[
  {
    "id": "hadis_thirsty_dog",
    "categoryId": "hadiser_golpo",
    "title": "তৃষ্ণার্ত কুকুরকে পানি পান",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) বর্ণনা করেছেন, একবার এক ব্যক্তি পথ দিয়ে যাচ্ছিলেন, তখন তার প্রচণ্ড পানির তৃষ্ণা পেল। তিনি একটি কুয়া দেখতে পেয়ে তাতে নামলেন এবং পানি পান করে উঠে এলেন।",
      "কুয়া থেকে উঠে তিনি দেখতে পেলেন, একটি কুকুর তৃষ্ণায় কাতর হয়ে হাঁপাচ্ছে এবং ভেজা মাটি চাটছে। লোকটি ভাবল, 'আমার যেমন প্রচণ্ড তৃষ্ণা পেয়েছিল, এই কুকুরটিরও ঠিক তেমনই তৃষ্ণা পেয়েছে।'",
      "এই ভেবে তিনি পুনরায় কুয়ায় নামলেন, নিজের চামড়ার মোজায় পানি ভরলেন এবং মুখ দিয়ে তা ধরে ওপরে উঠে এলেন। এরপর তিনি কুকুরটিকে সেই পানি পান করালেন।",
      "আল্লাহ তাআলা তার এই ছোট্ট দয়ার কাজটি এতটাই পছন্দ করলেন যে, তিনি এর বিনিময়ে তার সমস্ত গুনাহ মাফ করে দিলেন।",
      "সাহাবীরা জিজ্ঞেস করলেন:",
      "'ইয়া রাসূলাল্লাহ! চতুষ্পদ জন্তুর সেবা করলেও কি আমাদের সওয়াব হবে?'",
      "তিনি বললেন,",
      "فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ",
      "অর্থাৎ, প্রত্যেক সজীব প্রাণীর সেবার মধ্যেই সওয়াব রয়েছে। [সহীহ বুখারী]"
    ],
    "moral": "আল্লাহর চোখে কোনো দয়ার কাজই তুচ্ছ নয়। সৃষ্টির প্রতি সামান্য দয়া ও করুণা প্রদর্শন আল্লাহর ক্ষমা লাভের কারণ হতে পারে।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ২৩৬৩); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_three_men_in_cave_complete",
    "categoryId": "hadiser_golpo",
    "title": "গুহায় আটকে পড়া তিন ব্যক্তির দোয়া",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) পূর্ববর্তী উম্মতের এক শিক্ষণীয় ঘটনা বর্ণনা করেছেন। একবার তিন ব্যক্তি সফরে বেরিয়েছিল। পথিমধ্যে প্রচণ্ড বৃষ্টি শুরু হলে তারা একটি পাহাড়ের গুহায় আশ্রয় নেয়। হঠাৎ পাহাড় থেকে একটি বিশাল পাথর গড়িয়ে এসে গুহার মুখ সম্পূর্ণরূপে বন্ধ করে দেয়।",
      "ভিতর থেকে বের হওয়ার কোনো পথ না দেখে তারা একে অপরকে বললেন:",
      "'আল্লাহর কাছে আমাদের জীবনের শ্রেষ্ঠ সৎকাজগুলোর কথা উল্লেখ করে দোয়া করা ছাড়া আমাদের আর কোনো উপায় নেই। হয়তো তিনি এর বিনিময়ে আমাদের মুক্তি দেবেন।'",
      "প্রথম ব্যক্তি দোয়া শুরু করলেন:",
      "'হে আল্লাহ! আমার বৃদ্ধ পিতা-মাতা ছিলেন। আমি প্রতিদিন সন্ধ্যাবেলা তাদের দুধ পান না করিয়ে স্ত্রী-সন্তানদের দিতাম না। একদিন ফিরতে দেরি হওয়ায় তারা ঘুমিয়ে পড়েন। আমি দুধের পাত্র হাতে নিয়ে তাদের শিয়রে সারারাত ঠকঠক করে কাঁপতে কাঁপতে দাঁড়িয়ে ছিলাম। হে আল্লাহ, আমার এই কাজটি যদি শুধু আপনার সন্তুষ্টির জন্য হয়ে থাকে, তবে এই পাথরটি সরিয়ে দিন।'",
      "সাথে সাথেই পাথরটি সামান্য সরে গেল।",
      "দ্বিতীয় ব্যক্তি দোয়া করলেন:",
      "'হে আল্লাহ! আমার এক চাচাতো বোন ছিল, যাকে আমি অত্যন্ত ভালোবাসতাম। আমি একবার তার সাথে অসৎ কাজ করতে চাইলে সে রাজি হয়নি। পরে এক দুর্ভিক্ষের সময় সে সাহায্যের জন্য এলে আমি তাকে ১২০টি স্বর্ণমুদ্রা দিই এই শর্তে যে, সে আমার মনোবাসনা পূর্ণ করবে। কিন্তু আমি যখন তার কাছে গেলাম, তখন সে বলল, \"আল্লাহকে ভয় করো।\" এই কথা শুনে আমি তৎক্ষণাৎ সেখান থেকে ফিরে আসি। হে আল্লাহ, এই কাজটি যদি শুধু আপনার ভয়ের কারণেই করে থাকি, তবে এই পাথর আরও সরিয়ে দিন।'",
      "পাথরটি আরও কিছুটা সরে গেল।",
      "তৃতীয় ব্যক্তি দোয়া করলেন:",
      "'হে আল্লাহ! আমি একজন শ্রমিক নিয়োগ করেছিলাম এবং তার পারিশ্রমিক না নিয়েই চলে যায়। আমি তার সেই টাকা দিয়ে ব্যবসা করে অনেক পশুর মালিক হই। বহু বছর পর সে ফিরে এসে তার পারিশ্রমিক দাবি করলে আমি তাকে পুরো পশুপালটি দিয়ে দিই। হে আল্লাহ, এই কাজটি যদি শুধু আপনার সন্তুষ্টির জন্য করে থাকি, তবে আমাদের সম্পূর্ণ মুক্তি দিন।'",
      "সাথে সাথেই পাথরটি সম্পূর্ণরূপে সরে গেল এবং তারা গুহা থেকে বেরিয়ে এলেন।"
    ],
    "moral": "একনিষ্ঠভাবে আল্লাহর জন্য করা সৎকাজ কখনো বৃথা যায় না। বিপদের মুহূর্তে নিজের নেক আমলের ওসিলা দিয়ে দোয়া করা আল্লাহর কাছে সাহায্য লাভের শক্তিশালী উপায়।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ২২৭২, ৩৪৭০); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_leper_bald_blind",
    "categoryId": "hadiser_golpo",
    "title": "তিন ব্যক্তির অকৃতজ্ঞতার পরিণতি",
    "paragraphs": [
      "বনী ইসরাঈলের মধ্যে তিনজন ব্যক্তি ছিল—একজন কুষ্ঠরোগী, একজন টাকওয়ালা এবং একজন অন্ধ। আল্লাহ তাদের পরীক্ষা করার জন্য একজন ফেরেশতাকে মানুষের রূপে পাঠালেন।",
      "প্রথম দুজন (কুষ্ঠরোগী ও টাকওয়ালা) সুস্থতা ও সম্পদ লাভ করার পর অকৃতজ্ঞ হলো। ফেরেশতা তাদের কাছে সাহায্যের জন্য এলে তারা অহংকার করে বলল:",
      "'আমাদের অনেক দায়িত্ব আছে, তোমাকে দেওয়ার মতো কিছু নেই।'",
      "তারা তাদের অতীতকে অস্বীকার করল।",
      "কিন্তু অন্ধ ব্যক্তিটি কৃতজ্ঞ ছিল। ফেরেশতা যখন তার কাছে গেলেন, তখন সে বলল:",
      "'আমি সত্যিই অন্ধ ছিলাম, আল্লাহ আমাকে দৃষ্টিশক্তি দিয়েছেন। আমি দরিদ্র ছিলাম, তিনি আমাকে সম্পদ দিয়েছেন। আপনার যা ইচ্ছা নিয়ে যান।'",
      "আল্লাহ তার কৃতজ্ঞতায় খুশি হলেন এবং বাকি দুজনের ওপর অসন্তুষ্ট হলেন।",
      "আল্লাহ কুষ্ঠরোগী ও টাকওয়ালাকে তাদের আগের অবস্থায় ফিরিয়ে দিলেন এবং অন্ধ ব্যক্তির সম্পদ বহাল রাখলেন।",
      "আল্লাহর নেয়ামত পাওয়ার পর তাঁর প্রতি কৃতজ্ঞ থাকা উচিত এবং অতীতকে ভুলে গিয়ে অহংকার করা উচিত নয়। অকৃতজ্ঞতা নেয়ামতকে কেড়ে নেয়।"
    ],
    "moral": "আল্লাহর নেয়ামত পাওয়ার পর তাঁর প্রতি কৃতজ্ঞ থাকা উচিত এবং অতীতকে ভুলে গিয়ে অহংকার করা উচিত নয়। অকৃতজ্ঞতা নেয়ামতকে কেড়ে নেয়।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ৩৪৭২); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_man_killed_100_people",
    "categoryId": "hadiser_golpo",
    "title": "একশ খুনির তওবা ও রহমত",
    "paragraphs": [
      "পূর্ববর্তী যুগে এক ব্যক্তি ছিল যে ৯৯ জন মানুষকে হত্যা করেছিল। এরপর তার অন্তরে অনুশোচনা জন্মাল এবং সে তওবা করার জন্য পৃথিবীর শ্রেষ্ঠ জ্ঞানী ব্যক্তির সন্ধান করতে লাগল। তাকে একজন পাদ্রীর সন্ধান দেওয়া হলো।",
      "সে পাদ্রীর কাছে গিয়ে জিজ্ঞেস করল:",
      "'আমি ৯৯ জনকে হত্যা করেছি, আমার কি ক্ষমার কোনো সুযোগ আছে?'",
      "পাদ্রী বললেন:",
      "'না, তোমার কোনো ক্ষমা নেই।'",
      "লোকটি হতাশ ও ক্রুদ্ধ হয়ে সেই পাদ্রীকেও হত্যা করে ফেলল এবং তার খুনের সংখ্যা ১০০ পূর্ণ করল।",
      "কিন্তু তার অনুশোচনা দূর হলো না। সে আবার শ্রেষ্ঠ জ্ঞানী ব্যক্তির সন্ধান করতে লাগল। এবার তাকে আরেকজন আলেমের সন্ধান দেওয়া হলো। আলেম বললেন:",
      "'অবশ্যই! আল্লাহর রহমতের দরজা কে বন্ধ করতে পারে?'",
      "তিনি বললেন:",
      "'তবে তুমি তোমার এই পাপের এলাকা ছেড়ে অমুক পুণ্যবানদের গ্রামে চলে যাও এবং তাদের সাথে আল্লাহর ইবাদত করো।'",
      "লোকটি সেই গ্রামের দিকে রওনা হলো।",
      "পথিমধ্যে তার মৃত্যু এসে গেল। তখন রহমতের ফেরেশতা এবং আযাবের ফেরেশতা উভয়েই তার রুহ নেওয়ার জন্য হাজির হলো। তাদের তর্কের মীমাংসার জন্য আল্লাহ বললেন, 'সে যেখান থেকে আসছিল এবং যেখানে যাচ্ছিল, এই দুই স্থানের দূরত্ব মেপে দেখো। সে যেদিকের কাছাকাছি হবে, সে সেই দলের অন্তর্ভুক্ত হবে।' আল্লাহ তখন পুণ্যভূমির মাটিকে কাছে চলে আসতে এবং পাপের মাটিকে দূরে সরে যেতে নির্দেশ দিলেন।",
      "মাপার পর দেখা গেল, লোকটি পুণ্যভূমির দিকে এক বিঘত এগিয়ে আছে। ফলে, রহমতের ফেরেশতারা তার রুহ নিয়ে গেল এবং আল্লাহ তাকে ক্ষমা করে দিলেন।"
    ],
    "moral": "গুনাহ যত বড়ই হোক না কেন, আল্লাহর রহমত তার চেয়েও বিশাল। আন্তরিকভাবে অনুতপ্ত হয়ে সঠিক পথে ফিরে আসার চেষ্টাই হলো ক্ষমার মূল শর্ত।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ৩৪৭০); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_bedouin_in_mosque",
    "categoryId": "hadiser_golpo",
    "title": "মসজিদে প্রস্রাবকারী বেদুইন",
    "paragraphs": [
      "একবার এক গ্রাম্য আরব বা বেদুইন মসজিদে নববীতে প্রবেশ করল। মসজিদের নিয়ম-কানুন সম্পর্কে তার কোনো ধারণা ছিল না। প্রস্রাবের বেগ আসলে সে মসজিদেরই এক কোণায় বসে প্রস্রাব করতে শুরু করে দিল।",
      "এই দৃশ্য দেখে উপস্থিত সাহাবীরা প্রচণ্ড রেগে গেলেন এবং তাকে থামানোর জন্য চিৎকার করে তার দিকে ছুটে যেতে লাগলেন।",
      "কিন্তু দয়ার নবী রাসূলুল্লাহ (সাঃ) তাঁদেরকে থামিয়ে দিলেন। তিনি বললেন:",
      "'তাকে বাধা দিয়ো না, তার প্রস্রাব শেষ করতে দাও। তার প্রস্রাবের ওপর এক বালতি পানি ঢেলে দিয়ো।'",
      "তিনি আরও বললেন,",
      "إِنَّمَا بُعِثْتُمْ مُيَسِّرِينَ وَلَمْ تُبْعَثُوا مُعَسِّرِينَ",
      "অর্থাৎ, নিশ্চয়ই তোমাদেরকে নম্র আচরণকারী হিসেবে পাঠানো হয়েছে, কঠোর আচরণকারী হিসেবে নয়। [সহীহ বুখারী]",
      "প্রস্রাব শেষ হলে নবীজি (সাঃ) লোকটিকে পরম মমতার সাথে কাছে ডাকলেন।",
      "তিনি তাকে কোনো প্রকার ভর্ৎসনা না করে নরম সুরে বোঝালেন:",
      "'শোনো, এই মসজিদগুলো প্রস্রাব বা কোনো ময়লার জন্য নয়। এগুলো হলো আল্লাহর জিকির, সালাত আদায় এবং কুরআন তিলাওয়াতের জন্য।'",
      "নবীজির (সাঃ) এই সুন্দর ও দয়ার্দ্র আচরণে লোকটি এতটাই মুগ্ধ হয়েছিল যে, সে পরবর্তীতে দোয়া করত:",
      "'হে আল্লাহ, কেবল আমার ও মুহাম্মদের ওপর রহম করো, আমাদের সাথে আর কারো ওপর রহম করো না।'"
    ],
    "moral": "ভুলকারীকে ধমক বা কঠোরতার মাধ্যমে নয়, বরং ধৈর্য, দয়া এবং প্রজ্ঞার মাধ্যমে শিক্ষা দেওয়াই হলো নববী আদর্শ।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ২২০); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_crying_camel",
    "categoryId": "hadiser_golpo",
    "title": "উটের কান্না ও নবীজির দয়া",
    "paragraphs": [
      "একবার রাসূলুল্লাহ (সাঃ) মদিনার এক আনসারী সাহাবীর খেজুর বাগানে প্রবেশ করলেন। সেখানে তিনি একটি উট দেখতে পেলেন। উটটি নবীজি (সাঃ)-কে দেখার সাথে সাথেই ফোঁস ফোঁস করে কাঁদতে শুরু করল এবং তার চোখ দিয়ে পানি গড়িয়ে পড়তে লাগল।",
      "নবীজি (সাঃ) ছিলেন 'রাহমাতুল্লিল আ'লামিন' বা সমগ্র বিশ্বের জন্য রহমত। তিনি উটটির কষ্ট বুঝতে পারলেন। তিনি পরম মমতায় উটটির মাথায় ও ঘাড়ে হাত বুলিয়ে তাকে শান্ত করলেন।",
      "এরপর তিনি জিজ্ঞেস করলেন:",
      "'এই উটটির মালিক কে?'",
      "একজন আনসারী যুবক এগিয়ে এসে বলল:",
      "'ইয়া রাসূলাল্লাহ, এটি আমার।'",
      "নবীজি (সাঃ) তাকে বললেন:",
      "'তুমি কি এই বোবা প্রাণীটির ব্যাপারে আল্লাহকে ভয় করো না, যার মালিক আল্লাহ তোমাকে বানিয়েছেন? সে আমার কাছে অভিযোগ করেছে যে, তুমি তাকে ক্ষুধার্ত রাখো এবং তার ওপর অতিরিক্ত কাজের বোঝা চাপিয়ে দাও।'",
      "এই কথা শুনে উটের মালিক লজ্জিত হলেন এবং ভবিষ্যতে প্রাণীটির যত্ন নেওয়ার প্রতিজ্ঞা করলেন।"
    ],
    "moral": "ইসলাম শুধু মানুষের প্রতিই নয়, বরং বোবা পশু-পাখির প্রতিও দয়া ও করুণা প্রদর্শনের শিক্ষা দেয়। প্রাণীদের কষ্ট দেওয়া আল্লাহর কাছে একটি বড় অপরাধ।",
    "source": "সুনানে আবু দাউদ; মুসনাদে আহমাদ।"
  },
  {
    "id": "hadis_honest_gardener",
    "categoryId": "hadiser_golpo",
    "title": "সৎ বাগান মালিক ও অলৌকিক বৃষ্টি",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) বর্ণনা করেন, এক ব্যক্তি এক বিরান ভূমিতে পথ দিয়ে যাচ্ছিলেন। হঠাৎ তিনি মেঘের ভেতর থেকে একটি গায়েবী আওয়াজ শুনতে পেলেন। শব্দটি বলছিল, 'অমুকের বাগানে পানি দাও।'",
      "এই কথা শুনে মেঘটি সরে গিয়ে একটি নির্দিষ্ট পাথুরে জমির ওপর বৃষ্টি বর্ষণ করতে শুরু করল। লোকটি অবাক হয়ে সেই পানি অনুসরণ করে চলতে লাগল। তিনি দেখলেন, সমস্ত পানি একটি নালা দিয়ে প্রবাহিত হয়ে একটি নির্দিষ্ট বাগানে প্রবেশ করছে।",
      "তিনি বাগানের ভেতরে এক ব্যক্তিকে কোদাল দিয়ে কাজ করতে দেখলেন। তিনি লোকটির কাছে গিয়ে তার নাম জিজ্ঞেস করলেন। লোকটি ঠিক সেই নামটিই বলল, যা তিনি মেঘের ভেতর থেকে শুনেছিলেন।",
      "এরপর তিনি লোকটিকে জিজ্ঞেস করলেন:",
      "'হে আল্লাহর বান্দা, আপনি এই বাগানে এমন কী করেন, যার জন্য এমন অলৌকিক ঘটনা ঘটে?'",
      "লোকটি উত্তর দিল:",
      "'আপনি যেহেতু জিজ্ঞেস করেছেন, তাই বলছি। এই বাগান থেকে যা কিছুই উৎপাদিত হয়, আমি তা তিন ভাগে ভাগ করি।'",
      "তিনি বললেন:",
      "'এক-তৃতীয়াংশ আমি আল্লাহর রাস্তায় গরিব-মিসকিনদের জন্য দান করে দিই। এক-তৃতীয়াংশ আমি ও আমার পরিবার খাই। আর বাকি এক-তৃতীয়াংশ আমি পুনরায় এই বাগানেই বিনিয়োগ করি।'"
    ],
    "moral": "সততা ও আন্তরিকতার সাথে আল্লাহর রাস্তায় দান করলে, আল্লাহ দুনিয়াতেই তার প্রতিদান দেন এবং তার সম্পদে এমনভাবে বরকত দান করেন, যা মানুষের কল্পনার বাইরে।",
    "source": "সহীহ মুসলিম।"
  },
  {
    "id": "hadis_jurayj_the_monk",
    "categoryId": "hadiser_golpo",
    "title": "জুরাইজ ও মায়ের বদদোয়া",
    "paragraphs": [
      "বনী ইসরাঈলের জুরাইজ নামক এক ব্যক্তি ছিলেন, যিনি একটি উপাসনালয় নির্মাণ করে সেখানেই দিনরাত আল্লাহর ইবাদত করতেন।",
      "একদিন তিনি যখন সালাতে দাঁড়ানো ছিলেন, তখন তাঁর মা এসে তাঁকে ডাকলেন। জুরাইজ দ্বিধায় পড়ে গেলেন—তিনি কি সালাত ভাঙবেন, নাকি মায়ের ডাকে সাড়া দেবেন? তিনি সালাত চালিয়ে যাওয়াই শ্রেয় মনে করলেন। তাঁর মা পরপর তিনদিন এসে তাঁকে ডাকলেন এবং সাড়া না পেয়ে অবশেষে হতাশ হয়ে বদদোয়া করে বসলেন:",
      "'হে আল্লাহ, তাকে কোনো ফাহিশা (ব্যভিচারী) নারীর মুখ না দেখিয়ে মৃত্যু দিয়ো না।'",
      "কিছুদিন পর, সেই এলাকার এক ব্যভিচারী নারী এক সন্তানের জন্ম দিল। লোকেরা যখন তাকে সন্তানের পিতা সম্পর্কে জিজ্ঞেস করল, তখন সে জুরাইজের নাম বলে দিল, যাতে তাকে ফাঁসানো যায়।",
      "এই কথা শুনে লোকেরা ক্ষিপ্ত হয়ে জুরাইজের উপাসনালয় ভেঙে ফেলল এবং তাকে মারধর করতে লাগল। জুরাইজ শান্তভাবে তাদের কাছে কিছুটা সময় চাইলেন। তিনি ওযু করে দুই রাকাত সালাত আদায় করলেন।",
      "এরপর তিনি সেই নবজাতক শিশুর পেটে আঙুল দিয়ে খোঁচা মেরে জিজ্ঞেস করলেন:",
      "'হে শিশু, তোমার পিতা কে?'",
      "আল্লাহর হুকুমে সেই শিশুটি স্পষ্ট ভাষায় কথা বলে উঠল এবং বলল:",
      "'আমার পিতা অমুক রাখাল।'",
      "এই অলৌকিক ঘটনা দেখে লোকেরা তাদের ভুল বুঝতে পারল। তারা জুরাইজের কাছে ক্ষমা চাইল এবং তাঁর জন্য সোনা দিয়ে উপাসনালয় বানিয়ে দিতে চাইল। কিন্তু তিনি বললেন:",
      "'আগের মতো মাটি দিয়েই বানিয়ে দাও।'"
    ],
    "moral": "মায়ের দোয়া বা বদদোয়া আল্লাহর কাছে দ্রুত কবুল হয়। আর আল্লাহ তাঁর সৎ বান্দাদেরকে কঠিন বিপদ থেকে অলৌকিকভাবে রক্ষা করেন।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ৩৪৩৬); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_boy_and_the_king",
    "categoryId": "hadiser_golpo",
    "title": "বালক ও অত্যাচারী বাদশাহ",
    "paragraphs": [
      "পূর্ববর্তী যুগে এক অত্যাচারী বাদশাহ ছিল, যার একজন জাদুকর ছিল। জাদুকর বৃদ্ধ হয়ে গেলে সে বাদশাহর কাছে একটি বুদ্ধিমান বালককে চাইল, যাকে সে জাদুবিদ্যা শেখাবে। বাদশাহ একটি বালককে নিযুক্ত করলেন।",
      "বালকটি জাদুকরের কাছে যাওয়ার পথে এক খ্রিস্টান পাদ্রীর দেখা পায় এবং তাঁর একত্ববাদের কথায় মুগ্ধ হয়ে গোপনে তাঁর ওপর ঈমান আনে। আল্লাহ তাকে অলৌকিক ক্ষমতা দান করেন; সে অন্ধ ও কুষ্ঠরোগীকে ভালো করতে পারত।",
      "তার এই ক্ষমতার কথা জানতে পেরে বাদশাহ তাকে ডেকে পাঠায় এবং আল্লাহর ওপর ঈমান ত্যাগ করতে বলে। বালকটি অস্বীকৃতি জানালে বাদশাহ তাকে হত্যার নির্দেশ দেয়। কিন্তু সৈন্যরা তাকে পাহাড়ে বা সমুদ্রে ফেলে দিতে গিয়ে নিজেরাই ধ্বংস হয়ে যায় এবং বালকটি নিরাপদে ফিরে আসে।",
      "অবশেষে বালকটি বাদশাহকে বলল:",
      "'আপনি যদি আমাকে হত্যা করতে চান, তবে আপনাকে একটি মাঠে সকল মানুষকে একত্রিত করতে হবে, এরপর আমার তূণীর থেকে একটি তীর নিয়ে \"বিসমিল্লাহি রাব্বিল গুলাম\" (এই বালকের রবের নামে) বলে আমার দিকে নিক্ষেপ করতে হবে।'",
      "বাদশাহ তাই করল। তীরটি বালকের কপালে বিদ্ধ হওয়ার সাথে সাথেই সে মৃত্যুবরণ করল। কিন্তু এই দৃশ্য দেখে উপস্থিত সকল জনতা চিৎকার করে উঠল:",
      "'আমরা এই বালকের রবের প্রতি ঈমান আনলাম!'",
      "বাদশাহ ক্রোধে উন্মত্ত হয়ে রাস্তার পাশে বিশাল গর্ত খুঁড়ে তাতে আগুন জ্বালাল এবং যে ব্যক্তিই ঈমান ত্যাগ করতে অস্বীকার করল, তাকেই সেই জ্বলন্ত আগুনে নিক্ষেপ করে হত্যা করল। এই ঘটনাই কুরআনে 'আসহাবুল উখদুদ' বা 'গর্তওয়ালাদের' কাহিনী হিসেবে পরিচিত।"
    ],
    "moral": "ঈমানের শক্তি ও বুদ্ধিমত্তার কাছে জাগতিক ক্ষমতা পরাজিত হয়। একজন ব্যক্তির আত্মত্যাগ একটি পুরো জাতির হেদায়েতের কারণ হতে পারে।",
    "source": "সহীহ মুসলিম; পবিত্র কুরআন (সূরা আল-বুরুজ)।"
  },
  {
    "id": "hadis_prophet_visit_jewish_boy",
    "categoryId": "hadiser_golpo",
    "title": "অসুস্থ ইহুদি বালকের সেবা",
    "paragraphs": [
      "মদিনায় একজন ইহুদি বালক ছিল যে রাসূলুল্লাহ (সাঃ) এর খিদমত করত, যেমন তাঁর জন্য পানি এগিয়ে দেওয়া বা তাঁর জুতো গুছিয়ে রাখা।",
      "একদিন বালকটি অসুস্থ হয়ে পড়ল। নবীজি (সাঃ) তার অসুস্থতার খবর পেয়ে তাকে দেখতে তার বাড়িতে গেলেন। তিনি দেখলেন, বালকটি মৃত্যুশয্যায় শায়িত।",
      "তিনি পরম মমতার সাথে বালকটির শিয়রের কাছে বসলেন। তিনি তার দিকে তাকিয়ে বললেন:",
      "'বাবা, তুমি ইসলাম গ্রহণ করো।'",
      "বালকটি তার পাশে বসে থাকা তার পিতার দিকে তাকাল, যেন সে তার অনুমতি চাইছে।",
      "তার পিতা, যিনি একজন ইহুদি ছিলেন, তিনি নবীজির (সাঃ) মহানুভবতা ও আন্তরিকতা উপলব্ধি করতে পারছিলেন। তিনি তাঁর ছেলেকে বললেন:",
      "'আবুল কাসেম (নবীজির উপনাম) যা বলছেন, তা মেনে নাও।'",
      "পিতার অনুমতি পেয়ে বালকটি সাথে সাথেই কালেমা শাহাদাত পাঠ করে মুসলিম হয়ে গেল।",
      "এর কিছুক্ষণ পরেই সে মৃত্যুবরণ করল। নবীজি (সাঃ) যখন তার বাড়ি থেকে বেরিয়ে আসছিলেন, তখন তিনি আল্লাহর শুকরিয়া আদায় করে বলছিলেন:",
      "الْحَمْدُ لِلَّهِ الَّذِي أَنْقَذَهُ مِنَ النَّارِ",
      "অর্থাৎ, সমস্ত প্রশংসা সেই আল্লাহর জন্য, যিনি আমার মাধ্যমে একটি আত্মাকে জাহান্নামের আগুন থেকে রক্ষা করেছেন। [সহীহ বুখারী]"
    ],
    "moral": "দাওয়াতের সর্বোত্তম পদ্ধতি হলো দয়া, ভালোবাসা ও উত্তম আচরণ। অমুসলিমদের সাথে সুন্দর আচরণ করা এবং তাদের বিপদে পাশে দাঁড়ানো ইসলামের অন্যতম শিক্ষা।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ১৩৫৬)।"
  },
  {
    "id": "hadis_pious_and_sinner_brothers",
    "categoryId": "hadiser_golpo",
    "title": "অহংকারী ইবাদতকারী ও পাপী বন্ধু",
    "paragraphs": [
      "বনী ইসরাঈলের মধ্যে দুজন ব্যক্তি ছিল, যারা ছিল পরস্পরের বন্ধু। তাদের একজন ছিল অত্যন্ত ইবাদতকারী এবং অন্যজন ছিল পাপে লিপ্ত।",
      "ইবাদতকারী ব্যক্তিটি তার বন্ধুকে সবসময় পাপ কাজ থেকে বিরত থাকার জন্য উপদেশ দিত। কিন্তু তার বন্ধু সেই উপদেশে কান দিত না। একদিন সে তার বন্ধুকে একটি বড় গুনাহে লিপ্ত অবস্থায় দেখতে পেল।",
      "সেদিন সে আর নিজেকে সংযত রাখতে পারল না। সে রাগের মাথায় বন্ধুকে বলল:",
      "'এখান থেকে দূর হও!'",
      "এবং অহংকারের সাথে কসম করে বলল:",
      "'আল্লাহর কসম! আল্লাহ তোমাকে কখনোই ক্ষমা করবেন না।'",
      "তার এই কথাটি আল্লাহর কাছে অত্যন্ত অপছন্দনীয় হলো। আল্লাহ তায়ালা ওহী পাঠালেন:",
      "مَنْ ذَا الَّذِي يَتَأَلَّى عَلَيَّ أَنْ لَا أَغْفِرَ لِفُلَانٍ",
      "অর্থাৎ, কে সে, যে আমার ব্যাপারে সিদ্ধান্ত নেয় যে আমি অমুককে ক্ষমা করব না? [সহীহ মুসলিম]",
      "আল্লাহ বললেন:",
      "'আমি তাকে (পাপীকে) ক্ষমা করে দিলাম এবং তোমার (ইবাদতকারীর) সমস্ত আমল বরবাদ করে দিলাম।'",
      "এই হাদীসের বর্ণনাকারী সাহাবী আবু হুরায়রা (রাঃ) বলেন:",
      "'লোকটি এমন একটি কথা বলেছিল, যা তার দুনিয়া ও আখেরাত উভয়ই ধ্বংস করে দিয়েছে।'"
    ],
    "moral": "কারো ক্ষমা আল্লাহর ইচ্ছাধীন। নিজের ইবাদতের জন্য অহংকারী হওয়া এবং অন্যের প্রতি আল্লাহর রহমতকে সংকীর্ণ মনে করা একটি ভয়ংকর অপরাধ, যা নিজের আমলকেও ধ্বংস করে দিতে পারে।",
    "source": "সুনানে আবু দাউদ।"
  },
  {
    "id": "hadis_epileptic_woman",
    "categoryId": "hadiser_golpo",
    "title": "জান্নাতী সেই নারী",
    "paragraphs": [
      "হযরত আতা ইবনে আবি রাবাহ (রহঃ) বর্ণনা করেন, একবার সাহাবী ইবনে আব্বাস (রাঃ) আমাকে বললেন:",
      "'আমি কি তোমাকে একজন জান্নাতী নারী দেখাব?'",
      "আমি বললাম:",
      "'অবশ্যই।'",
      "তিনি একজন কালো বর্ণের নারীর দিকে ইশারা করে বললেন:",
      "'এই সেই নারী।'",
      "এরপর তিনি ঘটনাটি বর্ণনা করলেন।",
      "এই নারী একবার রাসূলুল্লাহ (সাঃ) এর কাছে এসে বললেন:",
      "'ইয়া রাসূলাল্লাহ! আমি মৃগীরোগে আক্রান্ত এবং রোগের কারণে অনেক সময় আমার শরীর থেকে কাপড় সরে যায়। আপনি আমার জন্য আল্লাহর কাছে দোয়া করুন।'",
      "নবীজি (সাঃ) তাঁকে বললেন:",
      "'তুমি যদি চাও, তবে ধৈর্য ধারণ করতে পারো, আর এর বিনিময়ে তুমি জান্নাত লাভ করবে। আর যদি তুমি চাও, তবে আমি আল্লাহর কাছে দোয়া করতে পারি, তিনি তোমাকে সুস্থ করে দেবেন।'",
      "এই কথা শুনে নারীটি বললেন:",
      "'আমি ধৈর্যই ধারণ করব।'",
      "এরপর তিনি বললেন:",
      "'তবে রোগের সময় আমার শরীর থেকে কাপড় সরে যায়, আপনি শুধু এইটুকু দোয়া করুন যেন আমার পর্দা ঠিক থাকে।'",
      "তখন নবীজি (সাঃ) তাঁর জন্য সেই দোয়াটি করে দিলেন।"
    ],
    "moral": "দুনিয়ার কষ্টের বিনিময়ে আখেরাতের চিরস্থায়ী পুরস্কার লাভ করা মুমিনের জন্য শ্রেষ্ঠ পছন্দ। বিপদে ধৈর্য ধারণ করা জান্নাত লাভের একটি অন্যতম উপায়।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ৫৬৫২); সহীহ মুসলিম।"
  },
  {
    "id": "hadis_woodcutter_debt",
    "categoryId": "hadiser_golpo",
    "title": "কাঠের টুকরোর ভেতরের ঋণ",
    "paragraphs": [
      "বনী ইসরাঈলের এক ব্যক্তি আরেক ব্যক্তির কাছে এক হাজার দিনার ঋণ চাইল। ঋণদাতা বলল:",
      "'আমার একজন সাক্ষী প্রয়োজন।'",
      "লোকটি বলল:",
      "'সাক্ষী হিসেবে আল্লাহই যথেষ্ট।'",
      "ঋণদাতা বলল:",
      "'একজন জামিনদার প্রয়োজন।'",
      "লোকটি বলল:",
      "'জামিনদার হিসেবে আল্লাহই যথেষ্ট।'",
      "ঋণদাতা তার এই আল্লাহর ওপর ভরসায় মুগ্ধ হয়ে তাকে ঋণ দিয়ে দিল।",
      "ঋণগ্রহীতা সমুদ্রে সফরে গেল। ঋণ পরিশোধের নির্দিষ্ট দিনে সে তীরে এসে কোনো নৌকা বা জাহাজ পেল না, যা দিয়ে সে পাওনাদারের কাছে টাকা পৌঁছে দিতে পারে।",
      "কোনো উপায় না দেখে সে একটি কাঠের টুকরো নিল, সেটিকে ভেতর থেকে গর্ত করল এবং এক হাজার দিনার ও একটি চিঠি তার ভেতরে ভরে মুখ বন্ধ করে দিল। এরপর সে আল্লাহর কাছে দোয়া করে বলল:",
      "'হে আল্লাহ, আপনি জানেন আমি তার কাছে সাক্ষী ও জামিনদার চেয়েছিলাম, কিন্তু সে আপনাকে ছাড়া কাউকে মানেনি। আমি আমার চেষ্টা করেছি, এখন আমি এই সম্পদ আপনার হাতেই সঁপে দিলাম।'",
      "এই বলে সে কাঠের টুকরোটি সমুদ্রে ভাসিয়ে দিল।",
      "অন্যদিকে, পাওনাদার ব্যক্তিটিও তীরে অপেক্ষা করছিল। কোনো জাহাজ না দেখে সে হতাশ হয়ে ভাবল, বাড়ির জন্য কিছু কাঠ নিয়ে যাই। তখন সে সেই ভাসমান কাঠের টুকরোটি দেখতে পেয়ে তুলে নিল। বাড়িতে গিয়ে কাঠটি ভাঙার সাথে সাথেই সে তার দিনার এবং চিঠিটি পেয়ে গেল।",
      "কিছুদিন পর ঋণগ্রহীতা ব্যক্তিটি আরও এক হাজার দিনার নিয়ে পাওনাদারের কাছে হাজির হলো, কারণ সে ভেবেছিল হয়তো আগের টাকা পৌঁছায়নি। কিন্তু পাওনাদার তাকে জানাল যে, আল্লাহ তার সেই কাঠের টুকরোর মাধ্যমে পাঠানো ঋণ অলৌকিকভাবে পৌঁছে দিয়েছেন।"
    ],
    "moral": "আল্লাহর ওপর যার বিশ্বাস ও ভরসা নিখুঁত, আল্লাহ তার জন্য এমন সব উপায়ে সাহায্যের ব্যবস্থা করেন, যা মানুষ কল্পনাও করতে পারে না।",
    "source": "সহীহ আল-বুখারী।"
  },
  {
    "id": "hadis_kab_ibn_malik_tawba",
    "categoryId": "hadiser_golpo",
    "title": "কা'ব ইবনে মালিক (রাঃ) এর তওবা",
    "paragraphs": [
      "তাবুক ছিল মুসলিমদের জন্য এক কঠিন অভিযান। কিছু মুনাফিক মিথ্যা অজুহাত দেখিয়ে যুদ্ধে অংশগ্রহণ থেকে বিরত থাকে। কিন্তু তিনজন নিষ্ঠাবান সাহাবী—কা'ব ইবনে মালিক (রাঃ), হিলাল ইবনে উমাইয়া (রাঃ) এবং মুরারা ইবনে রাবী (রাঃ)—কোনো বৈধ কারণ ছাড়াই শুধুমাত্র আলস্যের কারণে পেছনে রয়ে যান।",
      "নবীজি (সাঃ) যুদ্ধ থেকে ফিরে এলে মুনাফিকরা মিথ্যা অজুহাত দিয়ে ক্ষমা পেয়ে গেল। কিন্তু কা'ব (রাঃ) ও তাঁর দুই সঙ্গী সত্য কথা বলার সিদ্ধান্ত নিলেন। তাঁরা অকপটে নিজেদের ভুল স্বীকার করলেন।",
      "তাঁদের সততার জন্য নবীজি (সাঃ) তাঁদের বিষয়টি আল্লাহর ওপর ছেড়ে দিলেন এবং সকল মুসলিমকে তাঁদের সাথে কথা বলাসহ সকল প্রকার সামাজিক সম্পর্ক ছিন্ন করার নির্দেশ দিলেন। এই বয়কট প্রায় পঞ্চাশ দিন ধরে চলেছিল।",
      "এই পঞ্চাশ দিন তাঁদের জন্য ছিল পৃথিবীর বুকে সবচেয়ে কঠিন সময়। মদিনার মাটি তাঁদের জন্য সংকীর্ণ হয়ে গিয়েছিল। এমনকি তাঁদের স্ত্রীরাও তাঁদের থেকে আলাদা হয়ে যান। কিন্তু তাঁরা আল্লাহর রহমত থেকে নিরাশ না হয়ে ধৈর্য ধারণ করেন এবং আন্তরিকভাবে তওবা করতে থাকেন।",
      "অবশেষে, পঞ্চাশ দিন পর, ফজরের সালাতের সময় আল্লাহ তায়ালা সরাসরি কুরআনের আয়াত (সূরা আত-তাওবা: ১১৮) নাজিল করে তাঁদের তওবা কবুল হওয়ার এবং তাঁদের ক্ষমা করার ঘোষণা দেন। এই ঐশী ক্ষমা লাভে পুরো মদিনা আনন্দে মেতে ওঠে। এটি ছিল কা'ব (রাঃ) এর জীবনের সর্বশ্রেষ্ঠ দিন।"
    ],
    "moral": "কঠিন পরিস্থিতিতেও সত্যকে আঁকড়ে থাকলে এবং আন্তরিকভাবে অনুতপ্ত হলে সাময়িক কষ্ট হলেও তার চূড়ান্ত প্রতিদান ও ক্ষমা সরাসরি আল্লাহর পক্ষ থেকে আসে।",
    "source": "সহীহ আল-বুখারী; সহীহ মুসলিম; পবিত্র কুরআন (সূরা আত-তাওবা)।"
  },
  {
    "id": "hadis_prophet_visit_jewish_boy_second",
    "categoryId": "hadiser_golpo",
    "title": "অসুস্থ ইহুদি বালকের প্রতি দয়া",
    "paragraphs": [
      "মদিনায় একজন ইহুদি বালক ছিল যে রাসূলুল্লাহ (সাঃ) এর খিদমত করত, যেমন তাঁর জন্য পানি এগিয়ে দেওয়া বা তাঁর জুতো গুছিয়ে রাখা।",
      "একদিন বালকটি অসুস্থ হয়ে পড়ল। নবীজি (সাঃ) তার অসুস্থতার খবর পেয়ে তাকে দেখতে তার বাড়িতে গেলেন। তিনি দেখলেন, বালকটি মৃত্যুশয্যায় শায়িত।",
      "তিনি পরম মমতার সাথে বালকটির শিয়রের কাছে বসলেন। তিনি তার দিকে তাকিয়ে বললেন, 'বাবা, তুমি ইসলাম গ্রহণ করো।' বালকটি তার পাশে বসে থাকা তার পিতার দিকে তাকাল, যেন সে তার অনুমতি চাইছে।",
      "তার পিতা, যিনি একজন ইহুদি ছিলেন, তিনি নবীজির (সাঃ) মহানুভবতা ও আন্তরিকতা উপলব্ধি করতে পারছিলেন। তিনি তাঁর ছেলেকে বললেন, 'আবুল কাসেম (নবীজির উপনাম) যা বলছেন, তা মেনে নাও।' পিতার অনুমতি পেয়ে বালকটি সাথে সাথেই কালেমা শাহাদাত পাঠ করে মুসলিম হয়ে গেল।",
      "এর কিছুক্ষণ পরেই সে মৃত্যুবরণ করল। নবীজি (সাঃ) যখন তার বাড়ি থেকে বেরিয়ে আসছিলেন, তখন তিনি আল্লাহর শুকরিয়া আদায় করে বলছিলেন, 'সমস্ত প্রশংসা সেই আল্লাহর জন্য, যিনি আমার মাধ্যমে একটি আত্মাকে জাহান্নামের আগুন থেকে রক্ষা করেছেন।'"
    ],
    "moral": "দাওয়াতের সর্বোত্তম পদ্ধতি হলো দয়া, ভালোবাসা ও উত্তম আচরণ। অমুসলিমদের সাথে সুন্দর আচরণ করা এবং তাদের বিপদে পাশে দাঁড়ানো ইসলামের অন্যতম শিক্ষা।",
    "source": "সহীহ আল-বুখারী (হাদিস নং: ১৩৫৬)।"
  },
  {
    "id": "hadis_poor_man_dignity",
    "categoryId": "hadiser_golpo",
    "title": "গরিব লোকটির জীবিকা ও আত্মমর্যাদা",
    "paragraphs": [
      "একবার মদীনার এক দরিদ্র আনসারী ব্যক্তি রাসূলুল্লাহ (সা.)-এর কাছে এসে কিছু ভিক্ষা চাইলেন। রাসূল (সা.) তাঁকে জিজ্ঞেস করলেন:",
      "'তোমার বাড়িতে কি কিছুই নেই?'",
      "লোকটি বলল:",
      "'ইয়া রাসূলুল্লাহ, একটি কম্বল ছাড়া কিছুই নেই; যার কিছু অংশ আমরা গায়ে দিই এবং কিছু অংশ নিচে বিছিয়ে দিই। আর একটি পাত্র আছে, যেখানে আমরা পানি পান করি।'",
      "রাসূল (সা.) বললেন:",
      "'তুমি সেগুলো নিয়ে এসো।'",
      "লোকটি সেগুলো নিয়ে এলো। রাসূল (সা.) তখন জিনিসগুলো হাতে নিয়ে সাহাবীদের উদ্দেশে বললেন:",
      "'কে এগুলো কিনতে চান?'",
      "একজন সাহাবী বললেন:",
      "'আমি এক দিরহামে কিনব।'",
      "রাসূল (সা.) তখন দু'বার বা তিনবার দাম বাড়িয়ে বললেন:",
      "'এক দিরহামের বেশি কে দিতে পারেন?'",
      "আরেকজন সাহাবী দুই দিরহাম দাম বললেন। রাসূল (সা.) তখন জিনিসগুলো সেই দুই দিরহামের বিনিময়ে বিক্রি করে দিলেন।",
      "এরপর রাসূল (সা.) দুই দিরহাম লোকটি হাতে দিয়ে বললেন:",
      "'এক দিরহাম দিয়ে তুমি তোমার পরিবারের জন্য খাবার কিনবে। আর অন্য দিরহাম দিয়ে একটি কুড়াল কিনবে এবং আমার কাছে নিয়ে আসবে।'",
      "লোকটি কুড়াল নিয়ে এলো। রাসূল (সা.) তাতে নিজের পবিত্র হাতে একটি হাতল লাগিয়ে দিয়ে বললেন:",
      "'যাও, এই কুড়াল দিয়ে তুমি কাঠ সংগ্রহ করো এবং বিক্রি করো। পনেরো দিন আমি তোমাকে আর দেখতে না পাই।'",
      "লোকটি আল্লাহর নির্দেশে কাজ করতে লাগল। পনেরো দিন পর সে ফিরে এলো এবং ততদিনে সে দশ দিরহাম উপার্জন করেছে। রাসূল (সা.) তাঁর এই উন্নতি দেখে খুব খুশি হলেন।"
    ],
    "moral": "ইসলামে ভিক্ষাবৃত্তিকে নিরুৎসাহিত করে কাজ ও আত্মমর্যাদার গুরুত্বকে ফুটিয়ে তোলা হয়েছে। নিজের হাতে উপার্জন করাই প্রকৃত সম্মান।",
    "source": "সুনানে আবূ দাউদ, কিতাবুজ যাকাত, হাদিস: ১৬৪১।"
  },
  {
    "id": "hadis_camel_crying",
    "categoryId": "hadiser_golpo",
    "title": "উটের কান্না ও পশুর প্রতি দয়া",
    "paragraphs": [
      "একবার রাসূলুল্লাহ (সা.) মদীনার আনসারদের এক খেজুর বাগানের পাশ দিয়ে যাচ্ছিলেন। সেখানে তিনি একটি উট দেখতে পেলেন। উটটি রাসূল (সা.)-কে দেখেই কাঁদতে শুরু করল এবং চোখ দিয়ে তার অশ্রু গড়িয়ে পড়ল।",
      "রাসূল (সা.) উটটির কাছে গেলেন এবং তার পিঠে ও মাথায় স্নেহের হাত বুলাতে লাগলেন। এতে উটটি শান্ত হলো।",
      "রাসূল (সা.) তখন উটটির মালিককে ডাকলেন এবং জিজ্ঞেস করলেন:",
      "'এই উটটির মালিক কে?'",
      "আনসারদের এক যুবক এগিয়ে এসে বলল:",
      "'ইয়া রাসূলুল্লাহ, আমিই এর মালিক।'",
      "রাসূল (সা.) তখন তাঁকে বললেন:",
      "'তুমি কি এই প্রাণীটির ব্যাপারে আল্লাহকে ভয় করো না? আল্লাহ এটিকে তোমার মালিকানায় দিয়েছেন। কিন্তু আমি শুনলাম, তুমি একে ক্ষুধার্ত রাখো এবং এর উপর অতিরিক্ত পরিশ্রমের বোঝা চাপিয়ে দাও, যার ফলে এটি কষ্ট পাচ্ছে এবং আমার কাছে অভিযোগ করছে!'",
      "যুবকটি লজ্জিত হয়ে আল্লাহর কাছে ক্ষমা চাইল এবং উটটির প্রতি আরও যত্নশীল হওয়ার ওয়াদা করল।"
    ],
    "moral": "রাসূল (সা.)-এর এই ঘটনা পশু-পাখির প্রতি তাঁর অসীম দয়া ও সহানুভূতিকে তুলে ধরে। প্রাণীদের প্রতি নিষ্ঠুরতা ইসলামে কঠোরভাবে নিষিদ্ধ।",
    "source": "সুনানে আবূ দাউদ, কিতাবুল জিহাদ, হাদিস: ২৫৪৯।"
  },
  {
    "id": "hadis_mosque_cleaner",
    "categoryId": "hadiser_golpo",
    "title": "মসজিদের পরিচারিকা ও ছোট কাজের মর্যাদা",
    "paragraphs": [
      "মদীনার মসজিদে নববীতে একজন মহিলা নিয়মিত পরিষ্কার-পরিচ্ছন্নতার কাজ করতেন। তিনি ছিলেন দরিদ্র এবং সমাজে হয়তো তাঁর বিশেষ কোনো স্থান ছিল না, কিন্তু তিনি এই কাজটিকে গুরুত্ব সহকারে করতেন। রাসূলুল্লাহ (সা.) তাঁকে সবসময় দেখতেন এবং জানতেন।",
      "একদিন রাসূল (সা.) মসজিদে তাঁকে দেখতে পেলেন না। তিনি সাহাবীদের জিজ্ঞেস করলেন:",
      "'মসজিদের সেই মহিলা কোথায়?'",
      "সাহাবীরা বললেন:",
      "'ইয়া রাসূলুল্লাহ, তিনি গত রাতে ইন্তেকাল করেছেন।'",
      "সাহাবীরা মনে করেছিলেন যে, সামান্য একজন পরিচারিকার মৃত্যুর খবর রাসূল (সা.)-কে দেওয়ার প্রয়োজন নেই।",
      "রাসূল (সা.) তখন অসন্তোষ প্রকাশ করে বললেন:",
      "'তোমরা আমাকে কেন জানাওনি? চলো, আমাকে তার কবর দেখাও।'",
      "এরপর রাসূল (সা.) সেই সাহাবীদের সাথে সেই মহিলার কবরের কাছে গেলেন। রাসূল (সা.) তাঁর কবরের ওপর জানাযার নামাজ পড়ালেন এবং তাঁর জন্য দু'আ করলেন।"
    ],
    "moral": "আল্লাহর দৃষ্টিতে বড় বা ছোট কোনো কাজ নেই। যে ব্যক্তি আন্তরিকতা ও নিষ্ঠার সাথে আল্লাহর ঘরের সামান্যতম সেবাও করে, তার মর্যাদা অনেক উঁচুতে।",
    "source": "সহীহ বুখারী, কিতাবুস সালাত, হাদিস: ৪৫৮; সহীহ মুসলিম, কিতাবুল জানায়েয, হাদিস: ৯৫৬।"
  },
  {
    "id": "hadis_love_for_allah",
    "categoryId": "hadiser_golpo",
    "title": "আল্লাহর জন্য ভালোবাসা ও জান্নাতের সুখবর",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন:",
      "'আল্লাহর বান্দাদের মধ্যে এমন একদল লোক আছে, যারা নবীও নয়, শহীদও নয়। কিন্তু কিয়ামতের দিন তাদের মর্যাদা দেখে নবী ও শহীদরাও ঈর্ষা করবে।'",
      "সাহাবীরা কৌতূহলী হয়ে জিজ্ঞেস করলেন:",
      "'ইয়া রাসূলুল্লাহ! তারা কারা? আমাদের বলুন।'",
      "রাসূল (সা.) বললেন:",
      "'তারা এমন একদল লোক, যারা পরস্পরের মধ্যে কোনো আত্মীয়তার বন্ধন বা কোনো আর্থিক লেনদেন ছাড়াই কেবল আল্লাহর জন্য একে অপরকে ভালোবাসতো।'",
      "রাসূল (সা.) এরপর বললেন:",
      "'আল্লাহর কসম, কিয়ামতের দিন তাদের মুখমণ্ডল হবে নূরের মতো উজ্জ্বল এবং তারা নূরের মিম্বরগুলোর ওপর উপবিষ্ট থাকবে। মানুষ যখন ভয়ে কাঁপতে থাকবে, তখন তাদের কোনো ভয় থাকবে না। আর মানুষ যখন বিষণ্ন ও দুঃখিত থাকবে, তখন তারা বিষণ্ন হবে না।'",
      "এরপর তিনি এই আয়াতটি তেলাওয়াত করলেন,",
      "أَلَا إِنَّ أَوْلِيَاءَ اللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
      "অর্থাৎ, জেনে রাখো, যারা আল্লাহর বন্ধু, তাদের কোনো ভয় নেই এবং তারা চিন্তিতও হবে না। [সূরা ইউনুস: ৬২]"
    ],
    "moral": "আল্লাহর জন্য নিঃস্বার্থ ভালোবাসার গুরুত্ব অপরিসীম। দুনিয়াবী স্বার্থ ছাড়া শুধুমাত্র আল্লাহর সন্তুষ্টির জন্য কাউকে ভালোবাসা জান্নাতের পথ।",
    "source": "সুনানে আবূ দাউদ, কিতাবুল ইজারাহ, হাদিস: ৩৫২৬।"
  },
  {
    "id": "hadis_abu_hurairah_hunger",
    "categoryId": "hadiser_golpo",
    "title": "আবূ হুরায়রার (রা.) ক্ষুধা ও রাসূল (সা.)-এর মেহমানদারী",
    "paragraphs": [
      "আবূ হুরায়রা (রা.) ছিলেন আসহাবে সুফফার সদস্য এবং তীব্র দারিদ্র্যের জীবন যাপন করতেন। প্রায়শই তিনি ক্ষুধার যন্ত্রণায় কাতর থাকতেন।",
      "একদিন তিনি ক্ষুধার্ত অবস্থায় মসজিদে নববীর পথে বসে ছিলেন। এমন সময় আবূ বকর (রা.) পাশ দিয়ে যাচ্ছিলেন। আবূ হুরায়রা (রা.) তাঁকে কুরআনের একটি আয়াত জিজ্ঞেস করলেন, এই আশায় যে আবূ বকর (রা.) হয়তো তাঁর ক্ষুধার কষ্ট বুঝতে পেরে তাঁকে বাড়িতে খাবারের জন্য ডাকবেন। আবূ বকর (রা.) উত্তর দিলেন কিন্তু তাঁকে ডাকলেন না।",
      "এরপর উমর (রা.) যাচ্ছিলেন, তাঁকেও একই আয়াত জিজ্ঞেস করলেন, কিন্তু তিনিও ডাকলেন না।",
      "অবশেষে রাসূলুল্লাহ (সা.) আসলেন। তিনি আবূ হুরায়রা (রা.)-এর মুখের দিকে তাকিয়েই তাঁর মনের অবস্থা বুঝে গেলেন। রাসূল (সা.) মৃদু হেসে বললেন:",
      "'হে আবূ হুরায়রা!'",
      "আবূ হুরায়রা (রা.) বললেন:",
      "'জি, ইয়া রাসূলুল্লাহ!'",
      "রাসূল (সা.) বললেন:",
      "'এসো।'",
      "রাসূল (সা.) তাঁকে নিয়ে তাঁর ঘরে গেলেন। সেখানে এক পেয়ালা দুধ ছিল। রাসূল (সা.) তখন আবূ হুরায়রা (রা.)-কে বললেন:",
      "'যাও, আসহাবে সুফফার সব সদস্যকে ডেকে নিয়ে এসো।'",
      "আসহাবে সুফফায় প্রায় সত্তর জন সদস্য ছিলেন।",
      "সবাই আসার পর রাসূল (সা.) আবূ হুরায়রা (রা.)-কে বললেন:",
      "'তুমি এই পেয়ালা নাও এবং তাদের প্রত্যেককে পরিবেশন করো।'",
      "আবূ হুরায়রা (রা.) অবাক হয়ে দেখলেন, সত্তর জন লোক দুধ পান করার পরও পেয়ালাটি পূর্ণ রইল। সবশেষে, রাসূল (সা.) ও আবূ হুরায়রা (রা.) দু'জনই সেই অবশিষ্ট দুধ পান করলেন।"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর মেহমানদারী, দয়া এবং আল্লাহর মু'জিযাকে তুলে ধরে।",
    "source": "সহীহ বুখারী, কিতাবুর রিকাক, হাদিস: ৬৪৫২।"
  },
  {
    "id": "hadis_old_woman_jannah",
    "categoryId": "hadiser_golpo",
    "title": "বৃদ্ধা ও জান্নাতের সুসংবাদ",
    "paragraphs": [
      "একবার এক বৃদ্ধা সাহাবী রাসূলুল্লাহ (সা.)-এর কাছে এলেন এবং কাঁদতে কাঁদতে বললেন:",
      "'ইয়া রাসূলুল্লাহ! আল্লাহর কাছে দু'আ করুন, যেন আল্লাহ আমাকে জান্নাতে প্রবেশ করান।'",
      "রাসূল (সা.) তখন বৃদ্ধার সাথে রসিকতা করতে চাইলেন। তিনি মুচকি হেসে বললেন:",
      "'জান্নাতে তো কোনো বুড়ো মানুষ প্রবেশ করবে না!'",
      "বৃদ্ধা এই কথা শুনে হতবাক হয়ে গেলেন এবং ভীষণ কাঁদতে শুরু করলেন। তিনি ভাবলেন, যেহেতু তিনি বৃদ্ধ, তাই হয়তো আল্লাহ তাঁকে জান্নাতে দেবেন না।",
      "রাসূল (সা.) তখন তাঁকে সান্ত্বনা দিলেন এবং বললেন:",
      "'চিন্তা করো না, আল্লাহ তা'আলা তোমাকে জান্নাতে প্রবেশ করানোর আগে যুবতী বানিয়ে দেবেন!'",
      "এরপর তিনি কুরআনের এই আয়াতটি তেলাওয়াত করলেন,",
      "إِنَّا أَنشَأْنَاهُنَّ إِنشَاءً * فَجَعَلْنَاهُنَّ أَبْكَارًا",
      "অর্থাৎ, আমি তাদেরকে (জান্নাতের নারীদেরকে) বিশেষরূপে সৃষ্টি করেছি, অতঃপর তাদেরকে বানিয়েছি চিরকুমারী। [সূরা ওয়াকিয়া: ৩৫-৩৬]",
      "বৃদ্ধা তাঁর কথা শুনে খুশি হলেন এবং তাঁর মুখে হাসি ফুটে উঠল।"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর মধুর ব্যবহার ও মনস্তত্ত্বের জ্ঞানকে তুলে ধরে। জান্নাতে সবাই যুবক-যুবতী হবে।",
    "source": "সুনানে তিরমিযী, কিতাবুল বির ওয়াস সিলাহ, হাদিস: ২৪৯৫।"
  },
  {
    "id": "hadis_thorn_removal_jannah",
    "categoryId": "hadiser_golpo",
    "title": "গাছের ডাল সরালেই জান্নাত",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'একদা এক ব্যক্তি পথ দিয়ে চলছিলেন। হঠাৎ তিনি রাস্তার মাঝে একটি কাঁটাদার গাছের ডাল দেখতে পেলেন।'",
      "তখন তিনি (আল্লাহর সন্তুষ্টির জন্য) ভাবলেন, 'আল্লাহর কসম, আমি অবশ্যই এই কাঁটাযুক্ত ডালটি সরিয়ে দেব, যেন তা কোনো মুসলিম পথচারীকে কষ্ট না দেয়।'",
      "রাসূল (সা.) এরপর বললেন: 'আল্লাহ তা'আলা তাঁর এই কাজটি কবুল করলেন, আর এর বিনিময়ে আল্লাহ তাঁকে জান্নাতে প্রবেশ করালেন!'",
      "এই ঘটনাটি প্রমাণ করে যে, ছোট হোক বা বড় হোক—কোনো সৎকাজকেই অবহেলা করা উচিত নয়। মানুষের সামান্যতম প্রচেষ্টাও আল্লাহর কাছে অনেক মূল্যবান হতে পারে।"
    ],
    "moral": "ছোট সৎকাজও অবহেলা করা উচিত নয়। মানুষের অধিকার এবং পরিবেশের সুরক্ষা ইসলামে চরম গুরুত্বপূর্ণ।",
    "source": "সহীহ মুসলিম, কিতাবুল বির ওয়াস সিলাহ ওয়াল আদাব, হাদিস: ২৬৬৪।"
  },
  {
    "id": "hadis_sleeping_under_tree",
    "categoryId": "hadiser_golpo",
    "title": "খেজুর গাছের নিচে ঘুম ও ইহুদি চোর",
    "paragraphs": [
      "একবার রাসূলুল্লাহ (সা.) একটি খেজুর গাছের নিচে তাঁর তরবারিটি ঝুলিয়ে রেখে ঘুমিয়েছিলেন। এমন সময় এক ইহুদি ব্যক্তি গোপনে সেখানে এলো।",
      "ইহুদি লোকটি রাসূল (সা.)-এর ঝুলিয়ে রাখা তরবারিটি তুলে নিলো। এরপর সে রাসূল (সা.)-কে জাগিয়ে দিয়ে জিজ্ঞেস করল:",
      "'হে মুহাম্মাদ! এখন তোমাকে আমার হাত থেকে কে রক্ষা করবে?'",
      "রাসূল (সা.) শান্তভাবে এবং দৃঢ়তার সাথে জবাব দিলেন,",
      "اللَّهُ",
      "অর্থাৎ, আল্লাহ! [সহীহ বুখারী]",
      "রাসূল (সা.)-এর এমন অবিচল উত্তর এবং আল্লাহর প্রতি দৃঢ় নির্ভরতা দেখে লোকটি সাথে সাথে ভয় পেয়ে গেল। লোকটি তখন কাঁপতে কাঁপতে তরবারিটি ফেলে দিল।",
      "রাসূল (সা.) তরবারিটি তুলে নিলেন, কিন্তু সেই লোকটিকে কোনো শাস্তি দিলেন না। বরং তাকে ক্ষমা করে দিলেন। সেই ইহুদি ব্যক্তিটি রাসূল (সা.)-এর এমন ক্ষমাশীল আচরণ দেখে মুগ্ধ হলো এবং ইসলাম গ্রহণ করল।"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর চরম ধৈর্য, আল্লাহর প্রতি তাওয়াক্কুল (নির্ভরতা) এবং ক্ষমাশীলতার দৃষ্টান্ত।",
    "source": "সহীহ বুখারী, কিতাবুল মাগাযী, হাদিস: ৪১৩৫; সহীহ মুসলিম, কিতাবুল ফাদাইল, হাদিস: ৮৪৩।"
  },
  {
    "id": "hadis_thirsty_dog_sinful_woman",
    "categoryId": "hadiser_golpo",
    "title": "ক্ষুধার্ত কুকুর ও পাপী নারী",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'বনী ইসরাইলের (পূর্ববর্তী জাতি) এক নারী ছিলেন, যিনি খারাপ চরিত্রের জন্য পরিচিত ছিলেন। একসময় তিনি একটি কূপের কাছ দিয়ে যাচ্ছিলেন। সেখানে তিনি একটি কুকুরকে দেখলেন, যা তৃষ্ণায় হাঁপাচ্ছিল এবং কাদা চাটছিল।'",
      "নারীটি কুকুরের সেই করুণ অবস্থা দেখে অত্যন্ত ব্যথিত হলেন। তিনি ভাবলেন, এই কুকুরটি যে কষ্টের মধ্য দিয়ে যাচ্ছে, আমিও এমন কষ্ট পেতে পারি।",
      "তখন নারীটি তাঁর চামড়ার জুতা খুলে, সেটি একটি ওড়নার সাথে বেঁধে কূপের ভেতরে নামিয়ে দিলেন এবং সেই জুতাতে পানি ভরে ওপরে টেনে তুললেন। এরপর তিনি কুকুরটিকে সেই পানি পান করালেন।",
      "রাসূল (সা.) বললেন: 'আল্লাহ তা'আলা সেই নারীর এই দয়া ও কাজের জন্য তাঁকে ক্ষমা করে দিলেন এবং তাঁকে জান্নাতে প্রবেশ করালেন।'",
      "সাহাবীরা জিজ্ঞেস করলেন: 'ইয়া রাসূলুল্লাহ! আমাদের কি পশুদের প্রতি দয়ার বিনিময়েও নেকি দেওয়া হবে?' রাসূল (সা.) বললেন: 'প্রত্যেক সজীব প্রাণীর প্রতি দয়া প্রদর্শনের মধ্যেই সওয়াব রয়েছে।'"
    ],
    "moral": "আল্লাহর কাছে দয়ার গুরুত্ব অপরিসীম। একটি প্রাণীর প্রতি দয়া পর্যন্ত জান্নাতের কারণ হতে পারে।",
    "source": "সহীহ বুখারী, কিতাবুশ শুরব, হাদিস: ২৩৬৩; সহীহ মুসলিম, কিতাবুস সালাম, হাদিস: ২২৪৫।"
  },
  {
    "id": "hadis_rain_prayer",
    "categoryId": "hadiser_golpo",
    "title": "বৃষ্টির জন্য রাসূল (সা.)-এর দু'আ",
    "paragraphs": [
      "একবার মদীনায় দীর্ঘকাল বৃষ্টি হচ্ছিল না। এতে মানুষ ও পশুর জীবন বিপন্ন হয়ে পড়ছিল। জুমার দিন যখন রাসূলুল্লাহ (সা.) খুতবা দিচ্ছিলেন, তখন একজন লোক এসে দাঁড়াল এবং বলল:",
      "'ইয়া রাসূলুল্লাহ! ফসল নষ্ট হয়ে যাচ্ছে, পশুরা মারা যাচ্ছে! আল্লাহর কাছে দু'আ করুন, যেন তিনি আমাদের জন্য বৃষ্টি বর্ষণ করেন।'",
      "রাসূল (সা.) তখন হাত তুললেন এবং দু'আ করলেন,",
      "اللَّهُمَّ اسْقِنَا، اللَّهُمَّ اسْقِنَا، اللَّهُمَّ اسْقِنَا",
      "অর্থাৎ, হে আল্লাহ! আমাদের বৃষ্টি দাও! হে আল্লাহ! আমাদের বৃষ্টি দাও! হে আল্লাহ! আমাদের বৃষ্টি দাও! [সহীহ বুখারী]",
      "আনাস (রা.) বলেন: 'আল্লাহর কসম, তখন আকাশে এক টুকরো মেঘও ছিল না! অথচ রাসূল (সা.) দু'আ করার সাথে সাথেই আকাশ মেঘে ঢেকে গেল এবং বৃষ্টি শুরু হলো। বৃষ্টি এত বেশি হলো যে মনে হচ্ছিল ছাদ ফুটো হয়ে যাচ্ছে।'",
      "এরপর এক সপ্তাহ ধরে অবিরাম বৃষ্টি হলো। পরের জুমার দিন সেই লোকটি বা অন্য কেউ এসে বললেন: 'ইয়া রাসূলুল্লাহ! বৃষ্টিতে রাস্তাঘাট বন্ধ হয়ে গেছে, ঘরবাড়ি ভেঙে পড়ছে! আল্লাহর কাছে দু'আ করুন, যেন তিনি বৃষ্টি বন্ধ করেন।'",
      "রাসূল (সা.) তখন হেসে হাত তুললেন এবং দু'আ করলেন: 'হে আল্লাহ! আমাদের চারপাশে দাও, কিন্তু আমাদের ওপর নয়!' আনাস (রা.) বলেন: 'তখনই মেঘ সরে গেল এবং মদীনার চারপাশের পাহাড় ও জমিতে বৃষ্টি হতে থাকল, কিন্তু মদীনার ওপর এক ফোঁটা বৃষ্টিও পড়ল না।'"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর মু'জিযা ও আল্লাহর প্রতি তাঁর বিশেষ সম্পর্ককে তুলে ধরে।",
    "source": "সহীহ বুখারী, কিতাবুল ইসতিসকা, হাদিস: ১০২৯; সহীহ মুসলিম, হাদিস: ৮৯৭।"
  },
  {
    "id": "hadis_poor_believer_qiyamah",
    "categoryId": "hadiser_golpo",
    "title": "কিয়ামতের দিনের দরিদ্র মুমিন",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'কিয়ামতের দিন এক দরিদ্র মুমিনকে আল্লাহর সামনে আনা হবে। আল্লাহ তা'আলা তাকে জিজ্ঞেস করবেন: 'আমি কি তোমাকে সম্পদ দিইনি?' সে বলবে: 'না, হে আল্লাহ! আপনি আমাকে দুনিয়াতে গরিব রেখেছিলেন।''",
      "এরপর আল্লাহ তা'আলা দরিদ্র মুমিনের দিকে জান্নাতের একটি দরজা খুলে দেবেন। তাকে বলা হবে: 'এর ভেতরে যাও।' লোকটি জান্নাত দেখবে, সেখানে যে সুখ-শান্তি ও প্রাচুর্য রয়েছে, তা দেখে সে মুগ্ধ হবে।",
      "তখন তাকে বলা হবে: 'হে বান্দা! এই সব তোমার।' লোকটি আনন্দিত হয়ে বলবে: 'হে আল্লাহ! আমি তো কিছুই অর্জন করিনি, কিন্তু আপনি আমার ওপর এত দয়া করেছেন?'",
      "এরপর আল্লাহ তা'আলা দুনিয়ার জীবনে ধনী ছিল এমন এক ব্যক্তির দিকে ইশারা করবেন এবং বলবেন: 'তার সম্পদের দিকে তাকাও। এই সব তার।' ধনী লোকটি দেখবে, তার সমস্ত সম্পদ সেখানে রয়েছে। তখন ধনী লোকটি আফসোস করে বলবে: 'হায়! আমি যদি দুনিয়ার জীবনে গরিব থাকতাম এবং আব্দুল্লাহর (দরিদ্র মুমিন) মতো জীবন যাপন করতাম!'"
    ],
    "moral": "দুনিয়ার ক্ষণস্থায়ী সম্পদের চেয়ে আল্লাহর কাছে মুমিনের ধৈর্য ও ঈমানের মূল্য অনেক বেশি।",
    "source": "সুনানে তিরমিযী, কিতাবুল যুহদ, হাদিস: ২৩৫৩।"
  },
  {
    "id": "hadis_blanket_theft_mercy",
    "categoryId": "hadiser_golpo",
    "title": "রাসূল (সা.)-এর দয়া ও চাদর চুরির অভিযোগ",
    "paragraphs": [
      "একবার রাসূলুল্লাহ (সা.)-এর কাছে এক ব্যক্তি এসে অভিযোগ করল যে, তাঁর চাদর চুরি হয়ে গেছে। লোকটি রাসূল (সা.)-কে বলল: 'ইয়া রাসূলুল্লাহ! আমি অমুক ব্যক্তির ওপর সন্দেহ করছি।'",
      "সেই ব্যক্তিটি ছিলেন একজন দরিদ্র এবং তিনি হয়তো চুরির কাজটি করেছিলেন। রাসূল (সা.) তখন সেই লোকটিকে শাস্তি দেওয়ার বদলে, সেই অভিযুক্ত ব্যক্তির ঘরে গেলেন এবং তাঁর প্রয়োজন সম্পর্কে জানলেন।",
      "রাসূল (সা.) বুঝতে পারলেন, লোকটি অভাবে পড়েই হয়তো এমন কাজ করেছেন। রাসূল (সা.) তখন সেই অভিযুক্ত লোকটিকে কিছু অর্থ দিলেন এবং তাঁর প্রয়োজন মিটিয়ে দিলেন। এরপর রাসূল (সা.) লোকটিকে বললেন: 'তুমি আর কখনও এমন কাজ করো না।'",
      "এরপর রাসূল (সা.) সেই অভিযোগকারী ব্যক্তির দিকে ফিরে বললেন: 'তোমাকে যদি আমি এই পরিমাণ সম্পদ দিই, তাহলে তুমি কি তার বিরুদ্ধে আর কোনো অভিযোগ করবে না?' লোকটি অবাক হয়ে বলল: 'আমি তাকে ক্ষমা করে দিলাম, ইয়া রাসূলুল্লাহ! আপনি যা ভালো মনে করেন।'"
    ],
    "moral": "রাসূল (সা.) শাস্তির চেয়ে মানুষের প্রয়োজন মিটিয়ে দিয়ে তাকে সংশোধনের ওপর বেশি গুরুত্ব দিতেন। তাঁর লক্ষ্য ছিল মানুষকে সঠিক পথে ফিরিয়ে আনা।",
    "source": "সীরাত গ্রন্থসমূহে রাসূল (সা.)-এর ক্ষমাশীলতা ও দয়ার বর্ণনাকারী।"
  },
  {
    "id": "hadis_garden_three_parts",
    "categoryId": "hadiser_golpo",
    "title": "একজন ব্যক্তি ও গাছের নিচে ইবাদত",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'একদা একজন লোক (বনী ইসরাইলের) একটি নির্জন প্রান্তরে যাচ্ছিল। সেখানে সে আকাশ থেকে একটি কণ্ঠস্বর শুনতে পেল: 'অমুকের বাগানে বৃষ্টি দাও!''",
      "লোকটি সেই কণ্ঠস্বর শুনে অবাক হলো। সে সেই আওয়াজ অনুসরণ করতে করতে দেখল, সত্যিই এক খণ্ড মেঘ একটি নির্দিষ্ট বাগানের ওপর বৃষ্টি বর্ষণ করছে। বৃষ্টি থামার পর বাগানের মালিক এসে মাটি কোদাল দিয়ে পরিষ্কার করছিল।",
      "লোকটি বাগানের মালিককে জিজ্ঞেস করল: 'হে আল্লাহর বান্দা! তোমার নাম কী?' বাগানের মালিকটি তার নাম বলল, যা সে আকাশ থেকে শুনেছিল!",
      "তখন লোকটি জিজ্ঞেস করল: 'তুমি তোমার এই বাগানে কী এমন কাজ করো, যার জন্য আল্লাহ আকাশ থেকে নাম ধরে এই বাগানে বৃষ্টি দিচ্ছেন?'",
      "বাগানের মালিকটি বলল: 'আপনি যখন আমার নাম জেনেছেন, তখন আমি আপনাকে বলছি। আমি আমার এই বাগানের ফলন তিনটি ভাগে ভাগ করে দিই: এক ভাগ আমি নিজে খাই ও পরিবারের জন্য রাখি; দ্বিতীয় ভাগ আমি আল্লাহর পথে দান করি; আর তৃতীয় ভাগ আমি আবার এই বাগানে ব্যয় করি (পুনরায় বিনিয়োগ করি)।'"
    ],
    "moral": "আল্লাহর পথে দানের মহত্ত্ব অপরিসীম। নিজের সম্পদকে আল্লাহর হুকুম অনুযায়ী তিন ভাগে ভাগ করার এই সুন্নাতকে আল্লাহ এত পছন্দ করেছেন যে, আকাশ থেকে তার নাম ধরে রিজিক পাঠিয়েছেন।",
    "source": "সহীহ মুসলিম, কিতাবুয যুহদ ওয়ার রিকাক, হাদিস: ২৯৮৪।"
  },
  {
    "id": "hadis_tree_trunk_crying",
    "categoryId": "hadiser_golpo",
    "title": "রাসূল (সা.)-এর জন্য খেজুর গাছের গোড়ায় কান্না",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) যখন মসজিদে নববীতে খুতবা দিতেন, তখন তিনি একটি খেজুর গাছের গোড়ায় হেলান দিয়ে দাঁড়াতেন।",
      "এরপর যখন মিম্বর তৈরি হলো, তখন রাসূল (সা.) মিম্বরে দাঁড়িয়ে খুতবা দেওয়া শুরু করলেন। রাসূল (সা.) মিম্বরে উঠে খুতবা দেওয়া শুরু করার সাথে সাথেই সাহাবীরা একটি অদ্ভুত শব্দ শুনতে পেলেন।",
      "তারা দেখলেন, খেজুর গাছের সেই গোড়াটি (যা আগে রাসূল (সা.)-এর ঠেস দেওয়ার কাজে লাগত) একটি শিশুর মতো হাউমাউ করে কাঁদছে!",
      "সাহাবীরা অবাক হলেন। রাসূল (সা.) তখন মিম্বর থেকে নেমে আসলেন এবং সেই গোড়ার কাছে গেলেন। তিনি নিজের হাত দিয়ে সেই গোড়াটিকে জড়িয়ে ধরলেন এবং শান্ত করলেন।",
      "রাসূল (সা.) বললেন: 'এটা কাঁদছে, কারণ এটি আল্লাহর যিকির শুনতে পেত, যা মিম্বর তৈরি হওয়ায় বন্ধ হয়ে গেছে।' অন্য বর্ণনায় আছে, রাসূল (সা.) বললেন: 'এটি সেই যিকিরের জন্য কাঁদছে, যা সে হারাতে চলেছে।'"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর মু'জিযা এবং আল্লাহর প্রতি তাঁর গভীর সম্পর্ককে তুলে ধরে। সামান্য একটি জড়বস্তুও রাসূল (সা.)-এর বিচ্ছেদে এবং আল্লাহর যিকির থেকে বঞ্চিত হওয়ায় কষ্ট অনুভব করেছে।",
    "source": "সহীহ বুখারী, কিতাবুস সালাত, হাদিস: ৪৪৩; সুনানে তিরমিযী, শামায়েল মুহাম্মাদিয়া, হাদিস: ৩৬৭৯।"
  },
  {
    "id": "hadis_umar_anass_joke",
    "categoryId": "hadiser_golpo",
    "title": "উমর (রা.) ও আনাস (রা.)-এর রসিকতা",
    "paragraphs": [
      "আনাস ইবনে মালেক (রা.) ছিলেন রাসূলুল্লাহ (সা.)-এর দীর্ঘ দশ বছরের খাদেম। তিনি রাসূল (সা.)-কে খুবই ভালোবাসতেন এবং তাঁর জীবনে সবসময় হাসি-খুশি ছিলেন।",
      "একবার উমর ইবনুল খাত্তাব (রা.) এবং আনাস (রা.) একসাথে কোথাও যাচ্ছিলেন। পথে একটি কাঁটাযুক্ত গাছ ছিল। উমর (রা.) ভাবলেন, আনাস (রা.) হয়তো অসাবধানতাবশত কাঁটায় আঘাত পাবেন।",
      "উমর (রা.) তখন আনাস (রা.)-কে উদ্দেশ্য করে একটু রসিকতা করতে চাইলেন। উমর (রা.) আনাস (রা.)-এর দিকে তাকিয়ে বললেন: 'হে আনাস! একটু সাবধান! কাঁটায় আঘাত পেতে পারো!'",
      "উমর (রা.)-এর এই কথা শুনে আনাস (রা.) মুচকি হাসলেন এবং বললেন: 'হে আমীরুল মু'মিনীন! আপনি কি জানেন না, আল্লাহর বান্দাদের মধ্যে কেউ কেউ আছেন, যাঁরা কাঁটায় আঘাত পান না?'",
      "আনাস (রা.) এখানে বোঝাতে চাইলেন যে, আল্লাহর নেক বান্দারা আল্লাহর রহমতে সুরক্ষিত থাকেন। উমর (রা.) তাঁর এই উত্তর শুনে হেসে উঠলেন এবং বললেন: 'আল্লাহ তোমার প্রতি খুশি হোন, হে আনাস! তুমি সব সময়ই মজার কথা বলো।'"
    ],
    "moral": "এই ঘটনা সাহাবীদের পারস্পরিক স্নেহ ও নির্মল হাস্যরসকে তুলে ধরে।",
    "source": "সীরাত ও আদব সংক্রান্ত গ্রন্থে পাওয়া যায়।"
  },
  {
    "id": "hadis_abu_bakr_suspicious_food",
    "categoryId": "hadiser_golpo",
    "title": "আবু বকর (রা.)-এর আমানতদারী ও সন্দেহজনক খাবার",
    "paragraphs": [
      "আবূ বকর সিদ্দীক (রা.) ছিলেন রাসূলুল্লাহ (সা.)-এর সবচেয়ে ঘনিষ্ঠ বন্ধু এবং বিশ্বস্ত সাথী। তাঁর জীবন ছিল সততা, প্রজ্ঞা এবং আল্লাহর প্রতি গভীর নির্ভরতায় পরিপূর্ণ।",
      "আবূ বকর (রা.)-এর একজন ক্রীতদাস ছিল, যাকে তিনি পরে মুক্ত করে দেন। এই ক্রীতদাস মাঝে মাঝে তাঁর জন্য কিছু অর্থ উপার্জন করে নিয়ে আসত এবং আবূ বকর (রা.) সেই উপার্জন থেকে খাবার গ্রহণ করতেন। একদিন সেই ক্রীতদাস কিছু খাবার নিয়ে এলো। আবূ বকর (রা.) সেই খাবার থেকে কিছু অংশ খেলেন।",
      "খাবার খাওয়া শেষ হওয়ার পর ক্রীতদাসটি আবূ বকর (রা.)-কে জিজ্ঞেস করল: 'হে আমার প্রভু! আপনি তো সবসময় আমার উপার্জনের উৎস জিজ্ঞেস করেন, আজ কেন জিজ্ঞেস করলেন না?' আবূ বকর (রা.) তখন বললেন: 'আমি তো প্রায় প্রতিদিনই তোমার কাছে উৎস জিজ্ঞেস করি। আজ ক্ষুধার তাড়নায় ভুলে গিয়েছিলাম। বলো, এই খাবার কোথা থেকে এনেছো?'",
      "ক্রীতদাসটি তখন ঘটনা খুলে বলল: 'জাহিলিয়াতের যুগে আমি কিছু লোককে জ্যোতিষীর মতো ভবিষ্যৎ বলে প্রতারিত করতাম। আজ পথে যেতে দেখি, সেই লোকগুলো আমাকে কৃতজ্ঞতা স্বরূপ এই খাবার দিয়েছে।'",
      "ক্রীতদাসটির কথা শুনে আবূ বকর (রা.)-এর শরীর আতঙ্কে কেঁপে উঠল। তিনি বুঝতে পারলেন, এই খাবার প্রতারণা ও সন্দেহজনক উপায়ে অর্জিত হয়েছে। আবূ বকর (রা.) সাথে সাথে নিজ হাতে গলার ভেতরে আঙুল ঢুকিয়ে দিলেন এবং প্রচণ্ড চেষ্টা করে সেই খাওয়া খাবারগুলো বমি করে দিলেন।",
      "আবূ বকর (রা.) বললেন: 'যদি এই খাবার বের করতে গিয়ে আমার জীবনও চলে যেত, তবুও আমি তা করতাম। আমি রাসূলুল্লাহ (সা.)-কে বলতে শুনেছি: 'যা হারাম, তা দ্বারা বর্ধিত দেহ জান্নাতে প্রবেশ করবে না।''"
    ],
    "moral": "এই ঘটনা আবূ বকর (রা.)-এর চরম সতর্কতা ও ঈমানের গভীরতা প্রমাণ করে। হালাল উপার্জনের গুরুত্ব অপরিসীম।",
    "source": "সহীহ বুখারী, কিতাবুল মানাকিব, হাদিস: ৩৮৪২; মুসনাদ আহমাদ।"
  },
  {
    "id": "hadis_ayesha_race",
    "categoryId": "hadiser_golpo",
    "title": "আয়েশা (রা.) ও রাসূল (সা.)-এর দৌড় প্রতিযোগিতা",
    "paragraphs": [
      "হযরত আয়েশা (রা.)-এর সাথে রাসূল (সা.)-এর সম্পর্ক ছিল অত্যন্ত স্নেহময় এবং খেলাধুলাপূর্ণ। এই ঘটনাটি তাঁদের সফরের সময় ঘটেছিল।",
      "একবার রাসূলুল্লাহ (সা.) তাঁর সাহাবীগণসহ একটি সফরে ছিলেন। পথ চলতে চলতে একসময় রাসূল (সা.) তাঁর সাহাবীদের নির্দেশ দিলেন যেন তাঁরা এগিয়ে যান এবং সামনে কোথাও অপেক্ষা করেন।",
      "রাসূল (সা.)-এর নির্দেশে সাহাবীগণ এগিয়ে যাওয়ার পর, রাসূল (সা.) তখন আয়েশা (রা.)-এর দিকে তাকালেন এবং বললেন: 'এসো, এখন আমরা দু'জন দৌড় প্রতিযোগিতা করি।'",
      "প্রথমবার তাঁরা দৌড় শুরু করলেন এবং আয়েশা (রা.) যেহেতু তরুণী ও হালকা ছিলেন, তাই তিনি সহজেই রাসূল (সা.)-কে পেছনে ফেলে এগিয়ে গেলেন এবং প্রতিযোগিতায় জয়ী হলেন। রাসূল (সা.)-ও তাঁর স্ত্রীর এমন বিজয় দেখে অত্যন্ত আনন্দিত হলেন।",
      "কয়েক বছর পর তাঁরা আবার একটি সফরে ছিলেন। রাসূল (সা.) আবার আয়েশা (রা.)-কে বললেন: 'এসো, আরেকবার আমরা দৌড় প্রতিযোগিতা করি।' এবার আয়েশা (রা.) আগের চেয়ে কিছুটা ভারী হয়েছেন।",
      "তাঁরা দু'জন আবার দৌড় শুরু করলেন এবং এবার রাসূলুল্লাহ (সা.) আয়েশা (রা.)-কে পেছনে ফেলে এগিয়ে গেলেন এবং প্রতিযোগিতায় জয়ী হলেন। রাসূল (সা.) তখন বিজয়ের হাসি হেসে আয়েশা (রা.)-এর দিকে তাকালেন এবং বললেন: 'هذه بتلك يا عائشة!' (অর্থাৎ, 'হে আয়েশা! এই জয় তোমার আগের পরাজয়ের বদলা!')",
      "আয়েশা (রা.) তাঁর স্বামীর এই মধুর রসিকতা শুনে হেসে উঠলেন।"
    ],
    "moral": "এই ঘটনা রাসূল (সা.) ও আয়েশা (রা.)-এর দাম্পত্য জীবনের গভীর রোমান্টিকতা ও মাধুর্য তুলে ধরে। স্বামী-স্ত্রীর মধ্যে নির্মল আনন্দ ও খেলাধুলা ইসলামে উৎসাহিত।",
    "source": "সুনানে আবূ দাউদ, কিতাবুল জিহাদ, হাদিস: ২২৭৯।"
  },
  {
    "id": "hadis_jewish_neighbor_mercy",
    "categoryId": "hadiser_golpo",
    "title": "রাসূল (সা.)-এর দয়া ও ইহুদি প্রতিবেশীর সেবা",
    "paragraphs": [
      "মদীনায় রাসূল (সা.)-এর বাড়ির কাছেই এক ইহুদি বৃদ্ধ বা বালক বসবাস করত, যে রাসূল (সা.)-কে কষ্ট দিত এবং প্রায়শই তাঁর চলাচলের পথে আবর্জনা অথবা কাঁটা ফেলে রাখত।",
      "কিন্তু রাসূলুল্লাহ (সা.) কখনো তাঁর প্রতি কোনো বিরক্তি বা ক্রোধ প্রকাশ করতেন না। তিনি প্রতিদিন নীরবে সেই আবর্জনাগুলো সরিয়ে পথ পরিষ্কার করে যেতেন।",
      "একসময় এই লোকটি অসুস্থ হয়ে শয্যাশায়ী হয়ে পড়ল। প্রতিদিনের অভ্যাসমতো রাসূল (সা.) সেই পথে গেলেন, কিন্তু সেদিন তিনি রাস্তায় কোনো আবর্জনা দেখতে পেলেন না।",
      "রাসূল (সা.) তখন উপলব্ধি করলেন যে, নিশ্চয়ই প্রতিবেশী বৃদ্ধটি অসুস্থ হয়ে পড়েছেন। রাসূল (সা.) সামান্যতম দ্বিধা না করে বৃদ্ধের খোঁজ নেওয়ার সিদ্ধান্ত নিলেন। তিনি বৃদ্ধের বাড়িতে গেলেন এবং জিজ্ঞেস করলেন: 'আমার প্রতিবেশী কেমন আছেন? আমি তাঁর খোঁজ নিতে এসেছি।'",
      "ইহুদি বৃদ্ধটি রাসূল (সা.)-কে এভাবে তাঁর বাড়িতে দেখে অত্যন্ত লজ্জিত ও বিস্মিত হলেন। তিনি ভাবতেই পারেননি যে, যাঁকে তিনি বছরের পর বছর ধরে কষ্ট দিয়ে এসেছেন, তিনি অসুস্থতার খবর পেয়ে তাঁকে দেখতে আসবেন!",
      "বৃদ্ধটি তখন চরম অনুশোচনায় নীরব হয়ে রইলেন। বৃদ্ধটি তখন রাসূল (সা.)-এর হাতে হাত রেখে শাহাদাহ্ পাঠ করলেন এবং ইসলাম গ্রহণ করেন।"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর দয়া ও মহানুভবতার প্রমাণ। শত্রুর প্রতিও সদাচরণ ইসলামের শিক্ষা।",
    "source": "সীরাত গ্রন্থসমূহে রাসূল (সা.)-এর দয়া ও মহানুভবতার প্রমাণ হিসেবে ব্যাপকভাবে প্রচলিত।"
  },
  {
    "id": "hadis_anas_ibn_nadr_uhud",
    "categoryId": "hadiser_golpo",
    "title": "উহুদ যুদ্ধে আনাস ইবনে নাদর (রা.)-এর বীরত্ব",
    "paragraphs": [
      "আনাস ইবনে নাদর (রা.) ছিলেন আনাস ইবনে মালেক (রা.)-এর চাচা। তিনি বদর যুদ্ধে অংশগ্রহণ করতে পারেননি বলে আফসোস করতেন এবং আল্লাহর কাছে প্রতিজ্ঞা করেছিলেন যে, ভবিষ্যতে যদি কোনো যুদ্ধ হয়, তবে তিনি এমন বীরত্ব দেখাবেন যা আল্লাহ ও তাঁর রাসূলকে খুশি করবে।",
      "উহুদ যুদ্ধের দিন যখন মুসলিম সৈন্যরা ছত্রভঙ্গ হয়ে পড়ছিল, তখন আনাস ইবনে নাদর (রা.) দেখলেন যে কিছু সাহাবী হতাশ হয়ে বসে আছেন। তিনি জিজ্ঞেস করলেন: 'আপনারা এখানে বসে আছেন কেন?'",
      "সাহাবীরা বললেন: 'রাসূলুল্লাহ (সা.) শহীদ হয়ে গেছেন!' (যা ছিল গুজব)।",
      "আনাস ইবনে নাদর (রা.) তখন বললেন: 'যদি রাসূল (সা.) শহীদ হয়েও গিয়ে থাকেন, তবে তিনি যে আল্লাহর পথে যুদ্ধ করেছেন, তাঁর পথই অনুসরণ করো! মুহাম্মাদের (সা.) পরে বেঁচে থেকে তোমরা কী করবে? ওঠো, এবং রাসূল (সা.) যাঁর জন্য যুদ্ধ করেছেন, তাঁর জন্য লড়াই করো!'",
      "তিনি বললেন: 'হে আল্লাহ! এরা (মুসলিমরা) যা করেছে, আমি তার জন্য আপনার কাছে ক্ষমা চাই। আর এরা (মুশরিকরা) যা করেছে, আমি তার থেকে মুক্ত।'",
      "এই বলে তিনি হাতে তরবারি নিয়ে সরাসরি শত্রুদের ভিড়ে ঝাঁপিয়ে পড়লেন। আনাস (রা.) বলেন, তাঁর দেহ মুবারকে আশিটিরও বেশি তরবারি, বর্শা ও তীরের আঘাতের চিহ্ন পাওয়া গিয়েছিল। তাঁর দেহ এত ক্ষতবিক্ষত হয়েছিল যে তাঁকে চেনা যাচ্ছিল না। তাঁর বোন শুধু আঙ্গুলের অগ্রভাগ দেখে তাঁকে চিনতে পেরেছিলেন।",
      "তাঁর বীরত্ব প্রসঙ্গে আল্লাহ তা'আলা এই আয়াত নাযিল করেন: 'مِنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ' (অর্থাৎ, 'মুমিনদের মধ্যে কতক আল্লাহর সাথে কৃত ওয়াদাকে সত্যে পরিণত করেছে...')।"
    ],
    "moral": "আল্লাহর সাথে কৃত ওয়াদা পূর্ণ করা এবং জীবন উৎসর্গ করার এক অনন্য দৃষ্টান্ত।",
    "source": "সহীহ বুখারী, কিতাবুল জিহাদ ওয়াস সিয়্যার, হাদিস: ২৮০৫; সহীহ মুসলিম, কিতাবুল ইমারাহ, হাদিস: ১৯০৩।"
  },
  {
    "id": "hadis_guest_hospitality_sacrifice",
    "categoryId": "hadiser_golpo",
    "title": "মুসাফিরের জন্য খাবার ও রাসূল (সা.)-এর আনন্দ",
    "paragraphs": [
      "একবার রাসূলুল্লাহ (সা.)-এর কাছে একজন মেহমান এলেন। রাসূল (সা.) তাঁকে খাবার দেওয়ার জন্য তাঁর স্ত্রীদের কাছে খোঁজ নিলেন। কিন্তু রাসূল (সা.)-এর ঘরে কোনো খাবারই ছিল না।",
      "তখন রাসূল (সা.) সাহাবীদের জিজ্ঞেস করলেন: 'আজ রাতে কে এই মেহমানের মেহমানদারী করবে?' একজন আনসার সাহাবী, আবূ তালহা (রা.), উঠে দাঁড়ালেন এবং বললেন: 'আমি করব, ইয়া রাসূলুল্লাহ!'",
      "আবূ তালহা (রা.) মেহমানকে নিয়ে তাঁর বাড়িতে গেলেন। তিনি দেখলেন, বাড়িতে শুধু সামান্য কিছু খাবার আছে, যা শুধুমাত্র তাঁর শিশুদের জন্যই যথেষ্ট। তিনি স্ত্রীকে জিজ্ঞেস করলেন: 'কী করা যায়?'",
      "তাঁর স্ত্রী, উম্মে সুলাইম (রা.), বললেন: 'আপনি মেহমানকে বসান। আমি বাচ্চাদের ঘুম পাড়িয়ে দেব। এরপর যখন মেহমান খাবে, তখন আমরাও এমন ভান করব যেন আমরা খাচ্ছি। আলো নিভিয়ে আমরা খাবারটা শুধু মেহমানের সামনেই পরিবেশন করব।'",
      "তাঁরা তাই করলেন। মেহমানটি পেট ভরে খেলেন, আর স্বামী-স্ত্রী খালি প্লেটের দিকে হাত নাড়ার ভান করলেন।",
      "সকালে আবূ তালহা (রা.) যখন রাসূল (সা.)-এর কাছে গেলেন, তখন রাসূল (সা.) তাঁকে দেখে মুচকি হাসলেন এবং বললেন: 'আল্লাহ তোমাদের আজকের রাতে করা কাজটিতে খুশি হয়েছেন! আল্লাহ তা'আলা তোমাদের এই আমল কবুল করেছেন।'",
      "এই ঘটনার পরিপ্রেক্ষিতে আল্লাহ তা'আলা এই আয়াত নাযিল করেন: 'وَيُؤْثِرُونَ عَلَىٰ أَنفُسِهِمْ وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ' (অর্থাৎ, 'তারা নিজেদের ওপর অন্যকে অগ্রাধিকার দেয়, যদিও তারা নিজেরা অভাবগ্রস্ত থাকে।')"
    ],
    "moral": "এই ঘটনা ত্যাগের সর্বোচ্চ দৃষ্টান্তকে তুলে ধরে। নিজের প্রয়োজনের চেয়ে অন্যের প্রয়োজনকে অগ্রাধিকার দেওয়া মুমিনের গুণ।",
    "source": "সহীহ বুখারী, কিতাবুত তাফসীর, হাদিস: ৪৮৮৮; সহীহ মুসলিম, কিতাবুল আশরাব, হাদিস: ২০৫২।"
  },
  {
    "id": "hadis_bilal_jannah_footsteps",
    "categoryId": "hadiser_golpo",
    "title": "বেলাল (রা.)-এর শাহাদাত এবং জান্নাতের শব্দ",
    "paragraphs": [
      "একবার ফজরের নামাজের পর রাসূলুল্লাহ (সা.) বেলাল ইবনে রাবাহ (রা.)-কে জিজ্ঞেস করলেন: 'হে বেলাল! ইসলাম গ্রহণের পর তুমি এমন কী আমল করেছো, যার দ্বারা তুমি সবচেয়ে বেশি নেকি পাওয়ার আশা করো? কারণ, আজ রাতে আমি জান্নাতে তোমার জুতার শব্দ শুনতে পেয়েছি!'",
      "বিলাল (রা.) ছিলেন বিনয়ী। তিনি বললেন: 'ইয়া রাসূলুল্লাহ! আমি তো বিশেষ কোনো কাজ করিনি। তবে যখনই আমার ওযু ভেঙে যায়, আমি সাথে সাথে ওযু করি এবং ওযুর পর দুই রাকাত নফল নামাজ আদায় করি।'",
      "রাসূল (সা.) তখন বললেন: 'হ্যাঁ, এটাই সেই আমল!'"
    ],
    "moral": "ছোট বা নিয়মিত আমলগুলোও যদি নিষ্ঠা ও আন্তরিকতার সাথে করা হয়, তবে আল্লাহর কাছে তার মর্যাদা অনেক বেশি।",
    "source": "সহীহ বুখারী, কিতাবুত তাহাজ্জুদ, হাদিস: ১১৪৯; সহীহ মুসলিম, কিতাবুল ফাদাইল, হাদিস: ২৪৫৮।"
  },
  {
    "id": "hadis_umm_salama_dua",
    "categoryId": "hadiser_golpo",
    "title": "মরণাপন্ন মুমিনের জন্য রাসূল (সা.)-এর দু'আ",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'যখন তোমরা কোনো রোগীর কাছে যাও বা কোনো মৃত ব্যক্তির কাছে যাও, তখন ভালো কথা বলো। কারণ ফেরেশতারা তোমাদের বলা কথায় 'আমীন' বলেন।'",
      "উম্মে সালামাহ (রা.) বলেন, যখন আবূ সালামাহ (রা.) (তাঁর প্রথম স্বামী) ইন্তেকাল করলেন, তখন আমি রাসূল (সা.)-এর কাছে গেলাম। রাসূল (সা.) আমাকে একটি দু'আ শিখিয়ে দিলেন।",
      "রাসূল (সা.) বললেন: 'আল্লাহর কাছে দু'আ করো: 'হে আল্লাহ! আমাকে এর (আবূ সালামাহ) চেয়ে উত্তম কিছু দান করুন এবং আমার এই বিপদ দূর করুন।' এই দু'আ করলে আল্লাহ তোমার জন্য ভালো কিছু দান করবেন।'",
      "উম্মে সালামাহ (রা.) তখন মনে মনে ভাবলেন: আবূ সালামাহ (রা.)-এর চেয়ে উত্তম স্বামী আর কে হতে পারে? কিন্তু তিনি আল্লাহর ওপর ভরসা রেখে দু'আটি পড়লেন।",
      "কিছুদিন পর রাসূলুল্লাহ (সা.) স্বয়ং উম্মে সালামাহ (রা.)-কে বিবাহের প্রস্তাব দিলেন। তখন উম্মে সালামাহ (রা.) বুঝতে পারলেন, আল্লাহর রহমত এবং রাসূল (সা.)-এর দু'আ কত শক্তিশালী। আবূ সালামাহ (রা.)-এর চেয়ে উত্তম স্বামী তিনি রাসূল (সা.)-এর রূপে পেয়েছিলেন।"
    ],
    "moral": "বিপদে ধৈর্য ধরা এবং আল্লাহর কাছে দু'আ করা মুমিনের গুণ। আল্লাহ কষ্টের পর সুখ দান করেন।",
    "source": "সহীহ মুসলিম, কিতাবুল জানায়েয, হাদিস: ৯১৮।"
  },
  {
    "id": "hadis_munafiq_criticism",
    "categoryId": "hadiser_golpo",
    "title": "রাসূল (সা.)-এর ধৈর্য ও মুনাফিকের সমালোচনা",
    "paragraphs": [
      "একবার রাসূলুল্লাহ (সা.) যুদ্ধ শেষে গণিমতের মাল বণ্টন করছিলেন। এমন সময় আব্দুল্লাহ ইবনে উবাই ইবনে সালুল (মুনাফিকদের নেতা) এর এক অনুসারী এসে বলল: 'হে মুহাম্মাদ! আপনি যদি আল্লাহকে ভয় করতেন, তাহলে এমন বণ্টন করতেন না!'",
      "রাসূল (সা.) এই কথা শুনে চরমভাবে আহত হলেন। উমর ইবনুল খাত্তাব (রা.) তখন রাগে অস্থির হয়ে গেলেন এবং বললেন: 'ইয়া রাসূলুল্লাহ! আমাকে অনুমতি দিন, এই মুনাফিকের গর্দান উড়িয়ে দিই!'",
      "রাসূল (সা.) তখন উমর (রা.)-কে শান্ত করলেন এবং বললেন: 'উমর! তার থেকে বিরত থাকো। যদি আমি তাকে হত্যা করি, তাহলে মানুষ বলবে, 'মুহাম্মাদ তার সাথীদের হত্যা করে!''",
      "রাসূল (সা.) জানতেন যে, এই সমালোচক আসলে মুনাফিকদের দলের একজন। তবুও তিনি প্রকাশ্যে তাকে শাস্তি দিলেন না। রাসূল (সা.) সব সময় এমন কিছু থেকে দূরে থাকতেন, যা ইসলামের প্রচারের পথে বাধা সৃষ্টি করে।"
    ],
    "moral": "এই ঘটনা রাসূল (সা.)-এর ধৈর্য এবং দূরদর্শিতাকে তুলে ধরে। কখনো কখনো ধৈর্য ধরা বড় সিদ্ধান্তের চেয়ে বেশি কার্যকর।",
    "source": "সহীহ বুখারী, কিতাবুল মাগাযী, হাদিস: ৩১৫১।"
  },
  {
    "id": "hadis_truthful_merchant",
    "categoryId": "hadiser_golpo",
    "title": "সত্যবাদী ব্যবসায়ী ও কিয়ামতের দিন",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'সত্যবাদী এবং বিশ্বস্ত ব্যবসায়ী কিয়ামতের দিন নবী, সিদ্দীক (সত্যবাদী) এবং শহীদদের সাথে থাকবে।'",
      "এই হাদিসটি প্রমাণ করে যে, ব্যবসা-বাণিজ্য একটি পার্থিব কাজ হওয়া সত্ত্বেও, যদি তা সততা, বিশ্বস্ততা ও স্বচ্ছতার সাথে করা হয়, তবে আল্লাহর কাছে তা অনেক বড় ইবাদত হিসেবে গণ্য হয়।",
      "রাসূল (সা.) এখানে ব্যবসায়ীদের সততার গুরুত্বকে সর্বোচ্চ পর্যায়ে স্থাপন করেছেন। একজন সৎ ব্যবসায়ী যিনি মিথ্যা বলেন না, প্রতারণা করেন না এবং মানুষের সাথে ন্যায্য আচরণ করেন, তিনি আল্লাহর কাছে অত্যন্ত প্রিয়।"
    ],
    "moral": "ব্যবসায়ে সততা ও বিশ্বস্ততা জান্নাতের পথ। হালাল উপার্জন ও সৎ লেনদেন ইবাদতের সমতুল্য।",
    "source": "সুনানে তিরমিযী, কিতাবুল বুয়ূ', হাদিস: ১২০৯; সুনানে দারিমী, হাদিস: ২৫৭৫।"
  },
  {
    "id": "hadis_abu_hurairah_shaytan",
    "categoryId": "hadiser_golpo",
    "title": "খেজুর চুরি ও ফেরেশতার সাথে তর্ক",
    "paragraphs": [
      "আবূ হুরায়রা (রা.)-কে একবার রমজান মাসে রাসূলুল্লাহ (সা.) যাকাতের খেজুর পাহারা দেওয়ার দায়িত্ব দিলেন। এক রাতে এক চোর এসে খেজুর চুরি করতে শুরু করল। আবূ হুরায়রা (রা.) তাকে ধরলেন।",
      "আবূ হুরায়রা (রা.) বললেন: 'আমি তোমাকে রাসূলুল্লাহ (সা.)-এর কাছে নিয়ে যাব!' চোরটি কাকুতি-মিনতি করে বলল: 'আমি খুব গরিব! আমার স্ত্রী-সন্তান আছে! আমাকে ছেড়ে দাও!' আবূ হুরায়রা (রা.) দয়াপরবশ হয়ে তাকে ছেড়ে দিলেন।",
      "সকালে রাসূল (সা.) জিজ্ঞেস করলেন: 'হে আবূ হুরায়রা! তোমার রাতের বন্দীর কী হলো?' আবূ হুরায়রা (রা.) ঘটনা বললেন। রাসূল (সা.) বললেন: 'সে তোমাকে মিথ্যা বলেছে, সে আবার আসবে!'",
      "দ্বিতীয় রাতেও চোরটি এলো এবং ধরা পড়ল। আবূ হুরায়রা (রা.) এবারও তাকে ছেড়ে দিলেন। রাসূল (সা.) আবার বললেন, সে মিথ্যা বলেছে।",
      "তৃতীয় রাতে চোরটি আবার এলো। আবূ হুরায়রা (রা.) তাকে শক্ত করে ধরলেন এবং বললেন: 'এবার তোমাকে রাসূলুল্লাহ (সা.)-এর কাছে নিয়েই যাব!' চোরটি তখন বলল: 'যদি তুমি আমাকে ছেড়ে দাও, তাহলে আমি তোমাকে এমন কিছু শিখিয়ে দেব, যা তোমার উপকারে আসবে।'",
      "চোরটি (আসলে শয়তান) বলল: 'রাতে যখন তুমি বিছানায় যাবে, তখন আয়াতুল কুরসী পাঠ করবে। তাহলে সকালে ফেরা পর্যন্ত আল্লাহর পক্ষ থেকে একজন রক্ষক তোমার জন্য থাকবে, আর কোনো শয়তান তোমার কাছে ঘেঁষতে পারবে না।'",
      "সকালে রাসূল (সা.) জিজ্ঞেস করলেন: 'তোমার রাতের বন্দীর কী হলো?' আবূ হুরায়রা (রা.) ঘটনা বললেন। রাসূল (সা.) হেসে বললেন: 'সে তোমাকে মিথ্যা বলেছে, কিন্তু এই কথাটি সত্য বলেছে! হে আবূ হুরায়রা! তুমি কি জানো, তিন রাত ধরে তুমি কার সাথে কথা বলছো? সে ছিল শয়তান।'"
    ],
    "moral": "আয়াতুল কুরসীর ফজিলত অপরিসীম। এটি পাঠ করলে শয়তান থেকে সুরক্ষা পাওয়া যায়।",
    "source": "সহীহ বুখারী, কিতাবুল ওকালা, হাদিস: ২৩১১।"
  },
  {
    "id": "hadis_jannah_levels",
    "categoryId": "hadiser_golpo",
    "title": "জান্নাতের স্তর ও মুমিনের মর্যাদা",
    "paragraphs": [
      "রাসূলুল্লাহ (সা.) বলেছেন: 'জান্নাতে এমন কিছু স্তর আছে, যা একজন মুমিন ব্যক্তি তার আমলের বিনিময়ে লাভ করবে। জান্নাতবাসীরা ওপরের স্তরের মানুষদেরকে ঠিক তেমনই দেখবে, যেমন তোমরা আকাশ থেকে উজ্জ্বল তারকাকে দেখো।'",
      "সাহাবীরা কৌতূহলী হয়ে জিজ্ঞেস করলেন: 'ইয়া রাসূলুল্লাহ! সেগুলো কি নবীগণের জন্য বিশেষ স্থান? অন্য কারো জন্য কি সেই মর্যাদা নেই?'",
      "রাসূল (সা.) বললেন: 'না, আমার জীবন যাঁর হাতে, তাঁর কসম! সেগুলো তাদের জন্য, যারা আল্লাহর প্রতি ঈমান এনেছে এবং নবী-রাসূলদেরকে সত্য বলে বিশ্বাস করেছে।'",
      "এরপর রাসূল (সা.) বললেন: 'তোমরা যদি জান্নাতে প্রবেশ করতে চাও, তাহলে জান্নাতুল ফিরদাউস চাও। কারণ জান্নাতুল ফিরদাউস হলো জান্নাতের সর্বোচ্চ ও সর্বোত্তম অংশ, যার ওপর রয়েছে আল্লাহর আরশ, এবং সেখান থেকেই জান্নাতের ঝর্ণাধারা প্রবাহিত হয়।'"
    ],
    "moral": "আল্লাহর প্রতি দৃঢ় ঈমান এবং নবী-রাসূলদের প্রতি বিশ্বাস মানুষকে সর্বোচ্চ মর্যাদা দান করে। সর্বদা আল্লাহর কাছে বড় কিছু চাওয়া উচিত।",
    "source": "সহীহ বুখারী, কিতাবুত তাওহীদ, হাদিস: ৭৪২২; সহীহ মুসলিম, কিতাবুল ঈমান, হাদিস: ২৮২।"
  },
  {
    "id": "hadis_abu_darda_islam",
    "categoryId": "hadiser_golpo",
    "title": "আবূ দারদা (রা.)-এর ইসলাম গ্রহণ ও মূর্তির ভাঙন",
    "paragraphs": [
      "আবু দারদা (রা.) ইসলাম গ্রহণের পূর্বে মদীনার খাজরাজ গোত্রের একজন সম্মানিত ব্যক্তি ছিলেন। তিনি মূর্তি পূজায় বিশ্বাসী ছিলেন এবং তাঁর বাড়িতে একটি মূর্তি পূজা করতেন।",
      "আবু দারদা (রা.)-এর ঘনিষ্ঠ বন্ধু ছিলেন সাহাবী আব্দুল্লাহ ইবনে রওয়াহা (রা.), যিনি ইসলাম গ্রহণ করেছিলেন। একদিন আবু দারদা (রা.) বাইরে গেলে ইবনে রওয়াহা (রা.) সেই সুযোগ নিলেন।",
      "তিনি আবু দারদা (রা.)-এর বাড়িতে প্রবেশ করলেন এবং দেখলেন, আবু দারদা (রা.)-এর স্ত্রী উম্মে দারদা (রা.) তখনো ঘরে ছিলেন। ইবনে রওয়াহা (রা.) ঘরে ঢুকেই সোজা সেই মন্দিরে গেলেন এবং কুড়াল দিয়ে মূর্তিটি ভেঙে টুকরো টুকরো করে দিলেন।",
      "উম্মে দারদা (রা.) তখন চিৎকার করে উঠলেন। ইবনে রওয়াহা (রা.) মূর্তিকে ভেঙে ফেলে দ্রুত সেই স্থান ত্যাগ করলেন।",
      "কিছুক্ষণ পর আবু দারদা (রা.) ঘরে ফিরলেন। তিনি দেখেন তাঁর স্ত্রী কাঁদছেন এবং মূর্তির ভাঙা টুকরোগুলো ছড়িয়ে আছে। আবু দারদা (রা.) রাগে অস্থির হয়ে গেলেন।",
      "কিন্তু পথে চলতে চলতে তিনি গভীরভাবে চিন্তা করতে লাগলেন: 'যদি এই মূর্তিগুলো সত্যিই উপাসনার যোগ্য হতো, তবে কেন তারা নিজেদেরকে রক্ষা করতে পারল না?' তাঁর মনে এক তীব্র জ্ঞান ও যুক্তির আলো জ্বলে উঠল।",
      "তিনি দ্রুত রাসূলুল্লাহ (সা.)-এর কাছে গেলেন এবং শাহাদাহ্ পাঠ করে ইসলাম গ্রহণ করলেন। তাঁর স্ত্রী উম্মে দারদা (রা.)-ও পরে ইসলাম গ্রহণ করেন।"
    ],
    "moral": "সত্যের সন্ধানে যুক্তি ও বিবেক ব্যবহার করা জরুরি। মূর্তি পূজা অসার এবং একমাত্র আল্লাহই উপাসনার যোগ্য।",
    "source": "সীরাতে ইবনে হিশাম; আল-মুস্তাদরাক আলাস সাহিহাইন (আল-হাকিম)।"
  },
  {
    "id": "hadis_farewell_sermon",
    "categoryId": "hadiser_golpo",
    "title": "রাসূল (সা.)-এর শেষ ভাষণ ও আমানত",
    "paragraphs": [
      "বিদায় হজ্বের সময় আরাফাতের ময়দানে রাসূলুল্লাহ (সা.) লক্ষাধিক সাহাবীর সামনে তাঁর ঐতিহাসিক শেষ ভাষণ দিলেন। এটি ছিল মানবজাতির জন্য তাঁর সর্বশেষ এবং সবচেয়ে গুরুত্বপূর্ণ উপদেশ।",
      "রাসূল (সা.) সেই ভাষণে বললেন: 'হে লোক সকল! আমার কথাগুলো শোনো! আমি তোমাদের মাঝে এমন কিছু রেখে যাচ্ছি, যা তোমরা দৃঢ়ভাবে আঁকড়ে ধরলে কখনও পথভ্রষ্ট হবে না—তা হলো আল্লাহর কিতাব (কুরআন) এবং আমার সুন্নাহ (আদর্শ)।'",
      "এরপর তিনি বললেন: 'হে লোক সকল! তোমাদের জীবন, তোমাদের সম্পদ এবং তোমাদের সম্মান একে অপরের জন্য পবিত্র। একজন আর একজনের ওপর কোনো অত্যাচার করবে না।'",
      "ভাষণের শেষে রাসূল (সা.) সাহাবীদের জিজ্ঞেস করলেন: 'তোমাদের কাছে আমার সম্পর্কে জানতে চাওয়া হবে, তখন তোমরা কী বলবে?'",
      "সাহাবীরা সমস্বরে জবাব দিলেন: 'আমরা সাক্ষ্য দেব যে, আপনি আপনার বার্তা পৌঁছে দিয়েছেন, আমানত আদায় করেছেন এবং উম্মতের কল্যাণ কামনা করেছেন।'",
      "তখন রাসূলুল্লাহ (সা.) তাঁর আঙ্গুল আকাশের দিকে তুলে এবং জনতার দিকে নামিয়ে তিনবার বললেন: 'হে আল্লাহ! তুমি সাক্ষী থাকো! হে আল্লাহ! তুমি সাক্ষী থাকো! হে আল্লাহ! তুমি সাক্ষী থাকো!'"
    ],
    "moral": "এই ভাষণ ইসলামের মৌলিক মূল্যবোধ, ন্যায়বিচার এবং রাসূল (সা.)-এর চূড়ান্ত দায়িত্ব পালনের মুহূর্তকে তুলে ধরে। কুরআন ও সুন্নাহই মুক্তির পথ।",
    "source": "সহীহ মুসলিম, কিতাবুল হজ্ব, হাদিস: ১২১৮; সুনানে আবূ দাউদ, কিতাবুল মানাসিক, হাদিস: ১৯০৫।"
  },
  {
    "id": "hadis_shaytan_date_theft",
    "categoryId": "hadiser_golpo",
    "title": "খেজুর চুরি ও শয়তানের পরিচয়",
    "paragraphs": [
      "আবূ হুরায়রা (রা.) বর্ণনা করেন, রাসূলুল্লাহ (সা.) তাঁকে রমজান মাসে সদকার খেজুর পাহারা দেওয়ার দায়িত্ব দিয়েছিলেন। প্রথম রাতে এক ব্যক্তি এসে খেজুর চুরি করতে লাগল।",
      "আবূ হুরায়রা (রা.) তাকে ধরে ফেললেন এবং বললেন: 'আমি তোমাকে রাসূলুল্লাহ (সা.)-এর কাছে নিয়ে যাব!' লোকটি বলল: 'আমি অভাবগ্রস্ত, আমার পরিবার আছে। আমাকে ছেড়ে দিন।' আবূ হুরায়রা (রা.) দয়া করে তাকে ছেড়ে দিলেন।",
      "সকালে রাসূল (সা.) জিজ্ঞেস করলেন: 'হে আবূ হুরায়রা! তোমার বন্দীর কী হলো?' তিনি ঘটনা বললেন। রাসূল (সা.) বললেন: 'সে তোমাকে মিথ্যা বলেছে এবং আবার আসবে।'",
      "দ্বিতীয় ও তৃতীয় রাতেও একই ঘটনা ঘটল। তৃতীয় রাতে লোকটি বলল: 'আমি তোমাকে এমন কিছু শিখিয়ে দেব যা তোমার উপকারে আসবে। যখন তুমি ঘুমাতে যাবে, আয়াতুল কুরসী পড়বে। তাহলে আল্লাহর পক্ষ থেকে একজন রক্ষক তোমার সাথে থাকবে এবং সকাল পর্যন্ত কোনো শয়তান তোমার কাছে আসতে পারবে না।'",
      "সকালে রাসূল (সা.) জিজ্ঞেস করলেন। আবূ হুরায়রা (রা.) ঘটনা বললেন। রাসূল (সা.) বললেন: 'সে তোমাকে সত্য বলেছে, যদিও সে মিথ্যুক। হে আবূ হুরায়রা! তুমি কি জানো তিন রাত ধরে তুমি কার সাথে কথা বলছিলে? সে ছিল শয়তান।'"
    ],
    "moral": "আয়াতুল কুরসী পাঠ করলে রাতে শয়তান থেকে সুরক্ষা পাওয়া যায়। এটি অত্যন্ত ফজিলতপূর্ণ আয়াত।",
    "source": "সহীহ বুখারী, কিতাবুল ওকালা, হাদিস: ২৩১১।"
  },
  {
    "id": "ambor_macher_oloukik_rijik",
    "categoryId": "hadiser_golpo",
    "title": "জিহাদ, দুর্ভিক্ষ ও আম্বর মাছের অলৌকিক রিজিক",
    "summary": "",
    "paragraphs": [
      "عَنْ جَابِرٍ ، قَالَ بَعَثَنَا رَسُولُ اللهِ صلى الله عليه وسلم وَأَمَّرَ عَلَيْنَا أَبَا عُبَيْدَةَ تَتَلَقَّى عِيرًاالقريشي وزودنا جرابا من ثمر لم يجد لنا غيره ، فكان أبو عبيدة يعطينا لمزة نمرة - قال فقلت كيف كلتم تصنعون بها قال لمصها كما يمضُ الصَّبِيُّ ثُمَّ تَشْرَبُ عليها من الماء فتكفينا يومنا إلى الليل وكنا نضرب بعصينا الخيط ثم تبلة بالماء فتأكلةقال وانطلقنا على ساحل البحر مرفع لنا على ساحل البحر كهيئة الكتيب الضخم فأتيناه فإذا هي دابة تدعى العنبر. قال قال أبو عبيدة ميتة ثمَّ قَالَ لا بَلْ نَحْنُ رُسُلُ رَسُولِ اللَّهِ صلى الله عليه وسلم وفي سبيل الله وقد اضطررتم فكلوا ، قَالَ فَأَقَمْنَا عَلَيْهِ شَهْرًا وَنَحْنُ ثلاث مائة حتى سمنا قال ولقد رأيتنا تعترف من وقبِ عَيْنِهِ بِالْقِلَالِ الدُّهَنَ وَتَقْتَطِعْ منه القدر كالثور - أو كقدر النور - فلقد أخذ منا أبو عبيدة ثلاثةَ عشرَ رَجُلاً فَأَقْعَدَهُمْ في وَقَبِ عَيْنِهِ وَأَخَذَ ضِلعا من أضلاعه فأقامها ثم رحل أَعْظَمَ بَعِيرٍ مَعَنَا فَمَرَّ مِنْ تَحْتِهَا وَتَرَوْدْنَا مِنْ لَحْمِهِ وَشَائِقفلما قدمنا المدينة أتينا رسول الله صلى الله عليه وسلم فذكرنا ذلك له فقالَ هُوَ رِزْق أَخْرَجَهُ اللهُ لَكُمْ فَهَلْ مَعَكُمْ مِنْ لحمه شيء فتطعمونا قال فَأَرْسَلْنَا إِلَى رَسُولِ اللهِ صلى الله عليه وسلم منه فأكله .**জাবির রাযিয়াল্লাহু আনহু থেকে বর্ণিত**তিনি বলেন, আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম আবু উবাইদার নেতৃত্বে কুরাইশের একটি কাফেলার বিরুদ্ধে আমাদের অভিযানে পাঠান। পাথেয় হিসেবে কেবল একথলে খেজুর দেন। অবশ্য আমাদেরকে দেওয়ার মতো এ ছাড়া আর কিছুই ছিল না তার কাছে। আবু উবায়দা রাযিয়াল্লাহু আনহু প্রতিদিন আমাদের একটি করে খেজুর দিতেন।বর্ণনাকারী বলেন, আমি জিজ্ঞেস করি, একটিমাত্র খেজুর দিয়ে আপনারা কীভাবে কী করতেন? তিনি বলেন, আমরা সেটা চুষে চুষে খেতাম, ঠিক যেভাবে শিশুরা খায়। তারপর পানি পান করতাম। এটাই ছিল আমাদের দিনরাতের খাবার। এ ছাড়া আমরা লাঠি দিয়ে গাছের পাতা পাড়তাম। সেগুলো পানিতে ভিজিয়ে খেয়ে নিতাম।বর্ণনাকারী বলেন, তারপর আমরা সমুদ্র উপকূল ধরে চলতে থাকি। হঠাৎ আমাদের সামনে উঁচু ঢিবির মতো কী যেন ভেসে ওঠে। কাছে গিয়ে দেখি, 'আম্বর' নামের বিশেষ একটি প্রাণী। বর্ণনাকারী বলেন, আবু উবায়দা রাযিয়াল্লাহু আনহু বলেন, এ তো মৃত প্রাণী, খাওয়া যাবে না। কিন্তু কিছু একটা ভেবে পরক্ষণেই আবার বলেন,না, আমরা তো আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের প্রেরিত দূতঃ আল্লাহর পথেই আছি। তা ছাড়া তোমাদের প্রাণ ওষ্ঠাগত। সুতরাং তোমরা তা খেতে পারো। বর্ণনাকারী বলেন, তারপর দীর্ঘ একমাস ওই প্রাণীর গোশত খেয়েই জীবন ধারণ করি। আমরা সংখ্যায় ছিলাম ৩০০ জন। গোশত খেয়ে আমরা বেশ স্বাস্থ্যবান হয়ে উঠি।বর্ণনাকারী বলেন, আমার স্পষ্ট মনে আছে, প্রাণীর চক্ষুকোটর থেকে কলসির পর কলসি ভরে চর্বি বের করেছি এবং তার দেহ থেকে বিশালদেহী যাঁড়ের সমপরিমাণ গোশতের টুকরা কেটে নিয়েছি। চর্বি ও গোশত কাটা হলে, আবু উবাইদা রাযিয়াল্লাহু আনহু আমাদের তেরো জনকে ডেকে নেন এবং ওই প্রাণীর চোখের কোটরে বসিয়ে দেন। তিনি প্রাণীটির পাঁজরের একটি হাড় ছাড়িয়ে সোজা করে দাঁড় করান। এরপর আমাদের সবচেয়ে বড় উটটির ওপর হাওদা চড়ান। উটটিও হাড়ের নিচ দিয়ে অনায়াসে অতিক্রম করে। অবশিষ্ট গোশত আমরা সিদ্ধ করে পাথেয় হিসেবে সঙ্গে নিই।মদিনায় ফিরে এসে আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের কাছে উপস্থিত হই। তাকে ঘটনাটি জানাই।তিনি বলেন, এটি বিশেষ রিজিক, যা আল্লাহ তোমাদের জন্য ব্যবস্থা করেছিলেন। আমাদেরকে খাওয়ানোর মতো কিছু পরিমাণ গোশত তোমাদের কাছে অবশিষ্ট আছে কি?বর্ণনাকারী বলেন, আমরা তখন আল্লাহর রাসুল সাল্লাল্লাহু আলাইহি ওয়া সাল্লামের কাছে কিছু অংশ পাঠাই। তিনি তা গ্রহণ করেন।"
    ],
    "moral": "",
    "source": "বুখারি: ২৪৮৩; মুসলিম ১৯৩৫; তিরমিযি: ২৪৭৫; নাসায়ি: ৪৩৫১; আবু দাউদ: ৩৮৪০; ইবনু মাজাহ: ৪১৫৯"
  }
]