[
  {
    "id": "imam_abu_hanifa",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু হানিফা (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু হানিফার প্রকৃত নাম ছিল আল-নু'মান ইবনে সাবিত। তিনি ছিলেন ইসলামী আইনশাস্ত্রের (ফিকহ) চার সুন্নি মাযহাবের মধ্যে প্রথম এবং সর্বশ্রেষ্ঠ ইমাম। তাঁকে 'আল-ইমাম আল-আ'যম' (সর্বশ্রেষ্ঠ ইমাম) উপাধি দেওয়া হয়।",
      "জন্ম ও বংশ পরিচয়\n\n৮০ হিজরিতে (৬৯৯ খ্রিস্টাব্দে) ইরাকের বিখ্যাত জ্ঞানকেন্দ্র কুফায় তিনি জন্মগ্রহণ করেন। তাঁর পরিবার ছিল পারস্য বংশোদ্ভূত এবং অর্থনৈতিকভাবে সচ্ছল। তাঁর পিতা সাবিত একজন সফল রেশমী কাপড়ের ব্যবসায়ী ছিলেন। এই পারিবারিক সচ্ছলতা তাঁকে নির্বিঘ্নে জ্ঞান অন্বেষণে মনোযোগ দিতে সাহায্য করেছিল।",
      "তাবেয়ী মর্যাদা\n\nতিনি ছিলেন তাবেয়ী প্রজন্মের অন্তর্ভুক্ত। নির্ভরযোগ্য সূত্র অনুসারে, তিনি জীবনের প্রথম দিকে আনাস ইবনে মালিক (রাঃ) সহ কয়েকজন সাহাবীর সাক্ষাৎ লাভের সৌভাগ্য অর্জন করেন।",
      "ব্যবসা থেকে জ্ঞান সাধনায়\n\nইমাম আবু হানিফা (রহঃ) প্রথম জীবনে বাবার ব্যবসায় যোগ দেন এবং তাঁর অত্যন্ত সততার জন্য ব্যবসায়িক মহলে সুপরিচিত ছিলেন। কিন্তু কুফার প্রখ্যাত আলেম শা'বি (রহঃ)-এর অনুপ্রেরণায় তিনি জ্ঞান সাধনার দিকে ঝুঁকে পড়েন।",
      "প্রধান শিক্ষক\n\nতিনি তাঁর জীবনের প্রায় ১৮ বছর কুফার শ্রেষ্ঠ ফকীহ হাম্মাদ ইবনে আবি সুলায়মান (রহঃ)-এর মজলিসে অতিবাহিত করেন। হাম্মাদ (রহঃ)-এর মৃত্যুর পর, তাঁর ছাত্ররা ইমাম আবু হানিফা (রহঃ)-কেই তাঁর স্থলাভিষিক্ত হিসেবে মনোনীত করেন।",
      "বিস্তৃত জ্ঞান অন্বেষণ\n\nতিনি শুধুমাত্র কুফাতেই সীমাবদ্ধ থাকেননি। তিনি মক্কা, মদীনা এবং অন্যান্য জ্ঞানকেন্দ্রেও বহুবার সফর করে হাদিস ও ফিকহের জ্ঞান অর্জন করেন। তাঁর রচিত গ্রন্থের মধ্যে ইসলামী আকীদা সম্পর্কিত 'আল-ফিকহুল আকবর' এবং হাদিস সংকলন 'কিতাবুল আছার' অন্যতম।",
      "ফিকহে বৈপ্লবিক পদ্ধতি\n\nইমাম আবু হানিফা (রহঃ) তাঁর ফিকহী মাযহাব (হানাফি মাযহাব)-কে একটি বৈপ্লবিক পদ্ধতির মাধ্যমে সুসংগঠিত করেন। তিনি প্রায় ৪০ জন বিশেষজ্ঞ ফকীহ, মুহাদ্দিস ও উসূলবিদকে নিয়ে একটি ফিকহী গবেষণা পরিষদ গঠন করেন।",
      "গবেষণা পরিষদ\n\nএই মজলিসে একটি মাসআলা নিয়ে বিস্তারিত আলোচনার পর সম্মিলিত সিদ্ধান্তের মাধ্যমে ফায়সালা লিপিবদ্ধ করা হতো। ইসলামী আইনের ইতিহাসে এটি ছিল এক অনন্য পদ্ধতি।",
      "আইনের উৎস\n\nতাঁর ফিকহের ভিত্তি ছিল কুরআন, সুন্নাহ, সাহাবীদের ইজমা এবং এরপর কিয়াস (যুক্তি-তুলনা) ও ইসতিহসান (আইনী পচ্ছন্দ)-এর ব্যবহার। এই পদ্ধতি হানাফি ফিকহকে বাস্তব জীবনের প্রতিটি ক্ষেত্রে প্রয়োগের জন্য উপযোগী করে তোলে। তিনি হাদিসের বিশুদ্ধতার বিষয়ে অত্যন্ত কঠোর ছিলেন এবং শুধু শক্তিশালী ও নির্ভরযোগ্য হাদিসকেই ফিকহী বিধানে ব্যবহার করতেন।",
      "ব্যক্তিগত চরিত্র ও তাকওয়া\n\nইমাম আবু হানিফা (রহঃ)-এর ব্যক্তিগত জীবন ছিল উচ্চতর তাকওয়া (খোদাভীতি) ও ইবাদতের আদর্শ। তিনি দীর্ঘকাল ধরে সারারাত জেগে ইবাদত করতেন বলে বর্ণিত আছে।",
      "সততা ও দানশীলতা\n\nব্যবসায় তিনি ছিলেন অত্যন্ত সৎ। একবার তাঁর কর্মচারী ভুল করে ত্রুটিপূর্ণ কাপড় বিক্রি করলে, তিনি সেই কাপড়ের মূল্য দান করে দেন। তিনি তাঁর ছাত্রদের মাসিক ভাতা প্রদান করতেন এবং নিজের উপার্জনের বেশিরভাগই অভাবী ও জ্ঞান অন্বেষণকারীদের জন্য খরচ করতেন।",
      "শাসকদের সাথে আপসহীন অবস্থান\n\nইমাম আবু হানিফা (রহঃ) তাঁর জ্ঞান এবং নীতির প্রশ্নে ছিলেন আপসহীন ও নির্ভীক। তিনি কখনোই কোনো শাসকের অন্যায্য কাজে সহযোগিতা করতে রাজি হননি।",
      "উমাইয়া শাসকের প্রস্তাব প্রত্যাখ্যান\n\nউমাইয়া খলিফা মারওয়ান ইবনে মুহাম্মাদ তাঁকে কুফার প্রধান বিচারপতির (কাজীর) পদ গ্রহণের প্রস্তাব দিলে তিনি তা প্রত্যাখ্যান করেন। এই অস্বীকৃতির জন্য তাঁকে শারীরিক শাস্তি ভোগ করতে হয়।",
      "আব্বাসীয় খলিফার প্রস্তাব প্রত্যাখ্যান\n\nপরবর্তীতে আব্বাসীয় খলিফা আল-মানসুর তাঁকে বাগদাদের প্রধান বিচারপতির (কাজীউল কুজাত) পদ গ্রহণের জন্য চাপ দেন। ইমাম (রহঃ) দৃঢ়ভাবে বলেন যে, তিনি এই পদের যোগ্য নন এবং এটি গ্রহণ করতে রাজি নন।",
      "কারাবরণ ও নির্যাতন\n\nখলিফা আল-মানসুরের ক্রমাগত চাপ ও অস্বীকৃতির ফলে ইমাম আবু হানিফা (রহঃ)-কে কারাগারে বন্দী করা হয় এবং সেখানে তাঁর উপর কঠিন নির্যাতন চালানো হয়।",
      "ইন্তেকাল ও ঐতিহাসিক মর্যাদা\n\nদীর্ঘদিন শাসকের নির্যাতনের শিকার হয়ে ইমাম আবু হানিফা (রহঃ) ১৫০ হিজরিতে (৭৬৭ খ্রিস্টাব্দে) ইরাকের বাগদাদ শহরে কারাগারেই ইন্তেকাল করেন। তাঁর ইন্তেকালের পর তাঁর জানাযায় এত মানুষের সমাগম হয়েছিল যে, ভিড়ের কারণে ছয়বার জানাযার সালাত আদায় করতে হয়েছিল।",
      "উত্তরাধিকার\n\nতাঁর প্রতিষ্ঠিত হানাফি মাযহাব তাঁর দুই প্রধান ছাত্র ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম মুহাম্মদ (রহঃ)-এর মাধ্যমে সুসংগঠিত ও প্রচারিত হয়। বর্তমানে বিশ্বের বিপুল সংখ্যক মুসলিম তাঁর মাযহাবের অনুসারী। ইমাম আবু হানিফা (রহঃ) তাঁর আপসহীনতা, গভীর জ্ঞান ও অসাধারণ তাকওয়ার জন্য ইসলামী ইতিহাসের ইমামে আ'যম হিসেবে সর্বদা শ্রদ্ধার আসনে অধিষ্ঠিত থাকবেন।"
    ],
    "source": "ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_malik",
    "categoryId": "imam_jibon",
    "title": "ইমাম মালিক (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম মালিকের পূর্ণ নাম হলো মালিক ইবনে আনাস ইবনে মালিক ইবনে আবি আমির আল-আসবাহী। তিনি ছিলেন সুন্নি ইসলামের চারটি প্রধান ফিকহী মাযহাবের মধ্যে মালিকি মাযহাবের প্রতিষ্ঠাতা। তাঁকে 'ইমাম দার আল-হিজরা' বা 'মদীনার ইমাম' উপাধিতে ভূষিত করা হয়।",
      "জন্ম ও বংশ পরিচয়\n\nইমাম মালিক (রহঃ) ৯৩ হিজরিতে (৭১৩ খ্রিস্টাব্দে) মদীনা মুনাওয়ারায় জন্মগ্রহণ করেন এবং ১৭৯ হিজরিতে (৭৯৫ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তাঁর পরিবার ছিল অত্যন্ত সম্মানিত এবং ইয়েমেনের হিমইয়ার গোত্রের বংশধর। তাঁর পূর্বপুরুষরা ইয়েমেন থেকে হিজরত করে মদীনায় বসতি স্থাপন করেন এবং ইসলামের সেবায় নিজেদের নিয়োজিত করেন।",
      "শৈশব ও প্রাথমিক শিক্ষা\n\nইমাম মালিক (রহঃ) মদীনার এমন এক পরিবেশে বেড়ে ওঠেন যেখানে তাবেয়ীদের জ্ঞানচর্চা চলছিল। তাঁর দাদা মালিক ইবনে আবি আমির একজন বড় তাবেয়ী ছিলেন এবং তাঁর চাচা আবু সুহাইল নাফে' ও আবু রুওয়াইম উভয়েই হাদিসের আলেম ছিলেন। এই পরিবেশ তাঁর জ্ঞানার্জনের পথকে সহজ করে দেয়।",
      "প্রাথমিক জীবন ও জ্ঞান সাধনা\n\nতিনি এমন এক সময়ে মদীনায় বেড়ে ওঠেন, যখন এটি ছিল ইসলামী জ্ঞান, হাদিস এবং সুন্নাহর কেন্দ্রবিন্দু। প্রথম দিকে তিনি ফ্যাশন ও ঘোড়দৌড়ের প্রতি আগ্রহী ছিলেন। কিন্তু পরিবারের সদস্যদের, বিশেষত তাঁর মায়ের অনুপ্রেরণায় তিনি জ্ঞানের দিকে মনোনিবেশ করেন।",
      "মায়ের অনুপ্রেরণা ও উপদেশ\n\nইমাম মালিক (রহঃ)-এর মা ছিলেন অত্যন্ত বুদ্ধিমতী এবং দূরদর্শী। তিনি তাঁর মায়ের দেওয়া সেই উপদেশ সারাজীবন মনে রেখেছিলেন: 'যাও, জ্ঞানীর নিকট যাও এবং তাঁর শিষ্টাচার ও আদব শেখো, তাঁর জ্ঞান পরে শেখা যাবে।' তাঁর মা তাঁকে সুন্দর পোশাক পরিয়ে পাগড়ি পরিয়ে শিক্ষকের কাছে পাঠাতেন এবং বলতেন, 'আগে তাঁর আদব শেখো, তারপর তাঁর জ্ঞান শেখো।'",
      "জ্ঞান অর্জনে একাগ্রতা\n\nপ্রথম দিকে ইমাম মালিক (রহঃ) ফ্যাশন ও ঘোড়দৌড়ের প্রতি আগ্রহী ছিলেন। কিন্তু তাঁর মায়ের অনুপ্রেরণা এবং মদীনার জ্ঞানসমৃদ্ধ পরিবেশ তাঁকে জ্ঞানার্জনের দিকে ঝুঁকিয়ে দেয়। তিনি সম্পূর্ণভাবে হাদিস ও ফিকহ শিক্ষায় মনোনিবেশ করেন এবং মদীনার বড় বড় আলেমদের মজলিসে নিয়মিত উপস্থিত হতে থাকেন।",
      "গুরুত্বপূর্ণ শিক্ষকগণ\n\nতিনি মদীনার প্রখ্যাত তাবেয়ী ও তাবে-তাবেয়ী আলেমদের কাছ থেকে শিক্ষা লাভ করেন। তিনি প্রায় এক হাজারেরও বেশি শিক্ষকের নিকট হাদিস ও ফিকহ শিক্ষা করেছিলেন। তাঁর প্রধান শিক্ষকদের মধ্যে ছিলেন ইবনে শিহাব আল-যুহরি (রহঃ), ইয়াহইয়া ইবনে সাঈদ আল-আনসারী (রহঃ) এবং রাবি'আ ইবনে আবদুর রহমান (রহঃ)।",
      "আল-মুয়াত্তা সংকলন\n\nইমাম মালিক (রহঃ)-এর জীবনের সবচেয়ে বড় কীর্তি হলো তাঁর রচিত হাদিস ও ফিকহের সংকলন 'আল-মুয়াত্তা'। এটিই ছিল ফিকহ ও হাদিসের সমন্বয়ে রচিত প্রথম সংকলনগুলির মধ্যে অন্যতম। তৎকালীন আব্বাসীয় খলিফা আল-মানসুর চেয়েছিলেন যে, মুসলিম বিশ্বের জন্য একটি একক ও প্রামাণিক ফিকহী আইন গ্রন্থ সংকলিত হোক।",
      "হাদিস নির্বাচনের মানদণ্ড\n\nতিনি মুয়াত্তাতে কেবলমাত্র সেসব হাদিসই অন্তর্ভুক্ত করেছেন, যা মদীনার আলেমদের দ্বারা ব্যাপকভাবে গৃহীত, প্রতিষ্ঠিত ও অনুশীলন করা হতো। তিনি হাদিসের পাশাপাশি সাহাবীদের বক্তব্য এবং তাবেয়ীদের ফতোয়া অন্তর্ভুক্ত করেন।",
      "ফিকহী পদ্ধতি\n\nমালিকি মাযহাব অন্যান্য মাযহাব থেকে কিছুটা ভিন্ন, কারণ এর ভিত্তি প্রধানত মদীনার প্রচলিত আমলের ওপর। তিনি বিশ্বাস করতেন, নবী (সাঃ)-এর হিজরতের পর থেকে মদীনার মানুষের প্রজন্ম পরম্পরায় চলে আসা আমল অবশ্যই সুন্নাহর প্রতিফলন।",
      "ফতোয়ার মূলনীতি\n\nতাঁর ফতোয়া প্রদানের উৎস ছিল আল-কুরআন ও সুন্নাহ, ইজমা, মদীনাবাসীর আমল, আল-মাসালিহ আল-মুরসালা (জনস্বার্থ রক্ষা), ইসতিহসান ও কিয়াস।",
      "ব্যক্তিগত চরিত্র ও আদব\n\nইমাম মালিক (রহঃ) জ্ঞান, তাকওয়া এবং সাহসিকতার জন্য কিংবদন্তী ছিলেন। তিনি হাদিস ও ফতোয়া প্রদানের সময় অত্যন্ত বিনয়ী ও মর্যাদাপূর্ণ আচরণ করতেন। হাদিস বর্ণনা করার আগে তিনি সবসময় অজু করতেন, সুগন্ধি ব্যবহার করতেন এবং পরিচ্ছন্ন পোশাক পরতেন।",
      "রাজনৈতিক পরীক্ষা\n\nআব্বাসীয় খলিফা আল-মানসুরের শাসনকালে, ইমাম মালিক (রহঃ) একটি ফতোয়া জারি করেছিলেন, যা তৎকালীন শাসকদের অবস্থানের পরিপন্থী ছিল। এর ফলে তাঁকে গ্রেফতার করা হয় এবং প্রকাশ্য দিবালোকে শারীরিক শাস্তি দেওয়া হয়। এই ঘটনা তাঁর মর্যাদাকে আরও বাড়িয়ে দেয় এবং তিনি মুসলিম উম্মাহর কাছে আপসহীন আলেম হিসেবে পরিচিত হন।",
      "শিক্ষাদান ও ছাত্রবৃন্দ\n\nইমাম মালিক (রহঃ) মদীনায় প্রায় ৬০ বছর হাদিস ও ফিকহের শিক্ষাদান করেছেন। তাঁর মজলিসে হাজার হাজার ছাত্র জ্ঞান অর্জন করেছেন। তাঁর ছাত্রদের মধ্যে ইমাম শাফেয়ী (রহঃ), আবদুল্লাহ ইবনে মুবারক (রহঃ), আবদুর রহমান ইবনে কাসিম (রহঃ) এবং আরো অনেক বড় বড় আলেম ছিলেন। তিনি শিক্ষাদানের সময় অত্যন্ত গাম্ভীর্য বজায় রাখতেন এবং হাদিসের প্রতি সম্মান প্রদর্শন করতেন।",
      "মদীনার প্রতি ভালোবাসা\n\nইমাম মালিক (রহঃ) মদীনাকে অত্যন্ত ভালোবাসতেন এবং জীবনে কখনো মদীনা ছেড়ে অন্য কোথাও যাননি। খলিফারা তাঁকে বাগদাদে আসার জন্য আমন্ত্রণ জানালেও তিনি প্রত্যাখ্যান করেন এবং বলেন, 'মদীনা হলো রাসূলুল্লাহ (সাঃ)-এর শহর এবং আমি এখানেই থাকতে চাই।' তিনি মদীনার মসজিদে নববীতে নিয়মিত শিক্ষাদান করতেন এবং সেখানেই তাঁর জ্ঞানের মজলিস বসতো।",
      "প্রভাব ও উত্তরাধিকার\n\nতাঁর অন্যতম শ্রেষ্ঠ ছাত্র ছিলেন ইমাম শাফেয়ী (রহঃ), যিনি পরবর্তীকালে নিজস্ব মাযহাব প্রতিষ্ঠা করেন। মালিকি মাযহাব প্রধানত উত্তর আফ্রিকা, পশ্চিম আফ্রিকা, মিশর এবং আন্দালুসিয়া অঞ্চলে বিস্তার লাভ করে, যেখানে আজও এটি প্রভাবশালী। তাঁর মুয়াত্তা আজও হাদিস ও ফিকহের একটি অমূল্য গ্রন্থ হিসেবে বিবেচিত হয়।",
      "আকীদাহ ও কুরআন সম্পর্কে\n\nইমাম মালিক (রহঃ) আহলুস সুন্নাহ ওয়াল জামাআতের ইমাম ছিলেন। যারা কুরআনকে আল্লাহর কালাম না বলে আল্লাহর সৃষ্টি বলতো ইমাম মালিক (রহঃ) তাদের যিন্দিক (নাস্তিক) বলতেন। ইয়াহইয়া ইবনে রাবী' বর্ণনা করেন, এক লোক তাঁর কাছে এসে বলল, 'হে আবূ আব্দুল্লাহ! ঐ ব্যক্তি সম্পর্কে আপনি কি বলেন, যে কুরআনকে সৃষ্ট বলে?' মালিক বললেন, 'সে যিন্দিক। তোমরা তাকে হত্যা কর।' লোকটি বলল, 'আমি তো একটা শোনা কথা নকল করেছি মাত্র।' মালিক বললেন, 'আমি তোমাকে ছাড়া আর কারো থেকে এ কথা শুনিনি। এ বড় সাংঘাতিক।'",
      "আল্লাহর সিফাত বা গুণাবলি\n\nইমাম মালিক (রহঃ) আল্লাহর সিফাত সমূহের কোন রূপ তাবিল বা ভিন্নার্থ গ্রহণের পক্ষপাতি ছিলেন না। বরং আল্লাহর হাত, পা, মুখ এসবের হুবহু অর্থই নিতেন। ইমাম দারাকুতনী (রহঃ) আল-ওয়ালীদ ইবনে মুসলিমের সনদে বর্ণনা করেছেন, তিনি বলেন, 'আমি মালিক, সাওরী, আওযাঈ ও লায়ছ ইবনে সা'দকে আল্লাহর গুণাবলী সংক্রান্ত হাদিসগুলো সম্পর্কে জিজ্ঞেস করেছিলাম। তারা বলেছিলেন, এগুলো যেভাবে এসেছে সেভাবেই বর্ণিত।' অর্থাৎ যা আছে হুবহু সেটাই বিশ্বাস করা লাগবে। আহলুস সুন্নাহ ওয়াল জামাআতের আকিদাহ এটাই।",
      "আল্লাহর অবস্থান ও আরশের ঘটনা\n\nইমাম মালিক (রহঃ)-এর আকিদাহ হচ্ছে আল্লাহ আরশের উপর সমুন্নত আর এ বিষয়ে বিশ্বাস করা ওয়াজিব। আবূ নুআইম (রহঃ) জাফর ইবনে আব্দুল্লাহ থেকে বর্ণনা করেছেন, তিনি বলেন, 'আমরা মালিক ইবনে আনাসের মজলিসে ছিলাম। এ সময় এক লোক তাঁর কাছে এসে বলল, হে আবূ আব্দুল্লাহ! রহমান (আল্লাহ) তো আরশে সমুন্নত। তিনি কীভাবে সমুন্নত?' তার প্রশ্নে ইমাম মালিক এতটাই রাগান্বিত হলেন যে তাঁর শরীর থেকে ঘাম ঝরতে লাগল। কিছুক্ষণ পর তিনি মাথা তুললেন এবং বললেন, 'তাঁর সমুন্নত হওয়ার ধরন অবোধগম্য, তবে তাঁর সমুন্নত হওয়া অজ্ঞাত নয়, এ বিষয়ে ঈমান রাখা ফরয এবং প্রশ্ন তোলা বিদআত। আমার ধারণা তুমি একজন বিদআতী।' তারপর তিনি তাকে বের করে দিতে আদেশ দিলেন।",
      "কিয়ামতে আল্লাহকে দেখা\n\nইবনু আব্দিল বার্র (রহঃ) বলেন, মালিককে কিয়ামত দিবসে আল্লাহকে দেখা যাবে কি না তা জিজ্ঞেস করা হয়। উত্তরে তিনি বলেন, 'হ্যাঁ। আল্লাহ তাআলা বলেছেন, সেদিন অনেক চেহারা উজ্জ্বল হবে। তাদের প্রতিপালকের দিকে তাকিয়ে থাকবে (সূরা কিয়ামাহ ৭৫/২২)। তিনি আরেক দলকে বলেছিলেন, কখনই না। তারা সেদিন তাদের প্রতিপালকের দর্শন হতে বঞ্চিত থাকবে (সূরা মুতাফফিফীন ৮৩/১৫)।' অর্থাৎ ইমাম মালিক (রহঃ)-এর মত হচ্ছে আল্লাহকে বান্দারা কিয়ামতের দিন দেখতে পাবে।",
      "আল্লাহর ইলম সর্বত্র\n\nইমাম আবু দাউদ (রহঃ) আব্দুল্লাহ ইবনে নাফে' থেকে বর্ণনা করেছেন, তিনি বলেন, ইমাম মালিক বলেছেন, 'আল্লাহ আকাশে এবং তাঁর ইলম (বিদ্যা) সব জায়গায় পরিব্যাপ্ত।' এই বর্ণনাগুলো ইমাম মালিক (রহঃ)-এর আকিদাহকে স্পষ্টভাবে ব্যাখ্যা করে এবং তিনি আহলুস সুন্নাহ ওয়াল জামাআতের পথে ছিলেন।",
      "ইন্তেকাল ও ঐতিহাসিক মর্যাদা\n\nইমাম মালিক (রহঃ) ১৭৯ হিজরিতে (৭৯৫ খ্রিস্টাব্দে) রবিউল আউয়াল মাসে ৮৪ বছর বয়সে মদীনাতেই ইন্তেকাল করেন। তাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকী-তে মসজিদে নববীর পাশে দাফন করা হয়। তাঁর জানাযায় হাজার হাজার মানুষ অংশগ্রহণ করেন এবং তাঁর জন্য দোয়া করেন। মদীনার প্রতি তাঁর গভীর অঙ্গীকার এবং হাদিস ও ফিকহে তাঁর অসাধারণ অবদানের কারণে তিনি 'ইমাম দার আল-হিজরা' হিসেবে চিরস্মরণীয় হয়ে আছেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_shafei",
    "categoryId": "imam_jibon",
    "title": "ইমাম শাফেয়ী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম শাফেয়ী (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ মুহাম্মদ ইবনে ইদ্রিস ইবনে আল-আব্বাস ইবনে উসমান ইবনে শাফে' আল-কুরাইশী আল-মুত্তালাবী। তিনি ১৫০ হিজরিতে (৭৬৭ খ্রিস্টাব্দের আগস্ট মাসে) ফিলিস্তিনের গাজায় জন্মগ্রহণ করেন এবং ২০৪ হিজরিতে রজব মাসের প্রথম দিন জুমআর রাত্রিতে (৮২০ খ্রিস্টাব্দের ১৯ জানুয়ারি) মাত্র ৫২ বছর বয়সে মিশরে ইন্তেকাল করেন। তাঁকে 'নাসিরুল হাদীস' (হাদিসের সাহায্যকারী) ও 'শায়খুল ইসলাম' উপাধিতে ভূষিত করা হয়।",
      "বংশ পরিচয় ও কুরাইশ বংশ\n\nইমাম শাফেয়ী (রহঃ) যেই বছর জন্মগ্রহণ করেন, সেই বছরই ইমাম আবু হানিফা (রহঃ) ইন্তেকাল করেন। তিনি মক্কার কুরাইশ বংশের অন্তর্ভুক্ত ছিলেন এবং তাঁর বংশধারা আবদে মানাফ বিন কুসাই-এর কাছে নবী মুহাম্মদ (সাঃ)-এর সাথে মিলিত হয়েছে। তাই তিনি আল-মুত্তালাবী বলে পরিচিত। তাঁর দাদা 'শাফে' একজন সাহাবী ছিলেন, যার দিকে সম্পৃক্ত করায় তিনি 'শাফেয়ী' নামে পরিচিত হন।",
      "পিতৃহীনতা ও মায়ের ভূমিকা\n\nইমাম শাফেয়ী মাত্র ২ বছর বয়সে পিতা ইদ্রিসকে হারিয়ে ইয়াতীম হয়ে যান। পিতার মৃত্যুর পর অভিভাবকহীনতা ও দারিদ্র্যতা ইত্যাদি নানা সমস্যার সম্মুখীন হন। তাঁর বিচক্ষণ মা তাঁকে দু'বছর বয়সে পিতৃভূমি ইয়ামেনে নিয়ে আসেন এবং পরে মক্কায় পাড়ি জমান। তাঁর মা তাঁকে কুরআন মুখস্থ করানোয় মনোনিবেশ করান।",
      "অসাধারণ প্রতিভা ও প্রাথমিক শিক্ষা\n\nইমাম শাফেয়ী ছোটবেলা থেকেই শিক্ষানুরাগী এবং কঠোর জ্ঞান সাধনা করার ফলে মাত্র ৭ বছর বয়সে সম্পূর্ণ কুরআন মুখস্থ করেন এবং ১০ বছর বয়সে ইমাম মালিক (রহঃ)-এর 'মুয়াত্তা' হাদীস গ্রন্থ হিফয করেন। তিনি মক্কায় বিভিন্ন মসজিদে ঘুরে আলেমদের শরণাপন্ন হয়ে বিভিন্ন হাদীস ও মাসআলা মুখস্থ করতে থাকেন। মক্কায় আরবী পণ্ডিতদের কাছে আরবী কবিতা ও ভাষা জ্ঞানে পূর্ণ পান্ডিত্ব লাভ করেন এবং ১৮ বছর বয়স থেকে ফতোয়া প্রদান শুরু করেন।",
      "মদীনা সফর ও ইমাম মালিকের সান্নিধ্য\n\nতিনি ছোটবেলায় একবার মদীনা সফর করেন এবং ইমাম মালিক (রহঃ)-এর সংকলিত গ্রন্থ মুয়াত্তা মুখস্থ করে তাঁকে শুনান। ইমাম শাফেয়ীর ছোট বয়সে এই প্রজ্ঞা ও প্রতিভা দেখে ইমাম মালিক (রহঃ) অভিভূত হন এবং তাঁকে স্নেহের পাত্র বানিয়ে নেন। ইমাম শাফেয়ী ইমাম মালিকের নিকট জ্ঞান চর্চা শুরু করেন এবং তাঁর ইন্তেকাল পর্যন্ত তাঁর কাছে শিক্ষা লাভ করেন।",
      "ইয়ামেন ও ফতোয়া প্রদান\n\nমদীনার পর তিনি ইয়ামানে শিক্ষার উদ্দেশ্যে বের হন এবং সেখানে শিক্ষা ও জ্ঞান বিস্তারে আত্মনিয়োগ করেন। মাত্র ১৮ বছর বয়স থেকে তিনি ফতোয়া প্রদান শুরু করেন। জনসমাজে তাঁর খ্যাতি ছড়িয়ে পড়লে তিনি বিদ্বেষীদের প্রকোপে পড়েন এবং ইয়ামেন ত্যাগ করে আবার মক্কায় ফিরে আসেন।",
      "প্রথম ইরাক সফর\n\nইমাম শাফেয়ী ইরাকে দু'বার সফর করেন। প্রথমবার রাজনৈতিক কারণে খলীফা হারুনুর রশীদ তাঁকে ইরাকে জোরপূর্বক পাঠান। সেখানে গিয়ে তিনি ইরাকের প্রসিদ্ধ জ্ঞানীদের নিকট শিক্ষা সমাপন করেন, বিশেষত ইমাম মুহাম্মদ আল-শাইবানী (রহঃ)-এর নিকট হানাফি ফিকহ ও কিয়াস পদ্ধতি সম্পর্কে গভীর জ্ঞান লাভ করেন। এরপর তিনি আবার মক্কায় ফিরে আসেন এবং পূর্ণদমে দরস-তাদরীস ও ইসলাম প্রচার-প্রসারের কাজে একটানা নয় বছর আত্মনিয়োগ করেন।",
      "দ্বিতীয় ইরাক সফর ও ইমাম আহমাদের সাক্ষাৎ\n\n১৯৫ হিজরীতে ইমাম শাফেয়ী আবারো ইরাক সফর করেন। প্রথম সফর ছিল জ্ঞান শিক্ষা গ্রহণের আর এ সফর হলো শিক্ষা গ্রহণ পাশাপাশি শিক্ষাদানের জন্য। ইমাম বায়হাকী (রহঃ) বর্ণনা করেন, হুসাইন কারাবিসী বলেন, 'আমাদের মাঝে একজন হাদীস পন্থী (আহলে হাদীস) এসেছেন চল আমরা তার কাছে গিয়ে একটু হাসি-ঠাট্টা করি।' কিন্তু ইমাম শাফেয়ী আল্লাহ ও রাসূলের উদ্ধৃতি দিয়ে তাদের জবাব দিতে থাকলেন এবং তাঁর কুরআন ও হাদিসের অগাধ পান্ডিত্য দেখে তারা আশ্চর্য হয়ে তাঁর কাছে আত্মসমর্পণ করেন। এ সফরেই ইমাম আহমাদ ইবনে হাম্বল (রহঃ) ইমাম শাফেয়ীর সাক্ষাৎ করেন।",
      "মিশর সফর ও মুতাযিলা ফিতনা\n\nইমাম শাফেয়ী (রহঃ)-এর ইরাকে অবস্থান যেমনি প্রশংসনীয় তেমনি আবার অপরদিক হতে কালো মেঘ নেমে আসতে লাগল। মুতাযিলা আলিমরা রাজনৈতিক প্রাঙ্গণ দখল করায় খলীফা হারুণসহ সে সময়ের আববাসীয় খলীফাগণ ফালসাফা ও তর্কবিদ্যা-মানতিকে প্রভাবিত হয়ে কুরআন মাখলুক বা মুতাজিলা বিশ্বাস পোষণ করে আহলুস সুন্নাহ ওয়াল জামাআতের ইমামদের উপর নির্যাতন শুরু করে। বাধ্য হয়ে ইমাম শাফেয়ী ইরাক ত্যাগ করে মিসরে পারি জমান।",
      "মিশরে স্বাগত ও প্রভাব\n\nমিশরে আগমন করলেই মিশরবাসী তাঁকে অভিনন্দন জানান। মিশরের বিখ্যাত মসজিদ আমর ইবনুল আস মসজিদে কিছু আলোচনা পেশ করলে সকলেই তাঁর আলোচনায় মুগ্ধ হয়ে যান। তারা এক বাক্যে স্বীকার করেন যে, মিশরের বুকে এমন প্রতিভাবান ব্যক্তির কখনও আগমন ঘটেনি, যিনি কুরাইশ বংশোদ্ভুত, যার সালাতের ন্যায় উত্তম সালাত আদায় করতে কাউকে দেখিনি, যার চেহারার ন্যায় সুন্দর চেহারা খুব কমই আছে, যার বক্তব্য ও বাচন ভঙ্গির মত আকর্ষণীয় ও শ্রুতিমধূর কাউকে দেখিনি।",
      "ফিকহী পদ্ধতি ও উসূলে ফিকহ\n\nইমাম শাফেয়ী (রহঃ)-এর প্রধান অবদান হলো ফিকহের উসূল (মূলনীতি) প্রতিষ্ঠা করা। তিনি হানাফি মাযহাবের 'আহলে রায়' এবং মালিকি মাযহাবের 'আহলে হাদিস'-এর মধ্যে একটি ভারসাম্যপূর্ণ পথের সৃষ্টি করেন। তিনি সর্বপ্রথম হাদিস শাস্ত্রের নীতিমালা প্রণয়নে কলম ধরেন 'রিসালাহ' ও 'আল উম্ম' গ্রন্থদ্বয়ে।",
      "আল-রিসালাহ\n\nএই গ্রন্থটি ইসলামী আইনশাস্ত্রের উসূল আল-ফিকহ-এর উপর রচিত সর্বপ্রথম প্রামাণিক গ্রন্থ। এটি তাঁর মৌলিক অবদান, যেখানে তিনি ফিকহের ভিত্তি হিসেবে কুরআন, সুন্নাহ, ইজমা এবং কিয়াসের ব্যবহারকে সুসংজ্ঞায়িত করেন। তাঁর আরেকটি গুরুত্বপূর্ণ গ্রন্থ হলো 'আল-উম্ম', যা শাফেয়ী মাযহাবের প্রধান ভিত্তি।",
      "আল-মাযহাবুল কাদীম ও জাদিদ\n\nইমাম শাফেয়ী (রহঃ)-এর ফিকহী জীবনকে দুটি পর্যায়ে ভাগ করা হয়। প্রাচীন মাযহাব ইরাক, মক্কা এবং মদীনার জীবনকালে প্রদত্ত ফতোয়া। জীবনের শেষ চার বছর তিনি মিশরে কাটান এবং সেখানকার পরিবেশ দেখে তিনি তাঁর পূর্বের কিছু সিদ্ধান্ত পরিবর্তন করেন। বর্তমানে শাফেয়ী মাযহাবের ভিত্তি হলো এই 'আল-মাযহাবুল জাদিদ'।",
      "আকীদাহ ও কুরআন সম্পর্কে\n\nইমাম শাফেয়ী (রহঃ) আহলুস সুন্নাহ ওয়াল জামাআতের ইমাম। তিনি ছিলেন কুরআন ও সুন্নাহর একনিষ্ঠ অনুসারী। তিনি কালাম পন্থী যুক্তিবাদী বিদআতীদের ঘোর বিরোধী ছিলেন। কুরআন সম্পর্কে তিনি বলতেন, 'যে বলবে যে, কুরআন মাখলূক (সৃষ্ট) সে কাফের।' আল্লাহর সিফাত বা গুণাবলি সম্পর্কে তিনি বলেছেন, 'কুরআন ও সুন্নাহ-তে আল্লাহর যেসব গুণ বর্ণিত হয়েছে সেগুলো আমরা যথাযথ মানি এবং তাঁর সাথে কোনরূপ উপমা দেওয়া অস্বীকার করি।'",
      "শিক্ষকবৃন্দ\n\nইমাম শাফেয়ী (রহঃ) স্বীয় যুগে বিভিন্ন দেশে অগণিত আলিমের কাছ থেকে শিক্ষালাভ করেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে রয়েছেন ইমাম সুফিয়ান ইবনে উয়াইনাহ (রহঃ), ইমাম মালিক ইবনে আনাস (রহঃ), ইমাম মুহাম্মদ ইবনে আল-হাসান আল-শাইবানী (রহঃ), ইমাম ওয়াকী ইবনে আল-জাররাহ (রহঃ), জাফর সাদিক (রহঃ), ইবনে শিহাব যুহরী (রহঃ) এবং আরো অনেকে।",
      "ছাত্রবৃন্দ ও প্রভাব\n\nইমাম শাফেয়ী (রহঃ)-এর ছাত্র হওয়ার যারা সৌভাগ্য লাভ করেছেন তাদের সংখ্যা বর্ণনা দেয়া অসম্ভব। তাঁর উল্লেখযোগ্য ছাত্রদের মধ্যে রয়েছেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইমাম রাবী ইবনে সুলায়মান আল-মাসরী (রহঃ), ইমাম ইসমাঈল ইবনে ইয়াহইয়া আল-মুযানী (রহঃ) এবং আরো অনেকে।",
      "আলিম সমাজের মন্তব্য\n\nইমাম মালিক (রহঃ) বলেন, 'আমি এ যুবক ইমাম শাফেয়ী-র মত অধিক বিচক্ষণ ও বুদ্ধিমান আর কোন কোরাইশীকে পাইনি।' ইমাম আহমাদ ইবনে হাম্বল (রহঃ) বলতেন, 'মুহাম্মদ ইবনে ইদ্রিস আল-শাফেয়ী ছিলেন এমন, যেমন মানুষের জন্য সূর্য এবং দেহের জন্য আরোগ্য।' একদল আলেম বলেন, 'ইমাম শাফেয়ী হলেন স্বীয় যুগে কুরআনের ব্যাপারে সবচেয়ে বেশি জ্ঞানী মানুষ।'",
      "গ্রন্থাবলী\n\nইমাম শাফেয়ী অসংখ্য গ্রন্থ রেখে গেছেন। তাঁর উল্লেখযোগ্য গ্রন্থগুলো হলো 'কিতাবুল উম্ম' (৯টি বড় খণ্ডে প্রকাশিত ফিকহী পদ্ধতিতে সংকলিত হাদীস গ্রন্থ), 'আর রিসালাহ' (উসূলে হাদীস ও উসূলে ফিকহের প্রথম গ্রন্থ), 'আহকামুল কুরআন', 'ইখতিলাফুল হাদীস', 'জিমাউল ইলম', 'ফাযাইলু কুরাইশ' এবং আরো অনেক।",
      "ইন্তেকাল\n\nইমাম শাফেয়ী (রহঃ) জীবনের শেষ পর্যন্ত মিশরে অবস্থান করেন এবং তাঁর মূল্যবান গ্রন্থসমূহ সেখানেই সংকলন করেন। তিনি ২০৪ হিজরিতে রজব মাসের প্রথম দিন জুমআর রাত্রিতে (৮২০ খ্রিস্টাব্দের ১৯ জানুয়ারি) মাত্র ৫২ বছর বয়সে মিশরে ইন্তেকাল করেন। তাঁর হাদীস গবেষণা ও চর্চায় যারা হানাফী বা মালিকী মাযহাবের অনুসারী ছিলেন, তার অনেকেই হাদিসের আলোকে ইসলাম চর্চার সুযোগ লাভে ধন্য হন।"
    ],
    "source": "ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_ahmad",
    "categoryId": "imam_jibon",
    "title": "ইমাম আহমাদ ইবনে হাম্বল (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আহমাদ (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ আহমাদ ইবনে মুহাম্মাদ ইবনে হাম্বল আল-শাইবানী। তিনি ১৬৪ হিজরিতে (৭৮০ খ্রিস্টাব্দে) বাগদাদে জন্মগ্রহণ করেন এবং ২৪১ হিজরিতে (৮৫৫ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তাঁকে 'ইমাম আহলুস সুন্নাহ' (সুন্নাহপন্থীদের ইমাম) ও 'শাইখুল ইসলাম' উপাধিতে ভূষিত করা হয়।",
      "প্রাথমিক জীবন ও পিতৃহীনতা\n\nইমাম আহমাদ (রহঃ) বাগদাদের এক সম্ভ্রান্ত আরব শাইবানী বংশে জন্মগ্রহণ করেন। তাঁর বাবা মুহাম্মদ ইবনে হাম্বল অল্প বয়সেই ইন্তেকাল করলে, তাঁর মা তাঁকে লালন-পালন করেন। ছোটবেলা থেকেই তাঁর স্মৃতিশক্তি ছিল প্রখর এবং তিনি শৈশবেই পুরো কুরআন মুখস্থ করেন।",
      "জ্ঞান অন্বেষণের যাত্রা\n\nতিনি ১৬ বছর বয়স থেকেই হাদিস সংগ্রহ ও শেখার দিকে মনোযোগ দেন। তিনি জ্ঞান অর্জনের জন্য তৎকালীন মুসলিম বিশ্বের বিভিন্ন অঞ্চলে ব্যাপক সফর করেন। তিনি কুফা, বসরা, মক্কা, মদীনা, ইয়েমেন, সিরিয়া, জাযিরা, আব্বাদান, ওয়াসেত ও অন্যান্য অঞ্চলে পায়ে হেঁটে অথবা কঠিন পরিস্থিতিতে ভ্রমণ করেছেন।",
      "শিক্ষকবৃন্দ\n\nতিনি প্রায় ২৮০ জনেরও বেশি আলেমের কাছ থেকে জ্ঞান অর্জন করেন। তাঁর শিক্ষকদের মধ্যে গুরুত্বপূর্ণ ছিলেন ইমাম শাফেয়ী (রহঃ), ওয়াকী ইবনুল জাররাহ (রহঃ), সুফিয়ান ইবনে উয়াইনাহ (রহঃ), আবদুর রাযযাক ইবনে হাম্মাম সানআনী (রহঃ), ইয়াহইয়া ইবনে সাঈদ কাত্তান (রহঃ), আবু দাউদ তাওয়ালিসী (রহঃ) এবং আরো অনেকে। তিনি ইমাম শাফেয়ী (রহঃ)-এর একজন ছাত্র ছিলেন এবং ফিকহের উসূল সম্পর্কে তাঁর কাছ থেকে গভীর জ্ঞান লাভ করেন।",
      "ইমাম শাফেয়ীর সাথে সম্পর্ক\n\nইমাম আহমাদ (রহঃ) বাগদাদে ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম শাফেয়ী (রহঃ)-এর কাছে পড়াশুনা করেন। ইমাম শাফেয়ী (রহঃ) তাঁকে অত্যন্ত সম্মান করতেন এবং বলতেন, 'আমি বাগদাদে আহমদ ইবনে হাম্বলের চেয়ে অধিক জ্ঞানী, ত্যাগী ও মুত্তাকী আর কাউকে রেখে আসিনি।'",
      "মুসনাদে আহমাদ সংকলন\n\nইমাম আহমাদ (রহঃ)-এর সবচেয়ে বড় অবদান হলো তাঁর বিশাল হাদিস সংকলন 'মুসনাদে আহমাদ'। এই গ্রন্থে তিনি প্রায় ২৭,০০০-এর বেশি হাদিস সংকলন করেছেন। মুসনাদের বিশেষত্ব হলো, এটি সাহাবীর নাম অনুসারে সাজানো হয়েছে। হাদিসশাস্ত্রের পণ্ডিতদের কাছে মুসনাদ একটি অত্যন্ত নির্ভরযোগ্য এবং বিশাল ভান্ডার হিসেবে বিবেচিত।",
      "ফিকহী পদ্ধতি ও হাম্বলি মাযহাব\n\nতাঁর মাযহাব হাদিস ও আছার (সাহাবীদের বক্তব্য)-এর ওপর সবচেয়ে বেশি গুরুত্ব দেয়। তাঁর ফতোয়ার উৎস ছিল আল-কুরআন ও সুন্নাহ, সাহাবীদের ফতোয়া, ইজমা এবং দুর্বল হাদিসকে কিয়াসের উপর অগ্রাধিকার দেওয়া। তিনি মুতাজিলা যুক্তিবাদী মতবাদের সারা জীবন ব্যাপী বিরোধিতা করেছেন।",
      "আল-মিহনা - খলীফা মামুনের ফিতনা\n\nইমাম আহমাদ (রহঃ)-এর জীবনের সবচেয়ে কঠিন পর্ব হলো 'আল-মিহনা' বা ধর্মদ্রোহিতার তদন্ত। আব্বাসীয় খলিফা আল-মামুনের শাসনামলে 'মুতাযিলা'দের প্রভাবে এই বিতর্ক সৃষ্টি হয় যে, কুরআন সৃষ্ট নাকি আল্লাহর চিরন্তন বাণী। খলিফা আল-মামুন পণ্ডিতদের উপর কুরআনের সৃষ্ট হওয়ার মুতাজিলি মতবাদ গ্রহণ করার জন্য চাপ প্রয়োগ করেন।",
      "দৃঢ় অবস্থান ও প্রত্যাখ্যান\n\nইমাম আহমাদ (রহঃ) মুতাজিলি মতবাদ গ্রহণ করতে দৃঢ়ভাবে অস্বীকৃতি জানান এবং কুরআনকে আল্লাহর চিরন্তন কালাম হিসেবে ঘোষণা করেন। তিনি বলেছিলেন, 'কুরআন আল্লাহর বাণী, সৃষ্ট নয়। কুরআন আল্লাহর অন্যান্য সৃষ্টির মত কোন সৃষ্টি নয় বরং তা সরাসরি আল্লাহর বাণী ও আল্লাহরই নিজস্ব বিশুদ্ধ বক্তব্য, তাই তা সম্পূর্ণ নির্ভূল।'",
      "কারাবাস ও নির্যাতন\n\nইমাম আহমাদ (রহঃ) মুতাজিলি মতবাদ গ্রহণ করতে অস্বীকৃতি জানানোর কারণে, তিনি আল-মামুনের রাজত্বকাল জুড়ে বাগদাদে বন্দী ছিলেন। আল-মামুনের উত্তরসূরী আল-মুতাসিমের শাসনামলে এক ঘটনায় ইমাম আহমাদকে বেত্রাঘাত করে অজ্ঞান করে ফেলা হয়। এই নির্যাতন বাগদাদে ব্যাপক অস্থিরতা সৃষ্টি করে এবং আল-মুতাসিমকে তাঁকে মুক্তি দিতে বাধ্য করে।",
      "নির্বাসন ও মুক্তি\n\nআল-মুতাসিমের মৃত্যুর পর, আল-ওয়াসিক খলিফা হন এবং মুতাজিলি মতবাদ প্রয়োগের জন্য তাঁর পূর্বসূরীদের নীতি অব্যাহত রাখেন এবং এই লক্ষ্যে ইমাম আহমাদকে বাগদাদ থেকে নির্বাসিত করেন। আল-ওয়াসিকের মৃত্যুর পর এবং তাঁর ভাই আল-মুতাওয়াক্কিল, যিনি ঐতিহ্যবাহী সুন্নি বিশ্বাসের প্রতি অনেক বেশি সহনশীল ছিলেন, তাঁর আরোহণের পরই ইমাম আহমাদকে বাগদাদে ফিরিয়ে আনা হয়।",
      "ব্যক্তিগত জীবন ও তাকওয়া\n\nতিনি ছিলেন চরম যাহিদ (দুনিয়াবিমুখ), পরহেজগার এবং বিনয়ী। তিনি শাসকদের কাছ থেকে কোনো উপহার বা ভাতা গ্রহণ করতেন না। আবু দাউদ (রহঃ) বর্ণনা করেছেন, 'ইমাম আহমাদের মজলিস ছিল আখেরাতের মজলিস। সেখানে কখনো তিনি দুনিয়ার আলোচনা করতেন না। আমি কখনো তাঁকে দুনিয়ার নাম উচ্চারণ করতে শুনিনি।'",
      "ছাত্রবৃন্দ\n\nইমাম আহমাদ (রহঃ)-এর ছাত্র সংখ্যা হাজার হাজার। তাঁর উল্লেখযোগ্য ছাত্রদের মধ্যে রয়েছেন ইমাম বুখারী (রহঃ), ইমাম মুসলিম (রহঃ), ইমাম আবু দাউদ সিজিস্তানী (রহঃ), তাঁর দুই ছেলে সালেহ ও আবদুল্লাহ এবং চাচাতো ভাই হাম্বল ইবনে ইসহাক।",
      "গ্রন্থাবলী\n\nইমাম আহমাদ অসংখ্য গ্রন্থ রেখে গেছেন। তাঁর উল্লেখযোগ্য গ্রন্থগুলো হলো মুসনাদে আহমাদ, উসুলুস সুন্নাহ, কিতাবুল ঈমান, কিতাবুয যুহুদ, ফাযায়িলুস সাহাবা, কিতাবুস সালাত, আর-রাদ্দ আলাল জাহমিয়্যাহ (জাহমিয়া মতবাদের খণ্ডন) এবং আরো অনেক।",
      "ইন্তেকাল ও মর্যাদা\n\nতিনি ছিলেন জনগণের কাছে অত্যন্ত প্রিয়। তাঁর মৃত্যুর দিন বাগদাদে বহু মানুষ সমবেত হন। ঐতিহাসিকদের মতে, তাঁর জানাযায় এতো বিপুল সংখ্যক মানুষ অংশ নিয়েছিলেন যে, তা স্মরণকালের মধ্যে সবচেয়ে বড় জানাযা ছিল। ইমাম আহমাদ ইবনে হাম্বল (রহঃ) ২৪১ হিজরিতে (৮৫৫ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন। তাঁর আপসহীনতা ও কুরআনের মর্যাদা রক্ষায় অবিচল থাকার কারণে তিনি 'ইমাম আহলুস সুন্নাহ' হিসেবে চিরকাল সম্মানিত হয়ে আছেন।"
    ],
    "source": "ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; খতিব বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_bukhari",
    "categoryId": "imam_jibon",
    "title": "ইমাম বুখারী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম বুখারী (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ মুহাম্মদ ইবনে ইসমাইল ইবনে ইব্রাহিম ইবনে আল-মুগীরাহ আল-জু'ফী আল-বুখারী। তিনি হাদিসশাস্ত্রের সর্বোচ্চ মর্যাদা লাভকারী 'আমীরুল মু'মিনীন ফিল হাদিস'। ১৯৪ হিজরিতে ১৩ শাওয়াল শুক্রবার (৮১০ খ্রিস্টাব্দে) খোরাসানের বুখারায় জন্মগ্রহণ করেন এবং ২৫৬ হিজরিতে ১ শাওয়াল (৮৭০ খ্রিস্টাব্দে) সমরকন্দের খরতঙ্গে ইন্তেকাল করেন।",
      "বংশ পরিচয় ও পারিবারিক পটভূমি\n\nইমাম বুখারী (রহঃ) ছিলেন পারস্য বংশোদ্ভূত এক সম্ভ্রান্ত পরিবারের সন্তান। তাঁর পূর্বপুরুষ আল-মুগীরাহ বুখারার গভর্নর ইয়ামান আল-জু'ফীর হাতে ইসলাম গ্রহণ করেন। তাঁর বাবা ইসমাইল ইবনে ইব্রাহিম নিজেও একজন মুহাদ্দিস ছিলেন এবং ইমাম হাম্মাদ, ইমাম মালিক (রহঃ) ও আব্দুল্লাহ ইবনে মুবারক (রহঃ)-এর ছাত্র ছিলেন। তাঁর পিতা প্রচুর ধনসম্পদ রেখে যান।",
      "শৈশব ও মায়ের দোয়া\n\nইমাম বুখারী শৈশবেই পিতৃহীন হন এবং মায়ের তত্ত্বাবধানে বেড়ে ওঠেন। তাঁর মা ছিলেন বিদূষী ও মহীয়সী মহিলা। বাল্যকালে তিনি একটি কঠিন রোগে আক্রান্ত হন এবং তাঁর দুই চোখ প্রায় অন্ধ হয়ে যায়। তাঁর মা ব্যাকুল হয়ে আল্লাহর কাছে প্রার্থনা করতে থাকেন। এক রাতে স্বপ্নে তিনি হযরত ইব্রাহীম (আঃ)-কে দেখেন যিনি বলেন, 'তোমার প্রার্থনা আল্লাহ কবুল করেছেন।' পরদিন সকালে তাঁর পুত্রের চোখ সম্পূর্ণ সুস্থ হয়ে যায়।",
      "প্রাথমিক শিক্ষা ও প্রতিভা\n\nইমাম বুখারী (রহঃ) বাল্যকাল থেকেই শিক্ষা-দীক্ষার প্রতি গভীর আগ্রহী ছিলেন। মাত্র ৬ বছর বয়সে তিনি সম্পূর্ণ কুরআন মুখস্থ করেন। ১০ বছর বয়স থেকে তিনি হাদীস মুখস্থ করা শুরু করেন এবং ১৬ বছর বয়সে আব্দুল্লাহ ইবনে মুবারক ও ওয়াকীর পান্ডুলিপিসমূহ মুখস্থ করে ফেলেন।",
      "প্রখর স্মৃতিশক্তি\n\nতাঁর স্মৃতিশক্তি ছিল অত্যন্ত প্রখর। একদা ইমাম দাখেলির দরসগাহে একটি হাদিসের সনদ বর্ণনা করার সময় ভুল হলে ইমাম বুখারী নম্রস্বরে সংশোধন করেন। অন্য এক মজলিসে সহপাঠীরা হাদিস লিখে নিলেও তিনি লিখতেন না। জোর তাগিদে তিনি তাদের লেখা অনুসারে প্রায় ১৫,০০০ হাদিস মুখস্থ পাঠ করে শোনান। তিনি বলতেন, 'আমার অন্তরে এক লক্ষ সহিহ হাদিস ও দুই লক্ষ যঈফ হাদীস মুখস্থ রয়েছে।'",
      "হজ্জ ও জ্ঞান অন্বেষণের সফর\n\n১৬ বছর বয়সে তিনি মা ও বড় ভাইয়ের সাথে হজ্জে গমন করেন। হজ্জের পর তিনি মক্কায় রয়ে যান এবং হিজাযের হাদীসবিশারদদের কাছ থেকে হাদীস গ্রহণ করতে থাকেন। এ সময় তিনি 'কাজায়াস সাহাবা ওয়াত তাবীয়ীন' নামক গ্রন্থ রচনা করেন। এরপর হাদীস অন্বেষণের জন্য তিনি খোরাসান, মক্কা, মদীনা, ইরাক, সিরিয়া, মিশর সহ বহু অঞ্চলে সফর করেন। দীর্ঘ ১৬ বছর পর তিনি বুখারায় ফিরে আসেন।",
      "উস্তাদগণ\n\nতিনি এক হাজারেরও অধিক সংখ্যক মুহাদ্দিসের নিকট থেকে হাদীস সংগ্রহ করেন। তাঁর উল্লেখযোগ্য উস্তাদদের মধ্যে রয়েছেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইসহাক ইবনে রাহওয়াইহ (রহঃ), আলী ইবনুল মাদীনী (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ) এবং আরো অনেকে। তিনি ইমাম আবু হানিফা (রহঃ)-এর ছাত্র ইবরাহিম আল মক্কী ও মক্কি বিন ইবরাহিম থেকেও অনেক হাদিস বর্ণনা করেন।",
      "বাগদাদে স্মরণশক্তির পরীক্ষা\n\nযখন তাঁর সুনাম চতুর্দিকে ছড়িয়ে পড়ল, তখন বাগদাদের ৪০০ মুহাদ্দিস তাঁকে পরীক্ষা করার সিদ্ধান্ত নেন। তারা ১০০টি সহীহ হাদীসের সনদ ও মতন পাল্টিয়ে দিয়ে ১০ জন মুহাদ্দিসের হাতে সোপর্দ করেন। প্রতিটি হাদিস পড়া শেষে ইমাম বুখারী বলতেন, 'এ ধরনের কোন হাদিস আমার জানা নেই।' সবগুলো শেষ হলে তিনি প্রতিটি হাদিসকে তার আসল সনদের দিকে ফিরিয়ে দেন এবং ঠিক করে দেন। একটি শব্দও ছুটে যায়নি। সকলেই তাঁকে যুগশ্রেষ্ঠ মুহাদ্দিস হিসেবে স্বীকৃতি দেন।",
      "সহীহ আল-বুখারী সংকলন\n\nইমাম বুখারী (রহঃ)-এর জীবনব্যাপী পরিশ্রমের ফল হলো তাঁর সংকলন 'সহীহ আল-বুখারী'। হাদিসের বিশুদ্ধতার ক্ষেত্রে তিনি ছিলেন সবচেয়ে কঠোর। একটি হাদিসকে সহীহ হিসেবে অন্তর্ভুক্ত করার জন্য তিনি কঠোর শর্ত আরোপ করেন।",
      "পরিশ্রমের বিবরণ\n\nতিনি ১৬ বছর ধরে তাঁর এই সংকলন কাজটি সম্পন্ন করেন। তিনি প্রায় ৬ লাখ হাদিস থেকে যাচাই-বাছাই করে চূড়ান্তভাবে মাত্র ৭,২৭৫টি (পুনরাবৃত্তি সহ) সহীহ হাদিস লিপিবদ্ধ করেন।",
      "ইবাদতের মাধ্যমে সংকলন\n\nকথিত আছে, তিনি প্রতিটি হাদিস লিপিবদ্ধ করার আগে গোসল করতেন এবং দুই রাকাত নফল সালাত আদায় করে আল্লাহর কাছে ইস্তেখারা (পরামর্শ) চাইতেন।",
      "ফিকহী দৃষ্টিভঙ্গি\n\nইমাম বুখারী (রহঃ) ছিলেন মূলত একজন মুহাদ্দিস, কিন্তু তাঁকে অনেক আলেম মুজতাহিদ হিসেবেও গণ্য করেন। সহীহ বুখারী-এর বিভিন্ন অধ্যায়ের শিরোনাম এমনভাবে সাজানো হয়েছে, যা তাঁর গভীর ফিকহী জ্ঞান এবং ইজতিহাদের সিদ্ধান্তকে প্রতিফলিত করে।",
      "স্বর্ণমুদ্রার ঘটনা\n\nএকবার তিনি এক হাজার স্বর্ণমুদ্রা নিয়ে সফরে বের হন। এক চোর তা চুরি করার জন্য কৌশল করে চিৎকার করে বলে যে তার মুদ্রা চুরি হয়েছে। জাহাজের লোকেরা সবাইকে তল্লাশি করতে শুরু করলে ইমাম বুখারী চিন্তা করেন যে, যদি তাঁর কাছে মুদ্রা পাওয়া যায় তাহলে তিনি চোর হিসেবে সাব্যস্ত হবেন এবং হাদিসের মর্যাদা ক্ষুণ্ণ হবে। তাই তিনি স্বর্ণমুদ্রার থলেটি পানিতে ফেলে দেন। পরে চোর জিজ্ঞেস করলে তিনি বলেন, 'আমি তা পানিতে ফেলে দিয়েছি।' এই ঘটনা তাঁর হাদিসের প্রতি ভালোবাসা ও আত্মত্যাগের প্রমাণ।",
      "ছাত্রবৃন্দ ও প্রভাব\n\nইমাম বুখারী থেকে অসংখ্য মুহাদ্দিস সহীহ বুখারী বর্ণনা করেছেন। তাঁর উল্লেখযোগ্য ছাত্রদের মধ্যে রয়েছেন ইমাম মুসলিম (রহঃ), ইমাম তিরমিযী (রহঃ), ইমাম নাসাঈ (রহঃ), আবু হাতেম রাজি (রহঃ), ইমাম আবু বকর ইবনে খুযাইমা (রহঃ) এবং আরো অনেকে। ফিরাবরির বরাত দিয়ে বলা হয় যে, তাঁর সাথে প্রায় ৭০,০০০ লোক সরাসরি সহীহ বুখারী পড়েছেন।",
      "ইবাদত ও চরিত্র\n\nতিনি প্রতি বছর রমাযান মাসের দিনে একবার কুরআন খতম করতেন এবং তারাবীর পর প্রতি তিন রাতে একবার খতম করতেন। তিনি রাসূল (সাঃ)-এর সুন্নাত মোতাবেক শেষ রাতে তের রাকাত তাহাজ্জুদ নামায পড়তেন। তিনি ছিলেন অত্যন্ত দানশীল। তাঁর জমি থেকে প্রতি বছর ৭ লক্ষ দিরহাম ভাড়া পেতেন, যার বেশিরভাগই ইলম অর্জনের পথে ও অভাবীদের মধ্যে ব্যয় করতেন।",
      "রাজনৈতিক আপসহীনতা\n\nইমাম বুখারী (রহঃ) জ্ঞান ও সত্যের প্রশ্নে ছিলেন সম্পূর্ণ আপসহীন। বুখারার শাসক খালিদ ইবনে আহমাদ যুহলী তাঁকে দরবারে এসে ব্যক্তিগতভাবে শিক্ষাদানের অনুরোধ করেন। ইমাম বুখারী (রহঃ) তীব্রভাবে প্রত্যাখ্যান করেন এবং বলেন, 'জ্ঞানের কাছে যাওয়া উচিত, জ্ঞানীর কাছে জ্ঞান আসে না। আমি জ্ঞানকে অপমান করতে পারি না।'",
      "নির্বাসন ও ইন্তেকাল\n\nএই অস্বীকৃতির ফলে শাসক তাঁকে জনগণের সামনে অপমান করে বুখারা থেকে নির্বাসিত করেন। বিতাড়িত অবস্থায় তিনি সামারকান্দের কাছে খারতাঙ নামক গ্রামে আশ্রয় নেন এবং সেখানেই ২৫৬ হিজরিতে ১ শাওয়াল শুক্রবার দিবাগত রাতে ইন্তেকাল করেন। পরদিন শনিবার যোহরের নামাজের পর তাঁকে সমাধিস্থ করা হয়। ইমাম বুখারী (রহঃ)-এর জীবনের এই কঠিন পরীক্ষা সত্ত্বেও তাঁর জ্ঞান ও নীতি তাঁকে মুসলিম বিশ্বে আমীরুল মু'মিনীন ফিল হাদিস হিসেবে চিরকাল সম্মানিত করে রেখেছে।"
    ],
    "source": "ইবনে হাজার আল-আসকালানী, ফাতহুল বারী; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_muslim",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুসলিম (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম মুসলিম (রহঃ)-এর পূর্ণ নাম আবু আল-হুসাইন মুসলিম ইবনে আল-হাজ্জাজ ইবনে মুসলিম ইবনে ওয়ার্দ ইবনে কাউশাদ আল-কুশাইরী আল-নিশাপুরী। তিনি হাদিসশাস্ত্রের ছয়টি প্রধান গ্রন্থের মধ্যে দ্বিতীয় বিশুদ্ধতম গ্রন্থ 'সহীহ মুসলিম'-এর সংকলক। ২০৪ হিজরিতে (৮২০ খ্রিস্টাব্দে) নিশাপুরে জন্মগ্রহণ করেন এবং ২৬১ হিজরিতে (৮৭৫ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "বংশ পরিচয় ও জ্ঞানার্জনের প্রারম্ভ\n\nইমাম মুসলিম (রহঃ) নিশাপুরের এক ধনী, সম্ভ্রান্ত এবং জ্ঞানপিপাসু পরিবারে জন্মগ্রহণ করেন। তাঁর পরিবার কুশাইরী নামক একটি আরব গোত্রের অন্তর্ভুক্ত ছিল।",
      "শিক্ষার শুরু\n\nতিনি মাত্র বারো বছর বয়সে নিজ শহরের তৎকালীন মুহাদ্দিসদের কাছ থেকে হাদিস শোনা ও লেখা শুরু করেন। তাঁর প্রথম উস্তাদ ছিলেন ইয়াহিয়া ইবনে ইয়াহিয়া আল-নিশাপুরী (রহঃ)। হাদিসশাস্ত্রের প্রতি তাঁর গভীর আগ্রহ এবং শক্তিশালী স্মৃতিশক্তির কারণে তিনি অল্প বয়সেই তাঁর সমসাময়িকদের চেয়ে এগিয়ে যান।",
      "হাদিস সংগ্রহের বিস্তৃত সফর\n\nইমাম মুসলিম (রহঃ) জীবনের প্রায় পনেরো বছর ব্যয় করেন জ্ঞানের সন্ধানে ভ্রমণ করে। হাদিস সংগ্রহের জন্য তিনি তৎকালীন মুসলিম বিশ্বের প্রধান কেন্দ্রসমূহ—ইরাক (বাগদাদ, কুফা, বসরা), হিজাজ (মক্কা ও মদীনা), মিশর ও সিরিয়াতে ব্যাপক সফর করেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি হাদিসশাস্ত্রের প্রায় সকল শীর্ষস্থানীয় ইমামের কাছ থেকে শিক্ষা লাভ করেন। তাঁর শিক্ষকদের মধ্যে গুরুত্বপূর্ণ ছিলেন ইমাম বুখারী (রহঃ), ইমাম আহমাদ ইবনে হাম্বল (রহঃ) এবং ইসহাক ইবনে রাহাওয়াইহ (রহঃ)। তিনি ইমাম বুখারীর সান্নিধ্যে দীর্ঘ সময় কাটান এবং হাদিসের বিশুদ্ধতা যাচাইয়ের উসূল সম্পর্কে গভীর জ্ঞান অর্জন করেন। তিনি প্রায় ২২০ জন শিক্ষকের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "সহীহ মুসলিম সংকলন\n\nইমাম মুসলিম (রহঃ)-এর প্রধান ও চিরস্মরণীয় অবদান হলো তাঁর সংকলিত হাদিসগ্রন্থ 'সহীহ মুসলিম'। তিনি লক্ষ্য করেছিলেন যে, হাদিসের সংকলনগুলোতে সহীহ ও যঈফ (দুর্বল) হাদিসগুলো একত্রে মিশ্রিত অবস্থায় রয়েছে। তাই তিনি কেবলমাত্র সহীহ হাদিস নিয়ে একটি গ্রন্থ সংকলনের সংকল্প করেন।",
      "পরিশ্রম ও পরিসর\n\nতিনি প্রায় ৩ লাখ হাদিস পরীক্ষা করে সেগুলোর মধ্য থেকে সর্বোচ্চ বিশুদ্ধতার মানদণ্ডে উত্তীর্ণ প্রায় ৪০০০ হাদিস (পুনরাবৃত্তি ব্যতীত) তাঁর গ্রন্থে অন্তর্ভুক্ত করেন।",
      "বিন্যাসের উৎকর্ষ\n\nসহীহ মুসলিমের সবচেয়ে বড় বৈশিষ্ট্য হলো এর সুসংগঠিত বিন্যাস পদ্ধতি। ইমাম বুখারী যেখানে ফিকহী মাসআলার জন্য একই হাদিসকে ভিন্ন ভিন্ন অধ্যায়ে এনেছেন, সেখানে ইমাম মুসলিম (রহঃ) প্রতিটি ফিকহী অধ্যায়ের অধীনে সংশ্লিষ্ট সব হাদিস এবং সেগুলোর বিভিন্ন বর্ণনাকারীর শৃঙ্খল একত্রিত করেছেন।",
      "মর্যাদা ও তাকওয়া\n\nইমাম মুসলিম (রহঃ) তাঁর জীবদ্দশায়ই হাদিসশাস্ত্রের একজন মুজতাহিদ হিসেবে স্বীকৃতি লাভ করেন। ইমাম বুখারীর সহীহ বুখারী এবং ইমাম মুসলিমের সহীহ মুসলিম একসাথে 'সহীহাইন' (দুই সহীহ) নামে পরিচিত এবং কুরআনের পরই এই দুটি গ্রন্থের স্থান।",
      "উস্তাদের প্রতি বিনয়\n\nতাঁর উস্তাদ ইমাম বুখারী (রহঃ)-এর প্রতি তাঁর গভীর শ্রদ্ধা ছিল। একবার তিনি ইমাম বুখারীর কদম মুবারক চুম্বন করতে চেয়ে বলেছিলেন, 'হে মুহাদ্দিসদের ডাক্তার! আপনি আমাকে অনুমতি দিন আমি আপনার পা চুম্বন করি।' তিনি অত্যন্ত বিনয়ী, পরহেজগার এবং তাঁর জীবনে কোনো প্রকার গীবত বা মিথ্যা থেকে দূরে থাকতেন।",
      "সহীহ মুসলিমের বৈশিষ্ট্য\n\nসহীহ মুসলিম হাদিস সংকলনের ক্ষেত্রে অনন্য পদ্ধতি অনুসরণ করেছে। ইমাম মুসলিম (রহঃ) প্রতিটি হাদিসের সকল সনদ ও বর্ণনা একত্রে উল্লেখ করেছেন, যা হাদিস গবেষকদের জন্য অত্যন্ত সুবিধাজনক। তিনি হাদিসগুলোকে বিষয়ভিত্তিক অধ্যায়ে বিন্যস্ত করেছেন এবং প্রতিটি অধ্যায়ে সংশ্লিষ্ট সকল হাদিস সংকলন করেছেন।",
      "অন্যান্য রচনাবলী\n\nসহীহ মুসলিম ছাড়াও ইমাম মুসলিম (রহঃ) আরো অনেক গ্রন্থ রচনা করেছিলেন। এর মধ্যে রয়েছে আল-মুসনাদ আল-কাবীর, কিতাব আল-জামি আলা আল-আবওয়াব, কিতাব আল-আসমা ওয়া আল-কুনা, কিতাব আল-তাময়ীয, কিতাব আল-ইফরাদ, কিতাব আল-আকরান এবং আরো অনেক। তবে সহীহ মুসলিম ছাড়া তাঁর অন্য কোনো গ্রন্থ বর্তমানে পাওয়া যায় না।",
      "ছাত্রবৃন্দ\n\nইমাম মুসলিম (রহঃ) ছিলেন উলূমে হাদিসের এক বিশাল সাগর। বিশ্বের সকল হাদিস বিশারদ তাঁকে এ বিষয়ের একজন শ্রেষ্ঠ ইমাম বলে ঐকমত্য পোষণ করেছেন। তাঁর যুগের বড় বড় মুহাদ্দিসগণ তাঁর নিকট হাদিস শিক্ষা করেছেন। তাঁর প্রখ্যাত ছাত্রদের মধ্যে রয়েছেন ইবনে খুজায়মা (রহঃ), ইমাম তিরমিযী (রহঃ), আবু আওয়ানা (রহঃ), ইবরাহীম ইবনে আবী তালিব (রহঃ), আবু হামেদ আহমাদ ইবনে হামাদান (রহঃ) এবং আরো অনেকে।",
      "আলেমদের প্রশংসা\n\nইমাম মুসলিম (রহঃ) সম্পর্কে তৎকালীন ও পরবর্তী আলেমগণ অত্যন্ত উচ্চ ধারণা পোষণ করতেন। ইমাম নাসাঈ (রহঃ) বলেন, 'হাদিসের ইমামগণের মধ্যে চারজন রয়েছেন—আবু যুরআহ, মুহাম্মদ ইবনে ইসমাঈল (বুখারী), মুসলিম এবং আবদুল্লাহ ইবনে আবদুর রহমান আদ-দারিমী।' ইবনে হাজার আসকালানী (রহঃ) বলেন, 'ইমাম মুসলিম হাদিসশাস্ত্রের একজন অতুলনীয় ইমাম ছিলেন।'",
      "মৃত্যুর ঘটনা\n\nইমাম মুসলিম (রহঃ) ২৬১ হিজরির ২৫ রজব রোববার নিশাপুরে ইন্তেকাল করেন এবং ২৬ রজব সোমবার নিশাপুরের শহরতলী নাসরাবাদে তাঁকে দাফন করা হয়। ইবনে হাজার আসকালানী (রহঃ) মৃত্যুর কারণ সম্বন্ধে বর্ণনা করেছেন যে, একটি হাদিস বিষয়ক আলোচনা সভায় একটি হাদিস আলোচিত হয় যা ইমাম মুসলিমের জানা ছিল না। মজলিস শেষে বাড়ি ফিরে রাতে এক ঝুড়ি খেজুর সামনে নিয়ে হাদিসটি তালাশ করতে বসেন। একটি একটি করে খেজুর মুখে দিচ্ছেন আর হাদিসটি অনুসন্ধান করছেন। এভাবে সকাল হয়ে যায়, খেজুরও শেষ হয় এবং হাদিসটিও তিনি পেয়ে যান। এই অতিরিক্ত খেজুর ভক্ষণই তাঁর মৃত্যুর বাহ্যিক কারণ।",
      "ঐতিহাসিক মর্যাদা\n\nইমাম মুসলিম (রহঃ)-এর এই অবিস্মরণীয় অবদান তাঁকে হাদিস সংকলক হিসেবে মুসলিম ইতিহাসে দ্বিতীয় সর্বোচ্চ সম্মানিত স্থানে অধিষ্ঠিত করেছে। তাঁর সহীহ মুসলিম আজও সারা বিশ্বের মুসলমানদের কাছে কুরআনের পরে সবচেয়ে বিশুদ্ধ হাদিস গ্রন্থগুলোর একটি হিসেবে সম্মানিত। তাঁর জ্ঞানের প্রতি নিবেদন এবং হাদিসশাস্ত্রে অবদান চিরকাল মুসলিম উম্মাহর জন্য অনুপ্রেরণার উৎস হয়ে থাকবে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_abu_yusuf",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু ইউসুফ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু ইউসুফ (রহঃ)-এর পূর্ণ নাম ইয়াকুব ইবনে ইব্রাহিম ইবনে হাবিব আল-আনসারী আল-কুফী। তিনি ১১২ হিজরিতে (৭৩০ খ্রিস্টাব্দে) কুফায় জন্মগ্রহণ করেন এবং ১৮২ হিজরিতে (৭৯৮ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন। তিনি ছিলেন ইমাম আবু হানিফা (রহঃ)-এর সবচেয়ে বিখ্যাত ছাত্র এবং হানাফি মাযহাবের প্রধান সংকলক।",
      "প্রাথমিক জীবন ও দারিদ্র্য\n\nইমাম আবু ইউসুফ (রহঃ) কুফার এক দরিদ্র পরিবারে জন্মগ্রহণ করেন। তাঁর পিতা ছিলেন একজন সাধারণ কাপড় বিক্রেতা। শৈশবে তিনি পরিবারের আর্থিক সহায়তার জন্য কাজ করতেন এবং একই সাথে জ্ঞান অর্জনের চেষ্টা করতেন।",
      "ইমাম আবু হানিফার সান্নিধ্য\n\nঅল্প বয়সেই তিনি ইমাম আবু হানিফা (রহঃ)-এর মজলিসে যোগ দেন। প্রথমে তাঁর পিতা তাঁকে জ্ঞান অর্জনের পরিবর্তে কাজে মনোনিবেশ করতে বলতেন। কিন্তু ইমাম আবু হানিফা (রহঃ) তাঁর মেধা দেখে মুগ্ধ হন এবং তাঁর পরিবারকে আর্থিক সহায়তা প্রদান করেন যাতে তিনি নির্বিঘ্নে জ্ঞান অর্জন করতে পারেন।",
      "জ্ঞান অর্জনের পরিধি\n\nতিনি ইমাম আবু হানিফা (রহঃ)-এর কাছে প্রায় ১৭ বছর শিক্ষা লাভ করেন এবং হানাফি ফিকহের সকল মূলনীতি আয়ত্ত করেন। এছাড়াও তিনি হাদিসশাস্ত্রে গভীর জ্ঞান অর্জন করেন এবং ইমাম মালিক (রহঃ), সুফিয়ান আল-সাওরী (রহঃ) সহ অনেক মুহাদ্দিসের কাছ থেকে হাদিস শোনেন।",
      "প্রধান বিচারপতির দায়িত্ব\n\nআব্বাসীয় খলিফা হারুন আল-রশিদ তাঁকে সমগ্র ইসলামী খিলাফতের প্রধান বিচারপতি (কাজীউল কুজাত) নিযুক্ত করেন। এই পদে থেকে তিনি ন্যায়বিচার প্রতিষ্ঠায় অসাধারণ ভূমিকা পালন করেন এবং বিচার ব্যবস্থায় অনেক সংস্কার আনেন।",
      "কিতাবুল খারাজ রচনা\n\nইমাম আবু ইউসুফ (রহঃ)-এর সবচেয়ে বিখ্যাত গ্রন্থ হলো 'কিতাবুল খারাজ'। এই গ্রন্থে তিনি ইসলামী রাষ্ট্রের রাজস্ব ব্যবস্থা, ভূমি কর, জিযিয়া এবং অর্থনৈতিক নীতিমালা বিস্তারিতভাবে আলোচনা করেছেন। এটি ইসলামী অর্থনীতির একটি মৌলিক গ্রন্থ হিসেবে বিবেচিত।",
      "হানাফি মাযহাবের সংকলন\n\nইমাম আবু হানিফা (রহঃ) তাঁর জীবদ্দশায় তাঁর মাযহাবের মাসআলাগুলো লিখিত আকারে সংকলন করেননি। ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম মুহাম্মদ (রহঃ) তাঁদের উস্তাদের ফতোয়া ও মাসআলাগুলো সংকলন করে হানাফি ফিকহকে সুসংগঠিত করেন।",
      "ন্যায়বিচার ও সততা\n\nতিনি বিচারকার্যে অত্যন্ত ন্যায়পরায়ণ ছিলেন। একবার খলিফা হারুন আল-রশিদ তাঁর পক্ষে একটি মামলায় রায় দিতে চাপ দেন, কিন্তু ইমাম আবু ইউসুফ (রহঃ) সত্য ও ন্যায়ের পক্ষে দাঁড়ান এবং খলিফার বিপক্ষে রায় প্রদান করেন।",
      "ছাত্র ও শিক্ষাদান\n\nতিনি তাঁর জীবনে হাজারেরও বেশি ছাত্রকে শিক্ষা প্রদান করেন। তাঁর ছাত্রদের মধ্যে অনেকেই পরবর্তীতে বিখ্যাত ফকীহ ও বিচারক হয়েছিলেন। তিনি শিক্ষাদানে অত্যন্ত ধৈর্যশীল এবং বিনয়ী ছিলেন।",
      "ইন্তেকাল ও উত্তরাধিকার\n\nইমাম আবু ইউসুফ (রহঃ) ১৮২ হিজরিতে (৭৯৮ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন। তাঁর জানাযায় বিপুল সংখ্যক মানুষ অংশগ্রহণ করেন। তাঁর মৃত্যুতে খলিফা হারুন আল-রশিদ গভীর শোক প্রকাশ করেন এবং বলেন, 'আজ ইলম ও ন্যায়বিচারের একটি স্তম্ভ হারিয়ে গেল।' তাঁর অবদানের ফলে হানাফি মাযহাব সমগ্র মুসলিম বিশ্বে ছড়িয়ে পড়ে এবং আজও বিশ্বের সংখ্যাগরিষ্ঠ মুসলিম এই মাযহাব অনুসরণ করেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_muhammad_shaybani",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ আল-শাইবানী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম মুহাম্মদ আল-শাইবানী (রহঃ)-এর পূর্ণ নাম মুহাম্মদ ইবনে আল-হাসান ইবনে ফারকাদ আল-শাইবানী। তিনি ১৩২ হিজরিতে (৭৫০ খ্রিস্টাব্দে) ওয়াসিতে জন্মগ্রহণ করেন এবং ১৮৯ হিজরিতে (৮০৫ খ্রিস্টাব্দে) রাইতে ইন্তেকাল করেন। তিনি ইমাম আবু হানিফা (রহঃ)-এর অন্যতম প্রধান ছাত্র এবং হানাফি ফিকহের মূল সংকলক।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি শৈশবে কুফায় চলে আসেন এবং সেখানে ইমাম আবু হানিফা (রহঃ)-এর মজলিসে যোগ দেন। মাত্র ১৪ বছর বয়সে তিনি ইমাম আবু হানিফার ছাত্র হন এবং তাঁর কাছে প্রায় ৪ বছর শিক্ষা লাভ করেন। ইমাম আবু হানিফার ইন্তেকালের পর তিনি ইমাম আবু ইউসুফ (রহঃ)-এর কাছে দীর্ঘ সময় শিক্ষা গ্রহণ করেন।",
      "বিস্তৃত জ্ঞান অর্জন\n\nতিনি শুধু হানাফি ফিকহেই সীমাবদ্ধ থাকেননি। তিনি ইমাম মালিক (রহঃ)-এর কাছে মদীনায় গিয়ে তিন বছর হাদিস ও মালিকি ফিকহ শিক্ষা করেন। এছাড়াও তিনি সুফিয়ান আল-সাওরী (রহঃ) এবং আওযায়ী (রহঃ)-এর কাছ থেকেও জ্ঞান অর্জন করেন।",
      "হানাফি ফিকহের সংকলন\n\nইমাম মুহাম্মদ (রহঃ) হানাফি মাযহাবের প্রায় সকল মৌলিক গ্রন্থ রচনা করেছেন। তাঁর রচিত গ্রন্থগুলোকে 'কুতুবে যাহিরুর রিওয়ায়া' (প্রকাশ্য বর্ণনার গ্রন্থসমূহ) বলা হয়। এর মধ্যে রয়েছে আল-মাবসূত, আল-জামি আল-কাবীর, আল-জামি আল-সাগীর, আল-সিয়ার আল-কাবীর এবং আল-যিয়াদাত।",
      "আন্তর্জাতিক আইনের পথপ্রদর্শক\n\nতাঁর রচিত 'আল-সিয়ার আল-কবীর' গ্রন্থটি ইসলামী আন্তর্জাতিক আইনের প্রথম পূর্ণাঙ্গ গ্রন্থ। এতে যুদ্ধ, সন্ধি, কূটনীতি এবং আন্তর্জাতিক সম্পর্ক সংক্রান্ত বিধান বিস্তারিতভাবে আলোচিত হয়েছে।",
      "শিক্ষকতা ও ছাত্রবৃন্দ\n\nতিনি বাগদাদে একটি বিশাল শিক্ষা প্রতিষ্ঠান পরিচালনা করতেন। তাঁর ছাত্রদের মধ্যে ইমাম শাফেয়ী (রহঃ) অন্যতম। ইমাম শাফেয়ী তাঁর কাছ থেকে হানাফি ফিকহ ও কিয়াসের পদ্ধতি শিখেছিলেন।",
      "বিচারক হিসেবে দায়িত্ব\n\nখলিফা হারুন আল-রশিদ তাঁকে রাক্কার বিচারক নিযুক্ত করেন। তিনি সেখানে ন্যায়বিচার প্রতিষ্ঠায় গুরুত্বপূর্ণ ভূমিকা পালন করেন।",
      "ইন্তেকাল\n\nইমাম মুহাম্মদ (রহঃ) ১৮৯ হিজরিতে (৮০৫ খ্রিস্টাব্দে) খলিফা হারুন আল-রশিদের সাথে রাই নামক স্থানে ভ্রমণকালে ইন্তেকাল করেন। তাঁর মৃত্যুতে খলিফা গভীর শোক প্রকাশ করেন। তাঁর রচিত গ্রন্থগুলো আজও হানাফি ফিকহের মূল ভিত্তি এবং ইসলামী আইনশাস্ত্রের অমূল্য সম্পদ।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_abu_dawud_al_tayalisi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু দাউদ আল-তায়ালিসী (রহঃ)",
    "paragraphs": [
      "ইমাম আবু দাউদ আল-তায়ালিসী (রহঃ)-এর পূর্ণ নাম হলো সুলাইমান ইবনে দাউদ ইবনে আল-জারুদ আল-তায়ালিসী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাদিসের ক্ষেত্রে 'মুসনাদ' সংকলনের পথিকৃৎ।",
      "তাঁর উপনাম ছিল আবু দাউদ। তাঁকে 'আল-তায়ালিসী' বলা হতো, কারণ তিনি তাইলাস (এক ধরনের পোশাক) পরিধান করতেন।",
      "তিনি ছিলেন হাদিস ও রিজাল শাস্ত্রের একজন গভীর পণ্ডিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১৩৩ হিজরিতে (৭৫১ খ্রিস্টাব্দে) ইরাকের বসরা শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই হাদিসের প্রতি আগ্রহী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবে হাদিস ও ফিকহের জ্ঞান লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর, বিশেষ করে হাদিস বর্ণনার ক্ষেত্রে।",
      "শিক্ষকমণ্ডলী\n\nতিনি বহু তাবেয়ীনের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর শিক্ষকদের মধ্যে অন্যতম ছিলেন ইমাম শু'বাহ ইবনে আল-হাজ্জাজ, হিফশ ইবনে সুলাইমান এবং আব্দুল্লাহ ইবনে মুবারক।",
      "প্রধান গ্রন্থ: মুসনাদ আবি দাউদ আল-তায়ালিসী\n\nতাঁর প্রধান গ্রন্থ হলো 'মুসনাদ আবি দাউদ আল-তায়ালিসী'। এটি হাদিস সংকলনের ক্ষেত্রে একটি মৌলিক গ্রন্থ।",
      "গ্রন্থের বিশেষত্ব\n\n'মুসনাদ' পদ্ধতির গ্রন্থগুলো সাহাবীর নাম অনুসারে সাজানো হয়। এই গ্রন্থটি মুসনাদ ধারার অন্যতম প্রাচীন এবং গুরুত্বপূর্ণ সংকলন।",
      "হাদিস সংকলনে অবদান\n\nতাঁর গ্রন্থটি পরবর্তী মুহাদ্দিস, যেমন ইমাম আহমাদ ইবনে হাম্বল (রহঃ)-কে তাঁদের নিজস্ব 'মুসনাদ' সংকলনে অনুপ্রাণিত করেছিল।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের বেশিরভাগ সময় শিক্ষাদান, হাদিস বর্ণনা এবং গ্রন্থ রচনায় ব্যয় করেন।",
      "তিনি বসরা এবং বাগদাদে অধ্যাপনা করেন।",
      "মৃত্যু\n\nতিনি ২০৪ হিজরিতে (৮১৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আবু দাউদ আল-তায়ালিসী (রহঃ)-এর জীবন হাদিস সংকলনের 'মুসনাদ' ধারার একজন অন্যতম পথিকৃৎ হিসেবে স্মরণীয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_ishaq_ibn_rahwayh",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ)",
    "paragraphs": [
      "ইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ)-এর পূর্ণ নাম হলো আবু ইয়াকুব ইসহাক ইবনে ইব্রাহিম ইবনে মাখলাদ আল-তামিমী আল-মারওয়াযী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ হাফিয, মুহাদ্দিস এবং ফকীহ।",
      "তাঁর উপনাম ছিল আবু ইয়াকুব। তাঁকে 'ইমামুল মুহাদ্দিসীন' (মুহাদ্দিসদের ইমাম) এবং 'ইমামে খুরাসান' উপাধিতে ভূষিত করা হয়।",
      "তাঁর মা তাঁকে প্রসবের সময় পথে ছিলেন, তাই তাঁর পিতাকে 'ইবনে রাহাওয়াইহ' (পথের সন্তান) বলে ডাকা হতো, যা তাঁর নামে যুক্ত হয়।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১৬১ হিজরিতে (৭৭৮ খ্রিস্টাব্দে) মার্ভ (খোরাসান, বর্তমানে তুর্কমেনিস্তান) শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবেই হাদিস ও ফিকহের প্রাথমিক জ্ঞান লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের প্রায় সকল বড় আলেমের কাছ থেকে শিক্ষা গ্রহণ করেন। তিনি ইমাম সুফিয়ান ইবনে উয়াইনাহ, ইমাম ফুযাইল ইবনে ইয়ায আল-তামিমী, এবং ইমাম আব্দুল্লাহ ইবনে আল-মুবারক সহ বহু আলেমের ছাত্র ছিলেন।",
      "ইমাম আহমাদ ইবনে হাম্বল (রহঃ)-এর সাথে তাঁর ঘনিষ্ঠ সম্পর্ক ছিল।",
      "প্রধান অবদান\n\nতাঁর প্রধান অবদান হলো হাদিসশাস্ত্রের ক্ষেত্রে তাঁর বিশাল জ্ঞান। তিনি হাদিসের হাফিয হিসেবে সুপরিচিত ছিলেন।",
      "তিনি ইমাম বুখারী (রহঃ)-এর শিক্ষক ছিলেন এবং সহীহ বুখারী সংকলনের জন্য তাঁকে অনুপ্রাণিত করেন।",
      "তাঁর ফিকহী মাযহাব\n\nতিনি কোনো একক মাযহাবের অনুসরণ না করে ইজতিহাদ করতেন এবং তাঁর নিজস্ব ফিকহী সিদ্ধান্ত ছিল।",
      "হাদিস ও ফিকহের সমন্বয়\n\nতিনি হাদিস ও ফিকহের মধ্যে সমন্বয় সাধনে বিশ্বাসী ছিলেন এবং শুধুমাত্র হাদিস নির্ভর ফিকহের ওপর জোর দেন।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের বেশিরভাগ সময় শিক্ষাদান, গ্রন্থ রচনা এবং হাদিস বর্ণনায় ব্যয় করেন।",
      "তিনি খোরাসান ও নিশাপুরে অধ্যাপনা করেন।",
      "মৃত্যু\n\nতিনি ২৩৮ হিজরিতে (৮৫৩ খ্রিস্টাব্দে) নিশাপুরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ)-এর জীবন হাদিস, ফিকহ এবং শ্রেষ্ঠ মুহাদ্দিসদের অনুপ্রেরণা দেওয়ার ক্ষেত্রে এক উজ্জ্বল দৃষ্টান্ত।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_ibn_majah",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে মাজাহ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম ইবনে মাজাহ (রহঃ)-এর পূর্ণ নাম আবু আবদিল্লাহ মুহাম্মাদ ইবনে ইয়াজিদ ইবনে মাজাহ আর-রাবঈ আল-কাযভীনী। তিনি ২০৯ হিজরিতে (৮২৪ খ্রিস্টাব্দে) ইরাকের প্রসিদ্ধ শহর কাযভীনে জন্মগ্রহণ করেন এবং ২৭৩ হিজরিতে (৮৮৭ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি সিহাহ সিত্তাহর সর্বশেষ গ্রন্থ 'সুনান ইবনে মাজাহ'-এর সংকলক। তাঁর উপাধি ছিল 'আল-হাফিযুল কাবীর' (মহান হাফিয) এবং 'আল-মুফাসসির' (তাফসীরকার)।",
      "নাম ও পরিচিতি\n\nইমাম ইবনু মাজাহ-এর প্রকৃত নাম মুহাম্মাদ, পিতার নাম ইয়াযীদ, উপনাম আবু আব্দুল্লাহ। তাঁর পুরো বংশপরিক্রমা হলো 'আল-হাফিযুল কাবীর আল-মুফাসসির আবু আব্দুল্লাহ মুহাম্মাদ ইবনে ইয়াযীদ ইবনে আব্দুল্লাহ ইবনে মাজাহ আর-রাবঈ আল-কাযভীনী'। ইবনু মাজাহ-এর 'মাজাহ' নামটি কার উপাধি, এ ব্যাপারে ঐতিহাসিকদের মধ্যে মতবিরোধ রয়েছে। কেউ কেউ বলেন, মাজাহ তাঁর পিতার উপাধি, আবার কেউ বলেন, তাঁর দাদার উপাধি।",
      "জন্মস্থান\n\nমুসলিম জাহানের তৃতীয় খলীফা ওসমান বিন আফফান (রাঃ)-এর খেলাফতকালে কাযভীন শহরটি বিজিত হয়। এ শহরের প্রথম গভর্নর বা প্রশাসক ছিলেন বিশিষ্ট সাহাবী বারা ইবনু আযেব (রাঃ)। এই ঐতিহাসিক শহরেই ইমাম ইবনে মাজাহ জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা\n\nইমাম ইবনু মাজাহ নিজ দেশেই প্রাথমিক শিক্ষা সমাপন করেন। এরপর তিনি কুরআনুল কারীম হিফয সম্পন্ন করেন। অতঃপর উচ্চশিক্ষা অর্জন এবং হাদিস সংগ্রহের জন্য তৎকালীন মুসলিম বিশ্বের প্রায় প্রতিটি দেশ ও জনপদের যুগশ্রেষ্ঠ মুহাদ্দিসদের দ্বারস্থ হয়েছেন।",
      "হাদিস সংগ্রহের সফর\n\nইমাম ইবনু মাজাহ ২৩০ হিজরি মোতাবেক ৮৪৪ খ্রিস্টাব্দে ২২ বছর বয়সে হাদিস সংগ্রহের উদ্দেশ্যে বিভিন্ন শহরের মুহাদ্দিসগণের নিকটে গমন করেন। তিনি হাদিস লিপিবদ্ধকরণ এবং শিক্ষার্জনের জন্য রায়, বসরা, কুফা, বাগদাদ, সিরিয়া, মিশর, হিজাজ, মক্কা প্রভৃতি দেশ ও জনপদে ভ্রমণ করেন এবং বহু মনীষীর নিকট থেকে হাদিস সংগ্রহ করেন। তিনি ১৫ বছরের অধিক সময় ইলম চর্চায় নিমগ্ন থাকেন।",
      "শিক্ষকমণ্ডলী\n\nইবনু মাজাহ দেশ-বিদেশের অনেক মনীষীর নিকট শিক্ষাগ্রহণ ও হাদিস সংগ্রহ করেছেন। তাঁর অসংখ্য উস্তাদের মধ্যে উল্লেখযোগ্য হলেন হাফেয আলী ইবনু মুহাম্মাদ আত-তানাফিসী, জুরারাহ ইবনুল মুগাল্লিস, মুসয়াব ইবনু আব্দুল্লাহ আয-যুবাইরী, সুয়াইদ ইবনে সাঈদ, আব্দুল্লাহ ইবনু মু'আবিয়া আল-জুমাহী, মুহাম্মাদ ইবনু রুমহ, ইবরাহীম ইবনুল মুনযির আল-হিফমী, মুহাম্মাদ ইবনু আব্দুল্লাহ ইবনে নুমাইর, আবু বকর ইবনু আবু শায়বা এবং আরো অনেকে।",
      "প্রিয় উস্তাদ\n\nবহু মুহাদ্দিসের নিকট থেকে হাদিস শিক্ষাগ্রহণ ও সংগ্রহ করলেও ইমাম ইবনু মাজাহ তাঁর সবচেয়ে প্রিয়তম উস্তাদ আবু বকর ইবনু আবু শায়বার নিকট থেকে সবচেয়ে বেশি উপকৃত হয়েছেন। তিনি তাঁর কাছ থেকে হাদিসের গভীর জ্ঞান অর্জন করেন।",
      "সুনান ইবনে মাজাহ\n\nইমাম ইবনে মাজাহ (রহঃ)-এর প্রধান গ্রন্থ 'সুনান ইবনে মাজাহ' সিহাহ সিত্তাহর ছয়টি গ্রন্থের মধ্যে সর্বশেষ। এই গ্রন্থে প্রায় ৪,০০০ হাদিস সংকলিত হয়েছে। গ্রন্থটিতে এমন কিছু হাদিস রয়েছে যা অন্য পাঁচটি গ্রন্থে নেই। এই কারণে এটি হাদিস গবেষকদের জন্য অত্যন্ত মূল্যবান।",
      "গ্রন্থের বৈশিষ্ট্য\n\nসুনান ইবনে মাজাহতে এমন অনেক হাদিস রয়েছে যা অন্য পাঁচটি সহিহ গ্রন্থে পাওয়া যায় না। তবে কিছু মুহাদ্দিসের মতে এতে কিছু দুর্বল হাদিসও রয়েছে। তবুও এটি সিহাহ সিত্তাহর অন্তর্ভুক্ত এবং হাদিস শাস্ত্রে এর গুরুত্ব অপরিসীম।",
      "অন্যান্য রচনাবলী\n\nআল-দাহাবীর মতানুসারে ইবনে মাজাহ-এর প্রধান রচনাগুলো হলো সুনান-এ-ইবনে মাজাহ (প্রধান ছয়টি হাদীস গ্রন্থের একটি), কিতাব আত-তাফসীর (আল-কুরআন-এর তাফসীর) এবং কিতাব আত-তারিক (ইতিহাস গ্রন্থ, মূলত হাদিসের বর্ণনাকারীদের তালিকা)। তবে সুনান ছাড়া অন্য দুটি গ্রন্থ বর্তমানে পাওয়া যায় না।",
      "ছাত্রবৃন্দ\n\nইমাম ইবনু মাজাহ-এর অসংখ্য ছাত্রের মধ্যে উল্লেখযোগ্য হলেন ইবরাহীম ইবনু দীনার আল-হাওশাবী, আহমাদ ইবনু ইবরাহীম আল-কাযভীনী (তিনি হাফেয আবু ইয়া'লা আল-খলীলীর দাদা), আবুত তাইয়্যেব আহমাদ ইবনু রাওহিন আল-বাগদাদী আশ-শা'রানী, আবু আমর আহমাদ ইবনু মুহাম্মাদ ইবনে হাকীম আল-মাদীনী আল-ইস্পাহানী এবং আরো অনেকে।",
      "মৃত্যু\n\nইবনু মাজাহ-এর মৃত্যু তারিখ সম্পর্কে মতভেদ রয়েছে। ইবনু কাসীর ও জামালুদ্দীন ইউসুফ আল-মিযযী বলেন, ইবনু মাজাহ ২৭৩ হিজরী ২২ রামাযান মোতাবেক ২০ নভেম্বর ৮৮৬ খ্রিস্টাব্দে সোমবার মৃত্যুবরণ করেন। পরের দিন মঙ্গলবার তাঁকে দাফন করা হয়। মৃত্যুকালে তাঁর বয়স হয়েছিল ৬৪ বছর।",
      "জানাযা ও দাফন\n\nতাঁকে গোসল করান মুহাম্মাদ ইবনে আলী কেহেরমান এবং ইবরাহীম ইবনে দীনার। জানাযায় ইমামতি করেন স্বীয় ভাই আবু বকর এবং কবরে লাশ নামান তাঁর ভাই আবু বকর ও আবু আব্দুল্লাহ এবং স্বীয় পুত্র আব্দুল্লাহ ইবনে মুহাম্মাদ ইবনে ইয়াযীদ। তাঁর সংকলিত সুনান ইবনে মাজাহ আজও সারা বিশ্বের মুসলমানদের কাছে হাদিসের অন্যতম প্রধান গ্রন্থ হিসেবে সম্মানিত।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_abu_dawud",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু দাউদ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু দাউদ (রহঃ)-এর পূর্ণ নাম আবু দাউদ সুলাইমান ইবনে আল-আশআস ইবনে ইসহাক আল-আজদি আস-সিজিস্তানি। তিনি ২০২ হিজরিতে (৮১৭ খ্রিস্টাব্দে) বর্তমান আফগানিস্তানের সিজিস্তান অঞ্চলে জন্মগ্রহণ করেন এবং ২৭৫ হিজরিতে (৮৮৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। তিনি সিহাহ সিত্তাহ (ছয়টি বিশুদ্ধ হাদিস গ্রন্থ)-এর অন্যতম 'সুনান আবু দাউদ'-এর সংকলক।",
      "জন্ম ও বংশ পরিচয়\n\nইমাম আবু দাউদ (রহঃ) ২০২ হিজরিতে সিজিস্তানে জন্মগ্রহণ করেন। তাঁর ঊর্ধ্বতম পুরুষ ইমরান, যিনি হযরত আলী (রাঃ)-এর সঙ্গী হয়ে সীফফিনের যুদ্ধে শহীদ হয়েছিলেন। তখন আব্বাসীয় খলিফা মামুন ছিলেন রাষ্ট্রক্ষমতায়। ২০২ হিজরি সাল, যাকে ইসলামী জ্ঞান-বিজ্ঞানের সোনালি যুগ বলা হয়।",
      "প্রাথমিক শিক্ষা\n\nতাঁর প্রাথমিক শিক্ষা সম্পর্কে তেমন জানা যায় না। সম্ভবত তিনি নিজ গ্রামেই প্রাথমিক শিক্ষা লাভ করেন। তাঁর বয়স যখন দশ বছর তখন তিনি নিশাপুরের একটি মাদরাসায় ভর্তি হন এবং সেখানেই তিনি প্রখ্যাত মুহাদ্দিস ইবনু আসলামের নিকট হাদিসশাস্ত্র অধ্যয়ন করেন।",
      "বিস্তৃত সফর ও জ্ঞান অর্জন\n\nহাদিসে উচ্চ শিক্ষা লাভের জন্য ইমাম আবু দাউদ (রহঃ) মিশর, সিরিয়া, হিজাজ, ইরাক, বৃহত্তর খোরাসান প্রভৃতি বিখ্যাত হাদিস গবেষণা কেন্দ্রসমূহে ভ্রমণ করেন এবং তদানীন্তন সুবিখ্যাত মুহাদ্দিসগণের নিকট হাদিস শ্রবণ ও সংগ্রহ করেন। তিনি প্রায় ৫ লক্ষ হাদিস সংগ্রহ করেছিলেন।",
      "চরিত্র ও ব্যক্তিত্ব\n\nইমাম আবু দাউদ (রহঃ) ছিলেন ইবাদাতগুযার, পরহেজগার, যাহিদ ও ন্যায়পরায়ণ লোক। দুনিয়ার ভোগ বিলাসের প্রতি তাঁর কোন মোহ ছিল না। ইমাম ইবনু দাসাহ উল্লেখ করেন যে, ইমাম আবু দাউদের জামার একটি হাতা প্রশস্ত ও একটি হাতা সংকীর্ণ ছিল। এর কারণ জিজ্ঞাসা করা হলে তিনি বলেন, 'যে হাতাটি প্রশস্ত তার মধ্যে আমি লিখিত হাদিসগুলো রেখে দেই এবং যে সংকীর্ণ হাতার মধ্যে এ জাতীয় কিছুই নেই।'",
      "সুনান আবু দাউদ সংকলন\n\nইমাম আবু দাউদ (রহঃ)-এর সবচেয়ে বড় অবদান হলো তাঁর সংকলিত 'সুনান আবু দাউদ'। এই গ্রন্থে তিনি প্রায় ৫ লক্ষ হাদিসের মধ্য থেকে ৪,৮০০ হাদিস সংকলন করেছেন। তিনি বলেছেন যে, তিনি যেগুলোকে জয়িফ (দুর্বল) বলে উল্লেখ করেননি সেগুলো ছাড়া বাকি হাদিসগুলো সহিহ। তবে ইবনে হাজার আসকালানির মতানুযায়ী জয়িফ উল্লেখ করা হয়নি এমন হাদিসের মধ্যেও কিছু জয়িফ হাদিস রয়েছে।",
      "গ্রন্থের বৈশিষ্ট্য\n\nসুনান আবু দাউদের বিশেষত্ব হলো এটি মূলত ফিকহী বিষয়ক হাদিসের সংকলন। ইমাম আবু দাউদ (রহঃ) এতে বিশেষভাবে ফিকহ ও আহকাম সংক্রান্ত হাদিসগুলো সংকলন করেছেন। এই কারণে ফকীহগণ এই গ্রন্থকে অত্যন্ত গুরুত্বপূর্ণ মনে করেন।",
      "অন্যান্য রচনাবলী\n\nসুনান আবু দাউদ ছাড়াও তিনি আরো ২১টি বই লিখেছেন। এগুলোর মধ্যে রয়েছে কিতাব আল-মারাসিল (৬০০ মুরসাল হাদিস), রিসালাত আবি দাউদ ইলা আহলি মাক্কাহ (মক্কার বাসিন্দাদের প্রতি চিঠি), ইবতিদাউল ওয়াহী, আখবারুল খাওয়ারিজ, আ'লামুন নাবুয়্যাহ, আদ-দু'আ, আয-যুহদ এবং আরো অনেক।",
      "শিক্ষকবৃন্দ\n\nইমাম আবু দাউদ (রহঃ) তাঁর যুগের প্রায় সকল বড় মুহাদ্দিসের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে রয়েছেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ), আলী ইবনুল মাদীনী (রহঃ), কুতাইবা ইবনে সাঈদ (রহঃ), মুসাদ্দাদ ইবনে মুসারহাদ (রহঃ) এবং আরো অনেকে।",
      "হাদিস সংকলনের পদ্ধতি\n\nইমাম আবু দাউদ (রহঃ) হাদিস সংকলনে অত্যন্ত সতর্ক ছিলেন। তিনি প্রথমে ফিকহী বিষয়গুলো নির্ধারণ করতেন, তারপর সেই বিষয়ে সহিহ হাদিস খুঁজতেন। তিনি দুর্বল হাদিস এড়িয়ে চলতেন এবং শুধুমাত্র বিশ্বস্ত বর্ণনাকারীদের হাদিস গ্রহণ করতেন।",
      "গ্রন্থ সংকলনের উদ্দেশ্য\n\nইমাম আবু দাউদ (রহঃ) তাঁর পুত্রকে লিখিত একটি চিঠিতে বলেছেন যে, তিনি সুনান গ্রন্থে শুধুমাত্র আহকাম (শরীয়তের বিধান) সংক্রান্ত হাদিস সংকলন করেছেন। তিনি ফাযায়েল (মর্যাদা), তারগীব (উৎসাহ প্রদান) এবং তারহীব (ভয় প্রদর্শন) সংক্রান্ত হাদিস এতে অন্তর্ভুক্ত করেননি।",
      "হাদিসের মান নির্ধারণ\n\nইমাম আবু দাউদ (রহঃ) বলেছেন, 'আমি আমার কিতাবে যে হাদিসকে অত্যন্ত দুর্বল বলে উল্লেখ করেছি, তা ছাড়া বাকি সব হাদিস হাসান (গ্রহণযোগ্য) পর্যায়ের।' তবে পরবর্তী মুহাদ্দিসগণ তাঁর গ্রন্থের কিছু হাদিসকে দুর্বল বলে চিহ্নিত করেছেন।",
      "আলেমদের প্রশংসা\n\nইমাম আবু দাউদ (রহঃ) সম্পর্কে ইমাম নাসাঈ (রহঃ) বলেছেন, 'আবু দাউদ তাঁর যুগের ইমাম ছিলেন।' ইমাম ইবনুল আরাবী বলেছেন, 'ফকীহদের জন্য সুনান আবু দাউদই যথেষ্ট।' ইমাম নববী (রহঃ) বলেছেন, 'সুনান আবু দাউদ ফিকহের ছাত্রদের জন্য অপরিহার্য।'",
      "বসরায় বসবাস\n\nজীবনের শেষ দিকে ইমাম আবু দাউদ (রহঃ) বসরায় স্থায়ীভাবে বসবাস করেন। সেখানে তিনি হাদিস শিক্ষাদান করতেন এবং ফতোয়া প্রদান করতেন। তাঁর মজলিসে দূর-দূরান্ত থেকে ছাত্ররা আসতেন।",
      "জ্ঞান ও তাকওয়া\n\nইমাম আবু দাউদ (রহঃ) শুধু হাদিসশাস্ত্রেই পারদর্শী ছিলেন না, বরং ফিকহ, উসূলে ফিকহ এবং আরবি ভাষায়ও গভীর জ্ঞান রাখতেন। তিনি অত্যন্ত মুত্তাকী এবং আল্লাহভীরু ছিলেন। দুনিয়ার প্রতি তাঁর কোনো আসক্তি ছিল না।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে রয়েছেন ইমাম তিরমিযী (রহঃ), ইমাম নাসাঈ (রহঃ), আবু আওয়ানা (রহঃ), আবু বকর ইবনে দাসাহ (রহঃ) এবং আরো অনেকে। তাঁর ছাত্ররা তাঁর সুনান গ্রন্থটি বিশ্বব্যাপী প্রচার করেন।",
      "মাযহাব\n\nইমাম আবু দাউদ (রহঃ) ফিকহী মাযহাবের ক্ষেত্রে হাম্বলী মাযহাবের অনুসারী ছিলেন। তবে তিনি হাদিসের ভিত্তিতে ফতোয়া প্রদান করতেন এবং কোনো মাযহাবের অন্ধ অনুসরণ করতেন না।",
      "মৃত্যুকাল\n\nইমাম আবু দাউদ (রহঃ) ২৭৫ হিজরির ১৬ শাওয়াল শুক্রবার (৮৮৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। মৃত্যুকালে তাঁর বয়স হয়েছিল ৭৩ বছর। তাঁর জানাযায় বসরার হাজার হাজার মানুষ অংশগ্রহণ করেন।",
      "ঐতিহাসিক অবদান\n\nইমাম আবু দাউদ (রহঃ)-এর সুনান হাদিসশাস্ত্রে একটি মাইলফলক। এটি ফকীহদের জন্য সবচেয়ে উপকারী হাদিস গ্রন্থগুলোর একটি। তাঁর সংকলিত সুনান আবু দাউদ আজও সারা বিশ্বের মুসলমানদের কাছে হাদিসের অন্যতম প্রধান গ্রন্থ হিসেবে সম্মানিত এবং ইসলামী আইনশাস্ত্রের মূল ভিত্তি।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_tirmidhi",
    "categoryId": "imam_jibon",
    "title": "ইমাম তিরমিযী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম তিরমিযী (রহঃ)-এর পূর্ণ নাম আবু ঈসা মুহাম্মদ ইবনে ঈসা ইবনে সাওরাহ আস-সুলামি আদ-দারির আল-বুগি আত-তিরমিজি। তিনি ২০৯ হিজরিতে (৮২৪ খ্রিস্টাব্দে) উজবেকিস্তানের তিরমিজ শহরের বুগ গ্রামে জন্মগ্রহণ করেন এবং ২৭৯ হিজরিতে (৮৯২ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি সিহাহ সিত্তাহর অন্যতম 'জামি আত-তিরমিজি' বা 'সুনান আত-তিরমিজি'-এর সংকলক। তাঁকে 'আদ-দাহহাক' (অন্ধ) লকব দিয়েও ডাকা হতো।",
      "জন্ম ও বংশ পরিচয়\n\nইমাম তিরমিযী আব্বাসীয় খলিফা আল-মামুনের শাসনামলে জন্মগ্রহণ করেন। তাঁর পরিবার আরব গোত্র বনু সুলাইমের অন্তর্ভুক্ত ছিল। তাঁর দাদা মার্ভের লোক ছিলেন এবং তিরমিজে বসতি স্থাপন করেন। তিনি বিশেষত তিরমিজের উপশহর বুগ গ্রামে জন্মগ্রহণ করেন, এ কারণে তাঁর নিসবাত হিসেবে 'আত-তিরমিজি' ও 'আল-বুগি' এসেছে।",
      "হাদিস অধ্যয়ন শুরু\n\nইমাম তিরমিযী (রহঃ) ২০ বছর বয়সে হাদিস অধ্যয়ন শুরু করেন। ২৩৫ হিজরি থেকে শুরু করে হাদিস সংগ্রহের জন্য তিনি খোরাসান, ইরাক ও হেজাজ সফর করেছেন। তৎকালীন সময়ে তাঁর জন্মস্থান খোরাসান জ্ঞানচর্চার কেন্দ্র ছিল এবং এখানে ব্যাপক সংখ্যক মুহাদ্দিসের আবাস ছিল।",
      "ইরাকে সফর\n\nইমাম তিরমিযীর সফর করা অন্যান্য জ্ঞানচর্চার কেন্দ্রগুলোর মধ্যে রয়েছে ইরাকি শহর কুফা ও বসরা। তিনি ৪২ জন কুফি শিক্ষকের কাছ থেকে হাদিস বর্ণনা করেছেন। তাঁর জামি গ্রন্থে তিনি অন্যান্য যেকোন শহরের শিক্ষকদের চেয়ে কুফার শিক্ষকদের বর্ণনা বেশি ব্যবহার করেছেন।",
      "ইমাম বুখারীর সান্নিধ্য\n\nইমাম তিরমিযী ইমাম বুখারীর ছাত্র ছিলেন। বুখারীও খোরাসানের বাসিন্দা ছিলেন। ইমাম যাহাবি লিখেছেন, 'তাঁর হাদিসের জ্ঞান আল-বুখারীর কাছ থেকে এসেছে।' তিনি তাঁর জামি গ্রন্থে ইমাম বুখারীর নাম মোট ১১৪ বার উল্লেখ করেছেন। হাদিসের বর্ণনায় বিবরণ বা বর্ণনাকারীদের তারতম্যের উল্লেখের সময় তিনি ইমাম বুখারীর 'কিতাব আত-তারিখ'কে সূত্র হিসেবে ব্যবহার করেছেন।",
      "ইমাম বুখারীর প্রশংসা\n\nইমাম তিরমিযী ইমাম বুখারীকে ইরাক বা খোরাসানে হাদিসের ক্ষেত্রে সবচেয়ে জ্ঞানী ব্যক্তি বলে প্রশংসা করেছেন। ইমাম বুখারীও তিরমিযীকে উচ্চ মর্যাদা দিতেন। বলা হয় যে তিনি তিরমিযীকে বলেছিলেন, 'আপনি আমার কাছ থেকে যতটা না উপকৃত হয়েছেন তার চেয়ে আমি আপনার কাছ থেকে বেশি উপকৃত হয়েছি।' ইমাম বুখারী তাঁর প্রণীত সহিহ বুখারীতে তিরমিযীর বর্ণিত দুইটি হাদিস লিপিবদ্ধ করেছেন।",
      "অন্যান্য শিক্ষকবৃন্দ\n\nইমাম তিরমিযী এছাড়াও ইমাম আবু দাউদ ও ইমাম মুসলিমের কাছ থেকে হাদিস বর্ণনা করেছেন। ইমাম মুসলিমও তাঁর সহিহ মুসলিম গ্রন্থে তিরমিযীর বর্ণিত হাদিস লিপিবদ্ধ করেছেন। তাঁর অন্যান্য শিক্ষকদের মধ্যে রয়েছেন কুতাইবা ইবনে সাঈদ (রহঃ), ইসহাক ইবনে মুসা (রহঃ), আবু রাজা উতাইবা ইবনে সাইদ (রহঃ), আলি ইবনে হুজর (রহঃ) এবং আরো অনেকে।",
      "জামি আত-তিরমিজি সংকলন\n\nইমাম তিরমিযী (রহঃ)-এর সবচেয়ে বড় অবদান হলো 'জামি আত-তিরমিজি' বা 'সুনান আত-তিরমিজি'। এই গ্রন্থের পূর্ণ নাম 'আল-জামি আল মুখতাসার মিন আস-সুনান আন-রাসুলিল্লাহ'। এই গ্রন্থে তিনি হাদিসের শব্দ, অর্থ, সনদ এবং ফিকহগত তাৎপর্য বিশ্লেষণ করেছেন।",
      "গ্রন্থের বৈশিষ্ট্য\n\nজামি আত-তিরমিজির বিশেষত্ব হলো প্রতিটি হাদিসের পরে তিনি হাদিসের মান (সহিহ, হাসান, দুর্বল) উল্লেখ করেছেন এবং ফিকহী মতামত ও বিভিন্ন মাযহাবের অবস্থান ব্যাখ্যা করেছেন। তাঁর কাছে ইমাম আবু হানিফার ফতোয়া উল্লেখের জন্য নির্ভরযোগ্য সূত্র ছিল না বিধায় ফকিহদের অভিমত বর্ণনার সময় তিনি আবু হানিফার নাম উল্লেখ করেননি। এর পরিবর্তে তিনি 'কুফার কিছু ব্যক্তি' বলে উল্লেখ করতেন।",
      "আশ-শামাইল আন-নাবাউয়িয়াহ\n\nজামি আত-তিরমিজি ছাড়াও তিনি 'আশ-শামাইল আন-নাবাউয়িয়াহ ওয়া আল-ফাদাইল আল-মুসতাফাউয়িয়াহ' রচনা করেছেন। এটি রাসূলুল্লাহ (সাঃ)-এর ব্যক্তি ও চরিত্র সম্পর্কে হাদিসের একটি সংগ্রহ। ইসলামি পণ্ডিতদের কাছে এটি হাদিস অধ্যয়নের জন্য একটি গুরুত্বপূর্ণ সম্পদ হিসেবে বিবেচিত হয়।",
      "অন্যান্য রচনাবলী\n\nতাঁর অন্যান্য রচনাবলীর মধ্যে রয়েছে 'আল-ইলাল আস-সুগরা' (হাদিসের ত্রুটি সম্পর্কে ছোট গ্রন্থ), 'আল-ইলাল আল-কুবরা' (হাদিসের ত্রুটি সম্পর্কে বড় গ্রন্থ), 'আজ-জুহদ' (যুহদ সম্পর্কে), 'আল-আসমা ওয়া আল-কুনা' (নাম ও উপনাম), 'কিতাব আত-তারিখ' (ইতিহাস গ্রন্থ) এবং আরো অনেক।",
      "মাযহাব\n\nইমাম তিরমিযী ইমাম বুখারীর খুব ঘনিষ্ঠ ছিলেন। তিনি শাফিয়ি বা হাম্বলি মাযহাবের অনুসারী ছিলেন। এমন হতে পারে যে তিনি নিজে একজন মুজতাহিদ ছিলেন অথবা ইমাম বুখারীর খুব ঘনিষ্ঠ হওয়ায় কিছু অভিমত অনুযায়ী তিনি তাঁর মাযহাব অনুসরণ করতেন।",
      "অন্ধত্ব\n\nইমাম যাহাবির মতানুযায়ী ইমাম তিরমিযী (রহঃ) তাঁর জীবনের শেষ দুই বছর অন্ধ অবস্থায় কাটান। বলা হয় যে আল্লাহর ভয়ে অথবা ইমাম বুখারীর মৃত্যুর কারণে অতিরিক্ত কান্নার জন্য তিনি দৃষ্টিহীন হয়েছিলেন। এ কারণে তাঁকে 'আদ-দাহহাক' (অন্ধ) লকব দেওয়া হয়েছিল।",
      "ইন্তেকাল\n\nইমাম তিরমিযী ২৭৯ হিজরির ১৩ রজব সোমবার রাতে (৮ অক্টোবর ৮৯২ খ্রিস্টাব্দ, রোববার রাত) বুগে ইন্তেকাল করেন। তাঁকে বর্তমান উজবেকিস্তানের তিরমিজ থেকে ৬০ কিমি উত্তরে শিরাবাদে দাফন করা হয়। তিরমিজে তিনি স্থানীয়ভাবে আবু ঈসা আত-তিরমিজি বা 'তিরমিজ উতা' (তিরমিজের পিতা) নামে পরিচিত।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_nasai",
    "categoryId": "imam_jibon",
    "title": "ইমাম নাসাঈ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম নাসাঈ (রহঃ)-এর পূর্ণ নাম আবু আবদুর রহমান আহমাদ ইবনে শুআইব ইবনে আলী ইবনে সিনান ইবনে বাহর আন-নাসাঈ। তিনি ২১৫ হিজরিতে (৮৩০ খ্রিস্টাব্দে) খোরাসানের নাসা শহরে জন্মগ্রহণ করেন এবং ৩০৩ হিজরিতে (৯১৫ খ্রিস্টাব্দে) দামেস্কে শহীদ হন। তিনি সিহাহ সিত্তাহর অন্যতম 'সুনান আন-নাসাঈ'-এর সংকলক।",
      "জন্ম ও প্রাথমিক জীবন\n\nইমাম নাসাঈ ২১৫ হিজরি সনে খোরাসানের নাসা শহরে জন্মগ্রহণ করেন। নাসা শহরটি বর্তমান তুর্কমেনিস্তানে অবস্থিত যা খোরাসানের অংশ। এটি পশ্চিম এশিয়া এবং মধ্য এশিয়ার একটি অঞ্চল যা ইসলামি শিক্ষাকেন্দ্রের জন্য সুপরিচিত। সেখানে ইমাম নাসাঈ 'হালকা' নামে পরিচিত জ্ঞান তপস্যার সমাবেশ-মজলিশে অংশ নিয়েছিলেন।",
      "প্রাথমিক শিক্ষা\n\nশৈশবকালে স্বদেশে তিনি যেসব খ্যাতিমান শায়খের কাছ থেকে শিক্ষার্জন করেন তাঁরা হলেন হুমাইদ ইবনে মাখলাদ (মৃত ২৪৪ হিজরি), আম্মার ইবনুল হাসান (মৃত ২৪২ হিজরি) প্রমুখ। শুধু স্বদেশেই তিনি সীমাবদ্ধ থাকেননি, জ্ঞান অর্জনের জন্য ইমাম নাসাঈ বিভিন্ন দেশে সফর করে হাদিসের বিখ্যাত শায়খদের সান্নিধ্য পান।",
      "বিস্তৃত সফর\n\nপ্রায় ১৫ বছর বয়সে তিনি কুতাইবাতে প্রথম যাত্রা শুরু করেন। তিনি ইরাক, কুফা, হিজাজ, সিরিয়া এবং মিশরের বিদ্বানদের কাছ থেকে জ্ঞান লাভ করে পুরো আরবীয় উপদ্বীপ অতিক্রম করেন এবং শেষ পর্যন্ত মিশরে স্থায়ীভাবে বসতি স্থাপন করেন। ইলমে হাদিসের অসংখ্য মনীষী থেকে তিনি হাদিস শ্রবণ করেছেন।",
      "শিক্ষকবৃন্দ\n\nইমাম ইবনু হাজার আল আসকালানী (রহঃ) বলেছেন, ইমাম নাসাঈ (রহঃ)-এর অসংখ্য শিক্ষক ছিলেন, তাঁদের সংখ্যা গোনা সম্ভব নয়, তবে তাঁর বেশিরভাগ শিক্ষকেরই নাম তাঁর সুনানে উল্লেখিত হয়ে গিয়েছে। সুনানু কুবরা-তে ইমাম নাসাঈ ৪০৩ জন শিক্ষকের নিকট থেকে এবং সুনানু ছুগরা তথা সুনানে নাসাঈ-তে ৩৩৫ জন শায়খের নিকট থেকে হাদিস বর্ণনা করেছেন।",
      "প্রধান শিক্ষকগণ\n\nতাঁর উল্লেখযোগ্য শিক্ষকের মধ্যে রয়েছেন ইসহাক ইবনু রাহওয়াইহ (যিনি ইমাম বুখারী রহঃ-এরও উস্তায), কুতাইবা ইবনু সাঈদ (মৃত ২৪০ হিজরি), মুহাম্মাদ ইবনু নযর, আলী ইবনু হাজার, ইউনুস ইবনু আব্দুল আলা, মুহাম্মাদ বিন বাশার, ইমাম আবূ দাঊদ সিজিস্তানী, বিশর ইবনে হেলাল, আল-হাসান ইবনুস সাববাহ আল-বাযযার এবং আরো অনেকে।",
      "সুনান আন-নাসাঈ\n\nইমাম নাসাঈ (রহঃ)-এর প্রধান গ্রন্থ 'সুনান আন-নাসাঈ' বা 'আল-মুজতাবা' হাদিসশাস্ত্রের অন্যতম নির্ভরযোগ্য গ্রন্থ। এই গ্রন্থে তিনি অত্যন্ত সতর্কতার সাথে সহিহ হাদিস সংকলন করেছেন। ইমাম নাসাঈ (রহঃ) হাদিসের সনদ যাচাইয়ে অত্যন্ত কঠোর ছিলেন এবং দুর্বল বর্ণনাকারীদের এড়িয়ে চলতেন।",
      "ছাত্রবৃন্দ\n\nতাঁর থেকে অনেক বিখ্যাত মুহাদ্দিসই হাদিস শাস্ত্র সম্পর্কে জ্ঞানার্জন করেছেন। তাঁদের মধ্যে বিখ্যাত কয়েকজনের নাম হলো ইমাম আবুল কাসিম তাবারানি, আবু জাফর আত-তাহাবী, ইব্রাহিম বিন মুহাম্মদ বিন সালিহ বিন সিনান, আবু আলী হোসাইন বিন মুহাম্মদ নিশাপুরী, মুহাম্মদ বিন মু'আভিয়া বিন আহমার আন্দালুসী, আল-হাসান বিন রাশিক, মুহাম্মদ বিন হাইওয়েহ, হামযা আল-কিনানী প্রমুখ।",
      "ফিকহী মাযহাব\n\nশাহ ওয়ালি উল্লাহ মুহাদ্দিসে দেহলভী, শাহ আবদুল আজিজ দেহলভী এবং অন্যান্য অনেক আলেমগণ তাঁকে শাফেয়ী মাযহাবের অনুসারী হিসাবে উল্লেখ করেছেন। তবে আল্লামা আনওয়ার শাহ কাশ্মীরি বিচার বিশ্লেষণ করে বলেছেন, ইমাম আবু দাউদ ও ইমাম আবু আব্দুর রহমান নাসাঈ (রহঃ) উভয়েই হাম্বলী মাযহাবের ছিলেন।",
      "হযরত আলী (রাঃ)-এর ফযীলত গ্রন্থ\n\nইমাম নাসাঈ (রহঃ) দামেস্কে অবস্থানকালে হযরত আলী (রাঃ)-এর ফযীলত সম্পর্কে একটি গ্রন্থ রচনা করেন। এই গ্রন্থে তিনি হযরত আলী (রাঃ)-এর মর্যাদা ও গুণাবলী সম্পর্কে সহিহ হাদিস সংকলন করেছিলেন। এতে কিছু লোক তাঁর প্রতি ক্ষুব্ধ হয় এবং তাঁকে মসজিদে প্রহার করে।",
      "শাহাদাত\n\nমসজিদে প্রহারের ফলে ইমাম নাসাঈ (রহঃ) গুরুতর আহত হন। এই আঘাতের ফলে তিনি ৩০৩ হিজরিতে (৯১৫ খ্রিস্টাব্দে) মক্কায় যাওয়ার পথে ইন্তেকাল করেন। তাঁকে মক্কায় দাফন করা হয়। তিনি সত্য প্রকাশের জন্য শাহাদাত বরণ করেছেন এবং হাদিসশাস্ত্রে তাঁর অবদান চিরস্মরণীয় হয়ে আছে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_ibn_abi_shaybah",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে আবী শাইবা (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে আবী শাইবা (রহঃ)-এর পূর্ণ নাম হলো আবু বকর আব্দুল্লাহ ইবনে মুহাম্মদ ইবনে আবি শাইবা ইব্রাহিম ইবনে উসমান আল-কুফী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাদিস সংকলক।",
      "তাঁর উপনাম ছিল আবু বকর। তাঁকে তাঁর সময়ের 'আমীরুল মু'মিনীন ফিল হাদিস' হিসেবে গণ্য করা হতো।",
      "তিনি ছিলেন ইমাম বুখারী ও ইমাম মুসলিম সহ সিহাহ সিত্তাহর অনেক ইমামের শিক্ষক।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১৫৯ হিজরিতে (৭৭৬ খ্রিস্টাব্দে) ইরাকের কুফা শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল। তাঁর বাবা মুহাম্মদ ইবনে আবি শাইবও একজন মুহাদ্দিস ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি কুফায় হাদিস ও ফিকহের জ্ঞান লাভ করেন এবং তাঁর প্রখর স্মৃতিশক্তির জন্য সুপরিচিত ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি সুফিয়ান ইবনে উয়াইনাহ, ইয়াহইয়া ইবনে সাঈদ আল-কাত্তান সহ বহু আলেমের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "প্রধান গ্রন্থ: আল-মুসান্নাফ\n\nতাঁর প্রধান গ্রন্থ হলো 'আল-মুসান্নাফ'। এটি হাদিস সংকলনের ক্ষেত্রে সবচেয়ে পুরনো ও বৃহৎ গ্রন্থগুলোর মধ্যে অন্যতম।",
      "গ্রন্থের বিশেষত্ব\n\n'আল-মুসান্নাফ' হাদিস, সাহাবীর বক্তব্য (আছার) এবং তাবেয়ীদের ফতোয়ার এক বিশাল ভান্ডার। এটি ফিকহী অধ্যায় অনুসারে সাজানো।",
      "শিক্ষক হিসেবে মর্যাদা\n\nইমাম ইবনে আবী শাইবা (রহঃ) বহু মহান মুহাদ্দিসের শিক্ষক ছিলেন। তাঁর ছাত্রদের মধ্যে ইমাম বুখারী (রহঃ) এবং ইমাম মুসলিম (রহঃ) অন্যতম।",
      "রাজনৈতিক পরীক্ষা\n\nতাঁর জীবনেও রাজনৈতিক চাপ এসেছিল, তবে তিনি জ্ঞান বিতরণ ও হাদিস সংকলনেই মনোনিবেশ করেন।",
      "মৃত্যু\n\nতিনি ২৩৫ হিজরিতে (৮৫০ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম ইবনে আবী শাইবা (রহঃ)-এর জীবন হাদিস সংকলন এবং শ্রেষ্ঠ ইমামদেরকে শিক্ষাদানের মাধ্যমে ইসলামি জ্ঞানকে পরবর্তী প্রজন্মের কাছে পৌঁছে দেওয়ার এক উজ্জ্বল উদাহরণ।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_darimi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-দারিমী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-দারিমী (রহঃ)-এর পূর্ণ নাম হলো আবু মুহাম্মদ আব্দুল্লাহ ইবনে আবদির রহমান ইবনে আল-ফযল ইবনে বাহরাম আল-দারিমী আল-সামারকান্দী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস, ফকীহ এবং তাফসীরকার।",
      "তাঁর উপনাম ছিল আবু মুহাম্মদ। তিনি হাদিস, ফিকহ এবং তাফসীর শাস্ত্রে তাঁর গভীর জ্ঞানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১৮১ হিজরিতে (৭৯৭ খ্রিস্টাব্দে) মধ্য এশিয়ার সামারকান্দ শহরে জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবে কুরআন হিফয করেন এবং হাদিস ও ফিকহের প্রাথমিক জ্ঞান লাভ করেন। তাঁর মেধা ছিল অসাধারণ।",
      "হাদিস সংগ্রহের সফর\n\nতিনি হাদিস সংগ্রহের জন্য ইরাক, সিরিয়া, হিজাজ এবং মিশরে ব্যাপক সফর করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি সুফিয়ান ইবনে উয়াইনাহ, ইয়াহইয়া ইবনে সাঈদ আল-কাত্তান সহ বহু আলেমের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "প্রধান গ্রন্থ: সুনান আল-দারিমী\n\nতাঁর প্রধান গ্রন্থ হলো 'সুনান আল-দারিমী' (যা মুসনাদ আল-দারিমী নামেও পরিচিত)। এটি সিহাহ সিত্তাহর বাইরে হাদিসের অন্যতম নির্ভরযোগ্য সংকলন।",
      "গ্রন্থের বিশেষত্ব\n\n'সুনান আল-দারিমী' হাদিস সংকলনের ক্ষেত্রে এর শক্তিশালী সনদ এবং বিন্যাসের জন্য হাদিস গবেষকদের কাছে অত্যন্ত মূল্যবান।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের শেষ ভাগে সামারকান্দের কাজীর (বিচারক) পদ গ্রহণ করতে অস্বীকার করেন।",
      "মৃত্যু\n\nতিনি ২৫৫ হিজরিতে (৮৬৯ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-দারিমী (রহঃ)-এর জীবন হাদিস, ফিকহ ও তাফসীরের জ্ঞানকে সংরক্ষণ ও প্রচারের এক গুরুত্বপূর্ণ উদাহরণ।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_zuhri",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ ইবনে শিহাব আল-যুহরি (রহঃ)",
    "summary": "ইমাম যুহরি (রহঃ) ছিলেন তাবেয়ীনের যুগের অন্যতম শ্রেষ্ঠ হাদিস ও ফিকহ পণ্ডিত। তিনি 'ফুকাহায়ে সাব’আ' (মদীনার সাত ফকীহ)-এর কাছ থেকে সরাসরি শিক্ষা লাভ করেন। উমাইয়া খলিফা উমর ইবনে আবদুল আযীয (রহঃ)-এর নির্দেশে তিনিই সর্বপ্রথম হাদিসকে প্রাতিষ্ঠানিকভাবে লিখিত রূপ দেওয়ার কাজটি শুরু করেন এবং হাদিস সংরক্ষণে চিরস্মরণীয় হয়ে আছেন।",
    "paragraphs": [
      "ইমাম মুহাম্মদ ইবনে শিহাব আল-যুহরি (রহঃ)-এর পূর্ণ নাম আবু বকর মুহাম্মদ ইবনে মুসলিম ইবনে উবাইদিল্লাহ ইবনে আবদুল্লাহ ইবনে শিহাব আল-যুহরি। তিনি ছিলেন তাবেয়ীনের (সাহাবীদের পরবর্তী প্রজন্ম) অন্তর্ভুক্ত। তাঁর উপনাম ছিল আবু বকর। তিনি ছিলেন মদীনার অন্যতম সাতজন শ্রেষ্ঠ ফকীহদের (ফুকাহায়ে সাব'আ) অন্যতম।",
      "নাম ও পরিচিতি\n\nইমাম যুহরি ছিলেন মক্কার কুরাইশ বংশের বনু যুহরাহ গোত্রের বংশধর, যেই গোত্রের সঙ্গে নবী মুহাম্মদ (সাঃ)-এর সম্পর্ক ছিল। তিনি জ্ঞানের গভীরতা, প্রখর মেধা এবং তাকওয়ার কারণে তাঁর সমসাময়িকদের মধ্যে বিশেষ মর্যাদার অধিকারী ছিলেন। তাঁর জ্ঞান মূলত হাদিস, সীরাত (নবীজির জীবনী) এবং ফিকহ শাস্ত্রে ছিল।",
      "জন্মস্থান ও সময়\n\nতিনি মদীনা মুনাওয়ারায় ৫১ হিজরিতে (৬৭১ খ্রিস্টাব্দে) জন্মগ্রহণ করেন। তাঁর জন্ম এমন এক সময়ে, যখন মদীনা ছিল সাহাবী ও তাবেয়ীদের জ্ঞান বিতরণের প্রধান কেন্দ্র। এই পরিবেশ তাঁকে হাদিস ও সুন্নাহর গভীরতম জ্ঞান অর্জনে সরাসরি সাহায্য করে।",
      "প্রাথমিক শিক্ষা ও অসাধারণ মেধা\n\nশৈশবকাল থেকেই ইমাম যুহরি (রহঃ) অসাধারণ মেধার অধিকারী ছিলেন। কথিত আছে, তিনি মাত্র ৮০ দিনের মধ্যে সম্পূর্ণ কুরআনুল কারীম হিফয (মুখস্থ) করেন। জ্ঞান অন্বেষণের জন্য তিনি নিজের জীবন উৎসর্গ করেছিলেন। তিনি জ্ঞানচর্চায় এতটাই মগ্ন থাকতেন যে, প্রায়শই তিনি পারিবারিক দায়িত্বের প্রতি মনোযোগ দিতে পারতেন না। তিনি দিনের বেশিরভাগ সময় হাদিস লেখা ও মুখস্থ করতে ব্যয় করতেন।",
      "হাদিস সংগ্রহের গুরুত্ব ও রিজাল শাস্ত্র\n\nইমাম যুহরি (রহঃ) হাদিস মুখস্থ করার ক্ষেত্রে এতটাই মনোযোগী ছিলেন যে, তিনি বলতেন: 'আমি যখন হাদিস মুখস্থ করি, তখন আমাকে কোনো হাদিস দ্বিতীয়বার বলার প্রয়োজন হয়নি।' তিনি হাদিসের বর্ণনাকারীদের জীবনী (রিজাল) যাচাই-বাছাইয়ের ক্ষেত্রে অন্যতম শ্রেষ্ঠ পণ্ডিত ছিলেন। তিনি রিজাল শাস্ত্রের নিয়মাবলী প্রণয়নে অগ্রণী ভূমিকা রাখেন। তিনি হাদিস গ্রহণের ক্ষেত্রে সনদ বা বর্ণনাকারীর শৃঙ্খলের বিশুদ্ধতার ওপর চরম গুরুত্ব দিতেন।",
      "শিক্ষকমণ্ডলী\n\nইমাম যুহরি (রহঃ) বহু সাহাবী ও তাবেয়ীর নিকট থেকে শিক্ষা ও হাদিস সংগ্রহ করেছেন। তাঁর উস্তাদদের মধ্যে উল্লেখযোগ্য: সাহাবী আবদুল্লাহ ইবনে উমর (রাঃ), সাহাবী আনাস ইবনে মালিক (রাঃ), সাহাবী সাহল ইবনে সা'দ (রাঃ)। তাবেয়ীদের মধ্যে: সাঈদ ইবনে আল-মুসাইয়্যিব (যাকে তাঁর অন্যতম প্রধান শিক্ষক মানা হয়), উরওয়াহ ইবনে আল-যুবাইর, কাসিম ইবনে মুহাম্মদ ইবনে আবি বকর এবং অন্যান্য 'ফুকাহায়ে সাব'আ' (মদীনার সাত ফকীহ)।",
      "শিক্ষক হিসেবে মর্যাদা ও ছাত্রবৃন্দ\n\nতিনি তাঁর পরবর্তী প্রজন্মের বহু মহান ইমামের শিক্ষক ছিলেন। ফিকহের ইমাম ইমাম আবু হানিফা (রহঃ), ইমাম মালিক ইবনে আনাস (রহঃ) এবং হাদিসের ইমাম সুফিয়ান আল-সাওরী (রহঃ) তাঁর কাছ থেকে শিক্ষা লাভ করেন। তাঁর ছাত্রদের মধ্যে উল্লেখযোগ্য ছিলেন মুহাম্মদ ইবনে ইব্রাহিম আল-তাজহী এবং ইয়াহইয়া ইবনে সাঈদ আল-আনসারী। তাঁর জ্ঞানচর্চার ধারা পরবর্তী সকল মুহাদ্দিস ও ফকীহকে প্রভাবিত করেছে।",
      "হাদিস সংকলনে যুগান্তকারী অবদান\n\nইসলামের ইতিহাসে তিনিই প্রথম ব্যক্তি যিনি প্রাতিষ্ঠানিকভাবে হাদিস লিপিবদ্ধ করার কাজটি শুরু করেন। উমাইয়া খলিফা উমর ইবনে আব্দুল আযীয (রহঃ)-এর নির্দেশে তিনি হাদিস সংকলনের কাজ শুরু করেন। খলিফা ভয় পেয়েছিলেন যে, তাবেয়ীনের মৃত্যু হলে হাদিস বিলীন হয়ে যেতে পারে। ইমাম যুহরি (রহঃ) সরকারি পৃষ্ঠপোষকতায় হাদিস সংকলন করে তা মুসলিম সাম্রাজ্যের বিভিন্ন অঞ্চলে প্রেরণ করেন, যা পরবর্তীতে হাদিসের প্রধান গ্রন্থগুলোর ভিত্তিস্থাপন করে।",
      "রাজনৈতিক জীবন\n\nইমাম যুহরি (রহঃ) উমাইয়া খিলাফতের সময়ে খলিফা উমর ইবনে আব্দুল আযীয এবং হিশাম ইবনে আব্দুল মালিকের মতো শাসকদের সাথে ঘনিষ্ঠ সম্পর্ক বজায় রাখতেন এবং রাজদরবারে উপদেষ্টা ও শিক্ষকের ভূমিকা পালন করতেন। যদিও কিছু আলেম তাঁর শাসকদের সাথে ঘনিষ্ঠতা নিয়ে প্রশ্ন তুলেছিলেন, তবে বেশিরভাগ আলেম মনে করেন যে, তিনি জ্ঞান ও সুন্নাহর প্রচারের জন্যই এই সুযোগ ব্যবহার করেছিলেন।",
      "মৃত্যু ও শেষ জীবন\n\nইমাম যুহরি (রহঃ) জীবনের শেষ ভাগ মদীনা ও সিরিয়ার মধ্যবর্তী আল-শারাফ নামক এলাকায় কাটান। তিনি ১২৪ হিজরিতে (৭৪১ খ্রিস্টাব্দে) ইন্তেকাল করেন। মৃত্যুকালে তাঁর বয়স হয়েছিল ৭৩ বছর। তাঁকে আল-শারাফ এলাকায় দাফন করা হয়।",
      "জানাযা ও ওসিয়ত\n\nমৃত্যুর আগে তিনি তাঁর সকল ঋণ পরিশোধ করতে এবং তাঁর রেখে যাওয়া সম্পদ দিয়ে জ্ঞান অন্বেষণকারীদের সাহায্য করার ওসিয়ত করে যান। তিনি তাঁর জীবনকে রাসূলুল্লাহ (সাঃ)-এর হাদিস সংরক্ষণ ও প্রচারের জন্য সম্পূর্ণরূপে উৎসর্গ করেছিলেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_sufyan_al_thawri",
    "categoryId": "imam_jibon",
    "title": "ইমাম সুফিয়ান আল-সাওরী (রহঃ)",
    "paragraphs": [
      "ইমাম সুফিয়ান আল-সাওরী (রহঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ সুফিয়ান ইবনে সাঈদ ইবনে মাসরুক আল-সাওরী আল-কুফী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ তাবে-তাবেয়ী, মুহাদ্দিস এবং ফকীহ।",
      "তাঁর উপনাম ছিল আবু আব্দুল্লাহ। হাদিস ও ফিকহ শাস্ত্রে তাঁর গভীর পাণ্ডিত্যের কারণে তাঁকে 'আমীরুল মু'মিনীন ফিল হাদিস' (হাদিস বিশারদদের নেতা) উপাধি দেওয়া হয়।",
      "তিনি ছিলেন তাঁর সময়ের তাকওয়া (খোদাভীতি) এবং দুনিয়াবিমুখতার (যুহদ) জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৯৭ হিজরিতে (৭১৫ খ্রিস্টাব্দে) ইরাকের কুফা শহরে জন্মগ্রহণ করেন। কুফা তখন ছিল ইমাম আবু হানিফা (রহঃ)-এর ফিকহের কেন্দ্র।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল। তাঁর পিতা সাঈদ ইবনে মাসরুকও একজন হাদিস বর্ণনাকারী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবেই হাদিস ও ফিকহের জ্ঞান লাভ করেন। তাঁর মেধা ছিল অসাধারণ, যা তাঁকে অল্প বয়সেই বড় আলেমদের কাতারে নিয়ে আসে।",
      "শিক্ষকমণ্ডলী\n\nতিনি বহু তাবেয়ীনের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর শিক্ষকদের মধ্যে অন্যতম: ইমাম মুহাম্মদ ইবনে শিহাব আল-যুহরি (রহঃ), আব্দুল্লাহ ইবনে দিনার এবং আইয়্যুব আল-সাখতিয়ানি।",
      "তিনি ইমাম আবু হানিফা (রহঃ)-এরও সমসাময়িক ছিলেন এবং তাঁরা উভয়েই কুফার ফিকহী ধারায় অবদান রাখেন।",
      "হাদিস সংগ্রহের সফর\n\nহাদিস সংগ্রহের জন্য তিনি মক্কা, মদীনা, বসরা এবং অন্যান্য স্থানে ব্যাপক সফর করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে অন্যতম হলো 'আল-জামি' আল-কাবীর' (হাদিস ও ফিকহ সংকলন)। যদিও তাঁর মাযহাব টিকে থাকেনি, তাঁর ফিকহী সিদ্ধান্তগুলো আজও মূল্যবান।",
      "ফিকহী অবস্থান\n\nতিনি ছিলেন স্বতন্ত্র ফিকহী মাযহাবের প্রতিষ্ঠাতা। তাঁর মাযহাব হাদিস ও রায় (যুক্তির) মধ্যে ভারসাম্য রেখে চলত।",
      "তাকওয়া ও যুহদ\n\nতিনি তাঁর সময়ের অন্যতম প্রধান যাহিদ (দুনিয়াবিমুখ) আলেম ছিলেন। তিনি শাসকদের সাথে ঘনিষ্ঠতা এড়িয়ে চলতেন।",
      "রাজনৈতিক পরীক্ষা\n\nতিনি শাসকদের বিচারকের পদ (কাজী) গ্রহণ করতে অস্বীকার করেন এবং আব্বাসীয় খলিফা আল-মাহদীর সময় তাঁকে গ্রেপ্তার করার উদ্যোগ নেওয়া হলে তিনি আত্মগোপন করেন।",
      "তাঁর এই আপসহীনতা তাঁকে মুসলিম সমাজে বিশেষ মর্যাদা এনে দেয়।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে অন্যতম: আব্দুল্লাহ ইবনে আল-মুবারক এবং ইয়াহইয়া ইবনে সাঈদ আল-কাত্তান।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের বেশিরভাগ সময় শিক্ষাদান, ইবাদত ও গ্রন্থ রচনায় অতিবাহিত করেন।",
      "মৃত্যু\n\nতিনি ১৬১ হিজরিতে (৭৭৮ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম সুফিয়ান আল-সাওরী (রহঃ)-এর জীবন হাদিস, ফিকহ এবং তাকওয়ার এক উজ্জ্বল দৃষ্টান্ত, যিনি তাঁর সময়ের জ্ঞান ও আধ্যাত্মিকতার প্রতীক ছিলেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_awzai",
    "categoryId": "imam_jibon",
    "title": "ইমাম আওযায়ী (রহঃ)",
    "paragraphs": [
      "ইমাম আওযায়ী (রহঃ)-এর পূর্ণ নাম হলো আবু আমর আব্দুর রহমান ইবনে আমর আল-আওযায়ী। তিনি ছিলেন সিরিয়ার একজন বিশিষ্ট ফকীহ এবং তাঁর সময়ে আওযায়ী মাযহাবের প্রতিষ্ঠাতা।",
      "তাঁর উপনাম ছিল আবু আমর। তাঁর পাণ্ডিত্যের কারণে তাঁকে 'ইমামু আহলুস শাম' (সিরিয়ার অধিবাসীদের ইমাম) উপাধিতে ভূষিত করা হয়।",
      "তিনি সিরিয়া অঞ্চলে দীর্ঘদিন ধরে ফিকহী নেতৃত্ব দেন।",
      "জন্ম ও জন্মস্থান\n\nতাঁর জন্মসাল নিয়ে কিছুটা মতভেদ থাকলেও, তিনি ৮৮ হিজরির (৭০৭ খ্রিস্টাব্দে) দিকে সিরিয়ার বালবেক শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি ইয়েমেনের আওযা গোত্রের অন্তর্ভুক্ত ছিলেন এবং শৈশবে তাঁর মা তাঁকে লালন-পালন করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি অল্প বয়সেই হাদিস ও ফিকহের জ্ঞান অর্জন করেন। তিনি তাঁর প্রখর মেধার জন্য পরিচিত ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি ইমাম যুহরি (রহঃ), আতা ইবনে আবি রাবাহ সহ বহু তাবেয়ীর কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "প্রধান গ্রন্থ\n\nযদিও তাঁর ফিকহী মাযহাব কালের বিবর্তনে টিকে থাকেনি, তবুও তাঁর ফিকহী সিদ্ধান্তগুলো 'সুনান আল-আওযায়ী' নামে সংকলিত ছিল।",
      "তাঁর ফিকহী অবস্থান\n\nতিনি ফিকহী মাসআলাতে সরাসরি কুরআন ও হাদিসের ওপর নির্ভর করতেন। তাঁর মাযহাব সিরিয়া এবং আন্দালুসের কিছু অংশে প্রচলিত ছিল।",
      "কর্মজীবন\n\nতিনি সিরিয়ার বৈরুতে বসবাস করতেন এবং সেখানে শিক্ষাদান করতেন।",
      "রাজনৈতিক সম্পর্ক\n\nতিনি উমাইয়া ও আব্বাসীয় উভয় খিলাফতের সাথেই যুক্ত ছিলেন এবং শাসকদের কাছে ন্যায় প্রতিষ্ঠার জন্য কথা বলতেন।",
      "মৃত্যু\n\nতিনি ১৫৭ হিজরিতে (৭৭৪ খ্রিস্টাব্দে) বৈরুতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আওযায়ী (রহঃ)-এর জীবন প্রমাণ করে যে, একজন আলেম তার সময়ের রাজনৈতিক চাপের মুখেও সত্যের প্রচার করতে পারে এবং ফিকহী চিন্তাধারার সূচনা করতে পারে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_laysh_ibn_sad",
    "categoryId": "imam_jibon",
    "title": "ইমাম লাইস ইবনে সা'দ (রহঃ)",
    "paragraphs": [
      "ইমাম লাইস ইবনে সা'দ (রহঃ)-এর পূর্ণ নাম হলো আবু আল-হারিথ আল-লাইস ইবনে সা'দ ইবনে আবদির রহমান আল-ফাহমী। তিনি ছিলেন তাঁর সময়ের মিশরের শ্রেষ্ঠতম মুহাদ্দিস ও ফকীহ।",
      "তাঁর উপনাম ছিল আবু আল-হারিথ। তিনি জ্ঞান, সম্পদ ও উদারতার জন্য সুপরিচিত ছিলেন।",
      "তিনি ফিকহের ক্ষেত্রে একজন মুজতাহিদ ইমাম ছিলেন, যদিও তাঁর মাযহাব টিকে থাকেনি।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৯৪ হিজরিতে (৭১৩ খ্রিস্টাব্দে) মিশরের ফুসতাত (প্রাচীন কায়রো) শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি ছিলেন এক সম্ভ্রান্ত আরব পরিবারে সন্তান। তাঁর পিতা ছিলেন একজন ধার্মিক ব্যক্তি।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি মিশরের আলেমদের কাছ থেকে প্রাথমিক জ্ঞান লাভ করেন। তাঁর মেধা ছিল অসাধারণ এবং তিনি হাদিস ও ফিকহে দ্রুত পাণ্ডিত্য অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি ইমাম মুহাম্মদ ইবনে শিহাব আল-যুহরি (রহঃ) এবং নাফি' (আব্দুল্লাহ ইবনে উমর (রাঃ)-এর মুক্ত দাস)-এর মতো অনেক মহান তাবেয়ীনের কাছ থেকে শিক্ষা লাভ করেন।",
      "হাদিস সংগ্রহের সফর\n\nহাদিস সংগ্রহের জন্য তিনি মক্কা ও মদীনা সহ হিজাজের বিভিন্ন অঞ্চলে ভ্রমণ করেন।",
      "ইমাম মালিকের সাথে তুলনা\n\nইমাম মালিক (রহঃ)-এর মতো তিনিও হাদিস ও ফিকহের ক্ষেত্রে তাঁর যুগের একজন মুজতাহিদ ইমাম ছিলেন। অনেকে তাঁকে ইমাম মালিক (রহঃ)-এর চেয়েও বেশি ফিকহী জ্ঞান ও প্রজ্ঞার অধিকারী মনে করতেন।",
      "প্রধান গ্রন্থ\n\nযদিও তাঁর ফিকহী মাযহাব টিকে থাকেনি, তাঁর ফতোয়া ও সিদ্ধান্তগুলো তাঁর ছাত্রদের মাধ্যমে এবং অন্যান্য ফিকহী গ্রন্থে সংকলিত আছে।",
      "সম্পদ ও বদান্যতা\n\nতিনি ছিলেন ধনী এবং অত্যন্ত বদান্য। তিনি প্রতি বছর আল্লাহর রাস্তায় ২০ হাজার দিনার দান করতেন।",
      "তিনি দরিদ্র আলেমদের আর্থিক সহায়তা করতেন এবং তাঁর সম্পদ জ্ঞান বিতরণ ও মানুষের সেবায় ব্যয় করতেন।",
      "রাজনৈতিক সম্পর্ক\n\nতিনি শাসকদের কাছ থেকে আসা উপহার গ্রহণ করতেন না এবং শাসকদের কাছে ন্যায় প্রতিষ্ঠার জন্য কথা বলতেন।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে অন্যতম: আব্দুল্লাহ ইবনে ওয়াহাব।",
      "মৃত্যু\n\nতিনি ১৭৫ হিজরিতে (৭৯১ খ্রিস্টাব্দে) মিশরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম লাইস ইবনে সা'দ (রহঃ)-এর জীবন হাদিস ও ফিকহের জ্ঞানকে সম্পদ ও ক্ষমতার মাধ্যমে কিভাবে জনগণের কল্যাণে ব্যবহার করা যায়, তার এক বিরল উদাহরণ।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-সুবকী, তাবাকাত আল-শাফি'য়্যাহ আল-কুবরা"
  },
  {
    "id": "imam_ibn_khuzaymah",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে খুযাইমা (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে খুযাইমা (রহঃ)-এর পূর্ণ নাম হলো আবু বকর মুহাম্মদ ইবনে ইসহাক ইবনে খুযাইমা ইবনে আল-মুগীরাহ আল-সুলামী আল-নিশাপুরী। তিনি খোরাসানের নিশাপুরে জন্মগ্রহণ করেন। তিনি ছিলেন তাঁর সময়ের 'শাইখুল ইসলাম' এবং হাদিস ও ফিকহ শাস্ত্রে মুজতাহিদ ইমাম হিসেবে স্বীকৃত।",
      "নাম ও পরিচিতি\n\nতাঁর উপনাম ছিল আবু বকর। তাঁর বিশাল জ্ঞান এবং পাণ্ডিত্যের কারণে তাঁকে 'ইমামুল আইম্মাহ' (ইমামগণের ইমাম) এবং 'শাইখুল ইসলাম' উপাধিতে ভূষিত করা হয়। তিনি মূলত শাফেয়ী মাযহাবের একজন ফকীহ ছিলেন, তবে তাঁর জ্ঞান ও গবেষণা কোনো একক মাযহাবের সীমাবদ্ধ ছিল না।",
      "জন্ম ও জন্মস্থান\n\nতিনি ২৩৩ হিজরিতে (৮৪৭ খ্রিস্টাব্দে) খোরাসানের প্রসিদ্ধ শহর নিশাপুরে জন্মগ্রহণ করেন। নিশাপুর তখন ছিল মুসলিম বিশ্বের অন্যতম প্রধান জ্ঞানচর্চা কেন্দ্র। তাঁর জন্ম এমন এক পরিবেশে, যা তাঁকে শৈশবেই জ্ঞানার্জনে উদ্বুদ্ধ করেছিল।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nইমাম ইবনে খুযাইমা (রহঃ) মাত্র সাত বছর বয়সে কুরআন হিফয (মুখস্থ) সম্পন্ন করেন এবং নয় বছর বয়সে হাদিস শোনা শুরু করেন। তাঁর প্রখর মেধা ও স্মৃতিশক্তি ছিল কিংবদন্তী। তিনি নিজেই বলেছেন, তিনি শৈশবেই তাঁর শিক্ষক ইসহাক ইবনে রাহাওয়াইহ (রহঃ)-এর কাছে হাদিস মুখস্থ করে শোনাতেন।",
      "হাদিস সংগ্রহের সফর (রিহলাহ)\n\nহাদিস সংগ্রহের জন্য তিনি তৎকালীন মুসলিম বিশ্বের প্রধান জ্ঞানকেন্দ্রগুলোতে দীর্ঘ সফর করেন। তিনি ইরাক (বাগদাদ), বসরা, কুফা, মিশর, সিরিয়া, এবং হিজাজে (মক্কা ও মদীনা) ভ্রমণ করেন। এই সফর তাঁকে হাদিসের বিস্তৃত জ্ঞান এবং শক্তিশালী সনদ (শৃঙ্খল) অর্জনে সাহায্য করে।",
      "শিক্ষকমণ্ডলী\n\nতিনি বহু বিখ্যাত মুহাদ্দিস ও আলেমের কাছ থেকে শিক্ষা লাভ করেন। তাঁর অসংখ্য উস্তাদের মধ্যে উল্লেখযোগ্য: ইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ) (যাঁর কাছ থেকে তিনি ফিকহ ও হাদিস শেখেন), ইমাম বুখারী (রহঃ), ইমাম মুসলিম (রহঃ), ইমাম আবু দাউদ (রহঃ) এবং মুহাম্মদ ইবনে ইয়াহইয়া আল-যুহলী (রহঃ)। তিনি সরাসরি সিহাহ সিত্তাহর অনেক ইমামের ছাত্র ছিলেন।",
      "প্রধান গ্রন্থ: সহীহ ইবনে খুযাইমা\n\nইমাম ইবনে খুযাইমা (রহঃ)-এর প্রধান গ্রন্থ হলো 'আল-সহীহ আল-মুসনাদ আল-মুখতাসার মিনান নুসারি ইল্মি আর-রাসূল' যা 'সহীহ ইবনে খুযাইমা' নামেই পরিচিত। তাঁর সংকলিত এই গ্রন্থে প্রায় ৩,০০০ এরও বেশি সহীহ হাদিস স্থান পেয়েছে।",
      "গ্রন্থের বৈশিষ্ট্য ও মর্যাদা\n\nএই গ্রন্থের প্রধান বৈশিষ্ট্য হলো ইমাম বুখারী ও ইমাম মুসলিমের মতো কঠোর মানদণ্ড অনুসরণ করে শুধুমাত্র সহীহ হাদিস সংকলন করা। এই কারণে এই গ্রন্থটি 'সহীহাইন' (বুখারী ও মুসলিম)-এর পরে হাদিসের অন্যতম নির্ভরযোগ্য উৎস হিসেবে বিবেচিত। যদিও তিনি সহীহ হাদিসের ওপর জোর দিয়েছেন, তবুও কিছু দুর্বল হাদিসও এতে স্থান পেয়েছে বলে কিছু গবেষক মত দেন, তবে এর বিশুদ্ধতার হার অন্যান্য সুনান গ্রন্থের চেয়ে অনেক বেশি।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্রের মধ্যে উল্লেখযোগ্য হলেন: ইমাম ইবনে হিব্বান (রহঃ) (যিনি নিজেও 'সহীহ ইবনে হিব্বান' সংকলন করেন), আল-হাকিম আল-নিশাপুরী (রহঃ) (যিনি 'আল-মুস্তাদরাক' সংকলন করেন), এবং তাঁর পুত্র আবু আল-ফযল ইবনে খুযাইমা।",
      "মৃত্যু ও শেষ জীবন\n\nইমাম ইবনে খুযাইমা (রহঃ) জ্ঞান সাধনা এবং শিক্ষাদানেই তাঁর জীবনের শেষ সময় অতিবাহিত করেন। তিনি ৩১৩ হিজরিতে (৯২৫ খ্রিস্টাব্দে) নিশাপুরে ইন্তেকাল করেন। মৃত্যুকালে তাঁর বয়স হয়েছিল আশি বছর।",
      "জানাযা ও মর্যাদা\n\nতাঁর জানাযায় বিপুল সংখ্যক লোক সমাগম হয়। ইমাম ইবনে হিব্বান (রহঃ) তাঁর সম্পর্কে মন্তব্য করেছেন যে, তিনি তাঁর সময়ের অন্যতম শ্রেষ্ঠ ফিকহ ও হাদিসের আলেম ছিলেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_ibn_hibban",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ ইবনে হিব্বান (রহঃ)",
    "paragraphs": [
      "ইমাম মুহাম্মদ ইবনে হিব্বান (রহঃ)-এর পূর্ণ নাম হলো আবু হাতিম মুহাম্মদ ইবনে হিব্বান ইবনে আহমাদ ইবনে হিব্বান আল-বুস্তী। তিনি ছিলেন একজন সুন্নি মুসলিম পণ্ডিত, মুহাদ্দিস, ফকীহ এবং জীবনীকার (রিজাল শাস্ত্রে বিশেষজ্ঞ)।",
      "নাম ও পরিচিতি\n\nতাঁর পূর্ণ উপাধি ছিল 'আবু হাতিম আল-হাফিযুল কাবীর'। তাঁকে হাদিসের একজন মহান হাফিয (স্মৃতিশক্তিধর) হিসেবে গণ্য করা হয়। তিনি মূলত শাফেয়ী মাযহাবের একজন অনুসারী ছিলেন এবং তাঁর সময়ে তিনি বিচারিক কাজ (কাজীর দায়িত্ব) পালন করেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ২৭৫ হিজরিতে (৮৮৪ খ্রিস্টাব্দে) সিজিস্তান প্রদেশের বুস্ত শহরে জন্মগ্রহণ করেন। বুস্ত তখন ছিল জ্ঞানচর্চার একটি গুরুত্বপূর্ণ কেন্দ্র।",
      "শিক্ষা ও প্রারম্ভিক জ্ঞান\n\nইমাম ইবনে হিব্বান (রহঃ) নিজ অঞ্চলে প্রাথমিক শিক্ষা সমাপ্ত করেন। তিনি হাদিস এবং ফিকহ শাস্ত্রে গভীরভাবে মনোনিবেশ করেন। তাঁর অসাধারণ মেধা ছিল এবং তিনি বহু হাদিস সনদসহ মুখস্থ করেন।",
      "হাদিস সংগ্রহের ব্যাপক সফর (রিহলাহ)\n\nহাদিস সংগ্রহের জন্য তিনি জ্ঞানের সন্ধানে তৎকালীন মুসলিম বিশ্বের দূর-দূরান্তের অঞ্চলে ব্যাপকভাবে সফর করেন। তাঁর ভ্রমণগুলোর মধ্যে ছিল খোরাসান, ইরাক, হিজাজ (মক্কা ও মদীনা), মিশর, সিরিয়া, ইয়েমেন এবং অন্যান্য স্থান।",
      "শিক্ষকমণ্ডলী\n\nতিনি প্রায় ২,০০০ (দুই হাজারেরও বেশি) শিক্ষকের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর অন্যতম গুরুত্বপূর্ণ শিক্ষক ছিলেন ইমাম ইবনে খুযাইমা (রহঃ), যিনি ছিলেন তাঁর ফিকহ ও হাদিস উভয় ক্ষেত্রেই অন্যতম প্রধান উস্তাদ। এছাড়া তিনি ইমাম নাসাঈ (রহঃ)-এর কাছ থেকেও শিক্ষা লাভ করেন।",
      "প্রধান গ্রন্থ: সহীহ ইবনে হিব্বান\n\nইমাম ইবনে হিব্বান (রহঃ)-এর প্রধান গ্রন্থ হলো 'আল-তাক্বাসীম ওয়া আল-আনওয়া' যা 'সহীহ ইবনে হিব্বান' নামে পরিচিত। এটি হাদিসের বিশুদ্ধতার দিক থেকে অন্যতম নির্ভরযোগ্য উৎস হিসেবে গণ্য হয়, যা বুখারী ও মুসলিমের পরই স্থান পায়। এই গ্রন্থে প্রায় ৭,৫০০ সহীহ হাদিস স্থান পেয়েছে।",
      "গ্রন্থের বিশেষত্ব\n\n'সহীহ ইবনে হিব্বান'-এর বিন্যাস পদ্ধতি ফিকহী অধ্যায় অনুসারে নয়, বরং হাদিসের বিষয়বস্তু (আল-আনওয়া') অনুসারে সাজানো হয়েছে, যা এর একটি অনন্য বৈশিষ্ট্য। এছাড়া তাঁর রিজাল শাস্ত্রের বিখ্যাত গ্রন্থগুলোর মধ্যে রয়েছে কিতাব আল-মাজরুহীন এবং কিতাবুস সিকাত।",
      "ফিকহী ও প্রশাসনিক জীবন\n\nতিনি শাফেয়ী মাযহাবের একজন পণ্ডিত ছিলেন। প্রশাসনিকভাবে তিনি সিজিস্তান এবং সমরকন্দে কাজীর (বিচারপতি) দায়িত্ব পালন করেন। প্রশাসনিক কাজে তাঁর সততা ও জ্ঞান প্রশংসিত ছিল।",
      "মৃত্যু ও শেষ জীবন\n\nইমাম ইবনে হিব্বান (রহঃ) জীবনের শেষভাগে নিজ শহর বুস্তে একটি মাদ্রাসা স্থাপন করেন, যেখানে তিনি শিক্ষাদান করেন। তিনি ৩৫৪ হিজরিতে (৯৬৫ খ্রিস্টাব্দে) তাঁর জন্মস্থান বুস্তেই ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম ইবনে হিব্বান (রহঃ)-এর পাণ্ডিত্য এবং হাদিস সংরক্ষণে তাঁর অবদান পরবর্তী মুহাদ্দিসগণ, যেমন ইমাম ইবনে হাজার আল-আসকালানী (রহঃ) এবং ইমাম যাহাবী (রহঃ), দ্বারা ব্যাপকভাবে স্বীকৃত।"
    ],
    "source": "উইকিপিডিয়া (ইমাম ইবনে হিব্বান সম্পর্কিত ভুক্তি); ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "imam_al_hakim",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-হাকিম আল-নিশাপুরী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-হাকিম (রহঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ মুহাম্মদ ইবনে আব্দুল্লাহ ইবনে হামদাওয়াইহ ইবনে নু'আইম আল-যিয়াবী আল-নিশাপুরী। তিনি ছিলেন হাদিসশাস্ত্রের একজন মুজতাহিদ ইমাম এবং তাঁর যুগের শ্রেষ্ঠ সমালোচক (নাক্বিদ)।",
      "তাঁর উপাধি ছিল 'আল-হাকিম' (বিচারক বা প্রাজ্ঞ)। এটি তাঁর ফিকহী জ্ঞান ও প্রজ্ঞার জন্য দেওয়া হয়েছিল। এছাড়াও তাঁকে 'হাফিযুল কাবীর' (মহান হাফিয) হিসেবেও গণ্য করা হয়।",
      "তিনি প্রধানত শাফেয়ী মাযহাবের অনুসারী ছিলেন এবং ফিকহ ও হাদিস উভয় ক্ষেত্রেই তাঁর পাণ্ডিত্য ছিল।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৩২১ হিজরিতে (৯৩৩ খ্রিস্টাব্দে) খোরাসানের অন্যতম প্রধান জ্ঞানকেন্দ্র নিশাপুরে জন্মগ্রহণ করেন।",
      "তাঁর জন্ম এমন একটি বিদ্বান পরিবারে হয়েছিল, যা তাঁকে শৈশব থেকেই জ্ঞানার্জনে উদ্বুদ্ধ করেছিল। তাঁর পিতা ও দাদা উভয়ই হাদিস বর্ণনার সঙ্গে যুক্ত ছিলেন।",
      "প্রাথমিক শিক্ষা\n\nতিনি মাত্র ৯ বছর বয়সে হাদিস শোনা ও লেখা শুরু করেন। তাঁর প্রথম উস্তাদ ছিলেন তাঁর নিজ শহর নিশাপুরের প্রখ্যাত মুহাদ্দিসগণ।",
      "তিনি অল্প বয়সেই কুরআন ও হাদিসের প্রারম্ভিক জ্ঞান আয়ত্ত করেন এবং হাদিস মুখস্থ করার ক্ষেত্রে অসাধারণ মেধার পরিচয় দেন।",
      "হাদিস সংগ্রহের ব্যাপক সফর (রিহলাহ)\n\nজ্ঞান অন্বেষণে তিনি তৎকালীন মুসলিম বিশ্বের বহু দূর-দূরান্তের অঞ্চলে ভ্রমণ করেন। তাঁর এই সফর হাদিসশাস্ত্রের ইতিহাসে 'রিহলাহ' হিসেবে সুপরিচিত।",
      "তিনি ইরাক (বাগদাদ), হিজাজ (মক্কা ও মদীনা), কুফা, বসরা, সিরিয়া এবং মিশর সহ মধ্যপ্রাচ্যের প্রধান কেন্দ্রগুলোতে ভ্রমণ করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি প্রায় ২,০০০ (দুই হাজারেরও বেশি) শিক্ষকের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর অন্যতম উস্তাদ ছিলেন ইমাম ইবনে হিব্বান (রহঃ), যাঁর কাছ থেকে তিনি ফিকহ ও রিজাল শাস্ত্রের গভীর জ্ঞান লাভ করেন।",
      "এছাড়াও তিনি মুহাম্মদ ইবনে ইয়াকুব আল-আসাম, ইবনে খুযাইমা (রহঃ)-এর ছাত্র আবু আল-ফযল ইবনে খুযাইমা প্রমুখের কাছ থেকেও শিক্ষা লাভ করেন।",
      "প্রধান গ্রন্থ: আল-মুস্তাদরাক\n\nইমাম আল-হাকিম (রহঃ)-এর প্রধান ও সবচেয়ে বিখ্যাত গ্রন্থ হলো 'আল-মুস্তাদরাক আলাস সহীহাইন' (المستدرك على الصحيحين)।",
      "এই গ্রন্থের উদ্দেশ্য ছিল, ইমাম বুখারী ও ইমাম মুসলিম তাঁদের গ্রন্থে যেসব সহীহ হাদিস অন্তর্ভুক্ত করেননি, কিন্তু যেগুলো তাঁদের উভয়ের অথবা যেকোনো একজনের নির্ধারিত বিশুদ্ধতার মানদণ্ড (শুরুত) পূরণ করে, সেগুলোকে একত্রিত করা।",
      "গ্রন্থের বৈশিষ্ট্য ও সমালোচনা\n\nযদিও মুস্তাদরাকে অনেক সহীহ হাদিস রয়েছে, তবুও তিনি কিছু এমন হাদিসও অন্তর্ভুক্ত করেছেন যা পরবর্তীতে হাদিস বিশারদগণ দুর্বল হিসেবে চিহ্নিত করেছেন। এর ফলে গ্রন্থটি সমালোচিত হয়েছে, কিন্তু হাদিসের বিশাল ভান্ডার হিসেবে এর গুরুত্ব অপরিসীম।",
      "অন্যান্য গ্রন্থ\n\nআল-হাকিম (রহঃ) বহু মূল্যবান গ্রন্থ রচনা করেন। এর মধ্যে রয়েছে 'মা'রিফাতু উলূমিল হাদিস' (হাদিসের প্রকারভেদ ও নীতি সম্পর্কিত জ্ঞান), যা হাদিসশাস্ত্রের উসূলের ক্ষেত্রে এক মৌলিক কাজ।",
      "ফিকহী ও প্রশাসনিক জীবন\n\nতিনি শাফেয়ী ফিকহের অনুসারী ছিলেন এবং হাদিসের জ্ঞান দেওয়ার পাশাপাশি ফিকহী মাসআলারও ফতোয়া দিতেন। তিনি তাঁর নিজ শহর নিশাপুরে কাজীর (বিচারপতি) দায়িত্বও পালন করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্রের মধ্যে অন্যতম ছিলেন: ইমাম আল-বায়হাকি (রহঃ), যিনি পরবর্তীতে শাফেয়ী মাযহাব ও হাদিস সংরক্ষণে বিশাল ভূমিকা রাখেন।",
      "মৃত্যু ও শেষ জীবন\n\nইমাম আল-হাকিম (রহঃ) জ্ঞান সাধনা এবং শিক্ষাদানেই তাঁর জীবনের শেষ সময় অতিবাহিত করেন। তিনি ৪০৫ হিজরিতে (১০১৪ খ্রিস্টাব্দে) নিশাপুরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর ইন্তেকালের পর তাঁর জানাযায় বিশাল জনসমাগম হয়। তিনি তাঁর জ্ঞান, প্রজ্ঞা এবং হাদিস সংরক্ষণে তাঁর যুগান্তকারী কাজের জন্য 'শাইখুল মুহাদ্দিসীন' হিসেবে ইতিহাসে শ্রদ্ধার আসনে অধিষ্ঠিত।",
      "ইমাম যাহাবী (রহঃ) সহ পরবর্তী মুহাদ্দিসগণ মুস্তাদরাকের সমালোচনা করলেও আল-হাকিম (রহঃ)-এর পাণ্ডিত্য এবং অন্যান্য গ্রন্থে তাঁর অবদানকে অত্যন্ত উচ্চ মর্যাদা দিয়েছেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_al_bayhaqi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-বায়হাকী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-বায়হাকী (রহঃ)-এর পূর্ণ নাম হলো আবু বকর আহমদ ইবনে আল-হুসাইন ইবনে আলী ইবনে আবদুল্লাহ ইবনে মুসা আল-খুসরাউজিরদী আল-বায়হাকী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ 'শাইখুল ইসলাম' এবং হাদিস ও ফিকহ উভয় শাস্ত্রে সুগভীর জ্ঞানসম্পন্ন মুজতাহিদ ইমাম।",
      "তাঁর উপনাম ছিল আবু বকর। তিনি তাঁর জন্মস্থান বায়হাক অঞ্চলের নামানুসারে 'আল-বায়হাকী' নামে পরিচিত। তিনি ফিকহের ক্ষেত্রে ইমাম শাফেয়ী (রহঃ)-এর মাযহাবের একজন অন্যতম প্রধান প্রচারক ও ব্যাখ্যাকার ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৩৮৪ হিজরিতে (৯৯৪ খ্রিস্টাব্দে) খোরাসান অঞ্চলের বায়হাক প্রদেশের খুসরাউজিরদ গ্রামে জন্মগ্রহণ করেন। এই অঞ্চলে তখন জ্ঞানচর্চার এক উর্বর পরিবেশ বিরাজমান ছিল।",
      "ইমাম আল-বায়হাকী (রহঃ) এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন এবং জ্ঞানার্জনের জন্য তাঁর পরিবারের পক্ষ থেকে পূর্ণ সহযোগিতা পান।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবেই কুরআন হিফয করেন এবং হাদিস ও ফিকহের প্রাথমিক জ্ঞান অর্জন করেন। তিনি তাঁর প্রখর মেধা ও স্মৃতিশক্তির জন্য পরিচিত ছিলেন।",
      "তিনি হাদিস ও ফিকহের জ্ঞান অর্জনের জন্য তাঁর নিজ শহরের শিক্ষকদের কাছে মনোনিবেশ করেন।",
      "হাদিস সংগ্রহের ব্যাপক সফর (রিহলাহ)\n\nহাদিস সংগ্রহের জন্য তিনি তৎকালীন মুসলিম বিশ্বের বহু স্থানে ভ্রমণ করেন, যদিও তাঁর প্রধান কেন্দ্র ছিল খোরাসান ও নিশাপুর।",
      "তিনি বাগদাদ, বসরা, কুফা, হিজাজ (মক্কা ও মদীনা) সহ গুরুত্বপূর্ণ অঞ্চলে ভ্রমণ করেন, যেন হাদিসের সর্বোচ্চ সনদগুলো তিনি সংগ্রহ করতে পারেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি বহু মুহাদ্দিস ও আলেমের কাছ থেকে শিক্ষা লাভ করেন। তাঁর অন্যতম প্রধান উস্তাদ ছিলেন আল-হাকিম আল-নিশাপুরী (রহঃ), যাঁর কাছ থেকে তিনি হাদিস ও রিজাল শাস্ত্রের জ্ঞান লাভ করেন।",
      "এছাড়াও তিনি আবু আল-ফাতহ ইবনে হামদ আল-বুস্তী এবং আবু আবদুল্লাহ আল-হাফিজ সহ অনেক আলেমের শিষ্যত্ব গ্রহণ করেন।",
      "ইমাম আল-বায়হাকী (রহঃ) তাঁর উস্তাদ ইমাম আল-হাকিম (রহঃ)-এর সংকলিত 'আল-মুস্তাদরাক' গ্রন্থের কঠোর সমালোচনা ও ব্যাখ্যা প্রদান করেন, যা তাঁর পাণ্ডিত্যের গভীরতা প্রমাণ করে।",
      "প্রধান গ্রন্থ: সুনান আল-কুবরা\n\nইমাম আল-বায়হাকী (রহঃ)-এর প্রধান ও সবচেয়ে বিখ্যাত গ্রন্থ হলো 'আল-সুনান আল-কুবরা' (السنن الكبرى)। এটি ফিকহী মাসআলার দলিল হিসেবে ব্যবহৃত হাদিস ও আছারের সবচেয়ে বৃহৎ এবং নির্ভরযোগ্য সংকলনগুলোর মধ্যে অন্যতম।",
      "অন্যান্য গুরুত্বপূর্ণ গ্রন্থ\n\nতিনি অসংখ্য মূল্যবান গ্রন্থ রচনা করেন, যার মধ্যে রয়েছে 'কিতাব আল-দালাইল আন-নুবুওয়াহ' (নবুয়তের প্রমাণসমূহ), 'আল-আসমা ওয়াস সিফাত' (আল্লাহর নাম ও গুণাবলী) এবং শাফেয়ী ফিকহে 'আল-মা'রিফাহ'।",
      "গ্রন্থের বৈশিষ্ট্য ও মর্যাদা\n\nতাঁর গ্রন্থাবলির প্রধান বৈশিষ্ট্য হলো হাদিসের বিশুদ্ধতা যাচাইয়ের ক্ষেত্রে কঠোরতা এবং হাদিসের মাধ্যমে শাফেয়ী ফিকহের মূলনীতি প্রমাণ করা। তাঁর রচনাবলী সংখ্যায় এক হাজারেরও বেশি বলে কথিত আছে।",
      "ফিকহী জীবন ও মর্যাদা\n\nতিনি শাফেয়ী মাযহাবের একজন অন্যতম প্রধান মুখপাত্র ছিলেন। ইমাম আল-হারামাইন আল-জুয়াইনি (রহঃ) তাঁর সম্পর্কে বলেছিলেন: 'শাফেয়ী মাযহাবের এমন কোনো অনুসারী নেই, যার কাছে আল-বায়হাকীর অনুগ্রহ নেই।'",
      "প্রশাসনিক জীবন\n\nইমাম আল-বায়হাকী (রহঃ) তাঁর জ্ঞান সাধনা এবং অধ্যাপনাতেই জীবন অতিবাহিত করেন। তিনি প্রশাসনিক বা রাজনৈতিক দায়িত্ব থেকে দূরে থেকেছেন।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্রের মধ্যে উল্লেখযোগ্য হলেন: তাঁর পুত্র ইসমাইল ইবনে আহমদ এবং আবু সাদ ইবনে আবি সাদ আল-সিরাফি, যিনি তাঁর গ্রন্থগুলো প্রচারের দায়িত্ব নেন।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষভাগে নিশাপুরে চলে আসেন এবং সেখানেই অধ্যাপনায় নিয়োজিত থাকেন। তিনি ৪৫৮ হিজরিতে (১০৬৬ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও দাফন\n\nতাঁর মৃত্যুর পর তাঁকে তাঁর জন্মস্থান বায়হাক অঞ্চলে নিয়ে যাওয়া হয় এবং সেখানেই দাফন করা হয়।",
      "ইমাম আল-বায়হাকী (রহঃ)-এর এই বিপুল অবদান মুসলিম উম্মাহর জন্য হাদিস ও ফিকহের এক বিশাল জ্ঞানভান্ডার রেখে গেছে, যা আজও পঠিত ও অনুসরণ করা হয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_ghazali",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-গাযালী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-গাযালী (রহঃ)-এর পূর্ণ নাম হলো আবু হামিদ মুহাম্মদ ইবনে মুহাম্মদ ইবনে মুহাম্মদ ইবনে আহমাদ আল-গাযালী আল-তুসী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ পণ্ডিত, যাঁর প্রভাব ধর্মতত্ত্ব, ফিকহ ও দর্শন—সর্বত্র বিস্তৃত ছিল।",
      "নাম ও পরিচিতি\n\nতাঁর উপনাম ছিল আবু হামিদ। তাঁকে 'আল-গাযালী' বলা হতো, যা হয় তাঁর পৈত্রিক পেশা সূতা কাটা (গাযযাল) থেকে এসেছে অথবা তাঁর জন্মস্থান তুসের পার্শ্ববর্তী 'গাযালা' গ্রাম থেকে এসেছে। তাঁর অসাধারণ জ্ঞানের জন্য তিনি 'হুজ্জাতুল ইসলাম' (ইসলামের প্রমাণ) উপাধি লাভ করেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৪৫০ হিজরিতে (১০৫৮ খ্রিস্টাব্দে) খোরাসান অঞ্চলের তুস শহরে জন্মগ্রহণ করেন। শৈশবেই তিনি পিতৃহীন হন, কিন্তু তাঁর পিতা মৃত্যুর আগে তাঁর শিক্ষার জন্য একজন সুফি বন্ধুর কাছে তাঁর সন্তানদের দেখাশোনার দায়িত্ব দিয়ে যান।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি নিজ শহরে প্রাথমিক শিক্ষা শেষ করে নিশাপুরে গমন করেন। তাঁর প্রখর মেধা ছিল, যার ফলস্বরূপ তিনি অল্প বয়সেই হাদিস, ফিকহ ও ধর্মতত্ত্বের মূলনীতিগুলি আয়ত্ত করেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতাঁর সবচেয়ে গুরুত্বপূর্ণ শিক্ষক ছিলেন নিশাপুরের নিজামিয়া মাদ্রাসার প্রধান ইমাম আল-জুয়াইনি (ইমামুল হারামাইন)। আল-গাযালী (রহঃ) তাঁর নিকট ফিকহ, উসূল এবং ধর্মতত্ত্বের সর্বোচ্চ জ্ঞান অর্জন করেন। তিনি নিজামুল মুলকের পৃষ্ঠপোষকতা লাভ করেন।",
      "কর্মজীবন ও খ্যাতি\n\nইমাম আল-জুয়াইনির মৃত্যুর পর, নিজামুল মুলক তাঁকে বাগদাদের বিখ্যাত নিজামিয়া মাদ্রাসার প্রধান অধ্যাপক হিসেবে নিযুক্ত করেন। তখন তাঁর বয়স ছিল মাত্র ৩৪ বছর। বাগদাদে তাঁর জ্ঞান ও খ্যাতি দ্রুত মুসলিম বিশ্বে ছড়িয়ে পড়ে।",
      "প্রধান গ্রন্থ: তাহাফুত আল-ফালাসফা\n\nতাঁর প্রথম জীবনের গুরুত্বপূর্ণ গ্রন্থ হলো 'তাহাফুত আল-ফালাসফা' (দার্শনিকদের অসামঞ্জস্যতা)। এই গ্রন্থে তিনি তৎকালীন গ্রিক দর্শন দ্বারা প্রভাবিত মুসলিম দার্শনিকদের যুক্তিগুলোকে খণ্ডন করেন, যা ইসলামি ধর্মতত্ত্বের ভিত্তিকে মজবুত করে।",
      "আধ্যাত্মিক সংকট ও নির্জনতা\n\nখ্যাতির শীর্ষে থাকা অবস্থায় তিনি এক গভীর আধ্যাত্মিক সংকটে পড়েন। তিনি তাঁর জ্ঞান, খ্যাতি ও পদকে অর্থহীন মনে করেন এবং সত্যের সন্ধানে বেরিয়ে পড়েন।",
      "পাঁচ বছরের ভ্রমণ\n\nতিনি রাজকীয় পদ ও অধ্যাপনা ত্যাগ করে প্রায় পাঁচ বছর নির্জন জীবন ও সফরে কাটান। এই সময়ে তিনি সুফিবাদের চর্চা করেন এবং অভ্যন্তরীণ পরিশুদ্ধির মাধ্যমে হৃদয়ের জ্ঞান অর্জন করেন। তিনি মক্কা, মদীনা, জেরুজালেম এবং দামেস্কে ভ্রমণ করেন।",
      "আধ্যাত্মিক জ্ঞানের ফসল: ইহইয়া উলূমিদ্দীন\n\nতাঁর এই আধ্যাত্মিক সফরের ফসল হলো তাঁর শ্রেষ্ঠ রচনা 'ইহইয়া উলূমিদ্দীন' (ধর্মীয় জ্ঞানসমূহের পুনরুজ্জীবন)। এই গ্রন্থে তিনি ফিকহ, ধর্মতত্ত্ব এবং সুফিবাদের নৈতিকতা ও আধ্যাত্মিকতা—এই তিনের মধ্যে সমন্বয় সাধন করেন।",
      "ইহইয়া উলূমিদ্দীনের গুরুত্ব\n\nএই গ্রন্থটি ইসলামী সাহিত্যের একটি অন্যতম শ্রেষ্ঠ গ্রন্থ হিসেবে বিবেচিত। এটি মুসলিমদের ধর্মীয় জীবনকে কেবল বাহ্যিক আনুষ্ঠানিকতার মধ্যে সীমাবদ্ধ না রেখে, অভ্যন্তরীণ পরিশুদ্ধির (ইহসান) ওপর জোর দেয়।",
      "ফিকহী অবস্থান\n\nতিনি শাফেয়ী মাযহাবের অনুসারী ছিলেন এবং শাফেয়ী ফিকহে তাঁর বহু অবদান রয়েছে। যদিও পরবর্তী জীবনে তাঁর আগ্রহ ফিকহ থেকে সুফিবাদের দিকে বেশি ছিল।",
      "পুনরায় শিক্ষাদান\n\nদীর্ঘকাল নির্জন থাকার পর, তিনি আবার অধ্যাপনা শুরু করেন, তবে তাঁর মনন ও চিন্তাধারা ততদিনে সম্পূর্ণরূপে পরিবর্তিত হয়েছিল। তিনি নিশাপুরের নিজামিয়া মাদ্রাসায় ফিরে এসে স্বল্পকালের জন্য শিক্ষাদান করেন।",
      "অন্যান্য গ্রন্থ\n\nতাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থ হলো মিজান আল-আমাল, আইয়্যুহাল ওয়ালাদ, এবং আল-মুস্তাফা ফি উসূলিল ফিকহ।",
      "আল-গাযালী (রহঃ)-এর সংস্কার\n\nআল-গাযালী (রহঃ) তাঁর সময়ের ধর্ম ও দর্শনের মধ্যে সৃষ্ট বিভেদ দূর করে ইসলামি জ্ঞানকে একটি সমন্বিত কাঠামোতে ফিরিয়ে আনেন। তাঁর এই অবদান তাঁকে 'হুজ্জাতুল ইসলাম' উপাধি এনে দেয়।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় তুস শহরে তাঁর বাড়িতে হাদিস শিক্ষা এবং ইবাদত করে কাটান। তিনি ৫০৫ হিজরিতে (১১১১ খ্রিস্টাব্দে) তুস শহরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর ইন্তেকালের পর তাঁর জানাযায় বহু মানুষ সমবেত হন। ইমাম আল-গাযালী (রহঃ) তাঁর জ্ঞান, সাহস এবং আধ্যাত্মিকতার মাধ্যমে মুসলিম বিশ্বের চিন্তাধারাকে স্থায়ীভাবে প্রভাবিত করেছেন।",
      "তাঁর জীবনের মোড় পরিবর্তন প্রমাণ করে যে, প্রকৃত জ্ঞান কেবল পুঁথিগত নয়, বরং আধ্যাত্মিক অভিজ্ঞতা ও আন্তরিকতার মাধ্যমেও অর্জন করা সম্ভব।",
      "তাঁর রচনাবলী আজো মুসলিম এবং অমুসলিম পণ্ডিতদের কাছে সমানভাবে সমাদৃত।",
      "ইমাম আল-গাযালী (রহঃ) সর্বজনীনভাবে স্বীকৃত এমন একজন মনীষী, যিনি ইসলামি ইতিহাসের এক ক্রান্তিকালে পথপ্রদর্শকের ভূমিকা পালন করেছিলেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-সুবকী, তবাকাত আল-শাফি'য়্যাহ আল-কুবরা"
  },
  {
    "id": "imam_ibn_rushd",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে রুশদ (আভেরোস) (রহঃ)",
    "paragraphs": [
      "ইবনে রুশদ (রহঃ)-এর পূর্ণ নাম হলো আবু আল-ওয়ালীদ মুহাম্মদ ইবনে আহমাদ ইবনে রুশদ। তিনি ছিলেন আন্দালুসের স্বর্ণযুগের অন্যতম শ্রেষ্ঠ পণ্ডিত, যাঁর জ্ঞান ফিকহ, দর্শন, যুক্তিবিদ্যা, চিকিৎসা, এবং জ্যোতির্বিজ্ঞান সহ বহু ক্ষেত্রে বিস্তৃত ছিল।",
      "নাম ও পরিচিতি\n\nতাঁর উপাধি ছিল 'আল-হাফিয' এবং 'শাইখ আল-ইসলাম'। তিনি মূলত মালিকি মাযহাবের একজন অত্যন্ত গভীর ফকীহ ছিলেন। পাশ্চাত্য জগতে তাঁর পাণ্ডিত্যপূর্ণ দার্শনিক কাজের জন্য তিনি আভেরোস নামে পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৫২০ হিজরিতে (১১২৬ খ্রিস্টাব্দে) তৎকালীন মুসলিম আন্দালুসের রাজধানী কর্ডোভায় জন্মগ্রহণ করেন। তাঁর পরিবার ছিল অত্যন্ত সম্মানিত এবং জ্ঞানচর্চায় প্রসিদ্ধ।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা ও পিতামহ উভয়েই ছিলেন কর্ডোভার প্রধান বিচারপতি (কাজী)। ফলে তিনি শৈশব থেকেই ফিকহ ও প্রশাসনিক জ্ঞানের এক অনুকূল পরিবেশে বেড়ে ওঠেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nইবনে রুশদ (রহঃ) তাঁর নিজ শহরে প্রাথমিক শিক্ষা সম্পন্ন করেন। তিনি অত্যন্ত প্রখর মেধার অধিকারী ছিলেন এবং অল্প বয়সেই ফিকহ, হাদিস ও আরবী সাহিত্যে গভীর জ্ঞান অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের শ্রেষ্ঠ পণ্ডিতদের কাছে শিক্ষা লাভ করেন। ফিকহে তাঁর উস্তাদ ছিলেন আবু আল-কাসিম ইবনে বাশকুয়াল এবং চিকিৎসাবিদ্যায় তিনি আবু জাফর ইবনে হারুন আল-তুরুজালী-এর নিকট শিক্ষা গ্রহণ করেন।",
      "জ্ঞান অন্বেষণ\n\nহাদিস, ফিকহ এবং ধর্মীয় জ্ঞান ছাড়াও তিনি গ্রিক দর্শন, বিশেষ করে এরিস্টটলের দর্শনে গভীরভাবে মনোনিবেশ করেন। তিনি এরিস্টটলের প্রায় সব কাজের ব্যাখ্যা লেখেন।",
      "কর্মজীবন ও প্রশাসনিক ভূমিকা\n\nইবনে রুশদ (রহঃ) প্রথমে সেভিলে কাজীর (বিচারপতি) পদে নিযুক্ত হন। পরবর্তীতে তিনি তাঁর জন্মস্থান কর্ডোভার প্রধান বিচারপতি এবং আল-মুওয়াহহিদ শাসক আবু ইয়াকুব ইউসুফের ব্যক্তিগত চিকিৎসক হিসেবে দায়িত্ব পালন করেন।",
      "প্রধান গ্রন্থ: বিদায়াতুল মুজতাহিদ\n\nফিকহের ক্ষেত্রে তাঁর সবচেয়ে বিখ্যাত গ্রন্থ হলো 'বিদায়াতুল মুজতাহিদ ওয়া নিহায়াতুল মুকতাসিদ'। এই গ্রন্থে তিনি মালিকি ফিকহের বাইরেও অন্যান্য মাযহাবের ফিকহী মতপার্থক্যগুলো এবং তাদের পেছনের দলীলগুলো তুলনামূলকভাবে উপস্থাপন করেন।",
      "দার্শনিক গ্রন্থ: তাহাফুত আল-তাহাফুত\n\nইমাম আল-গাযালী (রহঃ) তাঁর তাহাফুত আল-ফালাসফা (দার্শনিকদের অসামঞ্জস্যতা) গ্রন্থে দার্শনিকদের যুক্তি খণ্ডন করেছিলেন। ইবনে রুশদ (রহঃ) সেই গ্রন্থের জবাব হিসেবে 'তাহাফুত আল-তাহাফুত' (অসামঞ্জস্যতার অসামঞ্জস্যতা) রচনা করেন, যেখানে তিনি দর্শন ও ধর্মের মধ্যে সামঞ্জস্য আনার চেষ্টা করেন।",
      "তাঁর দার্শনিক দৃষ্টিভঙ্গি\n\nইবনে রুশদ (রহঃ) মনে করতেন যে, ধর্ম ও দর্শন (ওহী এবং যুক্তি) একে অপরের পরিপূরক এবং সত্যের দিকে নিয়ে যায়। তাঁর এই সমন্বয়ের প্রচেষ্টা তাঁকে তৎকালীন ধর্মীয় গোঁড়ামির মুখে ফেলে দেয়।",
      "রাজনৈতিক পরীক্ষা ও নির্বাসন\n\nজীবনের শেষভাগে তাঁকে রাজনৈতিক ও ধর্মীয় বিতর্কের শিকার হতে হয়। তাঁর দার্শনিক মতামতকে ধর্মবিরোধী বলে মনে করা হলে, আল-মুওয়াহহিদ শাসক আল-মনসুর তাঁকে নির্বাসিত করেন এবং তাঁর গ্রন্থগুলো পুড়িয়ে ফেলার নির্দেশ দেন।",
      "নির্বাসনের পর ফিরে আসা\n\nকিছুকাল পর খলিফা আল-মনসুর তাঁর ভুল বুঝতে পেরে ইবনে রুশদ (রহঃ)-কে আবার সম্মানজনক পদে ফিরিয়ে আনেন এবং তাঁর নির্বাসন প্রত্যাহার করেন।",
      "চিকিৎসা ও অন্যান্য অবদান\n\nচিকিৎসাশাস্ত্রে তাঁর অবদান ছিল বিশাল। তিনি কিতাব আল-কুল্লিয়াত ফি আল-তিব্ব (সাধারণ চিকিৎসা নীতি) নামে একটি বিখ্যাত গ্রন্থ রচনা করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র ছিল, যারা তাঁর ফিকহী ও দার্শনিক জ্ঞানকে পরবর্তী প্রজন্মের কাছে পৌঁছে দেন।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি তাঁর জীবনের শেষ সময় মরক্কোর মারাকেশে কাটান। তিনি ৫৯৫ হিজরিতে (১১৯৮ খ্রিস্টাব্দে) মারাকেশে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর মৃত্যুর পর তাঁর মরদেহ কর্ডোভায় ফিরিয়ে এনে দাফন করা হয়। ইবনে রুশদ (রহঃ) তাঁর বহুমুখী জ্ঞান, বিশেষত দর্শন ও ফিকহের মধ্যে সেতু স্থাপনের জন্য বিশ্বব্যাপী এক কিংবদন্তী পণ্ডিত হিসেবে স্মরণীয় হয়ে আছেন।",
      "তাঁর দার্শনিক কাজগুলো মধ্যযুগে ইউরোপীয় রেনেসাঁ এবং পাশ্চাত্যের যুক্তিবাদী চিন্তাধারার ওপর বিশাল প্রভাব ফেলেছিল।",
      "ইবনে রুশদ (রহঃ)-এর জীবন প্রমাণ করে যে, প্রকৃত আলেম ধর্মীয় জ্ঞানকে যুক্তিবাদ ও প্রজ্ঞার মাধ্যমে আরও শক্তিশালী করতে পারে।"
    ],
    "source": "ইবনে আবি উসাইবিআহ, উয়ূন আল-আনবা ফি তাবাকাত আল-আতিব্বা; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_al_razi",
    "categoryId": "imam_jibon",
    "title": "ইমাম ফখরুদ্দীন আর-রাযী (রহঃ)",
    "paragraphs": [
      "ইমাম ফখরুদ্দীন আর-রাযী (রহঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ মুহাম্মদ ইবনে উমর ইবনে আল-হুসাইন আল-কুরেশী আল-তাবারী আল-রাযী। তিনি ছিলেন তাঁর সময়ের 'শাইখুল ইসলাম' এবং ইসলামি ধর্মতত্ত্ব ও যুক্তিশাস্ত্রে শ্রেষ্ঠতম পণ্ডিতদের একজন।",
      "তাঁর উপনাম ছিল আবু আব্দুল্লাহ। তাঁকে জ্ঞানের গভীরতা ও যুক্তির জোরে 'শাইখুল ইসলাম' এবং 'ইমামুল মুশাক্কিকিন' (সন্দেহকারীদের ইমাম, অর্থাৎ কঠিন প্রশ্ন উত্থাপনকারী) বলা হতো।",
      "তিনি প্রধানত তাফসীর, ধর্মতত্ত্ব (কালাম), ফিকহ ও দর্শন শাস্ত্রে তাঁর গভীর জ্ঞানের জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৫৪৩ হিজরিতে (১১৪৯ খ্রিস্টাব্দে) পারস্যের রায় শহরে জন্মগ্রহণ করেন। তাঁর পরিবার ছিল উচ্চ শিক্ষাসম্পন্ন এবং জ্ঞানচর্চার সঙ্গে যুক্ত।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা ছিলেন একজন বক্তা ও ধর্মতত্ত্ববিদ। তিনি তাঁর পিতার কাছ থেকে প্রাথমিক জ্ঞান অর্জন করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি অত্যন্ত প্রখর মেধার অধিকারী ছিলেন। শৈশবেই তিনি নিশাপুরে গমন করেন এবং সেখানে পড়াশোনা করেন।",
      "তিনি অল্প বয়সেই হাদিস, ফিকহ এবং যুক্তিশাস্ত্রের (মানতিক) মূলনীতিগুলিতে অসাধারণ দক্ষতা অর্জন করেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি প্রধানত মজিদ আল-দীন আল-জিলির নিকট শাফেয়ী ফিকহ এবং আল-আশ'আরী ধর্মতত্ত্ব শেখেন।",
      "কর্মজীবন ও খ্যাতি\n\nতিনি খোরাসান, মার্ভ, বালখ এবং হেরাট সহ বিভিন্ন শহরে শিক্ষাদান করেন এবং তাঁর খ্যাতি দ্রুত ছড়িয়ে পড়ে।",
      "প্রধান গ্রন্থ: তাফসীরে কাবীর\n\nতাঁর প্রধান ও সবচেয়ে বিখ্যাত গ্রন্থ হলো 'মাফাতীহ আল-গাইব' যা 'তাফসীরে কাবীর' নামে পরিচিত। এটি কুরআনের এক বিশাল তাফসীর গ্রন্থ।",
      "গ্রন্থের বৈশিষ্ট্য\n\nতাফসীরে কাবীরের বিশেষত্ব হলো এতে ফিকহ, ধর্মতত্ত্ব, দর্শন, বিজ্ঞান এবং যুক্তির আলোকে কুরআনের ব্যাখ্যা দেওয়া হয়েছে। এটি তাঁর সময়ের জ্ঞানের বিশালতাকে প্রতিফলিত করে।",
      "দার্শনিক অবদান\n\nতিনি দর্শন ও ধর্মতত্ত্বের মধ্যে সেতুবন্ধন তৈরি করতে চেয়েছিলেন এবং তাঁর যুক্তিগুলো পরবর্তী আলিমদের জন্য গুরুত্বপূর্ণ ভিত্তি হিসেবে কাজ করেছে।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্ররা মুসলিম বিশ্বের বিভিন্ন স্থানে তাঁর জ্ঞানকে ছড়িয়ে দেন। ছাত্রদের মধ্যে উল্লেখযোগ্য ছিলেন ঐতিহাসিক ইবনে আল-কাসেসি এবং শাফেয়ী ফকীহরা।",
      "বিতর্ক ও পরীক্ষা\n\nতাঁর ধর্মতাত্ত্বিক যুক্তি এবং দার্শনিক ব্যাখ্যা মাঝে মাঝে তাঁর সমসাময়িক কিছু গোঁড়া আলেমের সমালোচনার মুখে পড়েছিল।",
      "তিনি বিতর্কের মাধ্যমে সত্যকে তুলে ধরার ক্ষেত্রে নির্ভীক ছিলেন।",
      "ফিকহী অবস্থান\n\nতিনি শাফেয়ী ফিকহের একজন অনুসারী ছিলেন এবং ফিকহের ক্ষেত্রে তাঁর বহু মূল্যবান অবদান রয়েছে।",
      "সফর ও শেষ জীবন\n\nতিনি শিক্ষকতা ও গ্রন্থ রচনার পাশাপাশি বহু স্থানে ভ্রমণ করেন। জীবনের শেষভাগ তিনি হেরাট শহরে অতিবাহিত করেন।",
      "মৃত্যু\n\nইমাম ফখরুদ্দীন আর-রাযী (রহঃ) ৬০৬ হিজরিতে (১২১০ খ্রিস্টাব্দে) হেরাটে ইন্তেকাল করেন। মৃত্যুকালে তাঁর বয়স হয়েছিল ৬৩ বছর।",
      "জানাযা ও মর্যাদা\n\nতাঁর ইন্তেকালের পর তাঁর জানাযায় বিশাল জনসমাগম হয়। তিনি তাঁর জ্ঞান, প্রজ্ঞা এবং যুক্তিবাদী চিন্তাধারার জন্য মুসলিম বিশ্বে চিরস্মরণীয়।",
      "ইমাম আর-রাযী (রহঃ)-এর জীবন প্রমাণ করে যে, একজন আলেম ধর্মীয় জ্ঞানের সাথে যুক্তিশাস্ত্র এবং দর্শনকে সমন্বয় করে ইসলামি জ্ঞানকে আরও শক্তিশালী করতে পারে।"
    ],
    "source": "ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান; ইমাম যাহাবী, সিয়ারু আ’লামিন নুবালা"
  },
  {
    "id": "imam_ibn_al_athir",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে আল-আছীর আল-জাযারী (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে আল-আছীর (রহঃ)-এর পূর্ণ নাম হলো ইযযুদ্দিন আবুল হাসান আলী ইবনে মুহাম্মদ ইবনে আব্দুল কারিম ইবনে আব্দুল ওয়াহিদ আল-জাযারী। তিনি ছিলেন একজন বিখ্যাত ঐতিহাসিক, মুহাদ্দিস এবং জীবনীকার (রিজাল শাস্ত্রের পণ্ডিত)।",
      "তিনি 'ইবনে আল-আছীর' নামে পরিচিত, যা তাঁর বংশগত উপাধি। তিনি তিন ভাইয়ের মধ্যে একজন ছিলেন, যাদের প্রত্যেকেই নিজ নিজ ক্ষেত্রে প্রভাবশালী পণ্ডিত ছিলেন।",
      "তাঁর উপনাম ছিল আবুল হাসান। তিনি ইতিহাস, হাদিস ও জীবনীশাস্ত্রে তাঁর অসামান্য অবদানের জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৫৪০ হিজরিতে (১১৪৫ খ্রিস্টাব্দে) ইবনে উমর দ্বীপে জন্মগ্রহণ করেন, যা তৎকালীন জাযিরা (উত্তর মেসোপটেমিয়া) অঞ্চলে অবস্থিত ছিল।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার ছিল মসুল অঞ্চলের উচ্চবংশীয় এবং জ্ঞানচর্চায় প্রসিদ্ধ। তাঁর ভাই দিয়া আল-দীন ইবনে আল-আছীর ছিলেন বিখ্যাত আরবী সাহিত্য সমালোচক।",
      "শিক্ষা ও মেধা\n\nতিনি হাদিস ও ফিকহ শাস্ত্রে জ্ঞান অর্জন করলেও ইতিহাস ও জীবনীশাস্ত্রে তাঁর অবদান শ্রেষ্ঠতম।",
      "তিনি মসুল, বসরা, বাগদাদ এবং সিরিয়া সহ বিভিন্ন জ্ঞানকেন্দ্রে শিক্ষা লাভ করেন।",
      "তিনি হাদিস ও সীরাত (নবীজির জীবনী) সম্পর্কে গভীরভাবে অধ্যয়ন করেন।",
      "প্রধান গ্রন্থ: আল-কামিল ফিত-তারীখ\n\nতাঁর প্রধান গ্রন্থ হলো 'আল-কামিল ফিত-তারীখ' (সম্পূর্ণ ইতিহাস), যা সৃষ্টির শুরু থেকে তাঁর সময় (১২৩১ খ্রিস্টাব্দ) পর্যন্ত মুসলিম বিশ্বের এক বিশাল ইতিহাস গ্রন্থ।",
      "এই গ্রন্থটি ঐতিহাসিক তথ্যের নির্ভরযোগ্যতা এবং বিন্যাসের জন্য বিখ্যাত এবং পরবর্তী ঐতিহাসিকদের জন্য প্রধান ভিত্তি হিসেবে কাজ করেছে।",
      "অন্যান্য গ্রন্থ\n\nহাদিসের ক্ষেত্রে তাঁর অন্যতম গুরুত্বপূর্ণ গ্রন্থ হলো 'উসদুল গাবাহ ফি মা'রিফাতিস সাহাবাহ' (সাহাবীদের জীবনী), যেখানে তিনি প্রায় ৭,০০০ সাহাবীর জীবনী সংকলন করেছেন।",
      "তাঁর এই জীবনী সংকলন সাহাবীদের জীবন ও অবদান জানার ক্ষেত্রে অন্যতম গুরুত্বপূর্ণ উৎস।",
      "তিনি হাদিসের বর্ণনাকারীদের যাচাইয়ের পদ্ধতি (রিজাল শাস্ত্র) নিয়েও কাজ করেছেন।",
      "শিক্ষকবৃন্দ\n\nতিনি তাঁর সময়ের শ্রেষ্ঠ মুহাদ্দিস ও ঐতিহাসিকদের কাছ থেকে জ্ঞান লাভ করেন।",
      "কর্মজীবন\n\nতিনি মসুল ও আলেপ্পোর সালাহুদ্দীন আল-আইয়ুবীর বংশধরদের অধীনে বিভিন্ন প্রশাসনিক ও শিক্ষামূলক কাজে নিয়োজিত ছিলেন।",
      "সফর\n\nজ্ঞান অর্জনের পাশাপাশি তিনি প্রশাসনিক কারণে সিরিয়া ও মিশর পর্যন্ত সফর করেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত বিনয়ী, পরহেজগার এবং সত্যবাদী। তাঁর লেখার সততা তাঁকে ঐতিহাসিকদের মধ্যে বিশেষ মর্যাদা দিয়েছে।",
      "মৃত্যু\n\nইমাম ইবনে আল-আছীর (রহঃ) ৬৩০ হিজরিতে (১২৩৩ খ্রিস্টাব্দে) মসুল শহরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইবনে আল-আছীর (রহঃ)-এর জীবন প্রমাণ করে যে, মুসলিম মনীষীগণ ইতিহাস ও হাদিস উভয় জ্ঞানকে সমান গুরুত্ব দিয়ে ইসলামের উত্তরাধিকার সংরক্ষণ করেছেন।",
      "তাঁর গ্রন্থাবলি মুসলিম ও পাশ্চাত্য উভয় ঐতিহাসিকদের কাছেই সমানভাবে মূল্যবান।"
    ],
    "source": "ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান; ইমাম যাহাবী, সিয়ারু আ’লামিন নুবালা"
  },
  {
    "id": "imam_ibn_al_jawzi",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে আল-জাওযী (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে আল-জাওযী (রহঃ)-এর পূর্ণ নাম হলো আবুল ফারাজ আব্দুর রহমান ইবনে আলী ইবনে মুহাম্মদ আল-জাওযী। তিনি ছিলেন একজন হাম্বলি ফকীহ, ইতিহাসবিদ, মুহাদ্দিস, মুফাসসির এবং বাগদাদের অন্যতম শ্রেষ্ঠ বক্তা ও লেখক।",
      "তাঁর উপনাম ছিল আবুল ফারাজ। তিনি বাগদাদে 'জাওযা' নামক একটি স্থানে থাকতেন, যেখান থেকে তাঁর উপাধি 'আল-জাওযী' এসেছে। তাঁকে 'জাওযী আল-হাম্বলী' নামেও ডাকা হতো।",
      "তিনি তাঁর সময়ের অন্যতম সেরা পণ্ডিত ও লেখক হিসেবে পরিচিত, যিনি প্রায় শতাধিক গ্রন্থ রচনা করেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৫১০ হিজরিতে (১১১৬ খ্রিস্টাব্দে) আব্বাসীয় খিলাফতের কেন্দ্র বাগদাদে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি ছোটবেলাতেই পিতাকে হারান এবং তাঁর ফুফুর তত্ত্বাবধানে লালিত-পালিত হন।",
      "শিক্ষা ও মেধা\n\nতিনি শৈশব থেকেই জ্ঞানার্জনে মনোযোগী ছিলেন। তিনি হাদিস মুখস্থ করার ক্ষেত্রে এবং বিভিন্ন বিষয়ে লেখার ক্ষেত্রে অসাধারণ মেধার অধিকারী ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের বিখ্যাত হাম্বলি ফকীহ ও মুহাদ্দিসদের কাছ থেকে শিক্ষা লাভ করেন। তাঁর প্রধান উস্তাদদের মধ্যে অন্যতম হলেন ইবনে আল-যাগুনী (রহঃ)।",
      "তিনি হাদিসশাস্ত্রের সকল শাখা, বিশেষ করে 'ইলমুল রিজাল' (বর্ণনাকারীর জ্ঞান) বিষয়ে দক্ষতা অর্জন করেন।",
      "কর্মজীবন\n\nতিনি হাম্বলি মাযহাবের শিক্ষক ও মুফতি হিসেবে কাজ করেন এবং বাগদাদের নিজামিয়া মাদ্রাসা সহ বিভিন্ন স্থানে অধ্যাপনা করেন।",
      "প্রধান গ্রন্থ: তালবিসু ইবলিস\n\nতাঁর উল্লেখযোগ্য গ্রন্থ হলো 'তালবিসু ইবলিস' (শয়তানের প্রতারণা), যা ধর্মীয় জীবনে সৃষ্ট ভুল ধারণা ও গোঁড়ামিকে দূর করার জন্য লেখা হয়েছিল।",
      "তাঁর রচিত 'যাদ আল-মাসীর' একটি বহুল পঠিত তাফসীর গ্রন্থ। এটি তাঁর তাফসীর জ্ঞানের গভীরতা প্রমাণ করে।",
      "তাঁর আরেকটি সুবিশাল ইতিহাস গ্রন্থ হলো 'আল-মুনতাযাম ফি তারীখিল মুলুকি ওয়াল উমাম'।",
      "বক্তা হিসেবে খ্যাতি\n\nইবনে আল-জাওযী (রহঃ) বাগদাদের অন্যতম শ্রেষ্ঠ বক্তা ছিলেন। তাঁর ওয়াজ (ধর্মীয় আলোচনা) শুনতে হাজার হাজার মানুষ একত্রিত হতেন এবং এর ফলে বহু মানুষ অসৎ পথ ছেড়ে সৎ পথে ফিরে এসেছিল।",
      "বিতর্ক ও পরীক্ষা\n\nজীবনের শেষভাগে তিনি তৎকালীন হাম্বলি ফকীহদের কিছু ধর্মতাত্ত্বিক মতের বিরোধিতা করার কারণে রাজনৈতিক বিতর্কের শিকার হন এবং সাময়িকভাবে তাঁকে বাগদাদ থেকে দূরে থাকতে হয়।",
      "রাজনৈতিক সম্পর্ক\n\nতিনি আব্বাসীয় খলিফাদের সাথে সুসম্পর্ক বজায় রাখতেন এবং জ্ঞান ও ফিকহের মাধ্যমে তাঁদের উপদেশ দিতেন।",
      "তাঁর লেখার সংখ্যা\n\nধারণা করা হয়, তিনি তাঁর জীবনকালে এক হাজারেরও বেশি ছোট-বড় গ্রন্থ রচনা করেছিলেন।",
      "মৃত্যু\n\nইমাম ইবনে আল-জাওযী (রহঃ) ৫৯৭ হিজরিতে (১২০১ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর মৃত্যুর পর তাঁর জানাযায় এতো বিপুল সংখ্যক মানুষ অংশ নেয়, যা তাঁর জনপ্রিয়তার প্রমাণ দেয়।",
      "ইমাম ইবনে আল-জাওযী (রহঃ)-এর জীবন প্রমাণ করে যে, একজন আলেম ধর্মীয় জ্ঞানের বিভিন্ন শাখায় তাঁর বিপুল উৎপাদনশীলতা, প্রখর বুদ্ধি এবং সাধারণ মানুষের মধ্যে সঠিক ইসলামী জ্ঞান প্রচারের এক উজ্জ্বল দৃষ্টান্ত।",
      "তাঁর রচিত গ্রন্থাবলি হাম্বলি মাযহাবের জন্য বিশেষ গুরুত্বপূর্ণ।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ’লামিন নুবালা"
  },
  {
    "id": "imam_al_qurtubi",
    "categoryId": "imam_jibon",
    "title": "ইমাম কুরতুবী (রহঃ)",
    "paragraphs": [
      "ইমাম কুরতুবী (রহঃ)-এর পূর্ণ নাম হলো আবু আবদুল্লাহ মুহাম্মদ ইবনে আহমাদ ইবনে আবি বকর ইবনে ফারাহ আল-আনসারী আল-কুরতুবী। তিনি ছিলেন একজন মালিকি ফকীহ, হাদিস পণ্ডিত এবং তাফসীরশাস্ত্রের একজন মহান ইমাম।",
      "নাম ও পরিচিতি\n\nতাঁর উপনাম ছিল আবু আবদুল্লাহ। তাঁকে 'কুরতুবী' বলা হয়, কারণ তিনি আন্দালুসের (স্পেন) কর্ডোভা (কুরতুবা) শহরে জন্মগ্রহণ করেন।",
      "তিনি প্রধানত তাঁর কালজয়ী তাফসীর গ্রন্থের জন্য বিখ্যাত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৬০০ হিজরি (১২০৪ খ্রিস্টাব্দে) আন্দালুসের অন্যতম প্রধান শহর কর্ডোভায় জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি একটি সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন।",
      "শিক্ষা ও মেধা\n\nতিনি তাঁর নিজ শহর কর্ডোভায় প্রাথমিক শিক্ষা সম্পন্ন করেন এবং হাদিস ও ফিকহের প্রাথমিক জ্ঞান অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nআন্দালুসে মুসলিম শাসনের পতনের পর তিনি মিশরে হিজরত করেন এবং সেখানে তাঁর জ্ঞানের প্রসার ঘটে। মিশরে তিনি বহু আলেমের কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "তিনি কায়রোতে আবুল আব্বাস আল-কুরতুবী সহ বিভিন্ন আলেমের নিকট হাদিস ও ফিকহ শাস্ত্রের জ্ঞান লাভ করেন।",
      "তিনি হাদিস ও ফিকহের ক্ষেত্রে মালিকি মাযহাবের অনুসরণ করতেন।",
      "প্রধান গ্রন্থ: তাফসীর আল-কুরতুবী\n\nতাঁর প্রধান ও সবচেয়ে বিখ্যাত গ্রন্থ হলো 'আল-জামি লি আহকাম আল-কুরআন' যা 'তাফসীর আল-কুরতুবী' নামেই পরিচিত।",
      "গ্রন্থের উদ্দেশ্য\n\nএই তাফসীর গ্রন্থটির প্রধান উদ্দেশ্য হলো কুরআনের আয়াত থেকে ফিকহী আহকাম (আইনী বিধান) বের করা এবং তা নিয়ে বিভিন্ন মাযহাবের ব্যাখ্যা ও দলীল তুলে ধরা।",
      "গ্রন্থের বৈশিষ্ট্য\n\nতাফসীরে কুরতুবীর বিশেষত্ব হলো এটি মালিকি মাযহাবের পাশাপাশি শাফেয়ী, হানাফি এবং হাম্বলি মাযহাবের ফিকহী মতও বিস্তারিতভাবে আলোচনা করে।",
      "এছাড়াও তিনি আরবি ভাষা, হাদিস ও সীরাত নিয়ে বহু মূল্যবান গ্রন্থ রচনা করেন।",
      "তিনি জীবনের শেষভাগ মিশরেই জ্ঞানচর্চা, অধ্যাপনা এবং গ্রন্থ রচনা করে অতিবাহিত করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর বহু ছাত্র ছিল, যারা তাঁর জ্ঞানের ধারাকে মিশর এবং উত্তর আফ্রিকায় ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত বিনয়ী, পরহেজগার এবং দুনিয়াবি মোহমুক্ত একজন আলেম। তিনি তাঁর জীবনকে আল্লাহর পথে উৎসর্গ করেছিলেন।",
      "মৃত্যু\n\nইমাম কুরতুবী (রহঃ) ৬৭১ হিজরিতে (১২৭৩ খ্রিস্টাব্দে) মিশরের মুনিয়াত বনি আল-খাসিব শহরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর গ্রন্থাবলি, বিশেষ করে তাঁর তাফসীর, মুসলিম বিশ্বে মালিকি ফিকহ ও তাফসীরশাস্ত্রের একটি মৌলিক উৎস হিসেবে অত্যন্ত উচ্চ মর্যাদা লাভ করে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_nawawi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আন-নাওয়াবী (রহঃ)",
    "paragraphs": [
      "ইমাম আন-নাওয়াবী (রহঃ)-এর পূর্ণ নাম হলো আবু যাকারিয়্যা ইয়াহইয়া ইবনে শরাফ ইবনে মুরা ইবনে হাসান ইবনে হুসাইন আন-নাওয়াবী। তিনি ছিলেন শাফেয়ী ফিকহ ও হাদিসশাস্ত্রের একজন অন্যতম শ্রেষ্ঠ ইমাম।",
      "তাঁর উপনাম ছিল আবু যাকারিয়্যা। তাঁকে 'মুহিউদ্দীন' (দ্বীনের পুনর্জীবন দানকারী) উপাধি দেওয়া হয়েছিল, যদিও তিনি নিজে এই উপাধি পছন্দ করতেন না।",
      "তিনি প্রধানত হাদিস ব্যাখ্যা এবং শাফেয়ী ফিকহ সংকলনে তাঁর অসামান্য অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৬৩১ হিজরিতে (১২৩৩ খ্রিস্টাব্দে) সিরিয়ার নাবা নামক গ্রামে জন্মগ্রহণ করেন। এই গ্রাম থেকেই তাঁর নাম 'আন-নাওয়াবী' এসেছে।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার সাধারণ জীবনযাপন করত। তাঁর পিতা তাঁকে শৈশবেই জ্ঞানার্জনের জন্য উৎসাহিত করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবে কুরআন হিফয করেন। ১০ বছর বয়সে তিনি দামেস্কের মুহাদ্দিসদের দৃষ্টি আকর্ষণ করেন এবং তাঁর প্রখর মেধার জন্য সুপরিচিত ছিলেন।",
      "শিক্ষা সফর\n\n১৮ বছর বয়সে তিনি দামেস্কের বিখ্যাত আল-রাওয়াহিয়া মাদ্রাসায় উচ্চশিক্ষার জন্য গমন করেন।",
      "তিনি দামেস্কের বিভিন্ন মাদ্রাসায় ফিকহ, হাদিস, উসূল এবং ব্যাকরণ সহ বিভিন্ন বিষয়ে শিক্ষা লাভ করেন।",
      "তাঁর শিক্ষকদের মধ্যে অন্যতম ছিলেন ইসহাক ইবনে আহমদ আল-মাগরিবী এবং ইসমাইল ইবনে আবি ইসহাক।",
      "ইমাম আন-নাওয়াবী (রহঃ) ছিলেন তাঁর সমসাময়িকদের মধ্যে সবচেয়ে জ্ঞানী এবং ধার্মিক আলেমদের মধ্যে অন্যতম।",
      "প্রধান গ্রন্থ: রিয়াজুস সালিহীন\n\nতাঁর অন্যতম শ্রেষ্ঠ এবং সবচেয়ে জনপ্রিয় গ্রন্থ হলো 'রিয়াজুস সালিহীন' (সৎকর্মশীলদের বাগান), যা বিভিন্ন ফিকহী ও নৈতিক বিষয়ে সংকলিত হাদিসের একটি অনবদ্য গ্রন্থ।",
      "তাঁর প্রধান হাদিস ব্যাখ্যা গ্রন্থ হলো 'শারহ সহীহ মুসলিম', যা সহীহ মুসলিমের সবচেয়ে নির্ভরযোগ্য ও জনপ্রিয় ব্যাখ্যা গ্রন্থ।",
      "ফিকহী অবদান\n\nশাফেয়ী ফিকহের ক্ষেত্রে তাঁর প্রধান কাজ হলো 'আল-মাজমু' শারহ আল-মুহাজ্জাব' এবং 'মিনহাজ আল-তালিবিন', যা শাফেয়ী মাযহাবের অন্যতম প্রধান ভিত্তি।",
      "ব্যক্তিগত চরিত্র ও তাকওয়া\n\nতিনি ছিলেন চরম যাহিদ (দুনিয়াবিমুখ), পরহেজগার এবং বিনয়ী। তিনি বিবাহ করেননি এবং ইবাদত ও জ্ঞান সাধনার জন্য নিজের জীবনকে উৎসর্গ করেছিলেন।",
      "তাঁর খাদ্য ছিল খুবই সাধারণ এবং তিনি শাসকগোষ্ঠী থেকে কোনো বেতন বা সুবিধা গ্রহণ করতেন না।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র ছিল, যারা তাঁর জ্ঞানের ধারাকে সিরিয়া ও মিশরে ছড়িয়ে দেন।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি মাত্র ৪৪ বছর বয়সে ইন্তেকাল করেন। জীবনের শেষ বছরগুলোতে তিনি দামেস্কের বিভিন্ন মাদ্রাসায় অধ্যাপনা করেন।",
      "তিনি ৬৭৬ হিজরিতে (১২৭৭ খ্রিস্টাব্দে) তাঁর জন্মস্থান নাবা গ্রামে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আন-নাওয়াবী (রহঃ) স্বল্প জীবনকালেও তাঁর কাজের বিশালতা এবং বিশুদ্ধতার জন্য ইতিহাসে হাদিস ও ফিকহের অন্যতম শ্রেষ্ঠ ইমাম হিসেবে গণ্য হন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ’লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_ibn_taymiyyah",
    "categoryId": "imam_jibon",
    "title": "শাইখুল ইসলাম ইবনে তাইমিয়াহ (রহঃ)",
    "paragraphs": [
      "শাইখুল ইসলাম ইবনে তাইমিয়াহ (রহঃ)-এর পূর্ণ নাম হলো তাক্বীউদ্দীন আবুল আব্বাস আহমাদ ইবনে আব্দুল হালীম ইবনে আব্দুস সালাম ইবনে তাইমিয়াহ আল-হাররানী। তিনি ছিলেন হাম্বলি ফিকহ, ধর্মতত্ত্ব ও যুক্তিবিদ্যার একজন অত্যন্ত প্রভাবশালী পণ্ডিত।",
      "তাঁর উপনাম ছিল আবুল আব্বাস এবং তাঁকে 'শাইখুল ইসলাম' উপাধিতে ভূষিত করা হয়। তিনি তাঁর সময়ের গোঁড়ামি এবং প্রচলিত বিদ'আত-এর বিরুদ্ধে সংগ্রাম করার জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৬৬১ হিজরিতে (১২৬৩ খ্রিস্টাব্দে) সিরিয়ার হাররান শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার ছিল জ্ঞানচর্চায় প্রসিদ্ধ। তাঁর পিতা ও পিতামহ উভয়েই ছিলেন হাম্বলি মাযহাবের প্রখ্যাত আলেম।",
      "শিক্ষা ও মেধা\n\nতিনি শৈশবেই তাতার বাহিনীর আক্রমণের কারণে দামেস্কে হিজরত করেন। সেখানে তিনি কুরআন, হাদিস, ফিকহ, উসূল এবং যুক্তিশাস্ত্র সহ বিভিন্ন বিষয়ে গভীর জ্ঞান অর্জন করেন।",
      "তাঁর স্মৃতিশক্তি ছিল প্রখর। তিনি অল্প বয়সেই হাম্বলি ফিকহে দক্ষতা লাভ করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের বিখ্যাত হাম্বলি ফকীহদের কাছ থেকে শিক্ষা লাভ করেন এবং পরবর্তীতে নিজে হাদিস ও তাফসীর বিষয়ে ব্যাপক অধ্যয়ন করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান রচনাবলির মধ্যে রয়েছে: 'মাজমু আল-ফাতাওয়া' (ফতোয়ার সংকলন), 'আল-জাওয়াব আস-সহীহ লিমান বাদ্দালা দ্বীন আল-মাসীহ' (খ্রিস্টধর্মের সমালোচনায় রচিত), এবং 'মিনহাজ আস-সুন্নাহ আন-নাবাওয়িয়্যাহ'।",
      "তাঁর পদ্ধতি\n\nতিনি ফিকহী মাসআলাতে কোনো একক মাযহাবের অন্ধ অনুকরণ না করে সরাসরি কুরআন ও সহীহ হাদিসের দলিলের ওপর ভিত্তি করে ইজতিহাদ করতেন।",
      "রাজনৈতিক ও সামাজিক ভূমিকা\n\nতিনি তাতারদের বিরুদ্ধে জিহাদের ডাক দেন এবং শাসকগোষ্ঠীকে শরিয়তের পথে চলার আহ্বান জানান।",
      "বিতর্ক ও কারাবাস\n\nতাঁর ফিকহী ও ধর্মতাত্ত্বিক মতবাদ (যেমন: আল্লাহর সিফাত এবং সুফিদের কিছু চর্চার সমালোচনা) তৎকালীন অনেক আলেমকে ক্ষুব্ধ করে। এর ফলে তাঁর জীবনের বিভিন্ন সময়ে তাঁকে কারাবরণ করতে হয়।",
      "তিনি কায়রোর দুর্গ, আলেক্সান্দ্রিয়া এবং দামেস্কের দুর্গে বন্দী জীবন কাটান।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে অন্যতম শ্রেষ্ঠ হলেন হাফিয ইবনে কাইয়্যিম আল-জাওযিয়াহ এবং হাফিয ইবনে কাসীর।",
      "তাঁদের মাধ্যমে তাঁর ফিকহী ও ধর্মতাত্ত্বিক চিন্তা পরবর্তী প্রজন্মে ছড়িয়ে পড়ে।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি তাঁর জীবনের শেষ সময় দামেস্কের দুর্গে বন্দী অবস্থায় কাটান। সেখানেও তিনি গ্রন্থ রচনা ও ইবাদত অব্যাহত রাখেন।",
      "তিনি ৭২৮ হিজরিতে (১৩২৮ খ্রিস্টাব্দে) দামেস্কের দুর্গে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর ইন্তেকালের পর তাঁর জানাযায় তৎকালীন দামেস্কের ইতিহাসে নজিরবিহীন জনসমাগম হয়, যা তাঁর জনপ্রিয়তা ও মর্যাদার প্রমাণ দেয়।",
      "তাঁর জীবনী প্রমাণ করে যে, সত্যের পথে অটল থাকতে গেলে অনেক সময় প্রতিকূলতা ও নির্যাতন সহ্য করতে হয়।",
      "তাঁর রচনাবলী মুসলিম বিশ্বের আধুনিক সংস্কার আন্দোলন এবং সালাফি ধারার ওপর বিশাল প্রভাব ফেলে।",
      "তিনি সর্বজনীনভাবে স্বীকৃত এমন একজন মনীষী, যিনি ইসলামি ইতিহাসের এক ক্রান্তিকালে পথপ্রদর্শকের ভূমিকা পালন করেছিলেন।"
    ],
    "source": "হাফিয ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম যাহাবী, সিয়ারু আ’লামিন নুবালা"
  },
  {
    "id": "imam_ibn_al_qayyim",
    "categoryId": "imam_jibon",
    "title": "হাফিয ইবনে কাইয়্যিম আল-জাওযিয়াহ (রহঃ)",
    "paragraphs": [
      "হাফিয ইবনে কাইয়্যিম আল-জাওযিয়াহ (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ ইবনে আবি বকর ইবনে আইয়ূব ইবনে সা'দ আল-যুর'য়ী। তিনি ছিলেন শাইখুল ইসলাম ইবনে তাইমিয়াহ (রহঃ)-এর অন্যতম প্রধান এবং সুযোগ্য ছাত্র।",
      "তাঁর উপনাম ছিল আবুল ফিকহ। তাঁকে 'ইবনুল কাইয়্যিম আল-জাওযিয়াহ' বলা হয়, কারণ তাঁর পিতা দামেস্কের মাদরাসা আল-জাওযিয়্যাহর প্রধান প্রশাসক (কাইয়্যিম) ছিলেন।",
      "তিনি ছিলেন হাম্বলি ফিকহ, উসূল, হাদিস, তাফসীর এবং ধর্মতত্ত্বের একজন প্রখ্যাত পণ্ডিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৬৯১ হিজরিতে (১২৯২ খ্রিস্টাব্দে) দামেস্কের কাছে একটি গ্রামে জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি তাঁর পিতা এবং দামেস্কের অন্যান্য আলেমদের কাছ থেকে প্রাথমিক জ্ঞান অর্জন করেন। তিনি তাঁর প্রখর মেধা ও স্মৃতিশক্তির জন্য পরিচিত ছিলেন।",
      "ইবনে তাইমিয়াহর সান্নিধ্যে\n\nতিনি ৭১২ হিজরিতে (১৩১২ খ্রিস্টাব্দে) শাইখুল ইসলাম ইবনে তাইমিয়াহ (রহঃ)-এর সান্নিধ্যে আসেন। তিনি ইবনে তাইমিয়াহর সাথে তাঁর মৃত্যুর আগ পর্যন্ত অবিচ্ছেদ্যভাবে ছিলেন।",
      "তিনি ইবনে তাইমিয়াহ (রহঃ)-এর কাছ থেকে ফিকহী চিন্তাধারা, পদ্ধতি এবং জীবনদর্শন আয়ত্ত করেন।",
      "শিক্ষকমণ্ডলী\n\nইবনে তাইমিয়াহ (রহঃ) ছাড়াও তিনি ইবনে শিহাবুদ্দিন আন-নাবলুসী সহ দামেস্কের অনেক আলেমের কাছ থেকে হাদিস, ফিকহ ও আরবি ভাষা শেখেন।",
      "প্রধান গ্রন্থসমূহ\n\nতাঁর রচনাবলীর সংখ্যা বিশাল। এর মধ্যে 'যাদ আল-মা'আদ ফি হাদয়ি খাইরিল ই'বাদ' (নবীজির জীবন পদ্ধতির নির্দেশনা) অন্যতম।",
      "অন্যান্য বিখ্যাত গ্রন্থ হলো, 'ই'লাম আল-মুওয়াক্কি'ঈন আন রব্বিল 'আলামীন' (ফিকহের উসূল সম্পর্কিত), 'আত-তুরুক আল-হুকমিয়্যাহ' (বিচারিক ফিকহ)।",
      "আধ্যাত্মিক গ্রন্থ\n\nতাঁর আধ্যাত্মিক ও আত্মশুদ্ধি বিষয়ক গ্রন্থগুলোর মধ্যে 'মাদারিজুস সালিকীন' (রুহানি পথযাত্রীর স্তরসমূহ) বিশেষভাবে পরিচিত।",
      "রাজনৈতিক পরীক্ষা\n\nতিনি তাঁর উস্তাদ ইবনে তাইমিয়াহর মতবাদ সমর্থন করার কারণে রাজনৈতিক ও ধর্মতাত্ত্বিক বিতর্কের শিকার হন এবং দামেস্কের দুর্গে তাঁর সাথে কারাবরণ করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে অন্যতম হলেন হাফিয ইবনে রজব আল-হাম্বলি এবং হাফিয ইবনে কাসীর (যিনি তাঁর শিক্ষকও ছিলেন)।",
      "তাঁর প্রভাব\n\nইবনে কাইয়্যিম (রহঃ)-এর রচনাবলী হাদিস, ফিকহ এবং আত্মশুদ্ধি বিষয়ক জ্ঞানের ক্ষেত্রে আজও বিশ্বব্যাপী সমাদৃত।",
      "তিনি ধর্মীয় আইনকে যুক্তির সাথে গভীরভাবে বিশ্লেষণের ক্ষেত্রে তাঁর উস্তাদের ধারাকে এগিয়ে নিয়ে যান।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় দামেস্কের মাদরাসায় অধ্যাপনা ও গ্রন্থ রচনা করে কাটান।",
      "তিনি ৭৫১ হিজরিতে (১৩৪৯ খ্রিস্টাব্দে) দামেস্কে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর জানাযায় বিপুল জনসমাগম হয়। ইবনে কাইয়্যিম (রহঃ) তাঁর জ্ঞানের গভীরতা এবং সত্যের প্রতি তাঁর অবিচল নিষ্ঠার জন্য ইতিহাসে অত্যন্ত সম্মানিত।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ’লামিন নুবালা; ইবনে রজব আল-হাম্বলি, যায়ল তাবাকাত আল-হানাবিলাহ"
  },
  {
    "id": "imam_al_dhahabi",
    "categoryId": "imam_jibon",
    "title": "হাফিয ইমাম যাহাবী (রহঃ)",
    "paragraphs": [
      "হাফিয ইমাম যাহাবী (রহঃ)-এর পূর্ণ নাম হলো শামসুদ্দীন আবু আব্দুল্লাহ মুহাম্মদ ইবনে আহমাদ ইবনে উসমান ইবনে কাইমায আল-তুর্কুমানী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ ইতিহাসবিদ, মুহাদ্দিস এবং রিজালশাস্ত্রের ইমাম।",
      "তাঁর উপনাম ছিল আবু আব্দুল্লাহ এবং তাঁকে 'হাফিয' ও 'শামসুদ্দীন' (দ্বীনের সূর্য) উপাধিতে ভূষিত করা হয়।",
      "তিনি হাদিস ও রিজাল (বর্ণনাকারীদের জীবনী) শাস্ত্রে তাঁর বিশাল অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৬৭৩ হিজরিতে (১২৭৪ খ্রিস্টাব্দে) সিরিয়ার দামেস্কে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর বাবা স্বর্ণকার (যাহাব) ছিলেন, তাই তিনি 'আল-যাহাবী' নামে পরিচিত।",
      "শিক্ষা ও মেধা\n\nতিনি মাত্র ১৮ বছর বয়স থেকে হাদিস সংগ্রহ শুরু করেন। তিনি ইবনে তাইমিয়াহ (রহঃ) এবং ইমাম বারযালী (রহঃ)-এর মতো পণ্ডিতদের সান্নিধ্য লাভ করেন।",
      "তিনি মিশর, হিজাজ এবং সিরিয়ার বহু আলেমের কাছ থেকে হাদিস শেখেন।",
      "প্রধান গ্রন্থসমূহ: সিয়ারু আ’লামিন নুবালা\n\nতাঁর প্রধান গ্রন্থ হলো 'সিয়ারু আ’লামিন নুবালা' (মহৎ ব্যক্তিত্বদের জীবনী), যা ইসলামি ব্যক্তিত্বদের জীবনীশাস্ত্রের অন্যতম বিশাল সংকলন।",
      "তাঁর রচিত 'তারীখুল ইসলাম' (ইসলামের ইতিহাস) ইতিহাসশাস্ত্রের অন্যতম বৃহৎ গ্রন্থ।",
      "অন্যান্য গ্রন্থ\n\nরিজাল শাস্ত্রে তাঁর গুরুত্বপূর্ণ গ্রন্থ হলো 'মীযান আল-ই'তিদাল' (হাদিসের বর্ণনাকারীদের যাচাইয়ের মানদণ্ড)।",
      "তাঁর পাণ্ডিত্য\n\nইমাম যাহাবী (রহঃ)-এর প্রধান শক্তি ছিল তাঁর ব্যাপক মুখস্থ ক্ষমতা, হাদিসের শৃঙ্খল (আসানিদ) এবং রিজাল শাস্ত্রের গভীর জ্ঞান।",
      "তিনি তাঁর গ্রন্থে ঐতিহাসিক তথ্যের পাশাপাশি সমালোচনামূলক বিশ্লেষণও করেছেন।",
      "শিক্ষক ও ছাত্র\n\nতিনি ইবনে তাইমিয়াহ (রহঃ)-এর ছাত্র ছিলেন, তবে তিনি ইমাম বারযালী (রহঃ)-এরও শিক্ষক ছিলেন। তাঁর ছাত্রদের মধ্যে অন্যতম হলেন হাফিয ইবনে কাসীর।",
      "তাঁর নিরপেক্ষতা\n\nতাঁর জীবনী গ্রন্থে তিনি নিরপেক্ষভাবে আলেমদের গুণাবলী ও দুর্বলতা তুলে ধরেছেন, যা তাঁকে ঐতিহাসিকদের মধ্যে বিশেষ মর্যাদা দিয়েছে।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি তাঁর জীবনের শেষ সময় দামেস্কে শিক্ষাদান ও গ্রন্থ রচনায় অতিবাহিত করেন।",
      "তিনি ৭৪৮ হিজরিতে (১৩৪৮ খ্রিস্টাব্দে) দামেস্কে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম যাহাবী (রহঃ)-এর গ্রন্থাবলি হাদিস, ইতিহাস এবং জীবনীশাস্ত্রের ক্ষেত্রে আজও মৌলিক উৎস হিসেবে ব্যবহৃত হয়।"
    ],
    "source": "ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম সুবকী, তাবাকাত আল-শাফি'য়্যাহ আল-কুবরা"
  },
  {
    "id": "imam_ibn_kathir",
    "categoryId": "imam_jibon",
    "title": "হাফিয ইবনে কাসীর (রহঃ)",
    "paragraphs": [
      "হাফিয ইবনে কাসীর (রহঃ)-এর পূর্ণ নাম হলো ইসমাইল ইবনে উমর ইবনে কাসীর ইবনে দাউদ ইবনে কাসীর আল-কুরাইশী আল-দিমাশকী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুফাসসির, মুহাদ্দিস এবং ঐতিহাসিক।",
      "তাঁর উপাধি ছিল আবু আল-ফিদা। তিনি ইবনে তাইমিয়াহ (রহঃ)-এর ছাত্র এবং ইমাম যাহাবী (রহঃ)-এর ছাত্র ও সহকর্মী ছিলেন।",
      "তিনি তাফসীর, হাদিস এবং ইসলামের ইতিহাস রচনায় তাঁর অসামান্য অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৭০০ হিজরিতে (১৩০১ খ্রিস্টাব্দে) সিরিয়ার বুসরা শহরের কাছে একটি গ্রামে জন্মগ্রহণ করেন।",
      "শিক্ষা ও মেধা\n\nতিনি ছোটবেলায় পিতাকে হারান এবং তাঁর ভাই তাঁকে দামেস্কে নিয়ে আসেন। সেখানে তিনি জ্ঞানার্জন শুরু করেন।",
      "তিনি অত্যন্ত প্রখর মেধার অধিকারী ছিলেন। দামেস্কে তিনি কুরআন, হাদিস, ফিকহ ও আরবি ভাষা শেখেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর শিক্ষকদের মধ্যে অন্যতম শ্রেষ্ঠ ছিলেন: ইবনে তাইমিয়াহ (রহঃ) (যিনি তাঁর প্রধান শিক্ষক ছিলেন) এবং ইমাম যাহাবী (রহঃ) (যিনি তাঁকে হাদিস ও রিজাল শাস্ত্রে শিক্ষা দেন)।",
      "প্রধান গ্রন্থসমূহ: তাফসীর ইবনে কাসীর\n\nতাঁর প্রধান গ্রন্থ হলো 'তাফসীর আল-কুরআন আল-আযীম' যা 'তাফসীর ইবনে কাসীর' নামেই বিশ্বব্যাপী পরিচিত।",
      "তাফসীরের পদ্ধতি\n\nতাঁর তাফসীরের বিশেষত্ব হলো তিনি কুরআনের আয়াতের ব্যাখ্যায় প্রধানত অন্য কুরআনের আয়াত, এরপর হাদিস, এবং সাহাবীদের বক্তব্য ব্যবহার করেন।",
      "ইতিহাস গ্রন্থ\n\nতাঁর রচিত বিখ্যাত ইতিহাস গ্রন্থ হলো 'আল-বিদায়া ওয়ান নিহায়া' (শুরু ও শেষ), যা সৃষ্টির শুরু থেকে তাঁর সময় পর্যন্ত ইসলামি ইতিহাসকে কালানুক্রমিকভাবে তুলে ধরে।",
      "হাদিস ও ফিকহ\n\nতিনি শাফেয়ী ফিকহের অনুসারী ছিলেন এবং হাদিসশাস্ত্রের বর্ণনাকারীদের যাচাইয়ের ক্ষেত্রে কঠোর ছিলেন।",
      "তিনি দামেস্কের অনেক মাদ্রাসায়, যেমন তানকিজিয়া মাদ্রাসায় অধ্যাপনা করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর বহু ছাত্র তাঁর জ্ঞানের ধারাকে এগিয়ে নিয়ে যান।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, ধার্মিক এবং একজন অত্যন্ত পরিশ্রমী লেখক ও গবেষক।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ দিকে দৃষ্টিশক্তি হারিয়ে ফেলেন। তিনি ৭৪৪ হিজরিতে (১৩৭৩ খ্রিস্টাব্দে) দামেস্কে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর গ্রন্থাবলি মুসলিম বিশ্বে তাফসীর, হাদিস ও ইতিহাসের মৌলিক উৎস হিসেবে আজও পঠিত হয়।",
      "হাফিয ইবনে কাসীর (রহঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানের বিভিন্ন শাখায় মৌলিক কাজ করার জন্য শিক্ষকের সঠিক নির্দেশনা অপরিহার্য।"
    ],
    "source": "ইমাম সুবকী, তাবাকাত আল-শাফি'য়্যাহ আল-কুবরা"
  },
  {
    "id": "imam_al_haitami",
    "categoryId": "imam_jibon",
    "title": "হাফিয নূরুদ্দীন আল-হাইসামি (রহঃ)",
    "paragraphs": [
      "হাফিয নূরুদ্দীন আল-হাইসামি (রহঃ)-এর পূর্ণ নাম হলো আলী ইবনে আবি বকর ইবনে সুলাইমান নূরুদ্দীন আল-হাইসামি। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাদিস সংকলনের ক্ষেত্রে তাঁর অবদান অনস্বীকার্য।",
      "তাঁর উপাধি ছিল নূরুদ্দীন এবং তাঁকে হাদিসশাস্ত্রের একজন মহান হাফিয হিসেবে গণ্য করা হয়।",
      "তিনি প্রধানত এমন হাদিসগুলো সংকলন করার জন্য বিখ্যাত, যা সিহাহ সিত্তাহ (ছয়টি বিশুদ্ধ গ্রন্থ)-এ অন্তর্ভুক্ত হয়নি।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৭৩৫ হিজরিতে (১৩৩৪ খ্রিস্টাব্দে) মিশরের আল-হাইসাম নামক স্থানে জন্মগ্রহণ করেন।",
      "শিক্ষা ও মেধা\n\nতিনি ছোটবেলা থেকেই হাদিস শেখার প্রতি আগ্রহী ছিলেন এবং তাঁর প্রখর মেধার কারণে অল্প বয়সেই হাদিস মুখস্থ করেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর প্রধান শিক্ষক ছিলেন হাফিয আল-ইরাকী (রহঃ), যাঁর সান্নিধ্যে তিনি দীর্ঘকাল কাটান। এছাড়াও তিনি বহু আলেমের কাছ থেকে হাদিস শেখেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থ হলো 'মাজমা' আজ-যাওয়াইদ ওয়া মানবা' আল-ফাওয়াইদ'। এই গ্রন্থে তিনি মুসনাদ আহমাদ, আল-বাযযার, এবং তাবারানীর তিনটি মু'জাম সহ বেশ কিছু হাদিস গ্রন্থের হাদিসকে ফিকহী অধ্যায় অনুসারে একত্রিত করেছেন।",
      "এই গ্রন্থটি হাদিস গবেষকদের জন্য অত্যন্ত মূল্যবান, কারণ এটি বহু বিক্ষিপ্ত হাদিসকে একত্রে এনেছে।",
      "অন্যান্য গ্রন্থ\n\nতাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থ হলো 'কাশ্ফ আল-আস্তার আন যাওয়াইদ আল-বাযযার'।",
      "তিনি তাঁর সংকলিত হাদিসগুলোর বিশুদ্ধতার স্তর (সহীহ, হাসান বা দুর্বল) উল্লেখ করার ক্ষেত্রে যথেষ্ট কঠোরতা অবলম্বন করতেন।",
      "ছাত্রবৃন্দ\n\nতাঁর বহু ছাত্র তাঁর জ্ঞানকে ধারণ ও প্রচার করেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত বিনয়ী, পরহেজগার এবং সারাজীবন ইলম অর্জনে নিবেদিতপ্রাণ।",
      "সফর\n\nহাদিস সংগ্রহের জন্য তিনি মিশর এবং অন্যান্য অঞ্চলে ভ্রমণ করেন।",
      "তাঁর ইন্তেকাল\n\nতিনি ৮০৭ হিজরিতে (১৪০৫ খ্রিস্টাব্দে) মিশরে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nহাফিয আল-হাইসামি (রহঃ)-এর সংকলন পদ্ধতি এবং তাঁর বিশাল হাদিস সংগ্রহ তাঁকে হাদিসশাস্ত্রের অন্যতম শ্রেষ্ঠ ইমাম হিসেবে মর্যাদা দিয়েছে।"
    ],
    "source": "ইমাম ইবনে হাজার আল-আসকালানী, আদ-দুরার আল-কামিনা"
  },
  {
    "id": "imam_al_suyuti",
    "categoryId": "imam_jibon",
    "title": "ইমাম জালালুদ্দীন আস-সুয়ূতী (রহঃ)",
    "paragraphs": [
      "ইমাম জালালুদ্দীন আস-সুয়ূতী (রহঃ)-এর পূর্ণ নাম হলো আবু আল-ফযল আব্দুর রহমান ইবনে আবি বকর ইবনে মুহাম্মদ জালালুদ্দীন আস-সুয়ূতী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুফাসসির, মুহাদ্দিস এবং বহু বিষয়ে পণ্ডিত।",
      "তাঁর উপনাম ছিল আবুল ফযল। জ্ঞানের বিশালতার কারণে তাঁকে 'আল-হাফিয আল-কবীর' এবং 'মুহাক্কিক' (গবেষক) উপাধিতে ভূষিত করা হয়।",
      "তাঁর পরিবার মিশরের সুয়ূত শহর থেকে এসেছিল, তাই তিনি 'আস-সুয়ূতী' নামে পরিচিত। তাঁর প্রভাব ছিল মিশরের শাফেয়ী আলেমদের মধ্যে সুদূরপ্রসারী।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৮৪৯ হিজরিতে (১৪৪৫ খ্রিস্টাব্দে) মিশরের কায়রোতে জন্মগ্রহণ করেন। তাঁর জন্মস্থান ছিল কায়রোর আল-আজহার অঞ্চলের কাছে।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা ছিলেন একজন আলেম এবং মাদ্রাসায় শিক্ষকতা করতেন। শৈশবেই তিনি পিতাকে হারান, কিন্তু তাঁর পিতার বন্ধুরা ও পণ্ডিতরা তাঁকে জ্ঞানার্জনে সহায়তা করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি মাত্র ৮ বছর বয়সে সম্পূর্ণ কুরআন হিফয (মুখস্থ) সম্পন্ন করেন। তাঁর প্রখর মেধা ও স্মৃতিশক্তি ছিল কিংবদন্তী এবং তিনি অল্প বয়সেই উচ্চশিক্ষার জন্য প্রস্তুত হন।",
      "হাদিস ও ফিকহ শিক্ষা\n\nতিনি শাফেয়ী ফিকহে দক্ষতা লাভ করেন এবং হাদিসের সনদ ও মতনের উপর গভীর জ্ঞান অর্জন করেন। তিনি ফিকহের ক্ষেত্রে ইজতিহাদের সাহস রাখতেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর প্রধান শিক্ষকদের মধ্যে অন্যতম ছিলেন তাঁর পূর্বসূরি হাফিয ইবনে হাজার আল-আসকালানী (রহঃ)। এছাড়াও তিনি হাফিয আল-কাফিয়াজী সহ বহু আলেমের কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "হাদিস সংগ্রহের সফর\n\nজ্ঞানার্জনের জন্য তিনি সিরিয়া, হিজাজ (মক্কা ও মদীনা), ইয়েমেন এবং মরক্কোর দিকেও সফর করেন। তিনি প্রায় ১৫০ জন শিক্ষকের কাছ থেকে হাদিস শেখেন।",
      "প্রধান গ্রন্থ: আল-ইতকান ও তাফসীর আল-জালালাইন\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে অন্যতম হলো 'আল-ইতকান ফি উলুম আল-কুরআন' (কুরআন বিজ্ঞানের নীতি) যা উলূমুল কুরআনের ক্ষেত্রে একটি মৌলিক গ্রন্থ।",
      "এছাড়াও তিনি 'তাফসীর আল-জালালাইন' (ইমাম আল-মাহাল্লির সাথে যৌথভাবে রচিত) সম্পন্ন করেন, যা একটি সংক্ষিপ্ত ও বহুল পঠিত তাফসীর।",
      "হাদিস সংকলন\n\nহাদিস সংকলনে তাঁর গুরুত্বপূর্ণ কাজ হলো 'আল-জামি আস-সাগীর' এবং 'আল-জামি আল-কবীর', যা ফিকহী হাদিসের বিশাল ভান্ডার।",
      "অন্যান্য গ্রন্থ\n\nতিনি ইতিহাস ও জীবনীতে 'তারীখ আল-খুলাফা' (খলিফাদের ইতিহাস) এবং চিকিৎসা বিজ্ঞানেও গ্রন্থ রচনা করেন।",
      "তাঁর লেখার পরিমাণ\n\nতাঁর জীবনীকারেরা দাবি করেন যে, তিনি ৫০০ থেকে ১০০০-এরও বেশি গ্রন্থ রচনা করেছেন, যার মধ্যে অনেকগুলোই ছিল ছোট পুস্তিকা।",
      "পেশাগত জীবন\n\nতিনি কায়রোর বিভিন্ন মাদ্রাসায়, যেমন শাইখুনীয়া মাদ্রাসায় অধ্যাপনা করেন এবং ফতোয়া প্রদান করেন। তাঁর ফতোয়াগুলো শাফেয়ী ফিকহের ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ ছিল।",
      "রাজনৈতিক সম্পর্ক ও নির্জনতা\n\nজীবনের শেষভাগে তিনি তৎকালীন শাসকগোষ্ঠীর কাছ থেকে দূরে থাকতে শুরু করেন এবং নির্জনতা অবলম্বন করেন। তিনি তাঁর রচিত গ্রন্থ এবং ইবাদতেই মনোনিবেশ করেন।",
      "ফিকহী অবস্থান\n\nতিনি শাফেয়ী মাযহাবের অনুসরণ করতেন এবং ফিকহী মাসআলাতে তাঁর গভীর পাণ্ডিত্য ছিল। তিনি মাযহাবের মধ্যে ইজতিহাদের পথ উন্মুক্ত রাখতে চেয়েছেন।",
      "ছাত্রবৃন্দ\n\nতাঁর বহু ছাত্র তাঁর জ্ঞানকে ধারণ ও প্রচার করেন। তাঁর ছাত্রদের মাধ্যমে তাঁর জ্ঞান মিশরের বাইরেও ছড়িয়ে পড়ে।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি তাঁর জীবনের শেষ ভাগে নির্জনতা অবলম্বন করে গ্রন্থ রচনায় মনোনিবেশ করেন। এই সময় তিনি বাইরের দুনিয়ার ঝামেলা থেকে নিজেকে সম্পূর্ণ মুক্ত রাখেন।",
      "তিনি ৯১১ হিজরিতে (১৫০৫ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম সুয়ূতী (রহঃ) তাঁর বহুবিধ জ্ঞান ও বিশাল রচনাবলীর জন্য ইতিহাসে এক কিংবদন্তী পণ্ডিত হিসেবে স্মরণীয় হয়ে আছেন।",
      "তাঁর রচনাবলী আজও ইসলামি জ্ঞানচর্চার বিভিন্ন শাখায় মৌলিক উৎস হিসেবে ব্যবহৃত হয়।"
    ],
    "source": "ইবনে ইমাদ আল-হাম্বলি, শাযারাত আয-যাহাব; ইমাম সাখাভী, আল-জাওয়াহির ওয়াদ্-দুরার"
  },
  {
    "id": "imam_ibn_hajar_al_haytami",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে হাজার আল-হাইতামি (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে হাজার আল-হাইতামি (রহঃ)-এর পূর্ণ নাম হলো শিহাবুদ্দীন আবুল আব্বাস আহমাদ ইবনে মুহাম্মদ ইবনে আলী ইবনে হাজার আল-হাইতামি আল-মাক্কী। তিনি ছিলেন তাঁর সময়ের শাফেয়ী মাযহাবের অন্যতম শ্রেষ্ঠ ফকীহ ও প্রধান মুফতি।",
      "তাঁর উপাধি ছিল শিহাবুদ্দীন। তাঁকে 'শাইখুল ইসলাম' এবং মক্কা শরীফের প্রধান মুফতি হিসেবে গণ্য করা হতো। তিনি বিতর্ক এবং যুক্তিশাস্ত্রে ছিলেন অপ্রতিরোধ্য।",
      "তিনি ছিলেন তাঁর সময়ের শেষ মহান শাফেয়ী মুজতাহিদ ফকীহদের মধ্যে অন্যতম, যিনি মাযহাবের মূলনীতি ব্যাখ্যা করেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৯২৫ হিজরিতে (১৫১৯ খ্রিস্টাব্দে) মিশরের আল-হাইতাম নামক গ্রামে জন্মগ্রহণ করেন। এই গ্রাম থেকেই তাঁর নামের অংশ 'আল-হাইতামি' এসেছে।",
      "পারিবারিক পটভূমি\n\nতিনি শৈশবেই পিতৃহীন হন এবং তাঁর দুই চাচা তাঁকে লালন-পালন করেন। তাঁরাও পণ্ডিত ছিলেন এবং তাঁর প্রাথমিক শিক্ষার ভিত্তি স্থাপন করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি অল্প বয়সেই কায়রোতে আল-আজহার সহ বিভিন্ন মাদ্রাসায় উচ্চশিক্ষা লাভ করেন। তিনি ফিকহ, হাদিস ও উসূলুল ফিকহে দক্ষতা অর্জন করেন।",
      "তাঁর প্রখর স্মৃতিশক্তি ও যুক্তির গভীরতা সকলের দৃষ্টি আকর্ষণ করত।",
      "শিক্ষকমণ্ডলী\n\nতিনি শাফেয়ী ফিকহের শিক্ষক যাকারিয়া আল-আনসারী (রহঃ)-এর মতো বিখ্যাত আলেমের কাছ থেকে শিক্ষা গ্রহণ করেন। এছাড়াও তিনি আল-মানাওয়ী সহ অনেক মুহাদ্দিসের ছাত্র ছিলেন।",
      "জ্ঞান অন্বেষণ\n\nতিনি জ্ঞানার্জনের জন্য মক্কা ও মদীনাতেও ভ্রমণ করেন এবং শেষ পর্যন্ত মক্কাতেই স্থায়ী হন।",
      "কর্মজীবন\n\nতিনি পরবর্তীকালে মক্কা শরীফে হিজরত করেন এবং সেখানে শিক্ষকতা ও ফতোয়া প্রদানের কাজ শুরু করেন।",
      "তিনি মক্কার প্রধান মুফতি পদে নিযুক্ত হন এবং জীবনের শেষভাগ পর্যন্ত এই দায়িত্ব পালন করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে অন্যতম হলো 'তুহফাতুল মুহতাজ বি শারহিল মিনহাজ'। এটি শাফেয়ী ফিকহের প্রধান গ্রন্থ 'মিনহাজ আল-তালিবিন'-এর উপর রচিত অন্যতম শ্রেষ্ঠ ব্যাখ্যা গ্রন্থ।",
      "অন্যান্য গ্রন্থ\n\nহাদিস ও ফিকহে তাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থ হলো 'আল-ফাতাওয়া আল-কুবরা আল-ফিকহিয়্যাহ' (তাঁর ফতোয়ার সংকলন), এবং 'আল-সাওয়াইক আল-মুহরিকা আলা আহল আর-রাফযি ওয়াদ-দাল।",
      "তাঁর রচনাবলী\n\nতাঁর রচনাশৈলী ছিল অত্যন্ত শক্তিশালী এবং যুক্তিপূর্ণ। তাঁর গ্রন্থগুলো শাফেয়ী মাযহাবের পরবর্তী প্রজন্মের কাছে ফিকহের ক্ষেত্রে প্রধান উৎস হিসেবে বিবেচিত হয়।",
      "তাঁর বিতর্ক\n\nতিনি ধর্মীয় বিষয়ে যারা মূলধারার বাইরে যেত, তাদের বিরুদ্ধে কঠোর অবস্থান নিতেন এবং তাঁর যুক্তিগুলো ছিল খুবই দৃঢ়।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র ছিল, যারা তাঁর জ্ঞানকে মক্কা ও মিশরে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন তাঁর যুগে তাকওয়া, ইবাদত ও জ্ঞানের ক্ষেত্রে এক উজ্জ্বল দৃষ্টান্ত।",
      "মৃত্যু\n\nতিনি জীবনের শেষ সময় মক্কাতেই অতিবাহিত করেন। তিনি ৯৭৪ হিজরিতে (১৫৬৭ খ্রিস্টাব্দে) মক্কা মুকাররমায় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁকে মক্কা শরীফের জান্নাতুল মু'আল্লাতে দাফন করা হয়। তাঁর জ্ঞান ও কাজের ফল আজও শাফেয়ী মাযহাবের ফিকহে দৃশ্যমান।"
    ],
    "source": "আল-জাববারতি, আজাইব আল-আছার ফি তারাজিম ওয়াল আখবার; আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_mulla_ali_al_qari",
    "categoryId": "imam_jibon",
    "title": "ইমাম মোল্লা আলী আল-কারী (রহঃ)",
    "paragraphs": [
      "ইমাম মোল্লা আলী আল-কারী (রহঃ)-এর পূর্ণ নাম হলো আলী ইবনে সুলতান মুহাম্মদ আল-ক্বারী। তিনি ছিলেন তাঁর সময়ের হানাফী মাযহাবের অন্যতম শ্রেষ্ঠ ফকীহ, মুহাদ্দিস এবং ক্বারী (কুরআন তিলাওয়াত বিশারদ)।",
      "তাঁর উপনাম ছিল আলী। তাঁকে 'মোল্লা' এবং 'আল-ক্বারী' (ক্বিরাত বিশেষজ্ঞ) উপাধিতে ভূষিত করা হয়, কারণ তিনি ক্বিরাত শাস্ত্রে অসাধারণ পাণ্ডিত্য অর্জন করেন।",
      "তিনি প্রধানত হাদিস ব্যাখ্যা এবং হানাফী ফিকহে তাঁর অগণিত গ্রন্থ রচনার জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতাঁর জন্মসাল নিয়ে কিছুটা মতভেদ থাকলেও, তিনি ১০১৭ হিজরিতে (১৬০৮ খ্রিস্টাব্দে) আফগানিস্তানের হেরাট শহরে ইন্তেকাল করেন। জন্মসাল আনুমানিক ৯৩০ হিজরি।",
      "শিক্ষা ও মেধা\n\nতিনি হেরাট থেকে মক্কায় হিজরত করেন এবং সেখানে বাকি জীবন জ্ঞানচর্চা ও অধ্যাপনা করে কাটান।",
      "হাদিস ও ফিকহ শিক্ষা\n\nতিনি মক্কায় তাঁর শিক্ষক ইবনে হাজার আল-হাইতামীর ছাত্র, শাইখ আহমদ আল-আসকালানী সহ অনেক আলেমের কাছে শিক্ষা লাভ করেন।",
      "তিনি হানাফী ফিকহ, হাদিস, তাফসীর এবং ক্বিরাত শাস্ত্রে গভীর জ্ঞান অর্জন করেন।",
      "তাঁর ক্বিরাতের জ্ঞান তাঁকে 'আল-ক্বারী' উপাধি এনে দেয়।",
      "কর্মজীবন\n\nতিনি মক্কা শরীফে স্থায়ী হন এবং সেখানে শিক্ষকতা ও ফতোয়া প্রদানের মাধ্যমে তাঁর জীবন অতিবাহিত করেন।",
      "প্রধান গ্রন্থ: মিরকাত আল-মাফাতীহ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে অন্যতম হলো 'মিরকাত আল-মাফাতীহ শারহ মিশকাত আল-মাসাবীহ'। এটি হাদিস গ্রন্থ মিশকাত আল-মাসাবীহ-এর সবচেয়ে বিশদ ব্যাখ্যাগুলোর মধ্যে অন্যতম।",
      "তাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থ\n\nতাঁর রচিত 'শারহ আল-শিফা' (কাজী ইয়াদ রচিত গ্রন্থের ব্যাখ্যা), 'শারহ আল-ফিকহ আল-আকবর' (ইমাম আবু হানিফার আকীদা গ্রন্থের ব্যাখ্যা) এবং 'আল-মাসনূ ফী মা'রিফাতিল হাদিসিল মাউযূ (জাল হাদিস বিষয়ক) বিশেষভাবে পরিচিত।",
      "তাঁর লেখার সংখ্যা\n\nবলা হয়, তিনি হাদিস, ফিকহ, তাফসীর, সিরাত, আরবি ভাষা ও ক্বিরাত সহ বিভিন্ন বিষয়ে প্রায় ২০০টিরও বেশি গ্রন্থ রচনা করেন।",
      "ফিকহী অবস্থান\n\nতিনি হানাফী মাযহাবের একজন অত্যন্ত নিষ্ঠাবান ফকীহ ছিলেন এবং মাযহাবের দলিলগুলো প্রমাণ করার ক্ষেত্রে দৃঢ় ছিলেন।",
      "ছাত্রবৃন্দ\n\nতাঁর বহু ছাত্র মক্কা, ইয়েমেন এবং উপমহাদেশে তাঁর জ্ঞানকে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, ধার্মিক এবং খুবই কঠোর পরিশ্রমী আলেম। তিনি তাঁর জীবনের বেশিরভাগ সময় মক্কায় কাটানোর কারণে মক্কার আলেম হিসেবেও পরিচিত।",
      "মৃত্যু\n\nতিনি ১০১৪ হিজরিতে (১৬০৫ খ্রিস্টাব্দে) মক্কা মুকাররমায় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nমোল্লা আলী আল-কারী (রহঃ)-এর গ্রন্থাবলি হানাফী মাযহাবের ফিকহ ও হাদিস অধ্যয়নের জন্য আজও অপরিহার্য।"
    ],
    "source": "আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_al_nabulsi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আব্দুল গনি আল-নাবুলসী (রহঃ)",
    "paragraphs": [
      "ইমাম আব্দুল গনি আল-নাবুলসী (রহঃ)-এর পূর্ণ নাম হলো আব্দুল গনি ইবনে ইসমাইল ইবনে আব্দুল গনি আল-নাবুলসী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ সুফি, হানাফী ফকীহ, কবি এবং ঐতিহাসিক।",
      "তাঁর উপনাম ছিল আব্দুল গনি। তিনি প্রধানত সিরিয়ার হানাফী ফিকহ, সুফিবাদ এবং সাহিত্যের ক্ষেত্রে তাঁর বিশাল অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১০৫০ হিজরিতে (১৬৪০ খ্রিস্টাব্দে) সিরিয়ার দামেস্কে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর বাবা ছিলেন দামেস্কের একজন আলেম এবং বিচারক। তিনি ছোটবেলা থেকেই জ্ঞানচর্চার পরিবেশে বেড়ে ওঠেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি তাঁর বাবার কাছে এবং দামেস্কের অন্যান্য আলেমদের কাছে ফিকহ, হাদিস ও আরবি ভাষা শেখেন। তাঁর মেধা ছিল অসাধারণ এবং তিনি মাত্র ২০ বছর বয়সে শিক্ষকতা শুরু করেন।",
      "হাদিস ও ফিকহ শিক্ষা\n\nতিনি হানাফী ফিকহ এবং হাদিসের উসূলের উপর গভীর জ্ঞান অর্জন করেন। তাঁর আগ্রহ ছিল সুফিবাদের দিকেও।",
      "কর্মজীবন ও নির্জনতা\n\nতিনি দামেস্কে অধ্যাপনা শুরু করলেও একসময় নির্জনতা অবলম্বন করেন এবং প্রায় ১৫ বছর নির্জন জীবন কাটান।",
      "সফর\n\nনির্জনতা শেষে তিনি মক্কা, মদীনা, ত্রিপোলি, বৈরুত এবং ইস্তাম্বুলে ভ্রমণ করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর লেখার সংখ্যা প্রায় ২৫০টিরও বেশি বলে অনুমান করা হয়। তাঁর প্রধান গ্রন্থগুলো ফিকহ, সুফিবাদ, কবিতা এবং ভ্রমণকাহিনীর উপর রচিত।",
      "সুফি দর্শন\n\nতিনি সুফিবাদকে ইসলামি শরিয়তের আলোকে ব্যাখ্যা করার চেষ্টা করেন এবং ইবনে আরাবী (রহঃ)-এর সুফি দর্শনকে সমর্থন করেন।",
      "ফিকহী অবস্থান\n\nতিনি হানাফী মাযহাবের একজন অত্যন্ত গভীর ফকীহ ছিলেন এবং ফিকহী মাসআলাকে আধ্যাত্মিক দৃষ্টিকোণ থেকে বিশ্লেষণ করতেন।",
      "তাঁর রচনাবলী\n\nতাঁর রচনাবলীতে ফিকহ, কবিতা এবং ভ্রমণ অভিজ্ঞতার এক অনন্য মিশ্রণ দেখা যায়।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র ছিল, যারা তাঁর জ্ঞানের ধারাকে সিরিয়া ও পার্শ্ববর্তী অঞ্চলে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত ধার্মিক, কবি এবং সুফি সাধক। তাঁর জীবন ছিল জ্ঞান ও আধ্যাত্মিকতার মিশ্রণ।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় দামেস্কে কাটান এবং সেখানেই শিক্ষাদান অব্যাহত রাখেন।",
      "তিনি ১১৪৩ হিজরিতে (১৭৩০ খ্রিস্টাব্দে) দামেস্কে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nআল-নাবুলসী (রহঃ) তাঁর বহুমুখী জ্ঞান এবং সুফিবাদ ও ফিকহের সমন্বয় সাধনের জন্য পরিচিত।"
    ],
    "source": "আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_shah_waliullah",
    "categoryId": "imam_jibon",
    "title": "শাহ ওয়ালী উল্লাহ দেহলভী (রহঃ)",
    "paragraphs": [
      "শাহ ওয়ালী উল্লাহ দেহলভী (রহঃ)-এর পূর্ণ নাম হলো কুতুবুদ্দীন আহমাদ ইবনে আব্দুর রহীম। তিনি ছিলেন ভারতীয় উপমহাদেশের অন্যতম শ্রেষ্ঠ মুহাদ্দিস, ফকীহ এবং ইসলামি চিন্তাবিদ।",
      "তাঁর উপাধি ছিল শাহ ওয়ালী উল্লাহ। তিনি হাদিসশাস্ত্র, ফিকহ এবং মুসলিম সমাজে সংস্কারের ক্ষেত্রে তাঁর গভীর চিন্তার জন্য পরিচিত।",
      "তিনি হানাফী মাযহাবের অনুসারী হলেও ইজতিহাদ ও হাদিসের উপর জোর দিতেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১১১৪ হিজরিতে (১৭০৩ খ্রিস্টাব্দে) ভারতীয় উপমহাদেশের দিল্লীতে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা শাহ আব্দুর রহীম ছিলেন একজন আলেম এবং দিল্লির একটি মাদ্রাসার প্রতিষ্ঠাতা।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি মাত্র ৭ বছর বয়সে কুরআন হিফয করেন এবং ১৪ বছর বয়সে সকল প্রচলিত জ্ঞান অর্জন করেন।",
      "হাদিস ও ফিকহ শিক্ষা\n\nতিনি প্রথমে তাঁর পিতার কাছেই শিক্ষা লাভ করেন। এরপর তিনি হিজাজে যান এবং সেখানে হাদিস ও ফিকহশাস্ত্রের শ্রেষ্ঠ আলেমদের কাছে জ্ঞান অর্জন করেন।",
      "তাঁর শিক্ষকদের মধ্যে অন্যতম ছিলেন শাইখ আবু তাহির আল-কুরদী।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থ হলো 'হুজ্জাতুল্লাহ আল-বালিগাহ' (আল্লাহর পক্ষ থেকে চূড়ান্ত প্রমাণ), যা ইসলামি আইন ও বিশ্বাসকে যুক্তির আলোকে ব্যাখ্যা করে।",
      "অন্যান্য গ্রন্থ\n\nতিনি 'মুসাফ্ফা' (মুয়াত্তার ফার্সি ব্যাখ্যা) এবং ফিকহ ও উসূলের উপর বহু গ্রন্থ রচনা করেন।",
      "তিনিই প্রথম ব্যক্তি যিনি কুরআন শরীফের ফার্সি অনুবাদ করেন, যা উপমহাদেশে সাধারণ মানুষের কাছে কুরআনকে সহজলভ্য করে তোলে।",
      "সংস্কার আন্দোলন\n\nতিনি ভারতীয় উপমহাদেশে মুসলিম সমাজে প্রচলিত বিদ'আত দূরীকরণ এবং মুসলিমদের ঐক্যবদ্ধ হওয়ার জন্য সংস্কার আন্দোলন শুরু করেন।",
      "তিনি মাযহাবগুলোর মধ্যে সমন্বয়ের ওপর জোর দেন।",
      "রাজনৈতিক ভূমিকা\n\nতিনি তাঁর সময়ে মুসলিমদের রাজনৈতিক পতনের মুখে সাম্রাজ্যের নেতাদের কাছে চিঠিপত্র লেখেন এবং মুসলিমদের সামরিক ও রাজনৈতিক শক্তি পুনরুদ্ধারের আহ্বান জানান।",
      "ছাত্রবৃন্দ\n\nতাঁর পুত্র শাহ আব্দুল আযীয সহ তাঁর বহু ছাত্র তাঁর সংস্কারবাদী চিন্তাধারাকে এগিয়ে নিয়ে যান।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় দিল্লিতে শিক্ষাদান ও গ্রন্থ রচনায় কাটান।",
      "তিনি ১১৭৬ হিজরিতে (১৭৬২ খ্রিস্টাব্দে) দিল্লীতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nশাহ ওয়ালী উল্লাহ (রহঃ)-এর চিন্তা ভারতীয় উপমহাদেশের ইসলামি জ্ঞান ও রাজনৈতিক আন্দোলনে এক যুগান্তকারী প্রভাব ফেলে।"
    ],
    "source": "গোলাম হোসাইন, সিয়ার আল-মুতাআখখিরীন"
  },
  {
    "id": "imam_al_shawkani",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ ইবনে আলী আল-শাওকানী (রহঃ)",
    "paragraphs": [
      "ইমাম মুহাম্মদ ইবনে আলী আল-শাওকানী (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ ইবনে আলী ইবনে মুহাম্মদ ইবনে আব্দুল্লাহ আল-শাওকানী। তিনি ইয়েমেনের প্রধান মুজতাহিদ ফকীহ ও হাদিস পণ্ডিত হিসেবে পরিচিত।",
      "তাঁর উপাধি ছিল মুহাম্মদ। তিনি ইজতিহাদের ওপর জোর দিতেন এবং কোনো একক মাযহাবের অন্ধ অনুকরণ থেকে বিরত থাকতেন।",
      "তিনি হাদিসশাস্ত্র এবং তাঁর ফিকহী পদ্ধতির জন্য বিখ্যাত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১১৭৩ হিজরিতে (১৭৬০ খ্রিস্টাব্দে) ইয়েমেনের শাওকান শহরে জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবেই তাঁর বাবার কাছে জ্ঞান অর্জন করেন। তিনি অত্যন্ত প্রখর মেধার অধিকারী ছিলেন।",
      "হাদিস ও ফিকহ শিক্ষা\n\nতিনি প্রথমে জায়েদী মাযহাবের ফিকহ শিক্ষা করেন, কিন্তু পরে তিনি সরাসরি কুরআন ও সহীহ হাদিসের দলিলের ওপর ভিত্তি করে ইজতিহাদ করার দিকে মনোনিবেশ করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের বিখ্যাত আলেমদের কাছ থেকে শিক্ষা লাভ করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থ হলো 'নায়ল আল-আওতার মিন আসরার মুনতাকাল আখবার' (হাদিস থেকে ফিকহী বিধান বের করার গ্রন্থ) এবং 'ফাতহ আল-কাদীর' (তাফসীর গ্রন্থ)।",
      "তাঁর ফিকহী পদ্ধতি\n\nতিনি ইজতিহাদকে উৎসাহিত করেন এবং মাযহাবগুলোর মধ্যে বিদ্যমান মতপার্থক্যকে দলীলের ভিত্তিতে বিচার করার ওপর জোর দেন।",
      "কর্মজীবন\n\nতিনি ইয়েমেনের সান'আতে প্রধান বিচারপতি (কাজীউল কুজাত) হিসেবে দায়িত্ব পালন করেন।",
      "রাজনৈতিক ভূমিকা\n\nতিনি তাঁর সময়ে মুসলিম সমাজে সংস্কার আনতে চেয়েছিলেন এবং তাঁর জ্ঞানকে বিচার প্রশাসনের কাজে ব্যবহার করেন।",
      "মৃত্যু\n\nতিনি ১২৫০ হিজরিতে (১৮৩৪ খ্রিস্টাব্দে) ইয়েমেনের সান'আতে ইন্তেকাল করেন।"
    ],
    "source": "আল-যিরিকলী, আল-আ'লাম"
  },
  {
    "id": "imam_al_alusi",
    "categoryId": "imam_jibon",
    "title": "ইমাম মাহমুদ আল-আলূসী (রহঃ)",
    "paragraphs": [
      "ইমাম মাহমুদ আল-আলূসী (রহঃ)-এর পূর্ণ নাম হলো শিহাবুদ্দীন আবুল-ফানা মাহমুদ ইবনে আবদুল্লাহ ইবনে মাহমুদ আল-আলূসী আল-বাগদাদী। তিনি ছিলেন তাঁর সময়ের হানাফী ফিকহ, তাফসীর ও সাহিত্যশাস্ত্রে বিখ্যাত পণ্ডিত।",
      "তাঁর উপনাম ছিল শিহাবুদ্দীন। তিনি ইরাকের আলূস শহর থেকে এসেছিলেন, তাই তিনি 'আল-আলূসী' নামে পরিচিত।",
      "তিনি তাঁর বিশাল তাফসীর গ্রন্থের জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১২১৭ হিজরিতে (১৮০২ খ্রিস্টাব্দে) ইরাকের বাগদাদে জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি বাগদাদের জ্ঞানকেন্দ্রগুলোতে শিক্ষা লাভ করেন এবং আরবি ভাষা ও সাহিত্যের প্রতি বিশেষ মনোযোগ দেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর পিতা এবং বাগদাদের অন্যান্য আলেমদের কাছ থেকে হানাফী ফিকহ, হাদিস ও তাফসীর শেখেন।",
      "প্রধান গ্রন্থ: রুহ আল-মা'আনী\n\nতাঁর প্রধান গ্রন্থ হলো 'রুহ আল-মা'আনী ফি তাফসীরিল কুরআন আল-আযীম ওয়া আস-সাব'আল মাছানী'। এটি কুরআনের এক বিশাল ও বিস্তৃত তাফসীর গ্রন্থ।",
      "তাফসীরের বৈশিষ্ট্য\n\nতাঁর তাফসীরটি বিভিন্ন ফিকহী মাযহাব, ধর্মতত্ত্ব, দর্শন এবং আধুনিক বিজ্ঞানের প্রাসঙ্গিক আলোচনার জন্য বিখ্যাত।",
      "কর্মজীবন\n\nতিনি বাগদাদে শিক্ষকতা ও ফতোয়া প্রদানের কাজ করেন এবং উসমানীয় খিলাফতের অধীনে বিভিন্ন পদে নিযুক্ত ছিলেন।",
      "মৃত্যু\n\nতিনি ১২৭০ হিজরিতে (১৮৫৪ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন।"
    ],
    "source": "আল-যিরিকলী, আল-আ'লাম"
  },
  {
    "id": "imam_al_qawuqji",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ হাসানাইন আল-ক্বাউক্বজী (রহঃ)",
    "paragraphs": [
      "ইমাম মুহাম্মদ হাসানাইন আল-ক্বাউক্বজী (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ হাসানাইন ইবনে আব্দুল আজিজ ইবনে মুহাম্মদ আল-ক্বাউক্বজী আল-তারাবলুসী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস, ফকীহ এবং সুফি পণ্ডিত।",
      "তাঁর উপনাম ছিল আবু আল-ফিদা। তিনি প্রধানত হাদিসশাস্ত্র, ফিকহ (হানাফী) এবং বিশেষ করে সুফিবাদ সম্পর্কিত গ্রন্থ রচনার জন্য পরিচিত।",
      "তিনি সিরিয়া ও লেবাননে জ্ঞানচর্চা ও অধ্যাপনার ক্ষেত্রে বিশেষ প্রভাব ফেলেছিলেন এবং একজন মুহাদ্দিস হিসেবে তাঁর মর্যাদা ছিল সুউচ্চ।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১২২৩ হিজরিতে (১৮০৮ খ্রিস্টাব্দে) লেবাননের ত্রিপোলি শহরে জন্মগ্রহণ করেন। ত্রিপোলি তখন জ্ঞানচর্চার একটি গুরুত্বপূর্ণ কেন্দ্র ছিল।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার ছিল সম্ভ্রান্ত এবং জ্ঞানপিপাসু। তিনি শৈশব থেকেই জ্ঞানার্জনের অনুকূল পরিবেশ পান।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি ত্রিপোলিতে প্রাথমিক শিক্ষা সম্পন্ন করেন এবং আরবি ভাষা, ফিকহ ও হাদিসে দক্ষতা লাভ করেন।",
      "তিনি প্রখর মেধার অধিকারী ছিলেন এবং অল্প বয়সেই কায়রোর আল-আজহার বিশ্ববিদ্যালয়ে উচ্চশিক্ষার জন্য গমন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি কায়রোতে আল-আজহারের প্রখ্যাত আলেমদের কাছ থেকে ফিকহ ও হাদিস শিক্ষা লাভ করেন। বিশেষত তিনি হাদিসশাস্ত্রে পাণ্ডিত্য অর্জন করেন।",
      "প্রধান গ্রন্থসমূহ\n\nতাঁর রচিত গ্রন্থাবলির মধ্যে অন্যতম হলো 'আল-ফিহরিস্ত' (তাঁর শিক্ষকদের জীবনী ও ইলমের বর্ণনা) এবং 'আল-দালা'ইল আল-খায়রাত'-এর উপর তাঁর টিকা।",
      "তিনি হাদিস ও সুফিবাদ সম্পর্কিত প্রায় ৫০টিরও বেশি গ্রন্থ রচনা করেছেন।",
      "তাঁর লেখার উদ্দেশ্য ছিল মুসলিম সমাজের আত্মশুদ্ধি ও আধ্যাত্মিক দিকগুলিকে শক্তিশালী করা।",
      "হাদিস ও ফিকহী অবস্থান\n\nতিনি হানাফী মাযহাবের অনুসরণ করতেন এবং হাদিসশাস্ত্রকে ফিকহের আলোকে ব্যাখ্যা করার ক্ষেত্রে তাঁর বিশেষ দক্ষতা ছিল।",
      "সুফি দর্শন\n\nতিনি সুফিবাদকে ইসলামি শরিয়তের আলোকে ব্যাখ্যা করার চেষ্টা করেন এবং মুসলিমদের আধ্যাত্মিক পরিশুদ্ধির ওপর জোর দেন।",
      "কর্মজীবন\n\nতিনি ত্রিপোলি এবং দামেস্কে অধ্যাপনা করেন এবং বহু ছাত্র তাঁর জ্ঞানের ধারাকে এগিয়ে নিয়ে যান।",
      "তাঁর ছাত্ররা সিরিয়া, মিশর ও লেবাননের পরবর্তী আলেমদের মধ্যে প্রভাবশালী ছিলেন।",
      "রাজনৈতিক সম্পর্ক\n\nতিনি রাজনৈতিক কর্মকাণ্ড থেকে দূরে থেকে জ্ঞানচর্চা ও ইবাদতে মনোনিবেশ করেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং একজন পরিশ্রমী লেখক ও শিক্ষক।",
      "মৃত্যু\n\nতিনি ১৩০৫ হিজরিতে (১৮৮৮ খ্রিস্টাব্দে) ত্রিপোলিতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nআল-ক্বাউক্বজী (রহঃ)-এর জীবন হাদিস, ফিকহ ও সুফিবাদের মধ্যে সমন্বয় সাধনের এক উজ্জ্বল দৃষ্টান্ত।",
      "তাঁর রচনাবলী আজও হাদিস ও সুফিবাদ অধ্যয়নের ক্ষেত্রে গুরুত্বপূর্ণ উৎস হিসেবে বিবেচিত হয়।"
    ],
    "source": "আল-যিরিকলী, আল-আ'লাম"
  },
  {
    "id": "imam_muhammad_abduh",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ আবদুহু (রহঃ)",
    "paragraphs": [
      "ইমাম মুহাম্মদ আবদুহু (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ ইবনে আবদুহু ইবনে হাসান খয়রুল্লাহ। তিনি ছিলেন আধুনিক ইসলামি চিন্তাধারা ও সংস্কার আন্দোলনের অন্যতম প্রধান নেতা।",
      "তাঁর উপাধি ছিল আল-ইমাম আল-মুজাহিদ (সংস্কারক ইমাম)। তিনি ইসলামি শিক্ষাব্যবস্থা ও চিন্তাকে আধুনিক বিশ্বের চ্যালেঞ্জ মোকাবেলায় সংস্কার করার জন্য পরিচিত।",
      "তিনি প্রধানত ধর্মতত্ত্ব, সমাজ সংস্কার এবং কুরআন ব্যাখ্যার ক্ষেত্রে তাঁর অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১২৬৬ হিজরিতে (১৮৪৯ খ্রিস্টাব্দে) মিশরের আল-বুহায়রা অঞ্চলে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি ছিলেন সাধারণ কৃষক পরিবারের সন্তান। শৈশবেই তিনি কুরআনের প্রতি আগ্রহী হন এবং পারিবারিক জীবনেও সহজসরলতা বজায় রাখতেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি গ্রামের মাদ্রাসায় প্রাথমিক শিক্ষা সম্পন্ন করেন এবং অল্প বয়সে কায়রোর আল-আজহার বিশ্ববিদ্যালয়ে উচ্চশিক্ষার জন্য গমন করেন।",
      "শিক্ষকমণ্ডলী\n\nআল-আজহারে তাঁর প্রধান শিক্ষক ছিলেন শাইখ হাসান আল-তাভীর। কিন্তু তাঁর চিন্তাধারায় সবচেয়ে বেশি প্রভাব ফেলেছিলেন তাঁর আরেক শিক্ষক সায়্যিদ জামালুদ্দিন আল-আফগানী (রহঃ)।",
      "আল-আফগানী (রহঃ)-এর সান্নিধ্য\n\nতিনি সায়্যিদ জামালুদ্দিন আল-আফগানী (রহঃ)-এর কাছ থেকে যুক্তিবিদ্যা, দর্শন এবং সমাজ সংস্কারের ধারণা লাভ করেন। এই সান্নিধ্যই তাঁর জীবন ও চিন্তাধারার মোড় ঘুরিয়ে দেয়।",
      "সংস্কার আন্দোলন\n\nতিনি বিশ্বাস করতেন যে, মুসলিম বিশ্বের পিছিয়ে পড়ার প্রধান কারণ হলো ইসলামি জ্ঞানের স্থবিরতা এবং পশ্চিমা চ্যালেঞ্জ মোকাবিলায় ব্যর্থতা। তিনি ইসলামকে আধুনিক জ্ঞান ও যুক্তির আলোকে ব্যাখ্যা করার ওপর জোর দেন।",
      "প্রধান গ্রন্থ: তাফসীর আল-মানার\n\nতাঁর প্রধান গ্রন্থ হলো 'তাফসীর আল-মানার' (আল-কুরআনের ব্যাখ্যা), যা তাঁর ছাত্র মুহাম্মদ রশীদ রিদা সংকলন করেন। এই তাফসীর আধুনিক যুগোপযোগী ব্যাখ্যার জন্য পরিচিত।",
      "তাঁর পদ্ধতি\n\nতিনি কুরআনের ব্যাখ্যার ক্ষেত্রে 'আল-কুরআন আল-কারি’আহ' (যুক্তির আহ্বান) পদ্ধতির ওপর জোর দেন, যাতে ধর্ম ও বিজ্ঞান সমান্তরালে চলতে পারে।",
      "কর্মজীবন ও প্রশাসনিক ভূমিকা\n\nতিনি মিশরের আল-আজহার বিশ্ববিদ্যালয়ের অধ্যাপক, সংবাদপত্র সম্পাদক এবং মিশরের প্রধান মুফতি হিসেবে দায়িত্ব পালন করেন।",
      "আল-আজহার সংস্কার\n\nপ্রধান মুফতি হিসেবে তিনি আল-আজহার বিশ্ববিদ্যালয়ের শিক্ষাব্যবস্থার সংস্কারে গুরুত্বপূর্ণ ভূমিকা রাখেন এবং আধুনিক বিজ্ঞান ও যুক্তিশাস্ত্রকে পাঠ্যক্রমে অন্তর্ভুক্ত করার চেষ্টা করেন।",
      "রাজনৈতিক ভূমিকা\n\nতিনি ব্রিটিশ উপনিবেশিক শক্তির বিরুদ্ধে রাজনৈতিক কার্যক্রমে জড়িত ছিলেন, যার কারণে তাঁকে সাময়িকভাবে মিশর থেকে নির্বাসিত করা হয়।",
      "ছাত্রবৃন্দ\n\nমুহাম্মদ আবদুহুর ছাত্ররা, বিশেষ করে মুহাম্মদ রশীদ রিদা, তাঁর সংস্কারবাদী চিন্তাধারাকে মুসলিম বিশ্বের বিভিন্ন স্থানে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন ধার্মিক, যুক্তিবাদী এবং সমাজের প্রতি গভীর অঙ্গীকারবদ্ধ। তিনি তাঁর সংস্কারের জন্য অনেক বিতর্কের মুখেও দৃঢ় ছিলেন।",
      "মৃত্যু\n\nতিনি ১৩২৩ হিজরিতে (১৯০৫ খ্রিস্টাব্দে) মিশরের আলেকজান্দ্রিয়ায় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম মুহাম্মদ আবদুহু (রহঃ)-এর চিন্তা মুসলিম বিশ্বের আধুনিকায়ন ও সংস্কার আন্দোলনে এক যুগান্তকারী প্রভাব ফেলে এবং আজও প্রাসঙ্গিক।"
    ],
    "source": "মুহাম্মদ রশীদ রিদা, তারীখ আল-উস্তাদ আল-ইমাম"
  },
  {
    "id": "imam_rashid_rida",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ রশীদ রিদা (রহঃ)",
    "paragraphs": [
      "ইমাম মুহাম্মদ রশীদ রিদা (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ রশীদ ইবনে আলী রিদা। তিনি ছিলেন সিরিয়া বংশোদ্ভূত একজন প্রভাবশালী আলেম, মুফাসসির এবং আধুনিক ইসলামি সংস্কার আন্দোলনের অন্যতম প্রধান নেতা।",
      "তাঁর উপাধি ছিল আল-সায়্যিদ। তিনি ছিলেন ইমাম মুহাম্মদ আবদুহুর সুযোগ্য ছাত্র এবং তাঁর সংস্কারবাদী চিন্তাধারার প্রধান প্রচারক।",
      "তিনি 'আল-মানার' ম্যাগাজিনের মাধ্যমে মুসলিম সমাজে রাজনৈতিক ও ধর্মীয় সচেতনতা সৃষ্টি করেন এবং ইজতিহাদের পক্ষে জোর দেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১২৮২ হিজরিতে (১৮৬৫ খ্রিস্টাব্দে) সিরিয়ার ত্রিপোলি শহরে জন্মগ্রহণ করেন। সিরিয়া তখন উসমানীয় খিলাফতের অধীনে ছিল।",
      "পারিবারিক পটভূমি\n\nতিনি ছিলেন একটি জ্ঞানপিপাসু পরিবারে সন্তান। শৈশব থেকেই ইসলামি জ্ঞানের প্রতি তাঁর গভীর আকর্ষণ ছিল।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি ত্রিপোলিতে প্রাথমিক ইসলামি জ্ঞান লাভ করেন। তাঁর মেধা এবং যুক্তিবাদী চিন্তাধারা অল্প বয়সেই বিকশিত হয়।",
      "শিক্ষকমণ্ডলী ও আবদুহুর সান্নিধ্য\n\nতিনি দামেস্কের আলেমদের কাছ থেকে শিক্ষা লাভ করেন, কিন্তু তাঁর জীবনের মোড় ঘুরে যায় যখন তিনি ইমাম মুহাম্মদ আবদুহুর সান্নিধ্যে আসেন।",
      "তিনি ১৮৯৭ খ্রিস্টাব্দে কায়রোতে ইমাম মুহাম্মদ আবদুহুর কাছে হিজরত করেন এবং তাঁর ছাত্র ও ঘনিষ্ঠ সহচর হন।",
      "প্রধান গ্রন্থ: তাফসীর আল-মানার\n\nতাঁর প্রধান গ্রন্থ হলো 'তাফসীর আল-মানার', যা তাঁর উস্তাদ মুহাম্মদ আবদুহুর কুরআনের ব্যাখ্যার ওপর ভিত্তি করে রচিত এবং যা আধুনিক তাফসীরের ক্ষেত্রে এক মৌলিক গ্রন্থ।",
      "তাফসীরের পদ্ধতি\n\nএই তাফসীরে তিনি ধর্মীয় গোঁড়ামি দূর করে ইসলামকে যুক্তিনির্ভরভাবে উপস্থাপনের চেষ্টা করেন এবং মুসলিম উম্মাহর জাগরণের ওপর জোর দেন।",
      "সাংবাদিকতা ও সংস্কার\n\nতিনি ১৩১৫ হিজরিতে (১৮৯৮ খ্রিস্টাব্দে) কায়রোতে 'আল-মানার' নামে একটি প্রভাবশালী ম্যাগাজিন প্রকাশ করেন, যার মাধ্যমে তিনি মুসলিম সমাজের কুসংস্কার দূর করার চেষ্টা করেন।",
      "ফিকহী অবস্থান\n\nতিনি মাযহাবের মধ্যে অন্ধ অনুকরণ (তাকলীদ) না করে সরাসরি কুরআন ও সুন্নাহর ভিত্তিতে ইজতিহাদের ওপর জোর দেন।",
      "রাজনৈতিক ভূমিকা\n\nতিনি উসমানীয় খিলাফতের পতনের পর ইসলামি রাজনৈতিক পুনর্গঠনের পক্ষে অবস্থান নেন এবং আধুনিক ইসলামি রাষ্ট্রের ধারণা নিয়ে কাজ করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর ম্যাগাজিন ও গ্রন্থাবলি পুরো আরব বিশ্ব এবং ভারতীয় উপমহাদেশে প্রভাব ফেলে এবং অসংখ্য সংস্কারবাদী ছাত্র তৈরি করে।",
      "কর্মজীবন\n\nতিনি শিক্ষকতা, সাংবাদিকতা এবং গ্রন্থ রচনার মাধ্যমে তাঁর জীবন অতিবাহিত করেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, কঠোর পরিশ্রমী এবং সংস্কারের প্রতি নিবেদিতপ্রাণ। তাঁর লেখার মাধ্যমে তিনি তাঁর যুগের চ্যালেঞ্জ মোকাবিলা করেছেন।",
      "মৃত্যু\n\nতিনি ১৩৫৪ হিজরিতে (১৯৩৫ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nমুহাম্মদ রশীদ রিদা (রহঃ)-এর সাংবাদিকতা ও পাণ্ডিত্য আধুনিক ইসলামি চিন্তাধারায় স্থায়ী প্রভাব ফেলে।"
    ],
    "source": "উইকিপিডিয়া (মুহাম্মদ রশীদ রিদা সম্পর্কিত ভুক্তি); মুহাম্মদ রশীদ রিদা, আল-মানার"
  },
  {
    "id": "imam_al_alusi_jr",
    "categoryId": "imam_jibon",
    "title": "আল্লামা মাহমুদ শুকরী আল-আলূসী (রহঃ)",
    "paragraphs": [
      "আল্লামা মাহমুদ শুকরী আল-আলূসী (রহঃ)-এর পূর্ণ নাম হলো মাহমুদ শুকরী ইবনে আব্দুল্লাহ ইবনে মাহমুদ আল-আলূসী। তিনি ছিলেন তাঁর সময়ের হানাফী ফিকহ, হাদিস এবং আরবি ভাষা ও সাহিত্যের অন্যতম শ্রেষ্ঠ পণ্ডিত।",
      "তাঁর উপনাম ছিল মাহমুদ। তিনি পূর্ববর্তী বিখ্যাত মুফাসসির আলূসী পরিবারের সদস্য ছিলেন। তাঁকে আরবি ভাষার একজন মহান ভাষাবিদ ও সাহিত্যিক হিসেবে গণ্য করা হতো।",
      "তিনি প্রধানত হাদিসের বিশুদ্ধতা ও ইতিহাস সংক্রান্ত তাঁর গবেষণার জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১২৭৩ হিজরিতে (১৮৫৬ খ্রিস্টাব্দে) ইরাকের বাগদাদে জন্মগ্রহণ করেন। বাগদাদ তখন উসমানীয় সাম্রাজ্যের একটি গুরুত্বপূর্ণ প্রশাসনিক ও জ্ঞানকেন্দ্র ছিল।",
      "পারিবারিক পটভূমি\n\nতিনি তাঁর দাদা ইমাম মাহমুদ আল-আলূসী (রহঃ) (তাফসীর রুহ আল-মা'আনী-এর রচয়িতা)-এর কাছে জ্ঞান ও অনুপ্রেরণা লাভ করেন। তাঁর পরিবার কয়েক প্রজন্ম ধরে বাগদাদের প্রধান হানাফী আলেম হিসেবে পরিচিত।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি বাগদাদের জ্ঞানকেন্দ্রগুলোতে শিক্ষা লাভ করেন এবং আরবি ভাষা ও সাহিত্যের প্রতি বিশেষ মনোযোগ দেন।",
      "তাঁর মেধা ছিল প্রখর, যার কারণে তিনি অল্প বয়সেই হানাফী ফিকহ ও হাদিসশাস্ত্রে পাণ্ডিত্য অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর পিতা এবং বাগদাদের অন্যান্য আলেমদের কাছ থেকে হানাফী ফিকহ, হাদিস ও তাফসীর শেখেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে অন্যতম হলো 'তারীখ নাজদ' (নজদের ইতিহাস) এবং তাঁর পূর্বসূরিদের কাজগুলোর ওপর গবেষণা।",
      "অন্যান্য গ্রন্থ\n\nতিনি 'তাফসীর রুহ আল-মা'আনী' (তাঁর দাদার তাফসীরের ওপর কাজ) এবং আরবি ভাষা ও ব্যাকরণের ওপর বহু গ্রন্থ রচনা করেন।",
      "হাদিস ও ফিকহী অবস্থান\n\nতিনি হাদিসের বিশুদ্ধতার ওপর জোর দেন এবং তাঁর দাদার মতো যুক্তিনির্ভর হানাফী ফিকহের অনুসরণ করতেন। তিনি হাদিস এবং আক্বীদাগত বিতর্কের ক্ষেত্রে অত্যন্ত কঠোর ছিলেন।",
      "কর্মজীবন\n\nতিনি বাগদাদে শিক্ষকতা ও ফতোয়া প্রদানের কাজ করেন এবং উসমানীয় খিলাফতের অধীনে বিভিন্ন পদে নিযুক্ত ছিলেন।",
      "তাঁর প্রভাব\n\nতিনি ইরাকে হাদিস ও সুন্নাহর প্রচারের ক্ষেত্রে বিশাল ভূমিকা রাখেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত পরিশ্রমী এবং জ্ঞানচর্চার প্রতি নিবেদিতপ্রাণ।",
      "মৃত্যু\n\nতিনি ১৩৪২ হিজরিতে (১৯২৪ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nআল্লামা মাহমুদ শুকরী আল-আলূসী (রহঃ)-এর জীবন জ্ঞান সাধনা এবং পারিবারিক জ্ঞানের উত্তরাধিকারকে সংরক্ষণ ও সমৃদ্ধ করার এক উজ্জ্বল উদাহরণ।",
      "তাঁর রচনাবলী ইতিহাস, হাদিস ও আরবি সাহিত্যের মৌলিক উৎস হিসেবে বিবেচিত হয়।"
    ],
    "source": "আল-যিরিকলী, আল-আ'লাম"
  },
  {
    "id": "imam_al_albani",
    "categoryId": "imam_jibon",
    "title": "শাইখ মুহাম্মদ নাসিরুদ্দীন আল-আলবানী (রহঃ)",
    "paragraphs": [
      "শাইখ মুহাম্মদ নাসিরুদ্দীন আল-আলবানী (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ নাসিরুদ্দীন ইবনে নূহ ইবনে আদম আল-আলবানী আল-আরনাউতী। তিনি ছিলেন আধুনিক যুগের হাদিসশাস্ত্রের অন্যতম শ্রেষ্ঠ পণ্ডিত।",
      "তাঁর উপাধি ছিল আবু আব্দুর রহমান। তাঁকে তাঁর যুগের 'মুহাদ্দিস আল-আস্র' (যুগের মুহাদ্দিস) হিসেবে পরিচিত ছিলেন।",
      "তিনি হাদিসের বিশুদ্ধতা যাচাই এবং দুর্বল হাদিস চিহ্নিত করার ক্ষেত্রে তাঁর কঠোর পদ্ধতির জন্য বিখ্যাত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১৩৩৩ হিজরিতে (১৯১৪ খ্রিস্টাব্দে) আলবেনিয়ার শকোডারে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা ছিলেন একজন হানাফী ফিকহের আলেম। শৈশবেই তাঁর পরিবার ধর্মীয় নিপীড়ন থেকে বাঁচতে সিরিয়ার দামেস্কে হিজরত করে।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nদামেস্কে তাঁর পিতা তাঁকে ধর্মীয় ও ভাষাগত শিক্ষা দেন। তবে হাদিসশাস্ত্রে তাঁর জ্ঞান ছিল প্রধানত স্ব-অধ্যয়নের ফল।",
      "পেশা\n\nপেশাগতভাবে তিনি ছিলেন একজন ঘড়ি মেরামতকারী, কিন্তু তাঁর আগ্রহ ছিল হাদিসশাস্ত্রের গভীরে।",
      "হাদিস গবেষণা\n\nতিনি দামেস্কের আল-জাহিরিয়্যাহ লাইব্রেরিতে গিয়ে দিনের বেশিরভাগ সময় হাদিস গবেষণা করতেন। তিনি রিজাল শাস্ত্রের বহু প্রাচীন গ্রন্থ মুখস্থ করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে রয়েছে হাদিস যাচাইয়ের সিরিজ: 'সিলসিলাত আল-আহাদিস আস-সহীহাহ' এবং 'সিলসিলাত আল-আহাদিস আদ-দাঈফাহ'।",
      "এছাড়াও তিনি সিহাহ সিত্তাহ সহ বহু হাদিস গ্রন্থের তাহক্বীক (যাচাই) করেন এবং 'সহীহ আল-জামি আস-সাগীর' সংকলন করেন।",
      "ফিকহী অবস্থান\n\nতিনি কোনো একক মাযহাবের অন্ধ অনুকরণ না করে সরাসরি কুরআন ও সহীহ হাদিসের দলিলের ওপর ভিত্তি করে ফিকহী সিদ্ধান্ত নিতেন।",
      "কর্মজীবন\n\nতিনি মদীনা ইসলামি বিশ্ববিদ্যালয়ের অধ্যাপক হিসেবে দায়িত্ব পালন করেন।",
      "বিতর্ক\n\nহাদিস যাচাইয়ের ক্ষেত্রে তাঁর কঠোর পদ্ধতি এবং অনেক প্রচলিত হাদিসকে দুর্বল ঘোষণার কারণে তিনি তাঁর সমসাময়িক কিছু আলেমের সমালোচনার মুখে পড়েন।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্ররা আরব বিশ্বসহ পশ্চিমা দেশগুলোতে তাঁর জ্ঞানের ধারাকে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত পরিশ্রমী এবং কঠোরভাবে তাঁর সময়কে হাদিস গবেষণায় ব্যয় করতেন।",
      "মৃত্যু\n\nতিনি ১৪২০ হিজরিতে (১৯৯৯ খ্রিস্টাব্দে) জর্ডানের আম্মানে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nআল-আলবানী (রহঃ)-এর জীবন আধুনিক যুগের হাদিস গবেষণায় এক নতুন দিগন্ত উন্মোচন করে।",
      "তাঁর রচনাবলী হাদিসশাস্ত্রের ক্ষেত্রে আজও মৌলিক উৎস হিসেবে ব্যবহৃত হয়।"
    ],
    "source": "উইকিপিডিয়া (আল-আলবানী সম্পর্কিত ভুক্তি)"
  },
  {
    "id": "imam_al_baghawi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-ফাররা আল-বাগাওয়ী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-ফাররা আল-বাগাওয়ী (রহঃ)-এর পূর্ণ নাম হলো আবু মুহাম্মদ আল-হুসাইন ইবনে মাসউদ ইবনে মুহাম্মদ ইবনে আল-ফাররা আল-বাগাওয়ী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুফাসসির, মুহাদ্দিস এবং শাফেয়ী ফকীহ।",
      "তাঁর উপনাম ছিল আবু মুহাম্মদ। তাঁকে 'মুহিউস সুন্নাহ' (সুন্নাহর পুনরুজ্জীবনকারী) উপাধিতে ভূষিত করা হয়। তিনি খোরাসানের বাগ ও বাগশুর অঞ্চলের অধিবাসী ছিলেন, যা থেকে তাঁর নাম 'আল-বাগাওয়ী' এসেছে।",
      "তিনি শাফেয়ী মাযহাবের একজন নিষ্ঠাবান অনুসারী ছিলেন এবং হাদিস, ফিকহ ও তাফসীর শাস্ত্রে তাঁর পাণ্ডিত্য ছিল।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৪৩৬ হিজরিতে (১০৪৫ খ্রিস্টাব্দে) খোরাসান অঞ্চলের বাগ বা বাগশুর (বাগাওয়ানে) গ্রামে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে জড়িত ছিল এবং তিনি অনুকূল পরিবেশে বেড়ে ওঠেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবেই কুরআন হিফয করেন এবং হাদিস ও ফিকহের প্রাথমিক জ্ঞান অর্জন করেন। তিনি তাঁর প্রখর মেধার জন্য সুপরিচিত ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি কাজি হুসাইন ইবনে মুহাম্মদ আল-মারওয়াযী সহ বহু আলেমের কাছ থেকে ফিকহ ও হাদিস শিক্ষা লাভ করেন।",
      "প্রধান গ্রন্থ: তাফসীরে মা'আলিমুত তানযীল\n\nতাঁর প্রধান গ্রন্থ হলো 'মা'আলিমুত তানযীল', যা 'তাফসীর আল-বাগাওয়ী' নামেই পরিচিত। এটি হাদিস ও আছার (সাহাবীদের বক্তব্য)-এর ওপর ভিত্তি করে রচিত একটি গুরুত্বপূর্ণ তাফসীর গ্রন্থ।",
      "তাফসীরের পদ্ধতি\n\nতাঁর তাফসীরের বিশেষত্ব হলো এর সরলতা এবং ইসরাঈলি বর্ণনা (যা অন্যান্য তাফসীরে পাওয়া যায়) এড়িয়ে হাদিস ও সাহাবীদের বক্তব্যকে প্রাধান্য দেওয়া।",
      "অন্যান্য গ্রন্থ\n\nহাদিস সংকলনে তাঁর প্রধান গ্রন্থ হলো 'শারহুস সুন্নাহ' এবং 'মাসাবীহুস সুন্নাহ'। এই গ্রন্থটিই পরবর্তীতে আল-খতীব আল-তাবরিযীর হাতে মিশকাত আল-মাসাবীহ নামে পূর্ণতা লাভ করে।",
      "মাসাবীহুস সুন্নাহ হাদিস সংকলনের ক্ষেত্রে একটি গুরুত্বপূর্ণ গ্রন্থ হিসেবে বিবেচিত।",
      "ফিকহী অবস্থান\n\nতিনি ছিলেন শাফেয়ী মাযহাবের একজন নিষ্ঠাবান অনুসারী এবং তাঁর ফিকহী সিদ্ধান্তগুলো শাফেয়ী ফিকহের ক্ষেত্রে গুরুত্বপূর্ণ ছিল।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের বেশিরভাগ সময় শিক্ষাদান, গ্রন্থ রচনা এবং ইবাদতে ব্যয় করেন। তিনি কোনো প্রশাসনিক বা বিচারিক পদে ছিলেন না।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন খুবই বিনয়ী, দুনিয়াবি মোহমুক্ত (যাহিদ) এবং তাঁর সময়কে জ্ঞান বিতরণে ব্যয় করতেন।",
      "মৃত্যু\n\nতিনি ৫১৬ হিজরিতে (১১২২ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-বাগাওয়ী (রহঃ)-এর জীবন হাদিস ও আছারের ভিত্তিতে কুরআন ও সুন্নাহর সরল ব্যাখ্যা দেওয়ার ক্ষেত্রে তাঁর নিষ্ঠা এবং কঠোর পরিশ্রমের প্রমাণ দেয়।",
      "তাঁর রচনাবলী আজও শাফেয়ী ও মুহাদ্দিসদের কাছে মৌলিক গ্রন্থ হিসেবে পঠিত হয়।",
      "তাঁর তাফসীরটি তাফসীর বিল-মা'ছূর (বর্ণনার ভিত্তিতে তাফসীর) ধারার অন্যতম শ্রেষ্ঠ গ্রন্থ।",
      "তাঁর জ্ঞান সাধনা তাঁর যুগের আলেমদের জন্য এক অনুপ্রেরণা ছিল।",
      "তিনি জ্ঞান ও বিনয়ের প্রতীক হিসেবে স্মরণীয় হয়ে আছেন।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "qadi_iyad",
    "categoryId": "imam_jibon",
    "title": "কাজী ইয়াদ (রহঃ)",
    "paragraphs": [
      "কাজী ইয়াদ (রহঃ)-এর পূর্ণ নাম হলো আবু আল-ফযল ইয়াদ ইবনে মূসা ইবনে ইয়াদ ইবনে উমর ইবনে ইয়া’ইয়া ইবনে তামীম। তিনি ছিলেন আন্দালুস এবং উত্তর আফ্রিকার মালিকি মাযহাবের একজন প্রখ্যাত ফকীহ, মুহাদ্দিস ও ঐতিহাসিক।",
      "তাঁর উপনাম ছিল আবু আল-ফযল। তিনি 'কাজী' উপাধি লাভ করেন, কারণ তিনি তাঁর জীবনের একটি দীর্ঘ সময় বিচারকের (কাজী) দায়িত্ব পালন করেছেন।",
      "তিনি সীরাত (নবীজির জীবনী) এবং হাদিসশাস্ত্রের ক্ষেত্রে তাঁর অসামান্য অবদানের জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৪৭৬ হিজরিতে (১০৮৩ খ্রিস্টাব্দে) মরক্কোর সেবতা (Ceuta) শহরে জন্মগ্রহণ করেন। সেবতা তখন ছিল আল-মুরাবিতুনদের অধীনে গুরুত্বপূর্ণ জ্ঞানকেন্দ্র।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল এবং তিনি শৈশবেই অনুকূল পরিবেশে জ্ঞানার্জন শুরু করেন।",
      "শিক্ষা ও মেধা\n\nতিনি সেবতা এবং আন্দালুসের কর্ডোভা সহ বিভিন্ন কেন্দ্রে প্রাথমিক ও উচ্চশিক্ষা সম্পন্ন করেন। তিনি হাদিস, ফিকহ ও আরবি সাহিত্যে গভীর জ্ঞান অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের শ্রেষ্ঠ মালিকি ফকীহদের কাছ থেকে শিক্ষা লাভ করেন।",
      "প্রধান গ্রন্থ: কিতাব আশ-শিফা\n\nতাঁর প্রধান গ্রন্থ হলো 'কিতাব আশ-শিফা বিতারিফি হুকুকিল মুস্তাফা'। এটি নবী মুহাম্মদ (সাঃ)-এর মর্যাদা, গুণাবলী এবং তাঁর অধিকারসমূহ সম্পর্কে রচিত অন্যতম শ্রেষ্ঠ গ্রন্থ।",
      "গ্রন্থের প্রভাব\n\nএই গ্রন্থটি ইসলামের ইতিহাস এবং সীরাত (নবীজির জীবনী) সাহিত্যে একটি মৌলিক এবং প্রভাবশালী কাজ হিসেবে গণ্য হয়। এই গ্রন্থটি নবীপ্রেমের (মুহাব্বাহ) দৃষ্টিকোণ থেকে গুরুত্বপূর্ণ।",
      "অন্যান্য গ্রন্থ\n\nহাদিসের ক্ষেত্রে তাঁর গুরুত্বপূর্ণ গ্রন্থ হলো 'আল-ইলমা ইলা মা'রিফাত উসূল আল-রিওয়া' (হাদিস বর্ণনার মূলনীতি) এবং মালিকি ফিকহেও তাঁর অবদান রয়েছে।",
      "ফিকহী অবস্থান\n\nতিনি ছিলেন মালিকি মাযহাবের একজন অন্যতম প্রধান ফকীহ এবং তাঁর ফিকহী সিদ্ধান্তগুলো আন্দালুস এবং উত্তর আফ্রিকায় বহুল প্রচলিত ছিল।",
      "পেশাগত জীবন\n\nতিনি সেবতার প্রধান বিচারক হিসেবে কাজ করেন এবং পরে আন্দালুসের গ্রানাডাতেও প্রধান বিচারকের দায়িত্ব পালন করেন।",
      "রাজনৈতিক ভূমিকা\n\nতিনি আল-মুওয়াহহিদুন (Almohad) আন্দোলনের বিরুদ্ধে অবস্থান নিয়েছিলেন, যা ছিল তাঁর সময়ের একটি শক্তিশালী রাজনৈতিক ও ধর্মীয় শক্তি।",
      "এই বিরোধিতার কারণে তাঁকে বিচারিক পদ থেকে অব্যাহতি দেওয়া হয় এবং তাঁর জীবনে কঠিন সময় আসে।",
      "মৃত্যু\n\nতিনি ৫৪৪ হিজরিতে (১১৪৯ খ্রিস্টাব্দে) মারাকেশে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nকাজী ইয়াদ (রহঃ)-এর জীবন প্রমাণ করে যে, একজন আলেম বিচারিক দায়িত্ব পালনের পাশাপাশি নবী (সাঃ)-এর মর্যাদা রক্ষায় জ্ঞানগত অবদান রাখতে পারে এবং সত্যের জন্য রাজনৈতিক ঝুঁকি নিতে পারে।",
      "তাঁর গ্রন্থাবলি মালিকি ফিকহ ও সীরাত শাস্ত্রে মৌলিক উৎস হিসেবে বিবেচিত হয়।",
      "তিনি তাঁর সময়ের অন্যতম শ্রেষ্ঠ পণ্ডিত হিসেবে স্মরণীয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_ibn_asakir",
    "categoryId": "imam_jibon",
    "title": "ইবনে আসাকির (আবু আল-কাসিম) (রহঃ)",
    "paragraphs": [
      "ইবনে আসাকির (রহঃ)-এর পূর্ণ নাম হলো আবুল কাসিম আলী ইবনে আল-হাসান ইবনে হিবাতিল্লাহ ইবনে আবদুল্লাহ ইবনে আল-হুসাইন আল-দিমাশকী আল-শাফেয়ী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস ও ঐতিহাসিক।",
      "তাঁর উপনাম ছিল আবুল কাসিম। তাঁর পাণ্ডিত্যের কারণে তাঁকে 'হাফিয আল-আযম' (সবচেয়ে বড় হাফিয) উপাধিতে ভূষিত করা হয়।",
      "তিনি প্রধানত তাঁর জন্মস্থান দামেস্কের ইতিহাস সংকলনের জন্য বিখ্যাত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৪৯৯ হিজরিতে (১১০৫ খ্রিস্টাব্দে) সিরিয়ার দামেস্কে জন্মগ্রহণ করেন। দামেস্ক তখন জ্ঞানচর্চার অন্যতম কেন্দ্র ছিল।",
      "পারিবারিক পটভূমি\n\nতিনি একটি আলেম পরিবারে জন্মগ্রহণ করেন এবং তাঁর ভাই-বোনেরাও জ্ঞানচর্চার সঙ্গে যুক্ত ছিলেন।",
      "শিক্ষা ও মেধা\n\nতিনি শৈশব থেকেই হাদিস সংগ্রহে মনোনিবেশ করেন এবং তাঁর প্রখর মেধার জন্য পরিচিত ছিলেন। তিনি অল্প বয়সেই কুরআন ও হাদিস মুখস্থ করেন।",
      "হাদিস সংগ্রহের সফর (রিহলাহ)\n\nতিনি জ্ঞান অন্বেষণের জন্য তৎকালীন মুসলিম বিশ্বের গুরুত্বপূর্ণ কেন্দ্রগুলোতে ব্যাপকভাবে ভ্রমণ করেন। তিনি খোরাসান, ইরাক, হিজাজ এবং মিশরে যান।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের শ্রেষ্ঠ আলেমদের কাছ থেকে শিক্ষা গ্রহণ করেন। তিনি ফিকহ ও হাদিস উভয় ক্ষেত্রেই পারদর্শী ছিলেন।",
      "প্রধান গ্রন্থ: দামেস্কের ইতিহাস\n\nতাঁর প্রধান গ্রন্থ হলো 'তারীখ মাদিনাতি দিমাশ্ক' (দামেস্ক শহরের ইতিহাস)। এটি প্রায় ৮০ খণ্ডে সমাপ্ত। এটি ইসলামি ইতিহাসের অন্যতম বৃহৎ জীবনীমূলক কাজ।",
      "গ্রন্থের গুরুত্ব\n\nএই গ্রন্থে তিনি শুধু দামেস্কের ইতিহাস নয়, বরং তাঁর সময়ের এবং পূর্বের অসংখ্য সাহাবী, তাবেয়ী এবং আলেমের জীবনী সংকলন করেছেন।",
      "অন্যান্য গ্রন্থ\n\nহাদিস ও সীরাত নিয়ে তাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থ রয়েছে। তাঁর সমস্ত রচনাবলী তাঁর বিশাল স্মৃতিশক্তির প্রমাণ বহন করে।",
      "ফিকহী অবস্থান\n\nতিনি ছিলেন শাফেয়ী মাযহাবের একজন অনুসারী এবং তাঁর ফিকহী জ্ঞান তাঁর ঐতিহাসিক লেখাতেও প্রতিফলিত হয়েছে।",
      "পেশাগত জীবন\n\nতিনি দামেস্কের আল-নূরিয়া মাদ্রাসায় অধ্যাপনা করেন। এই মাদ্রাসাটি সালাহুদ্দীন আল-আইয়ুবীর পৃষ্ঠপোষকতায় প্রতিষ্ঠিত হয়েছিল।",
      "রাজনৈতিক সম্পর্ক\n\nতিনি সুলতান সালাহুদ্দীন আল-আইয়ুবীর ঘনিষ্ঠ ছিলেন এবং তাতারদের বিরুদ্ধে জিহাদের ক্ষেত্রে তাঁর জ্ঞান দিয়ে সহযোগিতা করতেন।",
      "মৃত্যু\n\nতিনি ৫৭৩ হিজরিতে (১১৭৬ খ্রিস্টাব্দে) দামেস্কে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইবনে আসাকির (রহঃ)-এর জীবন প্রমাণ করে যে, একজন আলেম জ্ঞান সংকলনের মাধ্যমে তাঁর সময়ের ইতিহাস ও ঐতিহ্যকে চিরস্থায়ী করতে পারে।",
      "তাঁর রচিত ইতিহাস গ্রন্থটি আজও ঐতিহাসিক তথ্যের এক বিশাল ভান্ডার হিসেবে বিবেচিত হয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_ibn_rajab_al_hanbali",
    "categoryId": "imam_jibon",
    "title": "হাফিয ইবনে রজব আল-হাম্বলি (রহঃ)",
    "paragraphs": [
      "হাফিয ইবনে রজব আল-হাম্বলি (রহঃ)-এর পূর্ণ নাম হলো যায়ন আল-দীন আবুল ফারাজ আব্দুর রহমান ইবনে আহমদ ইবনে আব্দুর রহমান ইবনে আল-হাসান। তিনি ছিলেন একজন হাম্বলি ফকীহ, হাদিস পণ্ডিত এবং ধর্মতত্ত্ববিদ।",
      "তাঁর উপনাম ছিল আবুল ফারাজ। তাঁকে 'হাফিয' উপাধিতে ভূষিত করা হয়। তিনি মূলত দামেস্কের অধিবাসী ছিলেন।",
      "তিনি হাদিস ও ফিকহের ক্ষেত্রে হাম্বলি মাযহাবের একজন অন্যতম প্রধান পণ্ডিত ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৭৩৬ হিজরিতে (১৩৩৫ খ্রিস্টাব্দে) ইরাকের বাগদাদে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল এবং তিনি অল্প বয়সেই হাম্বলি ফিকহ ও হাদিস শেখেন।",
      "শিক্ষা ও মেধা\n\nতিনি তাঁর প্রখর মেধা ও স্মৃতিশক্তির জন্য পরিচিত ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর শিক্ষক হাফিয ইবনে কাইয়্যিম আল-জাওযিয়াহ (রহঃ) এবং হাফিয আল-ইরাকী (রহঃ)-এর কাছ থেকে শিক্ষা লাভ করেন।",
      "তিনি শাইখুল ইসলাম ইবনে তাইমিয়াহ (রহঃ)-এর চিন্তাধারা দ্বারাও প্রভাবিত ছিলেন।",
      "প্রধান গ্রন্থ: জামি আল-উলূম ওয়াল হিকাম\n\nতাঁর প্রধান গ্রন্থ হলো 'জামি আল-উলূম ওয়াল হিকাম'। এটি হাদিসের একটি মৌলিক ব্যাখ্যা গ্রন্থ, যা মাত্র ৪২টি হাদিসের বিশদ ব্যাখ্যা করেছে।",
      "অন্যান্য গ্রন্থ\n\nতাঁর হাদিস ও ফিকহের ক্ষেত্রে 'লাতাইফ আল-মা'আরিফ' (বিভিন্ন মাসআলার উপর লেখা) এবং হাম্বলি ফিকহের উপর 'আল-ক্বাওয়াইদ আল-ফিকহিয়্যাহ' উল্লেখযোগ্য।",
      "ফিকহী অবস্থান\n\nতিনি হাম্বলি মাযহাবের একজন অত্যন্ত নিষ্ঠাবান ফকীহ ছিলেন এবং মাযহাবের মধ্যে ইজতিহাদের ওপর জোর দিতেন।",
      "পেশাগত জীবন\n\nতিনি দামেস্কে অধ্যাপনা করেন এবং তাঁর ছাত্রদের মাধ্যমে তাঁর জ্ঞান ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, দুনিয়াবি মোহমুক্ত এবং কঠোর পরিশ্রমী আলেম।",
      "মৃত্যু\n\nতিনি ৭৯৫ হিজরিতে (১৩৯৩ খ্রিস্টাব্দে) দামেস্কে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর গ্রন্থাবলি হাম্বলি মাযহাব এবং হাদিসশাস্ত্রের ব্যাখ্যার ক্ষেত্রে আজও মৌলিক উৎস হিসেবে পঠিত হয়।"
    ],
    "source": "ইবনে হাজার আল-আসকালানী, আল-দুরার আল-কামিনা; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "imam_ibn_al_iraqi",
    "categoryId": "imam_jibon",
    "title": "হাফিয আল-ইরাকী (আবদুর রহিম) (রহঃ)",
    "paragraphs": [
      "হাফিয আল-ইরাকী (রহঃ)-এর পূর্ণ নাম হলো আবু আল-ফযল আব্দুর রহিম ইবনে আল-হুসাইন ইবনে আবদির রহমান আল-ইরাকী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাদিসশাস্ত্রের নীতির (উসূল আল-হাদিস) ইমাম।",
      "তাঁর উপনাম ছিল আবুল ফযল। তাঁকে 'যাইন আল-দীন' এবং 'হাফিযুল হাদিস' উপাধিতে ভূষিত করা হয়।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৭২৫ হিজরিতে (১৩২৫ খ্রিস্টাব্দে) ইরাকের কুর্দিস্তান অঞ্চলে জন্মগ্রহণ করেন।",
      "শিক্ষা ও মেধা\n\nতিনি বাগদাদ এবং মিশরে জ্ঞান লাভ করেন। তিনি তাঁর প্রখর মেধা ও স্মৃতিশক্তির জন্য পরিচিত ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি ইবনে হাজার আল-আসকালানী (রহঃ) এবং হাফিয আল-হাইসামি (রহঃ)-এর মতো বহু মহান ইমামের শিক্ষক ছিলেন।",
      "প্রধান গ্রন্থ: আল্ফিয়াতুল ইরাকী\n\nতাঁর প্রধান গ্রন্থ হলো 'আল্ফিয়াতুল ইরাকী' (আল্ফিয়াত আল-হাদীস), যা হাদিসশাস্ত্রের নীতি (উসূল আল-হাদিস) নিয়ে রচিত এক হাজার শ্লোকের কবিতা। এটি হাদিস শিক্ষার্থীদের জন্য একটি মৌলিক গ্রন্থ।",
      "তাঁর অন্যান্য গ্রন্থ\n\nতাঁর ফিকহের ক্ষেত্রে 'তাখরীজ আহাদিস আল-ইহয়া' (ইমাম গাযালীর ইহয়া উলূমিদ্দীন-এর হাদিসগুলোর উৎস যাচাই) উল্লেখযোগ্য।",
      "পেশাগত জীবন\n\nতিনি মিশরের আল-আজহার সহ বিভিন্ন মাদ্রাসায় অধ্যাপনা করেন।",
      "মৃত্যু\n\nতিনি ৮০৬ হিজরিতে (১৪০৪ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।"
    ],
    "source": "ইবনে হাজার আল-আসকালানী, আল-দুরার আল-কামিনা"
  },
  {
    "id": "imam_badruddin_al_ayni",
    "categoryId": "imam_jibon",
    "title": "ইমাম বদরুদ্দিন আল-আইনী (রহঃ)",
    "paragraphs": [
      "ইমাম বদরুদ্দিন আল-আইনী (রহঃ)-এর পূর্ণ নাম হলো আবু মুহাম্মদ মাহমুদ ইবনে আহমদ ইবনে মুসা আল-হানাফী আল-আইনী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ হানাফী ফকীহ, মুহাদ্দিস এবং ঐতিহাসিক।",
      "তাঁর উপনাম ছিল আবু মুহাম্মদ। তিনি মিশর এবং সিরিয়ায় জ্ঞান ও বিচারিক ক্ষেত্রে প্রভাব বিস্তার করেন।",
      "তাঁর উপাধি ছিল 'আল-আইনী' যা তাঁর জন্মস্থান তুরস্কের আইনতাব শহরের নামের সাথে সম্পর্কিত। তিনি হানাফী মাযহাবের একজন প্রখ্যাত আলেম ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৭৬২ হিজরিতে (১৩৬০ খ্রিস্টাব্দে) তুরস্কের আইনতাব শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল এবং তিনি প্রাথমিক শিক্ষা নিজ শহরেই সম্পন্ন করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি কায়রোতে হিজরত করেন এবং সেখানে আল-আজহার সহ বিভিন্ন মাদ্রাসায় ফিকহ, হাদিস ও আরবি ভাষা শেখেন। তাঁর স্মৃতিশক্তি এবং জ্ঞানের গভীরতা ছিল অসাধারণ।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের বিখ্যাত আলেমদের, বিশেষ করে হানাফী ও শাফেয়ী উভয় মাযহাবের পণ্ডিতদের কাছে শিক্ষা লাভ করেন।",
      "কর্মজীবন ও প্রশাসনিক ভূমিকা\n\nতিনি কায়রোতে বিভিন্ন মাদ্রাসায় অধ্যাপনা করেন। তাঁকে মিশরের কাজীদের (বিচারপতি) পদে নিযুক্ত করা হয়েছিল এবং তিনি তাঁর সততা ও কঠোরতার জন্য পরিচিত ছিলেন।",
      "তিনি কায়রোর সুলতান আল-মুয়াইয়্যিদের ঘনিষ্ঠ ছিলেন এবং তাঁর অধীনে প্রশাসনিক কাজ করেন।",
      "প্রধান গ্রন্থ: উমদাতুল ক্বারী\n\nতাঁর প্রধান ও সবচেয়ে বিখ্যাত গ্রন্থ হলো 'উমদাতুল ক্বারী শারহ সহীহ আল-বুখারী'। এটি সহীহ বুখারীর একটি সুবিশাল ব্যাখ্যা গ্রন্থ।",
      "এই গ্রন্থটি তাঁর সমসাময়িক শাফেয়ী পণ্ডিত হাফিয ইবনে হাজার আল-আসকালানী (রহঃ)-এর ফাতহুল বারী-এর সাথে প্রতিদ্বন্দ্বিতা করত।",
      "অন্যান্য গ্রন্থ\n\nতাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থের মধ্যে রয়েছে 'আল-হিদায়া'-এর উপর তাঁর ফিকহী ভাষ্য এবং ঐতিহাসিক গ্রন্থ 'আল-সায়ফ আল-মুহান্নাদ ফী সীরাত আল-মালিক আল-মুয়াইয়্যদ'।",
      "পাণ্ডিত্যের বিতর্ক\n\nহাফিয ইবনে হাজার আল-আসকালানী (রহঃ)-এর সাথে তাঁর কিছু পাণ্ডিত্যপূর্ণ মতবিরোধ ছিল, যা জ্ঞানচর্চার ইতিহাসে সুপরিচিত।",
      "ফিকহী অবস্থান\n\nতিনি হানাফী মাযহাবের একজন শক্তিশালী ফকীহ ছিলেন এবং মাযহাবের দলিলগুলো প্রমাণ করার ক্ষেত্রে দৃঢ় ছিলেন।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র মিশর এবং সিরিয়ায় তাঁর জ্ঞানকে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত পরিশ্রমী এবং কঠোরভাবে তাঁর সময়কে জ্ঞানচর্চায় ব্যবহার করতেন।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় কায়রোতেই অতিবাহিত করেন।",
      "তিনি ৮৫৫ হিজরিতে (১৪৫১ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-আইনী (রহঃ)-এর গ্রন্থাবলি হানাফী মাযহাবের হাদিস ও ফিকহ অধ্যয়নের জন্য আজও অপরিহার্য এবং তিনি তাঁর বিশাল পাণ্ডিত্যের জন্য শ্রদ্ধার আসনে অধিষ্ঠিত।"
    ],
    "source": "ইবনে ইমাদ আল-হাম্বলি, শাযারাত আয-যাহাব; আল-সাখাভী, আল-জাওয়াহির ওয়াদ্-দুরার"
  },
  {
    "id": "imam_al_maqrizi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-মাকরিযী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-মাকরিযী (রহঃ)-এর পূর্ণ নাম হলো তাকীউদ্দীন আহমদ ইবনে আলী ইবনে আব্দুল কাদির ইবনে মুহাম্মদ আল-মাকরিযী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ ইতিহাসবিদ ও মুহাদ্দিস।",
      "তাঁর উপাধি ছিল তাকীউদ্দীন। তিনি ইতিহাস, ভূগোল এবং মিশরের সভ্যতা ও ইতিহাসের ক্ষেত্রে তাঁর গভীর পাণ্ডিত্যের জন্য পরিচিত।",
      "তিনি শাফেয়ী ফিকহের অনুসারী ছিলেন। তাঁর পারিবারিক নাম 'মাকরিযী' কায়রোর একটি জেলার নামের সঙ্গে সম্পর্কিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৭৬৬ হিজরিতে (১৩৬৪ খ্রিস্টাব্দে) মিশরের কায়রোতে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি জ্ঞানচর্চার এক অনুকূল পরিবেশে বেড়ে ওঠেন এবং শৈশবেই হাদিস ও ফিকহ শেখেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি কায়রোর আল-আজহার সহ বিভিন্ন মাদ্রাসায় শিক্ষা লাভ করেন। তিনি আরবি ভাষা, সাহিত্য ও ইতিহাসে দক্ষতা অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর শিক্ষকদের মধ্যে গুরুত্বপূর্ণ ছিলেন হাফিয আল-ইরাকী (রহঃ) এবং ইবনে হাজার আল-আসকালানী (রহঃ)।",
      "তিনি কায়রোর জ্ঞানকেন্দ্রে অধ্যাপনা করেন এবং গ্রন্থ রচনা ও সংগ্রহের কাজে মনোনিবেশ করেন।",
      "প্রধান গ্রন্থ: আল-মাওয়াইজ ওয়াল-ই'তিবার\n\nতাঁর প্রধান গ্রন্থ হলো 'আল-মাওয়াইজ ওয়াল-ই'তিবার ফি যিকরি আল-খিতাত ওয়াল-আছার'। এটি মিশর, বিশেষত কায়রোর ইতিহাস, স্থাপত্য ও সমাজ নিয়ে রচিত এক সুবিশাল গ্রন্থ।",
      "এই গ্রন্থটি মিশর ও কায়রোর ঐতিহাসিক তথ্যের এক অমূল্য ভান্ডার হিসেবে বিবেচিত হয়।",
      "অন্যান্য গ্রন্থ\n\nতাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থের মধ্যে রয়েছে 'ইগাছাতুল উম্মাহ বি কাশফ আল-ঘুম্মাহ' (দুর্ভিক্ষ ও অর্থনৈতিক ইতিহাসের উপর রচিত) এবং 'আল-নিয়ায়েত ফী মা'রিফাতিল হিদায়া'।",
      "ইতিহাস রচনার পদ্ধতি\n\nতিনি ইতিহাসে তথ্যের নির্ভুলতা এবং বিশদ বিবরণের ওপর জোর দিতেন, যা তাঁকে একজন প্রামাণিক ঐতিহাসিক হিসেবে প্রতিষ্ঠিত করেছে।",
      "পেশাগত জীবন\n\nতিনি কায়রোর বিভিন্ন মসজিদে ইমাম ও মুয়াজ্জিনের দায়িত্ব পালন করেন। এছাড়াও তিনি কায়রোর অন্যতম প্রধান লাইব্রেরিয়ান হিসেবে কাজ করেন।",
      "ফিকহী অবস্থান\n\nতিনি শাফেয়ী মাযহাবের অনুসরণ করতেন এবং ফিকহী মাসআলাতেও তাঁর পাণ্ডিত্য ছিল।",
      "ছাত্রবৃন্দ\n\nতাঁর বহু ছাত্র তাঁর জ্ঞানের ধারাকে এগিয়ে নিয়ে যান।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত পরিশ্রমী এবং ইতিহাস সংরক্ষণে নিবেদিতপ্রাণ।",
      "মৃত্যু\n\nতিনি ৮৪৫ হিজরিতে (১৪৪২ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-মাকরিযী (রহঃ)-এর কাজ মুসলিম বিশ্বের অর্থনৈতিক ও সামাজিক ইতিহাসের অধ্যয়নের জন্য আজও অপরিহার্য।"
    ],
    "source": "ইবনে হাজার আল-আসকালানী, আল-দুরার আল-কামিনা; ইমাম সাখাভী, আল-জাওয়াহির ওয়াদ্-দুরার"
  },
  {
    "id": "imam_al_sakhawi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-সাখাভী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-সাখাভী (রহঃ)-এর পূর্ণ নাম হলো শামসুদ্দীন মুহাম্মদ ইবনে আবদির রহমান ইবনে মুহাম্মদ আল-সাখাভী আল-কাহেরী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস, ঐতিহাসিক এবং হাফিয ইবনে হাজার আল-আসকালানী (রহঃ)-এর প্রধান ছাত্র।",
      "তাঁর উপাধি ছিল শামসুদ্দীন। তাঁর পাণ্ডিত্যের কারণে তাঁকে 'আল-সাখাভী' বলা হয়, যা মিশরের সাখা এলাকার সঙ্গে সম্পর্কিত।",
      "তিনি তাঁর শিক্ষক হাফিয ইবনে হাজার (রহঃ)-এর জ্ঞান ও পদ্ধতির প্রধান ধারক ও বাহক ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৮৩১ হিজরিতে (১৪২৮ খ্রিস্টাব্দে) মিশরের কায়রোতে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক আলেম পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি কায়রোর আল-আজহার সহ বিভিন্ন মাদ্রাসায় শিক্ষা লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর এবং অল্প বয়সেই তিনি হাদিস মুখস্থ করেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর প্রধান শিক্ষক ছিলেন হাফিয ইবনে হাজার আল-আসকালানী (রহঃ)। তিনি প্রায় ১০ বছর তাঁর সান্নিধ্যে ছিলেন এবং তাঁর কাছ থেকে হাদিস, ফিকহ ও ইতিহাস শেখেন।",
      "এছাড়াও তিনি অন্যান্য বিখ্যাত আলেম, যেমন আল-আইনী (রহঃ)-এর কাছ থেকেও জ্ঞান অর্জন করেন।",
      "হাদিস সংগ্রহের সফর\n\nতিনি হাদিস সংগ্রহের জন্য সিরিয়া, হিজাজ এবং ইয়েমেনে দীর্ঘ সফর করেন।",
      "প্রধান গ্রন্থ: ফাতহুল মুগীস\n\nতাঁর প্রধান গ্রন্থ হলো 'ফাতহুল মুগীস বি শারহ আল্ফিয়াত আল-হাদীস'। এটি হাফিয আল-ইরাকী (রহঃ)-এর আল্ফিয়াতুল ইরাকী-এর একটি বিশদ ব্যাখ্যা গ্রন্থ।",
      "অন্যান্য গ্রন্থ\n\nতাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থের মধ্যে রয়েছে 'আল-যাও' আল-লামি লি-আহলি আল-কারন আত-তাসি' (নবম শতাব্দীর আলেমদের জীবনী) এবং 'আল-মাকাসিদ আল-হাসানাহ'।",
      "পেশাগত জীবন\n\nতিনি মক্কা ও কায়রোতে অধ্যাপনা করেন এবং জ্ঞান বিতরণে তাঁর জীবন অতিবাহিত করেন।",
      "ফিকহী অবস্থান\n\nতিনি ছিলেন শাফেয়ী মাযহাবের একজন অনুসারী এবং তাঁর ফিকহী পাণ্ডিত্য ছিল সুপরিচিত।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র তাঁর জ্ঞানের ধারাকে কায়রো, মক্কা এবং অন্যান্য অঞ্চলে ছড়িয়ে দেন।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় মদীনা শরীফে কাটান।",
      "তিনি ৯০২ হিজরিতে (১৪৯৭ খ্রিস্টাব্দে) মদীনাতে ইন্তেকাল করেন এবং জান্নাতুল বাকীতে তাঁকে দাফন করা হয়।",
      "জানাযা ও মর্যাদা\n\nআল-সাখাভী (রহঃ)-এর জীবন হাদিসশাস্ত্রের নীতি (উসূল) এবং জীবনীমূলক গ্রন্থ রচনার ক্ষেত্রে তাঁর অসামান্য অবদানের জন্য স্মরণীয়।"
    ],
    "source": "ইবনে ইমাদ আল-হাম্বলি, শাযারাত আয-যাহাব"
  },
  {
    "id": "imam_ibn_kamal_pasha",
    "categoryId": "imam_jibon",
    "title": "ইবনে কামাল পাশা (রহঃ)",
    "paragraphs": [
      "ইবনে কামাল পাশা (রহঃ)-এর পূর্ণ নাম হলো শামসুদ্দীন আহমদ ইবনে সুলাইমান ইবনে কামাল পাশা। তিনি ছিলেন উসমানীয় খিলাফতের অন্যতম শ্রেষ্ঠ হানাফী ফকীহ, মুফতি এবং ঐতিহাসিক।",
      "তাঁর উপাধি ছিল 'ইবনে কামাল পাশা'। তাঁকে তুর্কি ভাষায় 'শাইখুল ইসলাম' এবং 'মুফতি আল-সাকালাইন' (মানব ও জিনের মুফতি) বলা হতো।",
      "তিনি হানাফী ফিকহ, আরবি ভাষা, ইতিহাস এবং ধর্মতত্ত্বের একজন বহুমুখী পণ্ডিত ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৮৭৩ হিজরিতে (১৪৬৯ খ্রিস্টাব্দে) তুরস্কের এদির্নে (Edirne) শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি সামরিক ও প্রশাসনিক দিক থেকে প্রভাবশালী পরিবারে জন্মগ্রহণ করেন। তাঁর বাবা ছিলেন একজন সামরিক কর্মকর্তা।",
      "শিক্ষা ও মেধা\n\nতিনি প্রথমে সামরিক প্রশিক্ষণ নিলেও পরে জ্ঞানার্জনের দিকে মনোনিবেশ করেন এবং তাঁর প্রখর মেধার কারণে দ্রুত জ্ঞান অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি বিভিন্ন উসমানীয় মাদ্রাসায়, বিশেষ করে এদির্নে এবং ইস্তাম্বুলে ফিকহ, হাদিস ও ভাষা শেখেন।",
      "কর্মজীবন ও প্রশাসনিক ভূমিকা\n\nতিনি উসমানীয় খিলাফতের অধীনে বিভিন্ন বিচারিক ও প্রশাসনিক পদে দায়িত্ব পালন করেন।",
      "তিনি সুলতান ইয়াভুজ সুলতান সেলিম এবং সুলতান সুলাইমান কানুনী-এর সময়ে কাজীকাস্কের (প্রধান সামরিক বিচারক) দায়িত্ব পালন করেন।",
      "উসমানীয় শাইখুল ইসলাম\n\nজীবনের শেষভাগে তিনি উসমানীয় খিলাফতের সর্বোচ্চ ধর্মীয় পদ 'শাইখুল ইসলাম' হিসেবে নিযুক্ত হন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে রয়েছে 'ইজতিহাদ' এবং 'মাযহাব' এর উপর রচিত তাঁর ফিকহী রিসালা (ছোট প্রবন্ধ)।",
      "তাঁর অন্যান্য গ্রন্থ\n\nতিনি ইতিহাস, ফিকহ, হাদিস এবং আরবি ব্যাকরণ সহ বিভিন্ন বিষয়ে প্রায় ২৫০টিরও বেশি গ্রন্থ রচনা করেন।",
      "ইতিহাসে অবদান\n\nতাঁর ইতিহাস গ্রন্থ 'তারীখ ইবনে কামাল পাশা' উসমানীয় খিলাফতের ইতিহাসের একটি গুরুত্বপূর্ণ উৎস।",
      "ফিকহী অবস্থান\n\nতিনি হানাফী মাযহাবের একজন শক্তিশালী ফকীহ ছিলেন এবং মাযহাবের মধ্যে ইজতিহাদের পক্ষে ছিলেন।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্ররা উসমানীয় সাম্রাজ্যের বিভিন্ন প্রশাসনিক ও ধর্মীয় পদে গুরুত্বপূর্ণ ভূমিকা রাখেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত প্রভাবশালী এবং তাঁর সময়কে জ্ঞান ও প্রশাসনের ক্ষেত্রে ব্যবহার করতেন।",
      "মৃত্যু\n\nতিনি ৯৪০ হিজরিতে (১৫৩৪ খ্রিস্টাব্দে) ইস্তাম্বুলে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইবনে কামাল পাশা (রহঃ)-এর জীবন জ্ঞান, সামরিক ও প্রশাসনিক ক্ষেত্রে তাঁর বহুমুখী প্রতিভার এক অনন্য দৃষ্টান্ত।"
    ],
    "source": "আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_ibn_nujaym",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে নুজাইম (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে নুজাইম (রহঃ)-এর পূর্ণ নাম হলো যইন আল-দীন ইবনে ইব্রাহিম ইবনে মুহাম্মদ ইবনে নুজাইম আল-হানাফী আল-মিসরী। তিনি ছিলেন মিশরের অন্যতম শ্রেষ্ঠ হানাফী ফকীহ।",
      "তাঁর উপনাম ছিল যইন আল-দীন। তাঁকে 'ফকীহুল আসর' (যুগের ফকীহ) উপাধিতে ভূষিত করা হয়।",
      "তিনি প্রধানত হানাফী ফিকহের মূলনীতি (উসূল) এবং ফিকহী ক্বাওয়াইদ (আইনগত নীতি) সংকলনে তাঁর অসামান্য অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৯২১ হিজরিতে (১৫১৫ খ্রিস্টাব্দে) মিশরের কায়রোতে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক বিদ্বান পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি কায়রোর আল-আজহার সহ বিভিন্ন মাদ্রাসায় ফিকহ, হাদিস ও আরবি ভাষা শেখেন। তাঁর পাণ্ডিত্য ছিল গভীর।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের শ্রেষ্ঠ হানাফী পণ্ডিতদের কাছ থেকে ফিকহ ও উসূলের জ্ঞান লাভ করেন।",
      "প্রধান গ্রন্থ: আল-আশবাহ ওয়ান নাযা’ইর\n\nতাঁর প্রধান ও সবচেয়ে বিখ্যাত গ্রন্থ হলো 'আল-আশবাহ ওয়ান নাযা’ইর'। এটি হানাফী ফিকহের আইনগত নীতি (ফিকহী ক্বাওয়াইদ) নিয়ে রচিত এক মৌলিক গ্রন্থ।",
      "এই গ্রন্থটি হানাফী ফিকহের বিভিন্ন জটিল মাসআলাকে সাধারণ নীতিমালার আলোকে ব্যাখ্যা করে।",
      "অন্যান্য গ্রন্থ\n\nতাঁর ফিকহের ক্ষেত্রে তাঁর অন্য একটি গুরুত্বপূর্ণ কাজ হলো 'আল-বাহর আল-রা'ইক শারহ কানয আল-দাক্বাইক্ব'।",
      "পেশাগত জীবন\n\nতিনি কায়রোর বিভিন্ন মাদ্রাসায় অধ্যাপনা করেন এবং ফতোয়া প্রদান করেন।",
      "তিনি হানাফী মাযহাবের একজন শক্তিশালী ফকীহ ছিলেন এবং ফিকহের ক্ষেত্রে তাঁর সিদ্ধান্ত ছিল অত্যন্ত গুরুত্বপূর্ণ।",
      "তাঁর রচনাশৈলী ছিল সুস্পষ্ট ও বিশ্লেষণধর্মী।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্ররা তাঁর জ্ঞানের ধারাকে কায়রো এবং উসমানীয় সাম্রাজ্যের অন্যান্য অঞ্চলে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত পরিশ্রমী এবং কঠোরভাবে তাঁর সময়কে জ্ঞানচর্চায় ব্যবহার করতেন।",
      "মৃত্যু\n\nতিনি ৯৭০ হিজরিতে (১৫৬৩ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম ইবনে নুজাইম (রহঃ)-এর গ্রন্থাবলি হানাফী মাযহাবের ফিকহী ক্বাওয়াইদ এবং জটিল মাসআলা বোঝার জন্য আজও অপরিহার্য।"
    ],
    "source": "ইবনে ইমাদ আল-হাম্বলি, শাযারাত আয-যাহাব; আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_zakariya_al_ansari",
    "categoryId": "imam_jibon",
    "title": "শাইখুল ইসলাম যাকারিয়া আল-আনসারী (রহঃ)",
    "paragraphs": [
      "শাইখুল ইসলাম যাকারিয়া আল-আনসারী (রহঃ)-এর পূর্ণ নাম হলো যইন আল-দীন আবু ইয়াহইয়া যাকারিয়া ইবনে মুহাম্মদ ইবনে আহমদ ইবনে যাকারিয়া আল-আনসারী। তিনি ছিলেন তাঁর সময়ের শাফেয়ী মাযহাবের অন্যতম শ্রেষ্ঠ ফকীহ, মুহাদ্দিস এবং শাইখুল ইসলাম।",
      "তাঁর উপনাম ছিল আবু ইয়াহইয়া। তাঁকে 'শাইখুল ইসলাম' এবং 'শাইখ আল-শুয়ুখ' (শাইখদের শাইখ) উপাধিতে ভূষিত করা হয়।",
      "তিনি একাধারে তাফসীর, হাদিস, ফিকহ, উসূল এবং সুফিবাদের উপর পাণ্ডিত্য অর্জন করেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৮২৩ হিজরিতে (১৪২০ খ্রিস্টাব্দে) মিশরের সুনাইকা নামক স্থানে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল এবং তিনি শৈশবে মক্কায় হিজরত করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি অল্প বয়সেই কুরআন হিফয করেন এবং কায়রোর আল-আজহার সহ বিভিন্ন মাদ্রাসায় উচ্চশিক্ষা লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর।",
      "শিক্ষকমণ্ডলী\n\nতিনি হাফিয ইবনে হাজার আল-আসকালানী (রহঃ) সহ তাঁর সময়ের শ্রেষ্ঠ আলেমদের কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "তিনি প্রায় ১০০ বছর জীবন লাভ করেন, যার ফলে তিনি বহু প্রজন্মের শিক্ষক হিসেবে ভূমিকা রাখেন।",
      "প্রধান গ্রন্থসমূহ\n\nতাঁর প্রধান গ্রন্থগুলোর মধ্যে অন্যতম হলো শাফেয়ী ফিকহে 'ফাতহ আল-ওয়াহাব বি শারহি মানহাজ আল-তুল্লাব' এবং 'ফাতহ আল-রাহমান' (তাফসীর)।",
      "এছাড়াও তিনি হাদিসশাস্ত্রের নীতি (উসূল আল-হাদিস) এবং সুফিবাদ সম্পর্কিত গুরুত্বপূর্ণ গ্রন্থ রচনা করেন।",
      "তাঁর রচনাবলী ছিল ফিকহী বিশ্লেষণের জন্য অত্যন্ত বিশদ ও গভীর।",
      "কর্মজীবন ও প্রশাসনিক ভূমিকা\n\nতিনি মিশরের আল-আজহার সহ বিভিন্ন মাদ্রাসায় অধ্যাপনা করেন এবং শাফেয়ী ফিকহের প্রধান বিচারক (কাজীউল কুজাত) হিসেবে দায়িত্ব পালন করেন।",
      "তিনি শাইখুল আজহার হিসেবেও দায়িত্ব পালন করেন, যা মিশরের সর্বোচ্চ ধর্মীয় পদ ছিল।",
      "ফিকহী অবস্থান\n\nতিনি শাফেয়ী মাযহাবের একজন শক্তিশালী ফকীহ ছিলেন এবং মাযহাবের মূলনীতিগুলো রক্ষা করার ক্ষেত্রে কঠোর ছিলেন।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে অন্যতম শ্রেষ্ঠ হলেন ইমাম ইবনে হাজার আল-হাইতামি (রহঃ)। তাঁর ছাত্রদের মাধ্যমে তাঁর জ্ঞান মিশরের বাইরেও ছড়িয়ে পড়ে।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং তাঁর তাকওয়া (খোদাভীতি) ছিল সর্বজনস্বীকৃত। তিনি তাঁর সময়কে জ্ঞান বিতরণ ও ইবাদতে ব্যয় করতেন।",
      "মৃত্যু\n\nতিনি ৯২৬ হিজরিতে (১৫২০ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nশাইখুল ইসলাম যাকারিয়া আল-আনসারী (রহঃ)-এর জীবন হাদিস, ফিকহ ও প্রশাসনিক ক্ষেত্রে তাঁর বিশাল প্রভাবের জন্য স্মরণীয়।"
    ],
    "source": "আল-মুহিব্বী, খুলাসাত আল-আছার; ইমাম সুয়ূতী, তারীখ আল-খুলাফা"
  },
  {
    "id": "imam_al_sharbiny",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-শারবীনী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-শারবীনী (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ ইবনে আহমদ ইবনে আল-খতিব আল-শারবীনী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ শাফেয়ী ফকীহ এবং মুফাসসির।",
      "তাঁর উপাধি ছিল শাইখ আল-খতিব। তিনি মিশরের শারবীন নামক এলাকা থেকে এসেছিলেন, তাই তিনি 'আল-শারবীনী' নামে পরিচিত।",
      "তিনি শাফেয়ী ফিকহ ও তাফসীর শাস্ত্রে তাঁর গভীর জ্ঞানের জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতাঁর জন্মসাল নিয়ে কিছুটা মতভেদ থাকলেও, তিনি দশম হিজরি শতকে (ষোড়শ শতকের শুরুতে) মিশরের শারবীন নামক স্থানে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক আলেম পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি কায়রোর আল-আজহার সহ বিভিন্ন মাদ্রাসায় ফিকহ, হাদিস ও আরবি ভাষা শেখেন। তাঁর পাণ্ডিত্য ছিল সুগভীর।",
      "শিক্ষকমণ্ডলী\n\nতিনি শাইখুল ইসলাম যাকারিয়া আল-আনসারী (রহঃ)-এর কাছ থেকে ফিকহ ও উসূলের জ্ঞান লাভ করেন। তিনি তাঁর অন্যতম প্রধান ছাত্র ছিলেন।",
      "প্রধান গ্রন্থ: মুগনি আল-মুহতাজ\n\nতাঁর প্রধান ও সবচেয়ে বিখ্যাত ফিকহী গ্রন্থ হলো 'মুগনি আল-মুহতাজ ইলা মা'রিফাত মা'আনী আল-ফাজ আল-মিনহাজ'। এটি শাফেয়ী ফিকহের ক্ষেত্রে একটি মৌলিক ও বহুল পঠিত ব্যাখ্যা গ্রন্থ।",
      "তাফসীর গ্রন্থ\n\nতাফসীর শাস্ত্রে তাঁর গুরুত্বপূর্ণ গ্রন্থ হলো 'সিরাজ আল-মুনীর ফী আল-ই'আনাহ আলা মা'রিফাহ বা'দি মা'আনী কালাম রাব্বিনা আল-খাবীর'।",
      "অন্যান্য গ্রন্থ\n\nতিনি হাদিস ও ফিকহের ক্ষেত্রে বহু মূল্যবান গ্রন্থ রচনা করেন।",
      "পেশাগত জীবন\n\nতিনি কায়রোর আল-আজহার সহ বিভিন্ন মাদ্রাসায় অধ্যাপনা করেন এবং ফতোয়া প্রদান করতেন।",
      "তিনি ছিলেন একজন দক্ষ শিক্ষক ও মুফতি।",
      "ফিকহী অবস্থান\n\nতিনি শাফেয়ী মাযহাবের একজন শক্তিশালী ফকীহ ছিলেন এবং মাযহাবের মধ্যে তাঁর সিদ্ধান্ত ছিল খুবই নির্ভরযোগ্য।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র তাঁর জ্ঞানের ধারাকে কায়রো এবং অন্যান্য অঞ্চলে ছড়িয়ে দেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি বিনয়ী, অত্যন্ত ধার্মিক এবং কঠোর পরিশ্রমী আলেম ছিলেন।",
      "মৃত্যু\n\nতিনি ৯৭৭ হিজরিতে (১৫৭০ খ্রিস্টাব্দে) কায়রোতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-শারবীনী (রহঃ)-এর গ্রন্থাবলি শাফেয়ী ফিকহ ও তাফসীর অধ্যয়নের জন্য আজও অপরিহার্য।"
    ],
    "source": "আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_al_shanqiti",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ আল-আমীন আল-শানক্বীত্বী (রহঃ)",
    "paragraphs": [
      "ইমাম মুহাম্মদ আল-আমীন আল-শানক্বীত্বী (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ আল-আমীন ইবনে মুহাম্মদ আল-মুখতার ইবনে আব্দুল কাদির আল-জাঙ্কী আল-শানক্বীত্বী। তিনি ছিলেন আধুনিক যুগের অন্যতম শ্রেষ্ঠ মুফাসসির, ফকীহ এবং হাদিস পণ্ডিত।",
      "তাঁর উপাধি ছিল শাইখুল ইসলাম। তিনি মূলত মরক্কো ও মৌরিতানিয়া থেকে আগত শানক্বীত্বী বংশের। তাঁকে হাদিস ও তাফসীরের ক্ষেত্রে আধুনিক যুগের মুজতাহিদ বলা হয়।",
      "তিনি তাফসীর, ফিকহ (মালিকি) এবং উসূল (আইনের মূলনীতি)-এর ওপর গভীর জ্ঞানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতাঁর জন্ম আনুমানিক ১৩২৫ হিজরিতে (১৯০৭ খ্রিস্টাব্দে) পশ্চিম আফ্রিকার মৌরিতানিয়ায়।",
      "পারিবারিক পটভূমি\n\nতিনি এক বিখ্যাত আলেম পরিবারে জন্মগ্রহণ করেন এবং শৈশবেই তাঁর বাবার কাছে জ্ঞানার্জন শুরু করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি ছোটবেলাতেই কুরআন হিফয করেন এবং আরবি ভাষা, ফিকহ ও ব্যাকরণে দক্ষতা অর্জন করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর।",
      "শিক্ষকমণ্ডলী\n\nতিনি মৌরিতানিয়ার প্রখ্যাত আলেমদের কাছ থেকে ফিকহ ও উসূলের জ্ঞান লাভ করেন। এরপর তিনি মদীনা এবং মক্কায় আরও শিক্ষা গ্রহণ করেন।",
      "প্রধান গ্রন্থসমূহ: আযওয়াউল বায়ান\n\nতাঁর প্রধান গ্রন্থ হলো 'আযওয়াউল বায়ান ফী ইযাহিল কুরআন বিল কুরআন' (কুরআন দ্বারা কুরআনের ব্যাখ্যা)। এটি আধুনিক তাফসীরশাস্ত্রের অন্যতম শ্রেষ্ঠ ও মৌলিক গ্রন্থ।",
      "তাফসীরের পদ্ধতি\n\nতাঁর তাফসীরটি তাফসীর বিল-মা'ছূর (বর্ণনার ভিত্তিতে তাফসীর) এবং তুলনামূলক ফিকহের ক্ষেত্রে অনন্য। তিনি কুরআনের আয়াতের ব্যাখ্যায় প্রধানত কুরআনের অন্য আয়াত ব্যবহার করেন।",
      "হাদিস ও ফিকহী অবস্থান\n\nতিনি ফিকহের ক্ষেত্রে মালিকি মাযহাবের অনুসারী হলেও দলিলের ভিত্তিতে ইজতিহাদ করতেন।",
      "তিনি মদীনার আল-জামিয়াহ আল-ইসলামিয়াহ (মদীনা ইসলামি বিশ্ববিদ্যালয়)-এ অধ্যাপনা করেন।",
      "কর্মজীবন ও প্রশাসনিক ভূমিকা\n\nতিনি মদীনা ইসলামি বিশ্ববিদ্যালয়ের শিক্ষক এবং সৌদি আরবের উচ্চ আলেম পরিষদের সদস্য হিসেবে দায়িত্ব পালন করেন।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র আরব বিশ্ব এবং অন্যান্য দেশে তাঁর জ্ঞানকে ছড়িয়ে দেন। শাইখ ইবনে বাজ (রহঃ)-এর ছাত্ররাও তাঁর কাছ থেকে জ্ঞান লাভ করেন।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং তাঁর সময়কে জ্ঞান বিতরণ ও ইবাদতে ব্যয় করতেন।",
      "মৃত্যু\n\nতিনি ১৩৯৩ হিজরিতে (১৯৭৪ খ্রিস্টাব্দে) মক্কায় হজের সময় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nআল-শানক্বীত্বী (রহঃ)-এর জীবনী হাদিস, ফিকহ ও তাফসীরে তাঁর বিশাল প্রভাবের জন্য স্মরণীয়।"
    ],
    "source": "সৌদি আরবের উচ্চ আলেম পরিষদ ওয়েবসাইট; আযওয়াউল বায়ান"
  },
  {
    "id": "imam_ibn_hibban_al_haytami",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে হিব্বান আল-হাইতামী (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে হিব্বান আল-হাইতামী (রহঃ)-এর পূর্ণ নাম হলো শিহাবুদ্দীন আবুল আব্বাস আহমাদ ইবনে মুহাম্মদ ইবনে আলী ইবনে হাজার আল-হাইতামি আল-মাক্কী। তিনি শাফেয়ী মাযহাবের অন্যতম শ্রেষ্ঠ ফকীহ।",
      "তাঁর উপাধি ছিল শিহাবুদ্দীন। তিনি মক্কা শরীফের প্রধান মুফতি এবং একজন শক্তিশালী বিতর্ককারী হিসেবে পরিচিত ছিলেন।",
      "তিনি ইমাম ইবনে হাজার আল-আসকালানী (রহঃ)-এর নামের সঙ্গে মিলিয়ে 'ইবনে হাজার আল-হাইতামি' নামে সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৯২৫ হিজরিতে (১৫১৯ খ্রিস্টাব্দে) মিশরের আল-হাইতাম নামক গ্রামে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি শৈশবেই পিতৃহীন হন এবং তাঁর দুই চাচা তাঁকে লালন-পালন করেন। তাঁরাও পণ্ডিত ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি অল্প বয়সেই কায়রোতে আল-আজহার সহ বিভিন্ন মাদ্রাসায় উচ্চশিক্ষা লাভ করেন। তিনি ফিকহ, হাদিস ও উসূলুল ফিকহে দক্ষতা অর্জন করেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর প্রধান শিক্ষক শাইখুল ইসলাম যাকারিয়া আল-আনসারী (রহঃ) সহ অনেক আলেমের কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "কর্মজীবন\n\nতিনি মক্কা শরীফে হিজরত করেন এবং সেখানে শিক্ষকতা ও ফতোয়া প্রদানের কাজ শুরু করেন।",
      "তিনি মক্কার প্রধান মুফতি পদে নিযুক্ত হন এবং জীবনের শেষভাগ পর্যন্ত এই দায়িত্ব পালন করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থ হলো 'তুহফাতুল মুহতাজ বি শারহিল মিনহাজ'। এটি শাফেয়ী ফিকহের প্রধান গ্রন্থ 'মিনহাজ আল-তালিবিন'-এর উপর রচিত অন্যতম শ্রেষ্ঠ ব্যাখ্যা গ্রন্থ।",
      "অন্যান্য গ্রন্থ\n\nহাদিস ও ফিকহে তাঁর অন্যান্য গুরুত্বপূর্ণ গ্রন্থ হলো 'আল-ফাতাওয়া আল-কুবরা আল-ফিকহিয়্যাহ' (তাঁর ফতোয়ার সংকলন), এবং 'আল-সাওয়াইক আল-মুহরিকা আলা আহল আর-রাফযি ওয়াদ-দাল।",
      "তাঁর রচনাবলী\n\nতাঁর রচনাশৈলী ছিল অত্যন্ত শক্তিশালী এবং যুক্তিপূর্ণ। তাঁর গ্রন্থগুলো শাফেয়ী মাযহাবের পরবর্তী প্রজন্মের কাছে ফিকহের ক্ষেত্রে প্রধান উৎস হিসেবে বিবেচিত হয়।",
      "মৃত্যু\n\nতিনি ৯৭৪ হিজরিতে (১৫৬৭ খ্রিস্টাব্দে) মক্কা মুকাররমায় ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁকে মক্কা শরীফের জান্নাতুল মু'আল্লাতে দাফন করা হয়। তাঁর জ্ঞান ও কাজের ফল আজও শাফেয়ী মাযহাবের ফিকহে দৃশ্যমান।"
    ],
    "source": "আল-জাববারতি, আজাইব আল-আছার ফি তারাজিম ওয়াল আখবার; আল-মুহিব্বী, খুলাসাত আল-আছার"
  },
  {
    "id": "imam_ibn_abi_hatim_al_razi",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে আবী হাতিম আল-রাযী (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে আবী হাতিম আল-রাযী (রহঃ)-এর পূর্ণ নাম হলো আবু মুহাম্মদ আবদির রহমান ইবনে মুহাম্মদ ইবনে ইদ্রিস ইবনে আল-মুনযির আল-তামিমি আল-রাযী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস, মুফাসসির এবং রিজালশাস্ত্রের পণ্ডিত।",
      "তাঁর উপনাম ছিল আবু মুহাম্মদ। তিনি তাঁর পিতা ইমাম আবু হাতিম আল-রাযীর সাথে জ্ঞানার্জনে নিয়োজিত ছিলেন।",
      "তিনি রিজাল (বর্ণনাকারীর জীবনী) এবং তাফসীর শাস্ত্রে তাঁর গভীর জ্ঞানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ২৪০ হিজরিতে (৮৫৪ খ্রিস্টাব্দে) পারস্যের রায় শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক বিখ্যাত আলেম পরিবারে জন্মগ্রহণ করেন। তাঁর পিতা ও চাচা উভয়েই ছিলেন হাদিস ও ফিকহের পণ্ডিত।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবে তাঁর পিতা এবং চাচার কাছ থেকে হাদিস ও ফিকহের জ্ঞান লাভ করেন। তাঁর মেধা ছিল অসাধারণ।",
      "হাদিস সংগ্রহের সফর\n\nহাদিস সংগ্রহের জন্য তিনি সিরিয়া, মিশর এবং অন্যান্য অঞ্চলে ব্যাপক সফর করেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর প্রধান শিক্ষক ছিলেন তাঁর পিতা ইমাম আবু হাতিম আল-রাযী (রহঃ) এবং ইমাম আবু যুর'আ আল-রাযী (রহঃ)।",
      "প্রধান গ্রন্থ: আল-জারহ ওয়াত-তা'দীল\n\nতাঁর প্রধান গ্রন্থ হলো 'কিতাব আল-জারহ ওয়াত-তা'দীল'। এটি হাদিসের বর্ণনাকারীদের সমালোচনা ও নির্ভরযোগ্যতা (রিজাল শাস্ত্র) নিয়ে রচিত অন্যতম শ্রেষ্ঠ ও মৌলিক গ্রন্থ।",
      "অন্যান্য গ্রন্থ\n\nতাফসীর শাস্ত্রে তাঁর গুরুত্বপূর্ণ গ্রন্থ হলো 'তাফসীর আল-কুরআন আল-আযীম'।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের বেশিরভাগ সময় শিক্ষাদান, গ্রন্থ রচনা এবং হাদিস বর্ণনায় ব্যয় করেন।",
      "মৃত্যু\n\nতিনি ৩২৭ হিজরিতে (৯৩৮ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম ইবনে আবী হাতিম আল-রাযী (রহঃ)-এর জীবন রিজাল শাস্ত্রকে সুসংগঠিত করে হাদিসের বিশুদ্ধতা রক্ষায় তাঁর অসামান্য অবদান রেখেছে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_baladhuri",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-বালাজুরী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-বালাজুরী (রহঃ)-এর পূর্ণ নাম হলো আবু আল-হাসান আহমাদ ইবনে ইয়াহইয়া ইবনে জাবির আল-বালাজুরী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ ঐতিহাসিক, যিনি ফিকহ ও হাদিসশাস্ত্রেও জ্ঞান রাখতেন।",
      "তাঁর উপনাম ছিল আবু আল-হাসান। তিনি তাঁর ইতিহাস গ্রন্থগুলির তথ্যের নির্ভরযোগ্যতার জন্য পরিচিত।",
      "তিনি প্রধানত ইসলামের প্রাথমিক বিজয়ের ইতিহাস সংকলনের জন্য বিখ্যাত।",
      "জন্ম ও জন্মস্থান\n\nতাঁর জন্মসাল নিয়ে মতভেদ থাকলেও, তিনি সম্ভবত নবম শতাব্দীর প্রথম দিকে বাগদাদে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতিনি এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন এবং শৈশব থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন।",
      "শিক্ষকমণ্ডলী\n\nতিনি বাগদাদ এবং অন্যান্য অঞ্চলে হাদিস, ফিকহ ও ইতিহাসশাস্ত্রের জ্ঞান লাভ করেন।",
      "তিনি ইতিহাসের ক্ষেত্রে ইমাম আল-মাদায়েনী এবং আল-ওয়াকেদী-এর মতো পণ্ডিতদের কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "প্রধান গ্রন্থ: ফুতুহ আল-বুলদান\n\nতাঁর প্রধান গ্রন্থ হলো 'ফুতুহ আল-বুলদান' (দেশসমূহের বিজয়)। এটি ইসলামের প্রাথমিক যুগের বিজয়ের ইতিহাস নিয়ে রচিত এক মৌলিক গ্রন্থ।",
      "গ্রন্থের গুরুত্ব\n\nএই গ্রন্থটি ইসলামের সামরিক ও রাজনৈতিক বিজয়ের তথ্যের এক বিশাল ভান্ডার হিসেবে বিবেচিত হয়।",
      "অন্যান্য গ্রন্থ\n\nতাঁর আরেকটি গুরুত্বপূর্ণ গ্রন্থ হলো 'আনসাব আল-আশরাফ' (নবাবদের বংশ পরিচয়), যা আরব গোত্র এবং প্রাথমিক মুসলিম ব্যক্তিত্বদের জীবনীমূলক তথ্য দেয়।",
      "পেশাগত জীবন\n\nতিনি বাগদাদের রাজদরবারে স্থান পেয়েছিলেন এবং খলিফা আল-মুতাওয়াক্কিলের সান্নিধ্যে ছিলেন।",
      "তিনি ইতিহাস সংকলন ও গ্রন্থ রচনায় তাঁর জীবনের বেশিরভাগ সময় ব্যয় করেন।",
      "মৃত্যু\n\nতিনি ২৭৯ হিজরিতে (৮৯২ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-বালাজুরী (রহঃ)-এর জীবন ইতিহাস সংকলনে তাঁর নিষ্ঠা এবং কঠোর পরিশ্রমের প্রমাণ দেয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_abu_hatim_al_razi_sr",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু হাতিম আল-রাযী (রহঃ)",
    "paragraphs": [
      "ইমাম আবু হাতিম আল-রাযী (রহঃ)-এর পূর্ণ নাম হলো মুহাম্মদ ইবনে ইদ্রিস ইবনে আল-মুনযির ইবনে দাউদ আল-রাযী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাদিসশাস্ত্রের বর্ণনাকারীদের সমালোচনা (নাক্বিদ) করার ক্ষেত্রে প্রধান ইমাম।",
      "তাঁর উপনাম ছিল আবু হাতিম। তিনি তাঁর পাণ্ডিত্য এবং কঠোরতার জন্য পরিচিত ছিলেন।",
      "তিনি রিজাল (বর্ণনাকারীর জীবনী) এবং জারহ ওয়া তা'দীল (সমালোচনা ও নির্ভরযোগ্যতা যাচাই) শাস্ত্রে একজন অগ্রণী ব্যক্তিত্ব ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১৯৫ হিজরিতে (৮১০ খ্রিস্টাব্দে) পারস্যের রায় শহরে জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবে হাদিস ও ফিকহের জ্ঞান লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর।",
      "হাদিস সংগ্রহের সফর\n\nতিনি হাদিস সংগ্রহের জন্য ইরাক, সিরিয়া, হিজাজ এবং মিশরে ব্যাপক সফর করেন। তাঁর সফর প্রায় ১০ বছর ধরে চলেছিল।",
      "শিক্ষকমণ্ডলী\n\nতিনি ইমাম আহমাদ ইবনে হাম্বল (রহঃ) সহ বহু আলেমের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "প্রধান গ্রন্থ\n\nতাঁর প্রধান গ্রন্থগুলো হাদিসের বর্ণনাকারীদের মূল্যায়ন নিয়ে রচিত। 'কিতাব আল-জারহ ওয়াত-তা'দীল' (যা তাঁর পুত্র ইবনে আবী হাতিম সংকলন করেন) হলো রিজাল শাস্ত্রের ক্ষেত্রে এক মৌলিক কাজ।",
      "তাঁর ফিকহী অবস্থান\n\nতিনি ফিকহী মাসআলাতে সরাসরি হাদিসের ওপর নির্ভর করতেন এবং মাযহাবের মধ্যে ইজতিহাদের ওপর জোর দিতেন।",
      "পেশাগত জীবন\n\nতিনি তাঁর জীবনের বেশিরভাগ সময় শিক্ষাদান, গ্রন্থ রচনা এবং হাদিস বর্ণনায় ব্যয় করেন।",
      "মৃত্যু\n\nতিনি ২৭৭ হিজরিতে (৮৯২ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আবু হাতিম আল-রাযী (রহঃ)-এর জীবন হাদিসশাস্ত্রের বিশুদ্ধতা রক্ষায় তাঁর অসামান্য অবদান রেখেছে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_ibn_abi_asim",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে আবি আসিম (রহঃ)",
    "paragraphs": [
      "ইমাম ইবনে আবি আসিম (রহঃ)-এর পূর্ণ নাম হলো আবু বকর আহমাদ ইবনে আমর ইবনে আবি আসিম আল-দাহহাক আল-শাইবানী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাদিস সংকলক।",
      "তাঁর উপনাম ছিল আবু বকর। তিনি মূলত হাদিসশাস্ত্রের হাফিয এবং রিজাল শাস্ত্রের পণ্ডিত হিসেবে পরিচিত ছিলেন।",
      "তিনি হাদিস সংগ্রহ এবং বিশুদ্ধতা যাচাইয়ের ক্ষেত্রে কঠোর ছিলেন।",
      "জন্ম ও জন্মস্থান\n\nতিনি ২০৭ হিজরিতে (৮২২ খ্রিস্টাব্দে) ইরাকের বসরা শহরে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল এবং তিনি শৈশব থেকেই হাদিসের প্রতি আগ্রহী ছিলেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি বসরা এবং বাগদাদের আলেমদের কাছ থেকে হাদিস ও ফিকহের প্রাথমিক জ্ঞান লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর।",
      "শিক্ষকমণ্ডলী\n\nতিনি ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইমাম বুখারী (রহঃ) সহ তাঁর সময়ের বহু আলেমের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "প্রধান গ্রন্থ: কিতাবুস সুন্নাহ\n\nতাঁর প্রধান গ্রন্থ হলো 'কিতাবুস সুন্নাহ' এবং 'আল-আহাদ ওয়াল-মাসানী'।",
      "'কিতাবুস সুন্নাহ' আক্বীদা (বিশ্বাস) সম্পর্কিত হাদিসের একটি গুরুত্বপূর্ণ সংকলন।",
      "তাঁর রচনাবলী\n\nতিনি ফিকহী হাদিস এবং আক্বীদা বিষয়ক বহু গ্রন্থ রচনা করেন।",
      "হাদিস সংকলনে অবদান\n\nতাঁর গ্রন্থগুলো পরবর্তী মুহাদ্দিসদের জন্য আক্বীদা ও ফিকহের ক্ষেত্রে গুরুত্বপূর্ণ উৎস হিসেবে কাজ করেছে।",
      "পেশাগত জীবন\n\nতিনি ইসফাহানের কাজীর (বিচারক) পদে নিযুক্ত ছিলেন এবং জীবনের শেষভাগ পর্যন্ত এই দায়িত্ব পালন করেন।",
      "বিচারক হিসেবে তিনি ন্যায়পরায়ণতা ও সততার জন্য পরিচিত ছিলেন।",
      "রাজনৈতিক সম্পর্ক\n\nতিনি প্রশাসনিক পদে থেকেও হাদিস ও ফিকহের জ্ঞান বিতরণে নিয়োজিত ছিলেন।",
      "মৃত্যু\n\nতিনি ২৮৭ হিজরিতে (৯০০ খ্রিস্টাব্দে) ইসফাহানে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম ইবনে আবি আসিম (রহঃ)-এর জীবন হাদিস, ফিকহ এবং বিচারিক কাজে তাঁর নিষ্ঠার প্রমাণ দেয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_juwayni",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-জুয়াইনি (রহঃ)",
    "paragraphs": [
      "ইমাম আল-জুয়াইনি (রহঃ)-এর পূর্ণ নাম হলো আবু আল-মা'আলী আব্দুল মালিক ইবনে আব্দুল্লাহ ইবনে ইউসুফ ইবনে মুহাম্মদ আল-জুয়াইনি। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ শাফেয়ী ফকীহ এবং আশ'আরী ধর্মতত্ত্বের পণ্ডিত।",
      "তাঁর উপনাম ছিল আবু আল-মা'আলী। তাঁকে 'ইমামুল হারামাইন' (মক্কা ও মদীনার ইমাম) উপাধিতে ভূষিত করা হয়, কারণ তিনি দীর্ঘদিন মক্কা ও মদীনায় অধ্যাপনা করেন।",
      "তিনি ছিলেন ইমাম আল-গাযালী (রহঃ)-এর প্রধান শিক্ষক।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৪১৯ হিজরিতে (১০২৮ খ্রিস্টাব্দে) খোরাসানের জুয়াইন নামক স্থানে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা ছিলেন একজন আলেম এবং তাঁর প্রাথমিক শিক্ষক।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি শৈশবে কুরআন হিফয করেন এবং ফিকহ ও উসূলের জ্ঞান লাভ করেন। তাঁর মেধা ছিল অসাধারণ।",
      "শিক্ষকমণ্ডলী\n\nতিনি তাঁর সময়ের শ্রেষ্ঠ শাফেয়ী পণ্ডিতদের কাছ থেকে শিক্ষা গ্রহণ করেন।",
      "প্রধান গ্রন্থ: নিহায়াত আল-মাতলাব\n\nতাঁর প্রধান গ্রন্থ হলো 'নিহায়াত আল-মাতলাব ফী দিরায়াত আল-মাযহাব'। এটি শাফেয়ী ফিকহের ক্ষেত্রে একটি মৌলিক ও বিশদ গ্রন্থ।",
      "অন্যান্য গ্রন্থ\n\nধর্মতত্ত্বের ক্ষেত্রে তাঁর গুরুত্বপূর্ণ গ্রন্থ হলো 'আল-ইরশাদ ইলা ক্বাওয়াতি' আল-আদিল্লাহ ফী উসূল আল-ই'তিক্বাদ'।",
      "শিক্ষক হিসেবে মর্যাদা\n\nতিনি ছিলেন ইমাম আল-গাযালী (রহঃ)-এর প্রধান শিক্ষক।",
      "কর্মজীবন\n\nতিনি বসরা এবং বাগদাদের নিজামিয়া মাদ্রাসায় অধ্যাপনা করেন।",
      "মৃত্যু\n\nতিনি ৪৭৮ হিজরিতে (১০৮৫ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-জুয়াইনি (রহঃ)-এর জীবন ফিকহ, উসূল এবং ধর্মতত্ত্বের ক্ষেত্রে তাঁর অসামান্য অবদান রেখেছে।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_al_khatib_al_baghdadi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-খতিব আল-বাগদাদী (রহঃ)",
    "paragraphs": [
      "ইমাম আল-খতিব আল-বাগদাদী (রহঃ)-এর পূর্ণ নাম হলো আবু বকর আহমাদ ইবনে আলী ইবনে সাবিত ইবনে আহমাদ ইবনে মাহদী আল-খতিব আল-বাগদাদী। তিনি ছিলেন তাঁর সময়ের অন্যতম শ্রেষ্ঠ মুহাদ্দিস ও ঐতিহাসিক।",
      "তাঁর উপনাম ছিল আবু বকর। তাঁকে তাঁর ঐতিহাসিক এবং হাদিসের কাজের জন্য 'হাফিযুল কাবীর' (মহান হাফিয) উপাধিতে ভূষিত করা হয়।",
      "তিনি মূলত হাদিসশাস্ত্রের নীতি (উসূল আল-হাদিস) এবং ইতিহাস সংকলনে তাঁর অসামান্য অবদানের জন্য পরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ৩৯২ হিজরিতে (১০০২ খ্রিস্টাব্দে) বাগদাদের কাছে গামেকা নামক গ্রামে জন্মগ্রহণ করেন।",
      "পারিবারিক পটভূমি\n\nতাঁর পিতা ছিলেন একজন খতিব (বক্তা), তাই তিনি 'আল-খতিব' নামে পরিচিত।",
      "শিক্ষা ও মেধা\n\nতিনি শৈশবে কুরআন হিফয করেন এবং বাগদাদের আলেমদের কাছে হাদিস ও ফিকহের জ্ঞান লাভ করেন। তাঁর স্মৃতিশক্তি ছিল প্রখর।",
      "হাদিস সংগ্রহের সফর\n\nতিনি হাদিস সংগ্রহের জন্য সিরিয়া, মিশর এবং অন্যান্য অঞ্চলে ব্যাপক সফর করেন।",
      "প্রধান গ্রন্থ: তারীখে বাগদাদ\n\nতাঁর প্রধান গ্রন্থ হলো 'তারীখে বাগদাদ' (বাগদাদ শহরের ইতিহাস)। এটি বাগদাদের আলেম ও ব্যক্তিত্বদের জীবনী নিয়ে রচিত এক সুবিশাল গ্রন্থ।",
      "এই গ্রন্থটি পরবর্তী সকল জীবনীমূলক গ্রন্থের জন্য মৌলিক উৎস হিসেবে কাজ করে।",
      "অন্যান্য গ্রন্থ\n\nহাদিসশাস্ত্রের নীতিতে তাঁর অন্যতম কাজ হলো 'আল-কিফায়া ফী উলূম আল-রিওয়ায়া' (হাদিস বর্ণনার নীতি)।",
      "মৃত্যু\n\nতিনি ৪৬৩ হিজরিতে (১০৭১ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nইমাম আল-খতিব আল-বাগদাদী (রহঃ)-এর জীবন হাদিসশাস্ত্রের নিয়মকানুন এবং ইতিহাস সংকলনে তাঁর মৌলিক অবদানের জন্য স্মরণীয়।"
    ],
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "imam_ahmad_raza_khan",
    "categoryId": "imam_jibon",
    "title": "ইমাম আহমদ রেজা খান বেরলভী (রহঃ)",
    "paragraphs": [
      "ইমাম আহমদ রেজা খান বেরলভী (রহঃ)-এর পূর্ণ নাম হলো আবু আল-বারাকাত মুহিউদ্দীন আব্দুল মুস্তফা মুহাম্মদ আহমদ ইবনে নকী আলী খান আল-কাদেরী। তিনি ভারতীয় উপমহাদেশের অন্যতম শ্রেষ্ঠ মুজাদ্দিদ (সংস্কারক), হানাফি ফকীহ, মুহাদ্দিস, মুফাসসির এবং সুফী ছিলেন।",
      "নাম ও পরিচিতি\n\nতাঁর উপনাম ছিল আবু আল-বারাকাত। তাঁকে তাঁর অনুসারীরা 'আ'লা হযরত' (সর্বোচ্চ মর্যাদাশীল) এবং চতুর্দশ হিজরি শতাব্দীর 'মুজাদ্দিদ' (সংস্কারক) উপাধিতে ভূষিত করেন।",
      "তিনি হানাফি ফিকহ ও আক্বীদার ক্ষেত্রে তাঁর কঠোর এবং নির্ভুল ব্যাখ্যার জন্য সুপরিচিত।",
      "জন্ম ও জন্মস্থান\n\nতিনি ১২৭২ হিজরি (১৮৫৬ খ্রিস্টাব্দে) ব্রিটিশ ভারতের উত্তর প্রদেশের বেরেলি শহরে জন্মগ্রহণ করেন। তাঁর পরিবার ছিল পশতুন (পাঠান) বংশোদ্ভূত এবং তৎকালীন সম্মানিত আলেমদের মধ্যে গণ্য।",
      "পারিবারিক পটভূমি\n\nতাঁর পরিবার জ্ঞানচর্চার সঙ্গে যুক্ত ছিল। তাঁর পিতা মাওলানা নকী আলী খান এবং পিতামহ মাওলানা রেজা আলী খান উভয়েই ফিকহ ও হাদিসের পণ্ডিত ছিলেন। তিনি শৈশব থেকেই জ্ঞানার্জনের এক অনুকূল পরিবেশে বেড়ে ওঠেন।",
      "প্রাথমিক শিক্ষা ও মেধা\n\nতিনি মাত্র ৪ বছর বয়সে কুরআন হিফয (মুখস্থ) সম্পন্ন করেন। তাঁর প্রখর মেধা ছিল কিংবদন্তী। মাত্র ১৩ বছর ১০ মাস ৫ দিন বয়সে তিনি ফিকহ ও উসূলের ক্ষেত্রে প্রথম ফতোয়া দেন।",
      "শিক্ষকমণ্ডলী\n\nতাঁর প্রধান শিক্ষক ছিলেন তাঁর পিতা মাওলানা নকী আলী খান (রহঃ)। এছাড়াও তিনি হিজাজে থাকাকালীন শাইখ আব্দুল রহমান আল-সিরাজ আল-মক্কী সহ বহু আলেমের কাছ থেকে হাদিস ও ফিকহের সনদ (ইজাযাহ) লাভ করেন।",
      "প্রধান গ্রন্থ: ফাতাওয়া-এ-রেজভিয়া\n\nতাঁর প্রধান ফিকহী গ্রন্থ হলো 'ফাতাওয়া-এ-রেজভিয়া'। এটি হানাফি ফিকহের উপর রচিত তাঁর লক্ষাধিক ফতোয়ার এক বিশাল সংকলন। এটি প্রায় ৩০ খণ্ডের বেশি।",
      "অন্যান্য গ্রন্থ\n\nতিনি ফিকহ, হাদিস, তাফসীর, আক্বীদা, যুক্তিবিদ্যা, গণিত ও জ্যোতির্বিজ্ঞান সহ প্রায় ১,০০০-এরও বেশি গ্রন্থ বা রিসালা (ছোট প্রবন্ধ) রচনা করেন।",
      "তাঁর উল্লেখযোগ্য গ্রন্থগুলোর মধ্যে রয়েছে 'কানযুল ঈমান' (কুরআনের উর্দু অনুবাদ), 'আল-মু'তামাদ আল-মুস্তানা'দ' (ধর্মতত্ত্ব) এবং 'হাদাইক-এ-বখশিশ' (না'ত শরীফের সংকলন)।",
      "ফিকহী অবস্থান ও আক্বীদা\n\nতিনি হানাফি মাযহাবের একজন কঠোর অনুসারী ছিলেন এবং মাযহাবের অনুসরণকে অপরিহার্য মনে করতেন। তিনি আক্বীদার ক্ষেত্রে আহলে সুন্নাত ওয়াল জামা'আতের মূলনীতিগুলো কঠোরভাবে রক্ষা করতেন।",
      "সংস্কারবাদী ভূমিকা (মুজাদ্দিদ)\n\nতিনি তাঁর সময়ে মুসলিম সমাজে প্রচলিত বিদ'আত ও শিরক-এর বিরুদ্ধে অবস্থান নেন। একই সাথে তিনি তাঁর সমসাময়িক কিছু আলেমদের (যেমন দেওবন্দী ও আহলে হাদিস) আক্বীদা ও ফিকহী সিদ্ধান্তের সমালোচনা করেন।",
      "তাঁর সমালোচনার ক্ষেত্র ছিল মূলত নবী (সাঃ)-এর ইলমে গায়েব (অদৃশ্যের জ্ঞান) ও হাজির-নাযির (উপস্থিতি) সংক্রান্ত বিশ্বাস।",
      "সুফিবাদ ও ত্বরীকা\n\nতিনি কাদরিয়া ত্বরীকার একজন অন্যতম প্রধান শাইখ ছিলেন এবং সুফিবাদের নৈতিক ও আধ্যাত্মিক দিকগুলির ওপর জোর দিতেন। তিনি ছিলেন সুফিবাদের একজন অন্যতম শক্তিশালী প্রবক্তা।",
      "রাজনৈতিক ভূমিকা\n\nতিনি ভারতীয় উপমহাদেশে মুসলিমদের রাজনীতিতে অংশগ্রহণকে সমর্থন করতেন, তবে তিনি কংগ্রেস বা মহাত্মা গান্ধীর সঙ্গে একমত ছিলেন না। তিনি খিলাফত আন্দোলন-এর পক্ষে থাকলেও এর কিছু পদ্ধতির সমালোচনা করেন।",
      "তিনি ইসলামী আইনের (শরীয়াহ) ভিত্তিতে ফয়সালা দেওয়ার ওপর জোর দিতেন।",
      "ছাত্রবৃন্দ\n\nতাঁর অসংখ্য ছাত্র ভারতীয় উপমহাদেশ এবং অন্যান্য দেশে তাঁর জ্ঞানকে ছড়িয়ে দেন। তাঁর চিন্তাধারার অনুসারীরা বেরলভী বা আহলে সুন্নাত ওয়াল জামা'আত নামে পরিচিত।",
      "ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং একজন পরিশ্রমী আলেম। তিনি তাঁর জীবনকে ইবাদত, গ্রন্থ রচনা এবং ফতোয়া বিতরণে ব্যয় করতেন।",
      "মৃত্যু ও শেষ জীবন\n\nতিনি জীবনের শেষ সময় বেরেলিতে কাটান। তিনি ১৩৪০ হিজরিতে (১৯২১ খ্রিস্টাব্দে) তাঁর নিজ শহর বেরেলিতে ইন্তেকাল করেন।",
      "জানাযা ও মর্যাদা\n\nতাঁর ইন্তেকালের পর তাঁর জানাযায় এবং তাঁর মাজারে আজও বিপুল জনসমাগম হয়। তাঁর জীবন ভারতীয় উপমহাদেশের ইসলামি জ্ঞান ও রাজনীতিতে এক গভীর প্রভাব ফেলে।"
    ],
    "source": "মাওলানা আব্দুল হাক্ক কাদরী, হায়াত-ই-আ'লা হযরত; হাফিয ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া (ঐতিহাসিক তথ্য যাচাইয়ে ব্যবহৃত)"
  }
]