[
  {
    "id": "imam_abu_hanifa",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু হানিফা (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু হানিফার প্রকৃত নাম ছিল আল-নু'মান ইবনে সাবিত। তিনি ছিলেন ইসলামী আইনশাস্ত্রের (ফিকহ) চার সুন্নি মাযহাবের মধ্যে প্রথম এবং সর্বশ্রেষ্ঠ ইমাম। তাঁকে 'আল-ইমাম আল-আ'যম' (সর্বশ্রেষ্ঠ ইমাম) উপাধি দেওয়া হয়।",
      "জন্ম ও বংশ পরিচয়\n\n৮০ হিজরিতে (৬৯৯ খ্রিস্টাব্দে) ইরাকের বিখ্যাত জ্ঞানকেন্দ্র কুফায় তিনি জন্মগ্রহণ করেন। তাঁর পরিবার ছিল পারস্য বংশোদ্ভূত এবং অর্থনৈতিকভাবে সচ্ছল। তাঁর পিতা সাবিত একজন সফল রেশমী কাপড়ের ব্যবসায়ী ছিলেন। এই পারিবারিক সচ্ছলতা তাঁকে নির্বিঘ্নে জ্ঞান অন্বেষণে মনোযোগ দিতে সাহায্য করেছিল।",
      "তাবেয়ী মর্যাদা\n\nতিনি ছিলেন তাবেয়ী প্রজন্মের অন্তর্ভুক্ত। নির্ভরযোগ্য সূত্র অনুসারে, তিনি জীবনের প্রথম দিকে আনাস ইবনে মালিক (রাঃ) সহ কয়েকজন সাহাবীর সাক্ষাৎ লাভের সৌভাগ্য অর্জন করেন।",
      "ব্যবসা থেকে জ্ঞান সাধনায়\n\nইমাম আবু হানিফা (রহঃ) প্রথম জীবনে বাবার ব্যবসায় যোগ দেন এবং তাঁর অত্যন্ত সততার জন্য ব্যবসায়িক মহলে সুপরিচিত ছিলেন। কিন্তু কুফার প্রখ্যাত আলেম শা'বি (রহঃ)-এর অনুপ্রেরণায় তিনি জ্ঞান সাধনার দিকে ঝুঁকে পড়েন।",
      "প্রধান শিক্ষক\n\nতিনি তাঁর জীবনের প্রায় ১৮ বছর কুফার শ্রেষ্ঠ ফকীহ হাম্মাদ ইবনে আবি সুলায়মান (রহঃ)-এর মজলিসে অতিবাহিত করেন। হাম্মাদ (রহঃ)-এর মৃত্যুর পর, তাঁর ছাত্ররা ইমাম আবু হানিফা (রহঃ)-কেই তাঁর স্থলাভিষিক্ত হিসেবে মনোনীত করেন।",
      "বিস্তৃত জ্ঞান অন্বেষণ\n\nতিনি শুধুমাত্র কুফাতেই সীমাবদ্ধ থাকেননি। তিনি মক্কা, মদীনা এবং অন্যান্য জ্ঞানকেন্দ্রেও বহুবার সফর করে হাদিস ও ফিকহের জ্ঞান অর্জন করেন। তাঁর রচিত গ্রন্থের মধ্যে ইসলামী আকীদা সম্পর্কিত 'আল-ফিকহুল আকবর' এবং হাদিস সংকলন 'কিতাবুল আছার' অন্যতম।",
      "ফিকহে বৈপ্লবিক পদ্ধতি\n\nইমাম আবু হানিফা (রহঃ) তাঁর ফিকহী মাযহাব (হানাফি মাযহাব)-কে একটি বৈপ্লবিক পদ্ধতির মাধ্যমে সুসংগঠিত করেন। তিনি প্রায় ৪০ জন বিশেষজ্ঞ ফকীহ, মুহাদ্দিস ও উসূলবিদকে নিয়ে একটি ফিকহী গবেষণা পরিষদ গঠন করেন।",
      "গবেষণা পরিষদ\n\nএই মজলিসে একটি মাসআলা নিয়ে বিস্তারিত আলোচনার পর সম্মিলিত সিদ্ধান্তের মাধ্যমে ফায়সালা লিপিবদ্ধ করা হতো। ইসলামী আইনের ইতিহাসে এটি ছিল এক অনন্য পদ্ধতি।",
      "আইনের উৎস\n\nতাঁর ফিকহের ভিত্তি ছিল কুরআন, সুন্নাহ, সাহাবীদের ইজমা এবং এরপর কিয়াস (যুক্তি-তুলনা) ও ইসতিহসান (আইনী পচ্ছন্দ)-এর ব্যবহার। এই পদ্ধতি হানাফি ফিকহকে বাস্তব জীবনের প্রতিটি ক্ষেত্রে প্রয়োগের জন্য উপযোগী করে তোলে। তিনি হাদিসের বিশুদ্ধতার বিষয়ে অত্যন্ত কঠোর ছিলেন এবং শুধু শক্তিশালী ও নির্ভরযোগ্য হাদিসকেই ফিকহী বিধানে ব্যবহার করতেন।",
      "ব্যক্তিগত চরিত্র ও তাকওয়া\n\nইমাম আবু হানিফা (রহঃ)-এর ব্যক্তিগত জীবন ছিল উচ্চতর তাকওয়া (খোদাভীতি) ও ইবাদতের আদর্শ। তিনি দীর্ঘকাল ধরে সারারাত জেগে ইবাদত করতেন বলে বর্ণিত আছে।",
      "সততা ও দানশীলতা\n\nব্যবসায় তিনি ছিলেন অত্যন্ত সৎ। একবার তাঁর কর্মচারী ভুল করে ত্রুটিপূর্ণ কাপড় বিক্রি করলে, তিনি সেই কাপড়ের মূল্য দান করে দেন। তিনি তাঁর ছাত্রদের মাসিক ভাতা প্রদান করতেন এবং নিজের উপার্জনের বেশিরভাগই অভাবী ও জ্ঞান অন্বেষণকারীদের জন্য খরচ করতেন।",
      "শাসকদের সাথে আপসহীন অবস্থান\n\nইমাম আবু হানিফা (রহঃ) তাঁর জ্ঞান এবং নীতির প্রশ্নে ছিলেন আপসহীন ও নির্ভীক। তিনি কখনোই কোনো শাসকের অন্যায্য কাজে সহযোগিতা করতে রাজি হননি।",
      "উমাইয়া শাসকের প্রস্তাব প্রত্যাখ্যান\n\nউমাইয়া খলিফা মারওয়ান ইবনে মুহাম্মাদ তাঁকে কুফার প্রধান বিচারপতির (কাজীর) পদ গ্রহণের প্রস্তাব দিলে তিনি তা প্রত্যাখ্যান করেন। এই অস্বীকৃতির জন্য তাঁকে শারীরিক শাস্তি ভোগ করতে হয়।",
      "আব্বাসীয় খলিফার প্রস্তাব প্রত্যাখ্যান\n\nপরবর্তীতে আব্বাসীয় খলিফা আল-মানসুর তাঁকে বাগদাদের প্রধান বিচারপতির (কাজীউল কুজাত) পদ গ্রহণের জন্য চাপ দেন। ইমাম (রহঃ) দৃঢ়ভাবে বলেন যে, তিনি এই পদের যোগ্য নন এবং এটি গ্রহণ করতে রাজি নন।",
      "কারাবরণ ও নির্যাতন\n\nখলিফা আল-মানসুরের ক্রমাগত চাপ ও অস্বীকৃতির ফলে ইমাম আবু হানিফা (রহঃ)-কে কারাগারে বন্দী করা হয় এবং সেখানে তাঁর উপর কঠিন নির্যাতন চালানো হয়।",
      "ইন্তেকাল ও ঐতিহাসিক মর্যাদা\n\nদীর্ঘদিন শাসকের নির্যাতনের শিকার হয়ে ইমাম আবু হানিফা (রহঃ) ১৫০ হিজরিতে (৭৬৭ খ্রিস্টাব্দে) ইরাকের বাগদাদ শহরে কারাগারেই ইন্তেকাল করেন। তাঁর ইন্তেকালের পর তাঁর জানাযায় এত মানুষের সমাগম হয়েছিল যে, ভিড়ের কারণে ছয়বার জানাযার সালাত আদায় করতে হয়েছিল।",
      "উত্তরাধিকার\n\nতাঁর প্রতিষ্ঠিত হানাফি মাযহাব তাঁর দুই প্রধান ছাত্র ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম মুহাম্মদ (রহঃ)-এর মাধ্যমে সুসংগঠিত ও প্রচারিত হয়। বর্তমানে বিশ্বের বিপুল সংখ্যক মুসলিম তাঁর মাযহাবের অনুসারী। ইমাম আবু হানিফা (রহঃ) তাঁর আপসহীনতা, গভীর জ্ঞান ও অসাধারণ তাকওয়ার জন্য ইসলামী ইতিহাসের ইমামে আ'যম হিসেবে সর্বদা শ্রদ্ধার আসনে অধিষ্ঠিত থাকবেন।"
    ],
    "moral": "জ্ঞান, সততা ও নীতির প্রশ্নে কখনো আপস করা যায় না। ইমাম আবু হানিফা (রহঃ) শাসকের চাপ ও নির্যাতনের মুখেও তাঁর নীতি থেকে সরে আসেননি।",
    "source": "ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_malik",
    "categoryId": "imam_jibon",
    "title": "ইমাম মালিক (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম মালিকের পূর্ণ নাম হলো মালিক ইবনে আনাস ইবনে মালিক ইবনে আবি আমির আল-আসবাহী। তিনি ছিলেন সুন্নি ইসলামের চারটি প্রধান ফিকহী মাযহাবের মধ্যে মালিকি মাযহাবের প্রতিষ্ঠাতা। তাঁকে 'ইমাম দার আল-হিজরা' বা 'মদীনার ইমাম' উপাধিতে ভূষিত করা হয়।",
      "জন্ম ও বংশ পরিচয়\n\nইমাম মালিক (রহঃ) ৯৩ হিজরিতে (৭১৩ খ্রিস্টাব্দে) মদীনা মুনাওয়ারায় জন্মগ্রহণ করেন এবং ১৭৯ হিজরিতে (৭৯৫ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তাঁর পরিবার ছিল অত্যন্ত সম্মানিত এবং ইয়েমেনের হিমইয়ার গোত্রের বংশধর। তাঁর পূর্বপুরুষরা ইয়েমেন থেকে হিজরত করে মদীনায় বসতি স্থাপন করেন এবং ইসলামের সেবায় নিজেদের নিয়োজিত করেন।",
      "শৈশব ও প্রাথমিক শিক্ষা\n\nইমাম মালিক (রহঃ) মদীনার এমন এক পরিবেশে বেড়ে ওঠেন যেখানে তাবেয়ীদের জ্ঞানচর্চা চলছিল। তাঁর দাদা মালিক ইবনে আবি আমির একজন বড় তাবেয়ী ছিলেন এবং তাঁর চাচা আবু সুহাইল নাফে' ও আবু রুওয়াইম উভয়েই হাদিসের আলেম ছিলেন। এই পরিবেশ তাঁর জ্ঞানার্জনের পথকে সহজ করে দেয়।",
      "প্রাথমিক জীবন ও জ্ঞান সাধনা\n\nতিনি এমন এক সময়ে মদীনায় বেড়ে ওঠেন, যখন এটি ছিল ইসলামী জ্ঞান, হাদিস এবং সুন্নাহর কেন্দ্রবিন্দু। প্রথম দিকে তিনি ফ্যাশন ও ঘোড়দৌড়ের প্রতি আগ্রহী ছিলেন। কিন্তু পরিবারের সদস্যদের, বিশেষত তাঁর মায়ের অনুপ্রেরণায় তিনি জ্ঞানের দিকে মনোনিবেশ করেন।",
      "মায়ের অনুপ্রেরণা ও উপদেশ\n\nইমাম মালিক (রহঃ)-এর মা ছিলেন অত্যন্ত বুদ্ধিমতী এবং দূরদর্শী। তিনি তাঁর মায়ের দেওয়া সেই উপদেশ সারাজীবন মনে রেখেছিলেন: 'যাও, জ্ঞানীর নিকট যাও এবং তাঁর শিষ্টাচার ও আদব শেখো, তাঁর জ্ঞান পরে শেখা যাবে।' তাঁর মা তাঁকে সুন্দর পোশাক পরিয়ে পাগড়ি পরিয়ে শিক্ষকের কাছে পাঠাতেন এবং বলতেন, 'আগে তাঁর আদব শেখো, তারপর তাঁর জ্ঞান শেখো।'",
      "জ্ঞান অর্জনে একাগ্রতা\n\nপ্রথম দিকে ইমাম মালিক (রহঃ) ফ্যাশন ও ঘোড়দৌড়ের প্রতি আগ্রহী ছিলেন। কিন্তু তাঁর মায়ের অনুপ্রেরণা এবং মদীনার জ্ঞানসমৃদ্ধ পরিবেশ তাঁকে জ্ঞানার্জনের দিকে ঝুঁকিয়ে দেয়। তিনি সম্পূর্ণভাবে হাদিস ও ফিকহ শিক্ষায় মনোনিবেশ করেন এবং মদীনার বড় বড় আলেমদের মজলিসে নিয়মিত উপস্থিত হতে থাকেন।",
      "গুরুত্বপূর্ণ শিক্ষকগণ\n\nতিনি মদীনার প্রখ্যাত তাবেয়ী ও তাবে-তাবেয়ী আলেমদের কাছ থেকে শিক্ষা লাভ করেন। তিনি প্রায় এক হাজারেরও বেশি শিক্ষকের নিকট হাদিস ও ফিকহ শিক্ষা করেছিলেন। তাঁর প্রধান শিক্ষকদের মধ্যে ছিলেন ইবনে শিহাব আল-যুহরি (রহঃ), ইয়াহইয়া ইবনে সাঈদ আল-আনসারী (রহঃ) এবং রাবি'আ ইবনে আবদুর রহমান (রহঃ)।",
      "আল-মুয়াত্তা সংকলন\n\nইমাম মালিক (রহঃ)-এর জীবনের সবচেয়ে বড় কীর্তি হলো তাঁর রচিত হাদিস ও ফিকহের সংকলন 'আল-মুয়াত্তা'। এটিই ছিল ফিকহ ও হাদিসের সমন্বয়ে রচিত প্রথম সংকলনগুলির মধ্যে অন্যতম। তৎকালীন আব্বাসীয় খলিফা আল-মানসুর চেয়েছিলেন যে, মুসলিম বিশ্বের জন্য একটি একক ও প্রামাণিক ফিকহী আইন গ্রন্থ সংকলিত হোক।",
      "হাদিস নির্বাচনের মানদণ্ড\n\nতিনি মুয়াত্তাতে কেবলমাত্র সেসব হাদিসই অন্তর্ভুক্ত করেছেন, যা মদীনার আলেমদের দ্বারা ব্যাপকভাবে গৃহীত, প্রতিষ্ঠিত ও অনুশীলন করা হতো। তিনি হাদিসের পাশাপাশি সাহাবীদের বক্তব্য এবং তাবেয়ীদের ফতোয়া অন্তর্ভুক্ত করেন।",
      "ফিকহী পদ্ধতি\n\nমালিকি মাযহাব অন্যান্য মাযহাব থেকে কিছুটা ভিন্ন, কারণ এর ভিত্তি প্রধানত মদীনার প্রচলিত আমলের ওপর। তিনি বিশ্বাস করতেন, নবী (সাঃ)-এর হিজরতের পর থেকে মদীনার মানুষের প্রজন্ম পরম্পরায় চলে আসা আমল অবশ্যই সুন্নাহর প্রতিফলন।",
      "ফতোয়ার মূলনীতি\n\nতাঁর ফতোয়া প্রদানের উৎস ছিল আল-কুরআন ও সুন্নাহ, ইজমা, মদীনাবাসীর আমল, আল-মাসালিহ আল-মুরসালা (জনস্বার্থ রক্ষা), ইসতিহসান ও কিয়াস।",
      "ব্যক্তিগত চরিত্র ও আদব\n\nইমাম মালিক (রহঃ) জ্ঞান, তাকওয়া এবং সাহসিকতার জন্য কিংবদন্তী ছিলেন। তিনি হাদিস ও ফতোয়া প্রদানের সময় অত্যন্ত বিনয়ী ও মর্যাদাপূর্ণ আচরণ করতেন। হাদিস বর্ণনা করার আগে তিনি সবসময় অজু করতেন, সুগন্ধি ব্যবহার করতেন এবং পরিচ্ছন্ন পোশাক পরতেন।",
      "রাজনৈতিক পরীক্ষা\n\nআব্বাসীয় খলিফা আল-মানসুরের শাসনকালে, ইমাম মালিক (রহঃ) একটি ফতোয়া জারি করেছিলেন, যা তৎকালীন শাসকদের অবস্থানের পরিপন্থী ছিল। এর ফলে তাঁকে গ্রেফতার করা হয় এবং প্রকাশ্য দিবালোকে শারীরিক শাস্তি দেওয়া হয়। এই ঘটনা তাঁর মর্যাদাকে আরও বাড়িয়ে দেয় এবং তিনি মুসলিম উম্মাহর কাছে আপসহীন আলেম হিসেবে পরিচিত হন।",
      "শিক্ষাদান ও ছাত্রবৃন্দ\n\nইমাম মালিক (রহঃ) মদীনায় প্রায় ৬০ বছর হাদিস ও ফিকহের শিক্ষাদান করেছেন। তাঁর মজলিসে হাজার হাজার ছাত্র জ্ঞান অর্জন করেছেন। তাঁর ছাত্রদের মধ্যে ইমাম শাফেয়ী (রহঃ), আবদুল্লাহ ইবনে মুবারক (রহঃ), আবদুর রহমান ইবনে কাসিম (রহঃ) এবং আরো অনেক বড় বড় আলেম ছিলেন। তিনি শিক্ষাদানের সময় অত্যন্ত গাম্ভীর্য বজায় রাখতেন এবং হাদিসের প্রতি সম্মান প্রদর্শন করতেন।",
      "মদীনার প্রতি ভালোবাসা\n\nইমাম মালিক (রহঃ) মদীনাকে অত্যন্ত ভালোবাসতেন এবং জীবনে কখনো মদীনা ছেড়ে অন্য কোথাও যাননি। খলিফারা তাঁকে বাগদাদে আসার জন্য আমন্ত্রণ জানালেও তিনি প্রত্যাখ্যান করেন এবং বলেন, 'মদীনা হলো রাসূলুল্লাহ (সাঃ)-এর শহর এবং আমি এখানেই থাকতে চাই।' তিনি মদীনার মসজিদে নববীতে নিয়মিত শিক্ষাদান করতেন এবং সেখানেই তাঁর জ্ঞানের মজলিস বসতো।",
      "প্রভাব ও উত্তরাধিকার\n\nতাঁর অন্যতম শ্রেষ্ঠ ছাত্র ছিলেন ইমাম শাফেয়ী (রহঃ), যিনি পরবর্তীকালে নিজস্ব মাযহাব প্রতিষ্ঠা করেন। মালিকি মাযহাব প্রধানত উত্তর আফ্রিকা, পশ্চিম আফ্রিকা, মিশর এবং আন্দালুসিয়া অঞ্চলে বিস্তার লাভ করে, যেখানে আজও এটি প্রভাবশালী। তাঁর মুয়াত্তা আজও হাদিস ও ফিকহের একটি অমূল্য গ্রন্থ হিসেবে বিবেচিত হয়।",
      "আকীদাহ ও কুরআন সম্পর্কে\n\nইমাম মালিক (রহঃ) আহলুস সুন্নাহ ওয়াল জামাআতের ইমাম ছিলেন। যারা কুরআনকে আল্লাহর কালাম না বলে আল্লাহর সৃষ্টি বলতো ইমাম মালিক (রহঃ) তাদের যিন্দিক (নাস্তিক) বলতেন। ইয়াহইয়া ইবনে রাবী' বর্ণনা করেন, এক লোক তাঁর কাছে এসে বলল, 'হে আবূ আব্দুল্লাহ! ঐ ব্যক্তি সম্পর্কে আপনি কি বলেন, যে কুরআনকে সৃষ্ট বলে?' মালিক বললেন, 'সে যিন্দিক। তোমরা তাকে হত্যা কর।' লোকটি বলল, 'আমি তো একটা শোনা কথা নকল করেছি মাত্র।' মালিক বললেন, 'আমি তোমাকে ছাড়া আর কারো থেকে এ কথা শুনিনি। এ বড় সাংঘাতিক।'",
      "আল্লাহর সিফাত বা গুণাবলি\n\nইমাম মালিক (রহঃ) আল্লাহর সিফাত সমূহের কোন রূপ তাবিল বা ভিন্নার্থ গ্রহণের পক্ষপাতি ছিলেন না। বরং আল্লাহর হাত, পা, মুখ এসবের হুবহু অর্থই নিতেন। ইমাম দারাকুতনী (রহঃ) আল-ওয়ালীদ ইবনে মুসলিমের সনদে বর্ণনা করেছেন, তিনি বলেন, 'আমি মালিক, সাওরী, আওযাঈ ও লায়ছ ইবনে সা'দকে আল্লাহর গুণাবলী সংক্রান্ত হাদিসগুলো সম্পর্কে জিজ্ঞেস করেছিলাম। তারা বলেছিলেন, এগুলো যেভাবে এসেছে সেভাবেই বর্ণিত।' অর্থাৎ যা আছে হুবহু সেটাই বিশ্বাস করা লাগবে। আহলুস সুন্নাহ ওয়াল জামাআতের আকিদাহ এটাই।",
      "আল্লাহর অবস্থান ও আরশের ঘটনা\n\nইমাম মালিক (রহঃ)-এর আকিদাহ হচ্ছে আল্লাহ আরশের উপর সমুন্নত আর এ বিষয়ে বিশ্বাস করা ওয়াজিব। আবূ নুআইম (রহঃ) জাফর ইবনে আব্দুল্লাহ থেকে বর্ণনা করেছেন, তিনি বলেন, 'আমরা মালিক ইবনে আনাসের মজলিসে ছিলাম। এ সময় এক লোক তাঁর কাছে এসে বলল, হে আবূ আব্দুল্লাহ! রহমান (আল্লাহ) তো আরশে সমুন্নত। তিনি কীভাবে সমুন্নত?' তার প্রশ্নে ইমাম মালিক এতটাই রাগান্বিত হলেন যে তাঁর শরীর থেকে ঘাম ঝরতে লাগল। কিছুক্ষণ পর তিনি মাথা তুললেন এবং বললেন, 'তাঁর সমুন্নত হওয়ার ধরন অবোধগম্য, তবে তাঁর সমুন্নত হওয়া অজ্ঞাত নয়, এ বিষয়ে ঈমান রাখা ফরয এবং প্রশ্ন তোলা বিদআত। আমার ধারণা তুমি একজন বিদআতী।' তারপর তিনি তাকে বের করে দিতে আদেশ দিলেন।",
      "কিয়ামতে আল্লাহকে দেখা\n\nইবনু আব্দিল বার্র (রহঃ) বলেন, মালিককে কিয়ামত দিবসে আল্লাহকে দেখা যাবে কি না তা জিজ্ঞেস করা হয়। উত্তরে তিনি বলেন, 'হ্যাঁ। আল্লাহ তাআলা বলেছেন, সেদিন অনেক চেহারা উজ্জ্বল হবে। তাদের প্রতিপালকের দিকে তাকিয়ে থাকবে (সূরা কিয়ামাহ ৭৫/২২)। তিনি আরেক দলকে বলেছিলেন, কখনই না। তারা সেদিন তাদের প্রতিপালকের দর্শন হতে বঞ্চিত থাকবে (সূরা মুতাফফিফীন ৮৩/১৫)।' অর্থাৎ ইমাম মালিক (রহঃ)-এর মত হচ্ছে আল্লাহকে বান্দারা কিয়ামতের দিন দেখতে পাবে।",
      "আল্লাহর ইলম সর্বত্র\n\nইমাম আবু দাউদ (রহঃ) আব্দুল্লাহ ইবনে নাফে' থেকে বর্ণনা করেছেন, তিনি বলেন, ইমাম মালিক বলেছেন, 'আল্লাহ আকাশে এবং তাঁর ইলম (বিদ্যা) সব জায়গায় পরিব্যাপ্ত।' এই বর্ণনাগুলো ইমাম মালিক (রহঃ)-এর আকিদাহকে স্পষ্টভাবে ব্যাখ্যা করে এবং তিনি আহলুস সুন্নাহ ওয়াল জামাআতের পথে ছিলেন।",
      "ইন্তেকাল ও ঐতিহাসিক মর্যাদা\n\nইমাম মালিক (রহঃ) ১৭৯ হিজরিতে (৭৯৫ খ্রিস্টাব্দে) রবিউল আউয়াল মাসে ৮৪ বছর বয়সে মদীনাতেই ইন্তেকাল করেন। তাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকী-তে মসজিদে নববীর পাশে দাফন করা হয়। তাঁর জানাযায় হাজার হাজার মানুষ অংশগ্রহণ করেন এবং তাঁর জন্য দোয়া করেন। মদীনার প্রতি তাঁর গভীর অঙ্গীকার এবং হাদিস ও ফিকহে তাঁর অসাধারণ অবদানের কারণে তিনি 'ইমাম দার আল-হিজরা' হিসেবে চিরস্মরণীয় হয়ে আছেন।"
    ],
    "moral": "জ্ঞান অর্জনের সাথে সাথে আদব ও শিষ্টাচার শেখা অপরিহার্য। ইমাম মালিক (রহঃ) হাদিসের প্রতি সম্মান ও মদীনার ঐতিহ্যের প্রতি অনুগত থেকে ইসলামী আইনশাস্ত্রে অবিস্মরণীয় অবদান রেখেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_shafei",
    "categoryId": "imam_jibon",
    "title": "ইমাম শাফেয়ী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম শাফেয়ী (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ মুহাম্মদ ইবনে ইদ্রিস ইবনে আল-আব্বাস ইবনে উসমান ইবনে শাফে' আল-কুরাইশী আল-মুত্তালাবী। তিনি ১৫০ হিজরিতে (৭৬৭ খ্রিস্টাব্দের আগস্ট মাসে) ফিলিস্তিনের গাজায় জন্মগ্রহণ করেন এবং ২০৪ হিজরিতে রজব মাসের প্রথম দিন জুমআর রাত্রিতে (৮২০ খ্রিস্টাব্দের ১৯ জানুয়ারি) মাত্র ৫২ বছর বয়সে মিশরে ইন্তেকাল করেন। তাঁকে 'নাসিরুল হাদীস' (হাদিসের সাহায্যকারী) ও 'শায়খুল ইসলাম' উপাধিতে ভূষিত করা হয়।",
      "বংশ পরিচয় ও কুরাইশ বংশ\n\nইমাম শাফেয়ী (রহঃ) যেই বছর জন্মগ্রহণ করেন, সেই বছরই ইমাম আবু হানিফা (রহঃ) ইন্তেকাল করেন। তিনি মক্কার কুরাইশ বংশের অন্তর্ভুক্ত ছিলেন এবং তাঁর বংশধারা আবদে মানাফ বিন কুসাই-এর কাছে নবী মুহাম্মদ (সাঃ)-এর সাথে মিলিত হয়েছে। তাই তিনি আল-মুত্তালাবী বলে পরিচিত। তাঁর দাদা 'শাফে' একজন সাহাবী ছিলেন, যার দিকে সম্পৃক্ত করায় তিনি 'শাফেয়ী' নামে পরিচিত হন।",
      "পিতৃহীনতা ও মায়ের ভূমিকা\n\nইমাম শাফেয়ী মাত্র ২ বছর বয়সে পিতা ইদ্রিসকে হারিয়ে ইয়াতীম হয়ে যান। পিতার মৃত্যুর পর অভিভাবকহীনতা ও দারিদ্র্যতা ইত্যাদি নানা সমস্যার সম্মুখীন হন। তাঁর বিচক্ষণ মা তাঁকে দু'বছর বয়সে পিতৃভূমি ইয়ামেনে নিয়ে আসেন এবং পরে মক্কায় পাড়ি জমান। তাঁর মা তাঁকে কুরআন মুখস্থ করানোয় মনোনিবেশ করান।",
      "অসাধারণ প্রতিভা ও প্রাথমিক শিক্ষা\n\nইমাম শাফেয়ী ছোটবেলা থেকেই শিক্ষানুরাগী এবং কঠোর জ্ঞান সাধনা করার ফলে মাত্র ৭ বছর বয়সে সম্পূর্ণ কুরআন মুখস্থ করেন এবং ১০ বছর বয়সে ইমাম মালিক (রহঃ)-এর 'মুয়াত্তা' হাদীস গ্রন্থ হিফয করেন। তিনি মক্কায় বিভিন্ন মসজিদে ঘুরে আলেমদের শরণাপন্ন হয়ে বিভিন্ন হাদীস ও মাসআলা মুখস্থ করতে থাকেন। মক্কায় আরবী পণ্ডিতদের কাছে আরবী কবিতা ও ভাষা জ্ঞানে পূর্ণ পান্ডিত্ব লাভ করেন এবং ১৮ বছর বয়স থেকে ফতোয়া প্রদান শুরু করেন।",
      "মদীনা সফর ও ইমাম মালিকের সান্নিধ্য\n\nতিনি ছোটবেলায় একবার মদীনা সফর করেন এবং ইমাম মালিক (রহঃ)-এর সংকলিত গ্রন্থ মুয়াত্তা মুখস্থ করে তাঁকে শুনান। ইমাম শাফেয়ীর ছোট বয়সে এই প্রজ্ঞা ও প্রতিভা দেখে ইমাম মালিক (রহঃ) অভিভূত হন এবং তাঁকে স্নেহের পাত্র বানিয়ে নেন। ইমাম শাফেয়ী ইমাম মালিকের নিকট জ্ঞান চর্চা শুরু করেন এবং তাঁর ইন্তেকাল পর্যন্ত তাঁর কাছে শিক্ষা লাভ করেন।",
      "ইয়ামেন ও ফতোয়া প্রদান\n\nমদীনার পর তিনি ইয়ামানে শিক্ষার উদ্দেশ্যে বের হন এবং সেখানে শিক্ষা ও জ্ঞান বিস্তারে আত্মনিয়োগ করেন। মাত্র ১৮ বছর বয়স থেকে তিনি ফতোয়া প্রদান শুরু করেন। জনসমাজে তাঁর খ্যাতি ছড়িয়ে পড়লে তিনি বিদ্বেষীদের প্রকোপে পড়েন এবং ইয়ামেন ত্যাগ করে আবার মক্কায় ফিরে আসেন।",
      "প্রথম ইরাক সফর\n\nইমাম শাফেয়ী ইরাকে দু'বার সফর করেন। প্রথমবার রাজনৈতিক কারণে খলীফা হারুনুর রশীদ তাঁকে ইরাকে জোরপূর্বক পাঠান। সেখানে গিয়ে তিনি ইরাকের প্রসিদ্ধ জ্ঞানীদের নিকট শিক্ষা সমাপন করেন, বিশেষত ইমাম মুহাম্মদ আল-শাইবানী (রহঃ)-এর নিকট হানাফি ফিকহ ও কিয়াস পদ্ধতি সম্পর্কে গভীর জ্ঞান লাভ করেন। এরপর তিনি আবার মক্কায় ফিরে আসেন এবং পূর্ণদমে দরস-তাদরীস ও ইসলাম প্রচার-প্রসারের কাজে একটানা নয় বছর আত্মনিয়োগ করেন।",
      "দ্বিতীয় ইরাক সফর ও ইমাম আহমাদের সাক্ষাৎ\n\n১৯৫ হিজরীতে ইমাম শাফেয়ী আবারো ইরাক সফর করেন। প্রথম সফর ছিল জ্ঞান শিক্ষা গ্রহণের আর এ সফর হলো শিক্ষা গ্রহণ পাশাপাশি শিক্ষাদানের জন্য। ইমাম বায়হাকী (রহঃ) বর্ণনা করেন, হুসাইন কারাবিসী বলেন, 'আমাদের মাঝে একজন হাদীস পন্থী (আহলে হাদীস) এসেছেন চল আমরা তার কাছে গিয়ে একটু হাসি-ঠাট্টা করি।' কিন্তু ইমাম শাফেয়ী আল্লাহ ও রাসূলের উদ্ধৃতি দিয়ে তাদের জবাব দিতে থাকলেন এবং তাঁর কুরআন ও হাদিসের অগাধ পান্ডিত্য দেখে তারা আশ্চর্য হয়ে তাঁর কাছে আত্মসমর্পণ করেন। এ সফরেই ইমাম আহমাদ ইবনে হাম্বল (রহঃ) ইমাম শাফেয়ীর সাক্ষাৎ করেন।",
      "মিশর সফর ও মুতাযিলা ফিতনা\n\nইমাম শাফেয়ী (রহঃ)-এর ইরাকে অবস্থান যেমনি প্রশংসনীয় তেমনি আবার অপরদিক হতে কালো মেঘ নেমে আসতে লাগল। মুতাযিলা আলিমরা রাজনৈতিক প্রাঙ্গণ দখল করায় খলীফা হারুণসহ সে সময়ের আববাসীয় খলীফাগণ ফালসাফা ও তর্কবিদ্যা-মানতিকে প্রভাবিত হয়ে কুরআন মাখলুক বা মুতাজিলা বিশ্বাস পোষণ করে আহলুস সুন্নাহ ওয়াল জামাআতের ইমামদের উপর নির্যাতন শুরু করে। বাধ্য হয়ে ইমাম শাফেয়ী ইরাক ত্যাগ করে মিসরে পারি জমান।",
      "মিশরে স্বাগত ও প্রভাব\n\nমিশরে আগমন করলেই মিশরবাসী তাঁকে অভিনন্দন জানান। মিশরের বিখ্যাত মসজিদ আমর ইবনুল আস মসজিদে কিছু আলোচনা পেশ করলে সকলেই তাঁর আলোচনায় মুগ্ধ হয়ে যান। তারা এক বাক্যে স্বীকার করেন যে, মিশরের বুকে এমন প্রতিভাবান ব্যক্তির কখনও আগমন ঘটেনি, যিনি কুরাইশ বংশোদ্ভুত, যার সালাতের ন্যায় উত্তম সালাত আদায় করতে কাউকে দেখিনি, যার চেহারার ন্যায় সুন্দর চেহারা খুব কমই আছে, যার বক্তব্য ও বাচন ভঙ্গির মত আকর্ষণীয় ও শ্রুতিমধূর কাউকে দেখিনি।",
      "ফিকহী পদ্ধতি ও উসূলে ফিকহ\n\nইমাম শাফেয়ী (রহঃ)-এর প্রধান অবদান হলো ফিকহের উসূল (মূলনীতি) প্রতিষ্ঠা করা। তিনি হানাফি মাযহাবের 'আহলে রায়' এবং মালিকি মাযহাবের 'আহলে হাদিস'-এর মধ্যে একটি ভারসাম্যপূর্ণ পথের সৃষ্টি করেন। তিনি সর্বপ্রথম হাদিস শাস্ত্রের নীতিমালা প্রণয়নে কলম ধরেন 'রিসালাহ' ও 'আল উম্ম' গ্রন্থদ্বয়ে।",
      "আল-রিসালাহ\n\nএই গ্রন্থটি ইসলামী আইনশাস্ত্রের উসূল আল-ফিকহ-এর উপর রচিত সর্বপ্রথম প্রামাণিক গ্রন্থ। এটি তাঁর মৌলিক অবদান, যেখানে তিনি ফিকহের ভিত্তি হিসেবে কুরআন, সুন্নাহ, ইজমা এবং কিয়াসের ব্যবহারকে সুসংজ্ঞায়িত করেন। তাঁর আরেকটি গুরুত্বপূর্ণ গ্রন্থ হলো 'আল-উম্ম', যা শাফেয়ী মাযহাবের প্রধান ভিত্তি।",
      "আল-মাযহাবুল কাদীম ও জাদিদ\n\nইমাম শাফেয়ী (রহঃ)-এর ফিকহী জীবনকে দুটি পর্যায়ে ভাগ করা হয়। প্রাচীন মাযহাব ইরাক, মক্কা এবং মদীনার জীবনকালে প্রদত্ত ফতোয়া। জীবনের শেষ চার বছর তিনি মিশরে কাটান এবং সেখানকার পরিবেশ দেখে তিনি তাঁর পূর্বের কিছু সিদ্ধান্ত পরিবর্তন করেন। বর্তমানে শাফেয়ী মাযহাবের ভিত্তি হলো এই 'আল-মাযহাবুল জাদিদ'।",
      "আকীদাহ ও কুরআন সম্পর্কে\n\nইমাম শাফেয়ী (রহঃ) আহলুস সুন্নাহ ওয়াল জামাআতের ইমাম। তিনি ছিলেন কুরআন ও সুন্নাহর একনিষ্ঠ অনুসারী। তিনি কালাম পন্থী যুক্তিবাদী বিদআতীদের ঘোর বিরোধী ছিলেন। কুরআন সম্পর্কে তিনি বলতেন, 'যে বলবে যে, কুরআন মাখলূক (সৃষ্ট) সে কাফের।' আল্লাহর সিফাত বা গুণাবলি সম্পর্কে তিনি বলেছেন, 'কুরআন ও সুন্নাহ-তে আল্লাহর যেসব গুণ বর্ণিত হয়েছে সেগুলো আমরা যথাযথ মানি এবং তাঁর সাথে কোনরূপ উপমা দেওয়া অস্বীকার করি।'",
      "শিক্ষকবৃন্দ\n\nইমাম শাফেয়ী (রহঃ) স্বীয় যুগে বিভিন্ন দেশে অগণিত আলিমের কাছ থেকে শিক্ষালাভ করেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে রয়েছেন ইমাম সুফিয়ান ইবনে উয়াইনাহ (রহঃ), ইমাম মালিক ইবনে আনাস (রহঃ), ইমাম মুহাম্মদ ইবনে আল-হাসান আল-শাইবানী (রহঃ), ইমাম ওয়াকী ইবনে আল-জাররাহ (রহঃ), জাফর সাদিক (রহঃ), ইবনে শিহাব যুহরী (রহঃ) এবং আরো অনেকে।",
      "ছাত্রবৃন্দ ও প্রভাব\n\nইমাম শাফেয়ী (রহঃ)-এর ছাত্র হওয়ার যারা সৌভাগ্য লাভ করেছেন তাদের সংখ্যা বর্ণনা দেয়া অসম্ভব। তাঁর উল্লেখযোগ্য ছাত্রদের মধ্যে রয়েছেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইমাম রাবী ইবনে সুলায়মান আল-মাসরী (রহঃ), ইমাম ইসমাঈল ইবনে ইয়াহইয়া আল-মুযানী (রহঃ) এবং আরো অনেকে।",
      "আলিম সমাজের মন্তব্য\n\nইমাম মালিক (রহঃ) বলেন, 'আমি এ যুবক ইমাম শাফেয়ী-র মত অধিক বিচক্ষণ ও বুদ্ধিমান আর কোন কোরাইশীকে পাইনি।' ইমাম আহমাদ ইবনে হাম্বল (রহঃ) বলতেন, 'মুহাম্মদ ইবনে ইদ্রিস আল-শাফেয়ী ছিলেন এমন, যেমন মানুষের জন্য সূর্য এবং দেহের জন্য আরোগ্য।' একদল আলেম বলেন, 'ইমাম শাফেয়ী হলেন স্বীয় যুগে কুরআনের ব্যাপারে সবচেয়ে বেশি জ্ঞানী মানুষ।'",
      "গ্রন্থাবলী\n\nইমাম শাফেয়ী অসংখ্য গ্রন্থ রেখে গেছেন। তাঁর উল্লেখযোগ্য গ্রন্থগুলো হলো 'কিতাবুল উম্ম' (৯টি বড় খণ্ডে প্রকাশিত ফিকহী পদ্ধতিতে সংকলিত হাদীস গ্রন্থ), 'আর রিসালাহ' (উসূলে হাদীস ও উসূলে ফিকহের প্রথম গ্রন্থ), 'আহকামুল কুরআন', 'ইখতিলাফুল হাদীস', 'জিমাউল ইলম', 'ফাযাইলু কুরাইশ' এবং আরো অনেক।",
      "ইন্তেকাল\n\nইমাম শাফেয়ী (রহঃ) জীবনের শেষ পর্যন্ত মিশরে অবস্থান করেন এবং তাঁর মূল্যবান গ্রন্থসমূহ সেখানেই সংকলন করেন। তিনি ২০৪ হিজরিতে রজব মাসের প্রথম দিন জুমআর রাত্রিতে (৮২০ খ্রিস্টাব্দের ১৯ জানুয়ারি) মাত্র ৫২ বছর বয়সে মিশরে ইন্তেকাল করেন। তাঁর হাদীস গবেষণা ও চর্চায় যারা হানাফী বা মালিকী মাযহাবের অনুসারী ছিলেন, তার অনেকেই হাদিসের আলোকে ইসলাম চর্চার সুযোগ লাভে ধন্য হন।"
    ],
    "moral": "জ্ঞান অর্জনে দারিদ্র্য বাধা নয়। ইমাম শাফেয়ী (রহঃ) দারিদ্র্য সত্ত্বেও তাঁর অসাধারণ মেধা ও পরিশ্রমের মাধ্যমে ইসলামী আইনশাস্ত্রে যুগান্তকারী অবদান রেখেছেন।",
    "source": "ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_ahmad",
    "categoryId": "imam_jibon",
    "title": "ইমাম আহমাদ ইবনে হাম্বল (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আহমাদ (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ আহমাদ ইবনে মুহাম্মাদ ইবনে হাম্বল আল-শাইবানী। তিনি ১৬৪ হিজরিতে (৭৮০ খ্রিস্টাব্দে) বাগদাদে জন্মগ্রহণ করেন এবং ২৪১ হিজরিতে (৮৫৫ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তাঁকে 'ইমাম আহলুস সুন্নাহ' (সুন্নাহপন্থীদের ইমাম) ও 'শাইখুল ইসলাম' উপাধিতে ভূষিত করা হয়।",
      "প্রাথমিক জীবন ও পিতৃহীনতা\n\nইমাম আহমাদ (রহঃ) বাগদাদের এক সম্ভ্রান্ত আরব শাইবানী বংশে জন্মগ্রহণ করেন। তাঁর বাবা মুহাম্মদ ইবনে হাম্বল অল্প বয়সেই ইন্তেকাল করলে, তাঁর মা তাঁকে লালন-পালন করেন। ছোটবেলা থেকেই তাঁর স্মৃতিশক্তি ছিল প্রখর এবং তিনি শৈশবেই পুরো কুরআন মুখস্থ করেন।",
      "জ্ঞান অন্বেষণের যাত্রা\n\nতিনি ১৬ বছর বয়স থেকেই হাদিস সংগ্রহ ও শেখার দিকে মনোযোগ দেন। তিনি জ্ঞান অর্জনের জন্য তৎকালীন মুসলিম বিশ্বের বিভিন্ন অঞ্চলে ব্যাপক সফর করেন। তিনি কুফা, বসরা, মক্কা, মদীনা, ইয়েমেন, সিরিয়া, জাযিরা, আব্বাদান, ওয়াসেত ও অন্যান্য অঞ্চলে পায়ে হেঁটে অথবা কঠিন পরিস্থিতিতে ভ্রমণ করেছেন।",
      "শিক্ষকবৃন্দ\n\nতিনি প্রায় ২৮০ জনেরও বেশি আলেমের কাছ থেকে জ্ঞান অর্জন করেন। তাঁর শিক্ষকদের মধ্যে গুরুত্বপূর্ণ ছিলেন ইমাম শাফেয়ী (রহঃ), ওয়াকী ইবনুল জাররাহ (রহঃ), সুফিয়ান ইবনে উয়াইনাহ (রহঃ), আবদুর রাযযাক ইবনে হাম্মাম সানআনী (রহঃ), ইয়াহইয়া ইবনে সাঈদ কাত্তান (রহঃ), আবু দাউদ তাওয়ালিসী (রহঃ) এবং আরো অনেকে। তিনি ইমাম শাফেয়ী (রহঃ)-এর একজন ছাত্র ছিলেন এবং ফিকহের উসূল সম্পর্কে তাঁর কাছ থেকে গভীর জ্ঞান লাভ করেন।",
      "ইমাম শাফেয়ীর সাথে সম্পর্ক\n\nইমাম আহমাদ (রহঃ) বাগদাদে ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম শাফেয়ী (রহঃ)-এর কাছে পড়াশুনা করেন। ইমাম শাফেয়ী (রহঃ) তাঁকে অত্যন্ত সম্মান করতেন এবং বলতেন, 'আমি বাগদাদে আহমদ ইবনে হাম্বলের চেয়ে অধিক জ্ঞানী, ত্যাগী ও মুত্তাকী আর কাউকে রেখে আসিনি।'",
      "মুসনাদে আহমাদ সংকলন\n\nইমাম আহমাদ (রহঃ)-এর সবচেয়ে বড় অবদান হলো তাঁর বিশাল হাদিস সংকলন 'মুসনাদে আহমাদ'। এই গ্রন্থে তিনি প্রায় ২৭,০০০-এর বেশি হাদিস সংকলন করেছেন। মুসনাদের বিশেষত্ব হলো, এটি সাহাবীর নাম অনুসারে সাজানো হয়েছে। হাদিসশাস্ত্রের পণ্ডিতদের কাছে মুসনাদ একটি অত্যন্ত নির্ভরযোগ্য এবং বিশাল ভান্ডার হিসেবে বিবেচিত।",
      "ফিকহী পদ্ধতি ও হাম্বলি মাযহাব\n\nতাঁর মাযহাব হাদিস ও আছার (সাহাবীদের বক্তব্য)-এর ওপর সবচেয়ে বেশি গুরুত্ব দেয়। তাঁর ফতোয়ার উৎস ছিল আল-কুরআন ও সুন্নাহ, সাহাবীদের ফতোয়া, ইজমা এবং দুর্বল হাদিসকে কিয়াসের উপর অগ্রাধিকার দেওয়া। তিনি মুতাজিলা যুক্তিবাদী মতবাদের সারা জীবন ব্যাপী বিরোধিতা করেছেন।",
      "আল-মিহনা - খলীফা মামুনের ফিতনা\n\nইমাম আহমাদ (রহঃ)-এর জীবনের সবচেয়ে কঠিন পর্ব হলো 'আল-মিহনা' বা ধর্মদ্রোহিতার তদন্ত। আব্বাসীয় খলিফা আল-মামুনের শাসনামলে 'মুতাযিলা'দের প্রভাবে এই বিতর্ক সৃষ্টি হয় যে, কুরআন সৃষ্ট নাকি আল্লাহর চিরন্তন বাণী। খলিফা আল-মামুন পণ্ডিতদের উপর কুরআনের সৃষ্ট হওয়ার মুতাজিলি মতবাদ গ্রহণ করার জন্য চাপ প্রয়োগ করেন।",
      "দৃঢ় অবস্থান ও প্রত্যাখ্যান\n\nইমাম আহমাদ (রহঃ) মুতাজিলি মতবাদ গ্রহণ করতে দৃঢ়ভাবে অস্বীকৃতি জানান এবং কুরআনকে আল্লাহর চিরন্তন কালাম হিসেবে ঘোষণা করেন। তিনি বলেছিলেন, 'কুরআন আল্লাহর বাণী, সৃষ্ট নয়। কুরআন আল্লাহর অন্যান্য সৃষ্টির মত কোন সৃষ্টি নয় বরং তা সরাসরি আল্লাহর বাণী ও আল্লাহরই নিজস্ব বিশুদ্ধ বক্তব্য, তাই তা সম্পূর্ণ নির্ভূল।'",
      "কারাবাস ও নির্যাতন\n\nইমাম আহমাদ (রহঃ) মুতাজিলি মতবাদ গ্রহণ করতে অস্বীকৃতি জানানোর কারণে, তিনি আল-মামুনের রাজত্বকাল জুড়ে বাগদাদে বন্দী ছিলেন। আল-মামুনের উত্তরসূরী আল-মুতাসিমের শাসনামলে এক ঘটনায় ইমাম আহমাদকে বেত্রাঘাত করে অজ্ঞান করে ফেলা হয়। এই নির্যাতন বাগদাদে ব্যাপক অস্থিরতা সৃষ্টি করে এবং আল-মুতাসিমকে তাঁকে মুক্তি দিতে বাধ্য করে।",
      "নির্বাসন ও মুক্তি\n\nআল-মুতাসিমের মৃত্যুর পর, আল-ওয়াসিক খলিফা হন এবং মুতাজিলি মতবাদ প্রয়োগের জন্য তাঁর পূর্বসূরীদের নীতি অব্যাহত রাখেন এবং এই লক্ষ্যে ইমাম আহমাদকে বাগদাদ থেকে নির্বাসিত করেন। আল-ওয়াসিকের মৃত্যুর পর এবং তাঁর ভাই আল-মুতাওয়াক্কিল, যিনি ঐতিহ্যবাহী সুন্নি বিশ্বাসের প্রতি অনেক বেশি সহনশীল ছিলেন, তাঁর আরোহণের পরই ইমাম আহমাদকে বাগদাদে ফিরিয়ে আনা হয়।",
      "ব্যক্তিগত জীবন ও তাকওয়া\n\nতিনি ছিলেন চরম যাহিদ (দুনিয়াবিমুখ), পরহেজগার এবং বিনয়ী। তিনি শাসকদের কাছ থেকে কোনো উপহার বা ভাতা গ্রহণ করতেন না। আবু দাউদ (রহঃ) বর্ণনা করেছেন, 'ইমাম আহমাদের মজলিস ছিল আখেরাতের মজলিস। সেখানে কখনো তিনি দুনিয়ার আলোচনা করতেন না। আমি কখনো তাঁকে দুনিয়ার নাম উচ্চারণ করতে শুনিনি।'",
      "ছাত্রবৃন্দ\n\nইমাম আহমাদ (রহঃ)-এর ছাত্র সংখ্যা হাজার হাজার। তাঁর উল্লেখযোগ্য ছাত্রদের মধ্যে রয়েছেন ইমাম বুখারী (রহঃ), ইমাম মুসলিম (রহঃ), ইমাম আবু দাউদ সিজিস্তানী (রহঃ), তাঁর দুই ছেলে সালেহ ও আবদুল্লাহ এবং চাচাতো ভাই হাম্বল ইবনে ইসহাক।",
      "গ্রন্থাবলী\n\nইমাম আহমাদ অসংখ্য গ্রন্থ রেখে গেছেন। তাঁর উল্লেখযোগ্য গ্রন্থগুলো হলো মুসনাদে আহমাদ, উসুলুস সুন্নাহ, কিতাবুল ঈমান, কিতাবুয যুহুদ, ফাযায়িলুস সাহাবা, কিতাবুস সালাত, আর-রাদ্দ আলাল জাহমিয়্যাহ (জাহমিয়া মতবাদের খণ্ডন) এবং আরো অনেক।",
      "ইন্তেকাল ও মর্যাদা\n\nতিনি ছিলেন জনগণের কাছে অত্যন্ত প্রিয়। তাঁর মৃত্যুর দিন বাগদাদে বহু মানুষ সমবেত হন। ঐতিহাসিকদের মতে, তাঁর জানাযায় এতো বিপুল সংখ্যক মানুষ অংশ নিয়েছিলেন যে, তা স্মরণকালের মধ্যে সবচেয়ে বড় জানাযা ছিল। ইমাম আহমাদ ইবনে হাম্বল (রহঃ) ২৪১ হিজরিতে (৮৫৫ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন। তাঁর আপসহীনতা ও কুরআনের মর্যাদা রক্ষায় অবিচল থাকার কারণে তিনি 'ইমাম আহলুস সুন্নাহ' হিসেবে চিরকাল সম্মানিত হয়ে আছেন।"
    ],
    "moral": "সত্যের পথে অটল থাকা এবং নীতির প্রশ্নে কখনো আপস না করা। ইমাম আহমাদ (রহঃ) কঠিন নির্যাতন সহ্য করেও কুরআনের মর্যাদা রক্ষায় অবিচল ছিলেন।",
    "source": "ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; খতিব বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_bukhari",
    "categoryId": "imam_jibon",
    "title": "ইমাম বুখারী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম বুখারী (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ মুহাম্মদ ইবনে ইসমাইল ইবনে ইব্রাহিম ইবনে আল-মুগীরাহ আল-জু'ফী আল-বুখারী। তিনি হাদিসশাস্ত্রের সর্বোচ্চ মর্যাদা লাভকারী 'আমীরুল মু'মিনীন ফিল হাদিস'। ১৯৪ হিজরিতে ১৩ শাওয়াল শুক্রবার (৮১০ খ্রিস্টাব্দে) খোরাসানের বুখারায় জন্মগ্রহণ করেন এবং ২৫৬ হিজরিতে ১ শাওয়াল (৮৭০ খ্রিস্টাব্দে) সমরকন্দের খরতঙ্গে ইন্তেকাল করেন।",
      "বংশ পরিচয় ও পারিবারিক পটভূমি\n\nইমাম বুখারী (রহঃ) ছিলেন পারস্য বংশোদ্ভূত এক সম্ভ্রান্ত পরিবারের সন্তান। তাঁর পূর্বপুরুষ আল-মুগীরাহ বুখারার গভর্নর ইয়ামান আল-জু'ফীর হাতে ইসলাম গ্রহণ করেন। তাঁর বাবা ইসমাইল ইবনে ইব্রাহিম নিজেও একজন মুহাদ্দিস ছিলেন এবং ইমাম হাম্মাদ, ইমাম মালিক (রহঃ) ও আব্দুল্লাহ ইবনে মুবারক (রহঃ)-এর ছাত্র ছিলেন। তাঁর পিতা প্রচুর ধনসম্পদ রেখে যান।",
      "শৈশব ও মায়ের দোয়া\n\nইমাম বুখারী শৈশবেই পিতৃহীন হন এবং মায়ের তত্ত্বাবধানে বেড়ে ওঠেন। তাঁর মা ছিলেন বিদূষী ও মহীয়সী মহিলা। বাল্যকালে তিনি একটি কঠিন রোগে আক্রান্ত হন এবং তাঁর দুই চোখ প্রায় অন্ধ হয়ে যায়। তাঁর মা ব্যাকুল হয়ে আল্লাহর কাছে প্রার্থনা করতে থাকেন। এক রাতে স্বপ্নে তিনি হযরত ইব্রাহীম (আঃ)-কে দেখেন যিনি বলেন, 'তোমার প্রার্থনা আল্লাহ কবুল করেছেন।' পরদিন সকালে তাঁর পুত্রের চোখ সম্পূর্ণ সুস্থ হয়ে যায়।",
      "প্রাথমিক শিক্ষা ও প্রতিভা\n\nইমাম বুখারী (রহঃ) বাল্যকাল থেকেই শিক্ষা-দীক্ষার প্রতি গভীর আগ্রহী ছিলেন। মাত্র ৬ বছর বয়সে তিনি সম্পূর্ণ কুরআন মুখস্থ করেন। ১০ বছর বয়স থেকে তিনি হাদীস মুখস্থ করা শুরু করেন এবং ১৬ বছর বয়সে আব্দুল্লাহ ইবনে মুবারক ও ওয়াকীর পান্ডুলিপিসমূহ মুখস্থ করে ফেলেন।",
      "প্রখর স্মৃতিশক্তি\n\nতাঁর স্মৃতিশক্তি ছিল অত্যন্ত প্রখর। একদা ইমাম দাখেলির দরসগাহে একটি হাদিসের সনদ বর্ণনা করার সময় ভুল হলে ইমাম বুখারী নম্রস্বরে সংশোধন করেন। অন্য এক মজলিসে সহপাঠীরা হাদিস লিখে নিলেও তিনি লিখতেন না। জোর তাগিদে তিনি তাদের লেখা অনুসারে প্রায় ১৫,০০০ হাদিস মুখস্থ পাঠ করে শোনান। তিনি বলতেন, 'আমার অন্তরে এক লক্ষ সহিহ হাদিস ও দুই লক্ষ যঈফ হাদীস মুখস্থ রয়েছে।'",
      "হজ্জ ও জ্ঞান অন্বেষণের সফর\n\n১৬ বছর বয়সে তিনি মা ও বড় ভাইয়ের সাথে হজ্জে গমন করেন। হজ্জের পর তিনি মক্কায় রয়ে যান এবং হিজাযের হাদীসবিশারদদের কাছ থেকে হাদীস গ্রহণ করতে থাকেন। এ সময় তিনি 'কাজায়াস সাহাবা ওয়াত তাবীয়ীন' নামক গ্রন্থ রচনা করেন। এরপর হাদীস অন্বেষণের জন্য তিনি খোরাসান, মক্কা, মদীনা, ইরাক, সিরিয়া, মিশর সহ বহু অঞ্চলে সফর করেন। দীর্ঘ ১৬ বছর পর তিনি বুখারায় ফিরে আসেন।",
      "উস্তাদগণ\n\nতিনি এক হাজারেরও অধিক সংখ্যক মুহাদ্দিসের নিকট থেকে হাদীস সংগ্রহ করেন। তাঁর উল্লেখযোগ্য উস্তাদদের মধ্যে রয়েছেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইসহাক ইবনে রাহওয়াইহ (রহঃ), আলী ইবনুল মাদীনী (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ) এবং আরো অনেকে। তিনি ইমাম আবু হানিফা (রহঃ)-এর ছাত্র ইবরাহিম আল মক্কী ও মক্কি বিন ইবরাহিম থেকেও অনেক হাদিস বর্ণনা করেন।",
      "বাগদাদে স্মরণশক্তির পরীক্ষা\n\nযখন তাঁর সুনাম চতুর্দিকে ছড়িয়ে পড়ল, তখন বাগদাদের ৪০০ মুহাদ্দিস তাঁকে পরীক্ষা করার সিদ্ধান্ত নেন। তারা ১০০টি সহীহ হাদীসের সনদ ও মতন পাল্টিয়ে দিয়ে ১০ জন মুহাদ্দিসের হাতে সোপর্দ করেন। প্রতিটি হাদিস পড়া শেষে ইমাম বুখারী বলতেন, 'এ ধরনের কোন হাদিস আমার জানা নেই।' সবগুলো শেষ হলে তিনি প্রতিটি হাদিসকে তার আসল সনদের দিকে ফিরিয়ে দেন এবং ঠিক করে দেন। একটি শব্দও ছুটে যায়নি। সকলেই তাঁকে যুগশ্রেষ্ঠ মুহাদ্দিস হিসেবে স্বীকৃতি দেন।",
      "সহীহ আল-বুখারী সংকলন\n\nইমাম বুখারী (রহঃ)-এর জীবনব্যাপী পরিশ্রমের ফল হলো তাঁর সংকলন 'সহীহ আল-বুখারী'। হাদিসের বিশুদ্ধতার ক্ষেত্রে তিনি ছিলেন সবচেয়ে কঠোর। একটি হাদিসকে সহীহ হিসেবে অন্তর্ভুক্ত করার জন্য তিনি কঠোর শর্ত আরোপ করেন।",
      "পরিশ্রমের বিবরণ\n\nতিনি ১৬ বছর ধরে তাঁর এই সংকলন কাজটি সম্পন্ন করেন। তিনি প্রায় ৬ লাখ হাদিস থেকে যাচাই-বাছাই করে চূড়ান্তভাবে মাত্র ৭,২৭৫টি (পুনরাবৃত্তি সহ) সহীহ হাদিস লিপিবদ্ধ করেন।",
      "ইবাদতের মাধ্যমে সংকলন\n\nকথিত আছে, তিনি প্রতিটি হাদিস লিপিবদ্ধ করার আগে গোসল করতেন এবং দুই রাকাত নফল সালাত আদায় করে আল্লাহর কাছে ইস্তেখারা (পরামর্শ) চাইতেন।",
      "ফিকহী দৃষ্টিভঙ্গি\n\nইমাম বুখারী (রহঃ) ছিলেন মূলত একজন মুহাদ্দিস, কিন্তু তাঁকে অনেক আলেম মুজতাহিদ হিসেবেও গণ্য করেন। সহীহ বুখারী-এর বিভিন্ন অধ্যায়ের শিরোনাম এমনভাবে সাজানো হয়েছে, যা তাঁর গভীর ফিকহী জ্ঞান এবং ইজতিহাদের সিদ্ধান্তকে প্রতিফলিত করে।",
      "স্বর্ণমুদ্রার ঘটনা\n\nএকবার তিনি এক হাজার স্বর্ণমুদ্রা নিয়ে সফরে বের হন। এক চোর তা চুরি করার জন্য কৌশল করে চিৎকার করে বলে যে তার মুদ্রা চুরি হয়েছে। জাহাজের লোকেরা সবাইকে তল্লাশি করতে শুরু করলে ইমাম বুখারী চিন্তা করেন যে, যদি তাঁর কাছে মুদ্রা পাওয়া যায় তাহলে তিনি চোর হিসেবে সাব্যস্ত হবেন এবং হাদিসের মর্যাদা ক্ষুণ্ণ হবে। তাই তিনি স্বর্ণমুদ্রার থলেটি পানিতে ফেলে দেন। পরে চোর জিজ্ঞেস করলে তিনি বলেন, 'আমি তা পানিতে ফেলে দিয়েছি।' এই ঘটনা তাঁর হাদিসের প্রতি ভালোবাসা ও আত্মত্যাগের প্রমাণ।",
      "ছাত্রবৃন্দ ও প্রভাব\n\nইমাম বুখারী থেকে অসংখ্য মুহাদ্দিস সহীহ বুখারী বর্ণনা করেছেন। তাঁর উল্লেখযোগ্য ছাত্রদের মধ্যে রয়েছেন ইমাম মুসলিম (রহঃ), ইমাম তিরমিযী (রহঃ), ইমাম নাসাঈ (রহঃ), আবু হাতেম রাজি (রহঃ), ইমাম আবু বকর ইবনে খুযাইমা (রহঃ) এবং আরো অনেকে। ফিরাবরির বরাত দিয়ে বলা হয় যে, তাঁর সাথে প্রায় ৭০,০০০ লোক সরাসরি সহীহ বুখারী পড়েছেন।",
      "ইবাদত ও চরিত্র\n\nতিনি প্রতি বছর রমাযান মাসের দিনে একবার কুরআন খতম করতেন এবং তারাবীর পর প্রতি তিন রাতে একবার খতম করতেন। তিনি রাসূল (সাঃ)-এর সুন্নাত মোতাবেক শেষ রাতে তের রাকাত তাহাজ্জুদ নামায পড়তেন। তিনি ছিলেন অত্যন্ত দানশীল। তাঁর জমি থেকে প্রতি বছর ৭ লক্ষ দিরহাম ভাড়া পেতেন, যার বেশিরভাগই ইলম অর্জনের পথে ও অভাবীদের মধ্যে ব্যয় করতেন।",
      "রাজনৈতিক আপসহীনতা\n\nইমাম বুখারী (রহঃ) জ্ঞান ও সত্যের প্রশ্নে ছিলেন সম্পূর্ণ আপসহীন। বুখারার শাসক খালিদ ইবনে আহমাদ যুহলী তাঁকে দরবারে এসে ব্যক্তিগতভাবে শিক্ষাদানের অনুরোধ করেন। ইমাম বুখারী (রহঃ) তীব্রভাবে প্রত্যাখ্যান করেন এবং বলেন: 'জ্ঞানের কাছে যাওয়া উচিত, জ্ঞানীর কাছে জ্ঞান আসে না। আমি জ্ঞানকে অপমান করতে পারি না।'",
      "নির্বাসন ও ইন্তেকাল\n\nএই অস্বীকৃতির ফলে শাসক তাঁকে জনগণের সামনে অপমান করে বুখারা থেকে নির্বাসিত করেন। বিতাড়িত অবস্থায় তিনি সামারকান্দের কাছে খারতাঙ নামক গ্রামে আশ্রয় নেন এবং সেখানেই ২৫৬ হিজরিতে ১ শাওয়াল শুক্রবার দিবাগত রাতে ইন্তেকাল করেন। পরদিন শনিবার যোহরের নামাজের পর তাঁকে সমাধিস্থ করা হয়। ইমাম বুখারী (রহঃ)-এর জীবনের এই কঠিন পরীক্ষা সত্ত্বেও তাঁর জ্ঞান ও নীতি তাঁকে মুসলিম বিশ্বে আমীরুল মু'মিনীন ফিল হাদিস হিসেবে চিরকাল সম্মানিত করে রেখেছে।"
    ],
    "moral": "জ্ঞানের মর্যাদা রক্ষা করা এবং সত্যের পথে অটল থাকা। ইমাম বুখারী (রহঃ) শাসকের চাপ ও নির্বাসনের মুখেও জ্ঞানকে অপমান করেননি এবং হাদিসের বিশুদ্ধতার ক্ষেত্রে সর্বোচ্চ মান বজায় রেখেছেন।",
    "source": "ইবনে হাজার আল-আসকালানী, ফাতহুল বারী; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_muslim",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুসলিম (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম মুসলিম (রহঃ)-এর পূর্ণ নাম আবু আল-হুসাইন মুসলিম ইবনে আল-হাজ্জাজ ইবনে মুসলিম ইবনে ওয়ার্দ ইবনে কাউশাদ আল-কুশাইরী আল-নিশাপুরী। তিনি হাদিসশাস্ত্রের ছয়টি প্রধান গ্রন্থের মধ্যে দ্বিতীয় বিশুদ্ধতম গ্রন্থ 'সহীহ মুসলিম'-এর সংকলক। ২০৪ হিজরিতে (৮২০ খ্রিস্টাব্দে) নিশাপুরে জন্মগ্রহণ করেন এবং ২৬১ হিজরিতে (৮৭৫ খ্রিস্টাব্দে) ইন্তেকাল করেন।",
      "বংশ পরিচয় ও জ্ঞানার্জনের প্রারম্ভ\n\nইমাম মুসলিম (রহঃ) নিশাপুরের এক ধনী, সম্ভ্রান্ত এবং জ্ঞানপিপাসু পরিবারে জন্মগ্রহণ করেন। তাঁর পরিবার কুশাইরী নামক একটি আরব গোত্রের অন্তর্ভুক্ত ছিল।",
      "শিক্ষার শুরু\n\nতিনি মাত্র বারো বছর বয়সে নিজ শহরের তৎকালীন মুহাদ্দিসদের কাছ থেকে হাদিস শোনা ও লেখা শুরু করেন। তাঁর প্রথম উস্তাদ ছিলেন ইয়াহিয়া ইবনে ইয়াহিয়া আল-নিশাপুরী (রহঃ)। হাদিসশাস্ত্রের প্রতি তাঁর গভীর আগ্রহ এবং শক্তিশালী স্মৃতিশক্তির কারণে তিনি অল্প বয়সেই তাঁর সমসাময়িকদের চেয়ে এগিয়ে যান।",
      "হাদিস সংগ্রহের বিস্তৃত সফর\n\nইমাম মুসলিম (রহঃ) জীবনের প্রায় পনেরো বছর ব্যয় করেন জ্ঞানের সন্ধানে ভ্রমণ করে। হাদিস সংগ্রহের জন্য তিনি তৎকালীন মুসলিম বিশ্বের প্রধান কেন্দ্রসমূহ—ইরাক (বাগদাদ, কুফা, বসরা), হিজাজ (মক্কা ও মদীনা), মিশর ও সিরিয়াতে ব্যাপক সফর করেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি হাদিসশাস্ত্রের প্রায় সকল শীর্ষস্থানীয় ইমামের কাছ থেকে শিক্ষা লাভ করেন। তাঁর শিক্ষকদের মধ্যে গুরুত্বপূর্ণ ছিলেন ইমাম বুখারী (রহঃ), ইমাম আহমাদ ইবনে হাম্বল (রহঃ) এবং ইসহাক ইবনে রাহাওয়াইহ (রহঃ)। তিনি ইমাম বুখারীর সান্নিধ্যে দীর্ঘ সময় কাটান এবং হাদিসের বিশুদ্ধতা যাচাইয়ের উসূল সম্পর্কে গভীর জ্ঞান অর্জন করেন। তিনি প্রায় ২২০ জন শিক্ষকের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "সহীহ মুসলিম সংকলন\n\nইমাম মুসলিম (রহঃ)-এর প্রধান ও চিরস্মরণীয় অবদান হলো তাঁর সংকলিত হাদিসগ্রন্থ 'সহীহ মুসলিম'। তিনি লক্ষ্য করেছিলেন যে, হাদিসের সংকলনগুলোতে সহীহ ও যঈফ (দুর্বল) হাদিসগুলো একত্রে মিশ্রিত অবস্থায় রয়েছে। তাই তিনি কেবলমাত্র সহীহ হাদিস নিয়ে একটি গ্রন্থ সংকলনের সংকল্প করেন।",
      "পরিশ্রম ও পরিসর\n\nতিনি প্রায় ৩ লাখ হাদিস পরীক্ষা করে সেগুলোর মধ্য থেকে সর্বোচ্চ বিশুদ্ধতার মানদণ্ডে উত্তীর্ণ প্রায় ৪০০০ হাদিস (পুনরাবৃত্তি ব্যতীত) তাঁর গ্রন্থে অন্তর্ভুক্ত করেন।",
      "বিন্যাসের উৎকর্ষ\n\nসহীহ মুসলিমের সবচেয়ে বড় বৈশিষ্ট্য হলো এর সুসংগঠিত বিন্যাস পদ্ধতি। ইমাম বুখারী যেখানে ফিকহী মাসআলার জন্য একই হাদিসকে ভিন্ন ভিন্ন অধ্যায়ে এনেছেন, সেখানে ইমাম মুসলিম (রহঃ) প্রতিটি ফিকহী অধ্যায়ের অধীনে সংশ্লিষ্ট সব হাদিস এবং সেগুলোর বিভিন্ন বর্ণনাকারীর শৃঙ্খল একত্রিত করেছেন।",
      "মর্যাদা ও তাকওয়া\n\nইমাম মুসলিম (রহঃ) তাঁর জীবদ্দশায়ই হাদিসশাস্ত্রের একজন মুজতাহিদ হিসেবে স্বীকৃতি লাভ করেন। ইমাম বুখারীর সহীহ বুখারী এবং ইমাম মুসলিমের সহীহ মুসলিম একসাথে 'সহীহাইন' (দুই সহীহ) নামে পরিচিত এবং কুরআনের পরই এই দুটি গ্রন্থের স্থান।",
      "উস্তাদের প্রতি বিনয়\n\nতাঁর উস্তাদ ইমাম বুখারী (রহঃ)-এর প্রতি তাঁর গভীর শ্রদ্ধা ছিল। একবার তিনি ইমাম বুখারীর কদম মুবারক চুম্বন করতে চেয়ে বলেছিলেন, 'হে মুহাদ্দিসদের ডাক্তার! আপনি আমাকে অনুমতি দিন আমি আপনার পা চুম্বন করি।' তিনি অত্যন্ত বিনয়ী, পরহেজগার এবং তাঁর জীবনে কোনো প্রকার গীবত বা মিথ্যা থেকে দূরে থাকতেন।",
      "সহীহ মুসলিমের বৈশিষ্ট্য\n\nসহীহ মুসলিম হাদিস সংকলনের ক্ষেত্রে অনন্য পদ্ধতি অনুসরণ করেছে। ইমাম মুসলিম (রহঃ) প্রতিটি হাদিসের সকল সনদ ও বর্ণনা একত্রে উল্লেখ করেছেন, যা হাদিস গবেষকদের জন্য অত্যন্ত সুবিধাজনক। তিনি হাদিসগুলোকে বিষয়ভিত্তিক অধ্যায়ে বিন্যস্ত করেছেন এবং প্রতিটি অধ্যায়ে সংশ্লিষ্ট সকল হাদিস সংকলন করেছেন।",
      "অন্যান্য রচনাবলী\n\nসহীহ মুসলিম ছাড়াও ইমাম মুসলিম (রহঃ) আরো অনেক গ্রন্থ রচনা করেছিলেন। এর মধ্যে রয়েছে আল-মুসনাদ আল-কাবীর, কিতাব আল-জামি আলা আল-আবওয়াব, কিতাব আল-আসমা ওয়া আল-কুনা, কিতাব আল-তাময়ীয, কিতাব আল-ইফরাদ, কিতাব আল-আকরান এবং আরো অনেক। তবে সহীহ মুসলিম ছাড়া তাঁর অন্য কোনো গ্রন্থ বর্তমানে পাওয়া যায় না।",
      "ছাত্রবৃন্দ\n\nইমাম মুসলিম (রহঃ) ছিলেন উলূমে হাদিসের এক বিশাল সাগর। বিশ্বের সকল হাদিস বিশারদ তাঁকে এ বিষয়ের একজন শ্রেষ্ঠ ইমাম বলে ঐকমত্য পোষণ করেছেন। তাঁর যুগের বড় বড় মুহাদ্দিসগণ তাঁর নিকট হাদিস শিক্ষা করেছেন। তাঁর প্রখ্যাত ছাত্রদের মধ্যে রয়েছেন ইবনে খুজায়মা (রহঃ), ইমাম তিরমিযী (রহঃ), আবু আওয়ানা (রহঃ), ইবরাহীম ইবনে আবী তালিব (রহঃ), আবু হামেদ আহমাদ ইবনে হামাদান (রহঃ) এবং আরো অনেকে।",
      "আলেমদের প্রশংসা\n\nইমাম মুসলিম (রহঃ) সম্পর্কে তৎকালীন ও পরবর্তী আলেমগণ অত্যন্ত উচ্চ ধারণা পোষণ করতেন। ইমাম নাসাঈ (রহঃ) বলেন, 'হাদিসের ইমামগণের মধ্যে চারজন রয়েছেন—আবু যুরআহ, মুহাম্মদ ইবনে ইসমাঈল (বুখারী), মুসলিম এবং আবদুল্লাহ ইবনে আবদুর রহমান আদ-দারিমী।' ইবনে হাজার আসকালানী (রহঃ) বলেন, 'ইমাম মুসলিম হাদিসশাস্ত্রের একজন অতুলনীয় ইমাম ছিলেন।'",
      "মৃত্যুর ঘটনা\n\nইমাম মুসলিম (রহঃ) ২৬১ হিজরির ২৫ রজব রোববার নিশাপুরে ইন্তেকাল করেন এবং ২৬ রজব সোমবার নিশাপুরের শহরতলী নাসরাবাদে তাঁকে দাফন করা হয়। ইবনে হাজার আসকালানী (রহঃ) মৃত্যুর কারণ সম্বন্ধে বর্ণনা করেছেন যে, একটি হাদিস বিষয়ক আলোচনা সভায় একটি হাদিস আলোচিত হয় যা ইমাম মুসলিমের জানা ছিল না। মজলিস শেষে বাড়ি ফিরে রাতে এক ঝুড়ি খেজুর সামনে নিয়ে হাদিসটি তালাশ করতে বসেন। একটি একটি করে খেজুর মুখে দিচ্ছেন আর হাদিসটি অনুসন্ধান করছেন। এভাবে সকাল হয়ে যায়, খেজুরও শেষ হয় এবং হাদিসটিও তিনি পেয়ে যান। এই অতিরিক্ত খেজুর ভক্ষণই তাঁর মৃত্যুর বাহ্যিক কারণ।",
      "ঐতিহাসিক মর্যাদা\n\nইমাম মুসলিম (রহঃ)-এর এই অবিস্মরণীয় অবদান তাঁকে হাদিস সংকলক হিসেবে মুসলিম ইতিহাসে দ্বিতীয় সর্বোচ্চ সম্মানিত স্থানে অধিষ্ঠিত করেছে। তাঁর সহীহ মুসলিম আজও সারা বিশ্বের মুসলমানদের কাছে কুরআনের পরে সবচেয়ে বিশুদ্ধ হাদিস গ্রন্থগুলোর একটি হিসেবে সম্মানিত। তাঁর জ্ঞানের প্রতি নিবেদন এবং হাদিসশাস্ত্রে অবদান চিরকাল মুসলিম উম্মাহর জন্য অনুপ্রেরণার উৎস হয়ে থাকবে।"
    ],
    "moral": "জ্ঞানের প্রতি নিবেদিতপ্রাণ থাকা এবং উস্তাদের প্রতি সম্মান প্রদর্শন। ইমাম মুসলিম (রহঃ) তাঁর জীবনের শেষ মুহূর্ত পর্যন্ত হাদিসশাস্ত্রে নিমগ্ন ছিলেন এবং তাঁর উস্তাদদের প্রতি গভীর শ্রদ্ধাশীল ছিলেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইবনে খাল্লিকান, ওয়াফায়াত আল-আ'ইয়ান"
  },
  {
    "id": "imam_abu_yusuf",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু ইউসুফ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু ইউসুফ (রহঃ)-এর পূর্ণ নাম ইয়াকুব ইবনে ইব্রাহিম ইবনে হাবিব আল-আনসারী আল-কুফী। তিনি ১১২ হিজরিতে (৭৩০ খ্রিস্টাব্দে) কুফায় জন্মগ্রহণ করেন এবং ১৮২ হিজরিতে (৭৯৮ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন। তিনি ছিলেন ইমাম আবু হানিফা (রহঃ)-এর সবচেয়ে বিখ্যাত ছাত্র এবং হানাফি মাযহাবের প্রধান সংকলক।",
      "প্রাথমিক জীবন ও দারিদ্র্য\n\nইমাম আবু ইউসুফ (রহঃ) কুফার এক দরিদ্র পরিবারে জন্মগ্রহণ করেন। তাঁর পিতা ছিলেন একজন সাধারণ কাপড় বিক্রেতা। শৈশবে তিনি পরিবারের আর্থিক সহায়তার জন্য কাজ করতেন এবং একই সাথে জ্ঞান অর্জনের চেষ্টা করতেন।",
      "ইমাম আবু হানিফার সান্নিধ্য\n\nঅল্প বয়সেই তিনি ইমাম আবু হানিফা (রহঃ)-এর মজলিসে যোগ দেন। প্রথমে তাঁর পিতা তাঁকে জ্ঞান অর্জনের পরিবর্তে কাজে মনোনিবেশ করতে বলতেন। কিন্তু ইমাম আবু হানিফা (রহঃ) তাঁর মেধা দেখে মুগ্ধ হন এবং তাঁর পরিবারকে আর্থিক সহায়তা প্রদান করেন যাতে তিনি নির্বিঘ্নে জ্ঞান অর্জন করতে পারেন।",
      "জ্ঞান অর্জনের পরিধি\n\nতিনি ইমাম আবু হানিফা (রহঃ)-এর কাছে প্রায় ১৭ বছর শিক্ষা লাভ করেন এবং হানাফি ফিকহের সকল মূলনীতি আয়ত্ত করেন। এছাড়াও তিনি হাদিসশাস্ত্রে গভীর জ্ঞান অর্জন করেন এবং ইমাম মালিক (রহঃ), সুফিয়ান আল-সাওরী (রহঃ) সহ অনেক মুহাদ্দিসের কাছ থেকে হাদিস শোনেন।",
      "প্রধান বিচারপতির দায়িত্ব\n\nআব্বাসীয় খলিফা হারুন আল-রশিদ তাঁকে সমগ্র ইসলামী খিলাফতের প্রধান বিচারপতি (কাজীউল কুজাত) নিযুক্ত করেন। এই পদে থেকে তিনি ন্যায়বিচার প্রতিষ্ঠায় অসাধারণ ভূমিকা পালন করেন এবং বিচার ব্যবস্থায় অনেক সংস্কার আনেন।",
      "কিতাবুল খারাজ রচনা\n\nইমাম আবু ইউসুফ (রহঃ)-এর সবচেয়ে বিখ্যাত গ্রন্থ হলো 'কিতাবুল খারাজ'। এই গ্রন্থে তিনি ইসলামী রাষ্ট্রের রাজস্ব ব্যবস্থা, ভূমি কর, জিযিয়া এবং অর্থনৈতিক নীতিমালা বিস্তারিতভাবে আলোচনা করেছেন। এটি ইসলামী অর্থনীতির একটি মৌলিক গ্রন্থ হিসেবে বিবেচিত।",
      "হানাফি মাযহাবের সংকলন\n\nইমাম আবু হানিফা (রহঃ) তাঁর জীবদ্দশায় তাঁর মাযহাবের মাসআলাগুলো লিখিত আকারে সংকলন করেননি। ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম মুহাম্মদ (রহঃ) তাঁদের উস্তাদের ফতোয়া ও মাসআলাগুলো সংকলন করে হানাফি ফিকহকে সুসংগঠিত করেন।",
      "ন্যায়বিচার ও সততা\n\nতিনি বিচারকার্যে অত্যন্ত ন্যায়পরায়ণ ছিলেন। একবার খলিফা হারুন আল-রশিদ তাঁর পক্ষে একটি মামলায় রায় দিতে চাপ দেন, কিন্তু ইমাম আবু ইউসুফ (রহঃ) সত্য ও ন্যায়ের পক্ষে দাঁড়ান এবং খলিফার বিপক্ষে রায় প্রদান করেন।",
      "ছাত্র ও শিক্ষাদান\n\nতিনি তাঁর জীবনে হাজারেরও বেশি ছাত্রকে শিক্ষা প্রদান করেন। তাঁর ছাত্রদের মধ্যে অনেকেই পরবর্তীতে বিখ্যাত ফকীহ ও বিচারক হয়েছিলেন। তিনি শিক্ষাদানে অত্যন্ত ধৈর্যশীল এবং বিনয়ী ছিলেন।",
      "ইন্তেকাল ও উত্তরাধিকার\n\nইমাম আবু ইউসুফ (রহঃ) ১৮২ হিজরিতে (৭৯৮ খ্রিস্টাব্দে) বাগদাদে ইন্তেকাল করেন। তাঁর জানাযায় বিপুল সংখ্যক মানুষ অংশগ্রহণ করেন। তাঁর মৃত্যুতে খলিফা হারুন আল-রশিদ গভীর শোক প্রকাশ করেন এবং বলেন, 'আজ ইলম ও ন্যায়বিচারের একটি স্তম্ভ হারিয়ে গেল।' তাঁর অবদানের ফলে হানাফি মাযহাব সমগ্র মুসলিম বিশ্বে ছড়িয়ে পড়ে এবং আজও বিশ্বের সংখ্যাগরিষ্ঠ মুসলিম এই মাযহাব অনুসরণ করেন।"
    ],
    "moral": "দারিদ্র্য জ্ঞান অর্জনের পথে বাধা নয় এবং ন্যায়বিচারে কখনো আপস করা যায় না। ইমাম আবু ইউসুফ (রহঃ) দরিদ্র পরিবার থেকে উঠে এসে জ্ঞান ও ন্যায়বিচারের এক উজ্জ্বল দৃষ্টান্ত স্থাপন করেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_muhammad_shaybani",
    "categoryId": "imam_jibon",
    "title": "ইমাম মুহাম্মদ আল-শাইবানী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম মুহাম্মদ আল-শাইবানী (রহঃ)-এর পূর্ণ নাম মুহাম্মদ ইবনে আল-হাসান ইবনে ফারকাদ আল-শাইবানী। তিনি ১৩২ হিজরিতে (৭৫০ খ্রিস্টাব্দে) ওয়াসিতে জন্মগ্রহণ করেন এবং ১৮৯ হিজরিতে (৮০৫ খ্রিস্টাব্দে) রাইতে ইন্তেকাল করেন। তিনি ইমাম আবু হানিফা (রহঃ)-এর অন্যতম প্রধান ছাত্র এবং হানাফি ফিকহের মূল সংকলক।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি শৈশবে কুফায় চলে আসেন এবং সেখানে ইমাম আবু হানিফা (রহঃ)-এর মজলিসে যোগ দেন। মাত্র ১৪ বছর বয়সে তিনি ইমাম আবু হানিফার ছাত্র হন এবং তাঁর কাছে প্রায় ৪ বছর শিক্ষা লাভ করেন। ইমাম আবু হানিফার ইন্তেকালের পর তিনি ইমাম আবু ইউসুফ (রহঃ)-এর কাছে দীর্ঘ সময় শিক্ষা গ্রহণ করেন।",
      "বিস্তৃত জ্ঞান অর্জন\n\nতিনি শুধু হানাফি ফিকহেই সীমাবদ্ধ থাকেননি। তিনি ইমাম মালিক (রহঃ)-এর কাছে মদীনায় গিয়ে তিন বছর হাদিস ও মালিকি ফিকহ শিক্ষা করেন। এছাড়াও তিনি সুফিয়ান আল-সাওরী (রহঃ) এবং আওযায়ী (রহঃ)-এর কাছ থেকেও জ্ঞান অর্জন করেন।",
      "হানাফি ফিকহের সংকলন\n\nইমাম মুহাম্মদ (রহঃ) হানাফি মাযহাবের প্রায় সকল মৌলিক গ্রন্থ রচনা করেছেন। তাঁর রচিত গ্রন্থগুলোকে 'কুতুবে যাহিরুর রিওয়ায়া' (প্রকাশ্য বর্ণনার গ্রন্থসমূহ) বলা হয়। এর মধ্যে রয়েছে আল-মাবসূত, আল-জামি আল-কাবীর, আল-জামি আল-সাগীর, আল-সিয়ার আল-কাবীর এবং আল-যিয়াদাত।",
      "আন্তর্জাতিক আইনের পথপ্রদর্শক\n\nতাঁর রচিত 'আল-সিয়ার আল-কবীর' গ্রন্থটি ইসলামী আন্তর্জাতিক আইনের প্রথম পূর্ণাঙ্গ গ্রন্থ। এতে যুদ্ধ, সন্ধি, কূটনীতি এবং আন্তর্জাতিক সম্পর্ক সংক্রান্ত বিধান বিস্তারিতভাবে আলোচিত হয়েছে।",
      "শিক্ষকতা ও ছাত্রবৃন্দ\n\nতিনি বাগদাদে একটি বিশাল শিক্ষা প্রতিষ্ঠান পরিচালনা করতেন। তাঁর ছাত্রদের মধ্যে ইমাম শাফেয়ী (রহঃ) অন্যতম। ইমাম শাফেয়ী তাঁর কাছ থেকে হানাফি ফিকহ ও কিয়াসের পদ্ধতি শিখেছিলেন।",
      "বিচারক হিসেবে দায়িত্ব\n\nখলিফা হারুন আল-রশিদ তাঁকে রাক্কার বিচারক নিযুক্ত করেন। তিনি সেখানে ন্যায়বিচার প্রতিষ্ঠায় গুরুত্বপূর্ণ ভূমিকা পালন করেন।",
      "ইন্তেকাল\n\nইমাম মুহাম্মদ (রহঃ) ১৮৯ হিজরিতে (৮০৫ খ্রিস্টাব্দে) খলিফা হারুন আল-রশিদের সাথে রাই নামক স্থানে ভ্রমণকালে ইন্তেকাল করেন। তাঁর মৃত্যুতে খলিফা গভীর শোক প্রকাশ করেন। তাঁর রচিত গ্রন্থগুলো আজও হানাফি ফিকহের মূল ভিত্তি এবং ইসলামী আইনশাস্ত্রের অমূল্য সম্পদ।"
    ],
    "moral": "বিভিন্ন মাযহাব থেকে জ্ঞান অর্জন করা এবং নিজের মাযহাবকে সুসংগঠিত করা। ইমাম মুহাম্মদ (রহঃ) বিভিন্ন ইমামের কাছ থেকে শিখে হানাফি ফিকহকে পূর্ণাঙ্গ রূপ দিয়েছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_abu_dawud_tayalisi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু দাউদ আল-তায়ালিসী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু দাউদ আল-তায়ালিসী (রহঃ)-এর পূর্ণ নাম সুলাইমান ইবনে দাউদ ইবনে আল-জারুদ আল-তায়ালিসী আল-বাসরী। তিনি ১৩৩ হিজরিতে (৭৫১ খ্রিস্টাব্দে) বসরায় জন্মগ্রহণ করেন এবং ২০৪ হিজরিতে (৮১৯ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি ছিলেন প্রথম যুগের অন্যতম শ্রেষ্ঠ মুহাদ্দিস এবং হাফিয।",
      "প্রাথমিক জীবন ও জ্ঞান অর্জন\n\nতিনি বসরার এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন। অল্প বয়স থেকেই তিনি হাদিস শেখা শুরু করেন এবং তাঁর অসাধারণ স্মৃতিশক্তির জন্য বিখ্যাত হয়ে ওঠেন।",
      "বিশাল হাদিস সংগ্রহ\n\nতিনি তাঁর সময়ের প্রায় সকল বড় মুহাদ্দিসের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর প্রধান শিক্ষকদের মধ্যে ছিলেন শু'বা ইবনে আল-হাজ্জাজ (রহঃ), সুফিয়ান আল-সাওরী (রহঃ) এবং হাম্মাদ ইবনে সালামা (রহঃ)। তিনি প্রায় ৩০,০০০ হাদিস মুখস্থ করেছিলেন।",
      "মুসনাদ আল-তায়ালিসী\n\nতাঁর সংকলিত 'মুসনাদ আল-তায়ালিসী' হাদিসশাস্ত্রের একটি গুরুত্বপূর্ণ গ্রন্থ। এই গ্রন্থে তিনি প্রায় ২,৭৬৭টি হাদিস সংকলন করেছেন যা সাহাবীদের নাম অনুসারে সাজানো।",
      "অসাধারণ স্মৃতিশক্তি\n\nইমাম আহমাদ ইবনে হাম্বল (রহঃ) তাঁর স্মৃতিশক্তির প্রশংসা করে বলেছেন, 'আমি আবু দাউদ আল-তায়ালিসীর চেয়ে শক্তিশালী স্মৃতিশক্তির অধিকারী কাউকে দেখিনি।' তিনি হাদিস বর্ণনা করার সময় কোনো কিতাব দেখতেন না, সবকিছু মুখস্থ থেকে বলতেন।",
      "শিক্ষাদান ও প্রভাব\n\nতিনি বসরায় একটি বিশাল হাদিসের মজলিস পরিচালনা করতেন। তাঁর ছাত্রদের মধ্যে ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ) এবং আলী ইবনে আল-মাদীনী (রহঃ) অন্যতম।",
      "ইন্তেকাল\n\nইমাম আবু দাউদ আল-তায়ালিসী (রহঃ) ২০৪ হিজরিতে (৮১৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। তাঁর মৃত্যুতে হাদিসশাস্ত্রের একটি উজ্জ্বল নক্ষত্র হারিয়ে যায়। তাঁর সংকলিত মুসনাদ আজও হাদিস গবেষকদের জন্য একটি মূল্যবান সম্পদ।"
    ],
    "moral": "শক্তিশালী স্মৃতিশক্তি ও পরিশ্রমের মাধ্যমে জ্ঞান সংরক্ষণ করা। ইমাম তায়ালিসী (রহঃ) তাঁর অসাধারণ স্মৃতিশক্তি দিয়ে হাজার হাজার হাদিস সংরক্ষণ করেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_ishaq_rahawaih",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ)-এর পূর্ণ নাম ইসহাক ইবনে ইব্রাহিম ইবনে মাখলাদ আল-হানযালী আল-মারওয়াযী। তিনি ১৬১ হিজরিতে (৭৭৮ খ্রিস্টাব্দে) মারওয়ে জন্মগ্রহণ করেন এবং ২৩৮ হিজরিতে (৮৫৩ খ্রিস্টাব্দে) নিশাপুরে ইন্তেকাল করেন। তিনি ছিলেন হাদিস ও ফিকহ উভয় শাস্ত্রে একজন মুজতাহিদ ইমাম।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি খোরাসানের মারও অঞ্চলে জন্মগ্রহণ করেন এবং সেখানেই প্রাথমিক শিক্ষা লাভ করেন। অল্প বয়সেই তিনি হাদিস ও ফিকহের প্রতি গভীর আগ্রহী হয়ে ওঠেন।",
      "জ্ঞান অর্জনের সফর\n\nতিনি জ্ঞান অর্জনের জন্য ইরাক, হিজাজ, ইয়েমেন এবং সিরিয়ায় ব্যাপক সফর করেন। তাঁর প্রধান শিক্ষকদের মধ্যে ছিলেন সুফিয়ান ইবনে উয়াইনাহ (রহঃ), ওয়াকী ইবনে আল-জাররাহ (রহঃ) এবং আবদুর রাযযাক আল-সান'আনী (রহঃ)।",
      "ইমাম আহমাদের সাথে সম্পর্ক\n\nইমাম ইসহাক (রহঃ) এবং ইমাম আহমাদ ইবনে হাম্বল (রহঃ) ছিলেন সমসাময়িক এবং ঘনিষ্ঠ বন্ধু। তাঁরা একসাথে জ্ঞান অর্জনের জন্য সফর করতেন। আলেমগণ বলতেন, 'পূর্ব দিকে ইসহাক এবং পশ্চিম দিকে আহমাদ - এই দুজনই তাঁদের যুগের ইমাম।'",
      "সহীহ বুখারীর অনুপ্রেরণা\n\nইমাম বুখারী (রহঃ) তাঁর উস্তাদ ইমাম ইসহাক (রহঃ)-এর অনুপ্রেরণায় সহীহ হাদিসের সংকলন শুরু করেন। একবার ইমাম ইসহাক বলেছিলেন, 'যদি কেউ শুধুমাত্র সহীহ হাদিসের একটি সংকলন তৈরি করত!' এই কথা শুনে ইমাম বুখারী সহীহ বুখারী সংকলনের কাজ শুরু করেন।",
      "মুসনাদ ও ফিকহী অবদান\n\nতিনি একটি বিশাল মুসনাদ সংকলন করেছিলেন যাতে প্রায় ১০,০০০ হাদিস ছিল। তাঁর ফিকহী মতামত অত্যন্ত সম্মানিত ছিল এবং অনেক মাসআলায় তাঁর স্বতন্ত্র ইজতিহাদ ছিল।",
      "নিশাপুরে বসবাস\n\nজীবনের শেষ দিকে তিনি নিশাপুরে বসতি স্থাপন করেন এবং সেখানে হাদিস ও ফিকহের শিক্ষাদান করেন। তাঁর মজলিসে হাজার হাজার ছাত্র জ্ঞান অর্জন করতেন।",
      "ইন্তেকাল\n\nইমাম ইসহাক ইবনে রাহাওয়াইহ (রহঃ) ২৩৮ হিজরিতে (৮৫৩ খ্রিস্টাব্দে) নিশাপুরে ইন্তেকাল করেন। তাঁর মৃত্যুতে ইমাম আহমাদ (রহঃ) গভীর শোক প্রকাশ করেন এবং বলেন, 'ইসহাক ইবনে রাহাওয়াইহ ছিলেন ইসলামের একটি স্তম্ভ।'"
    ],
    "moral": "জ্ঞান অর্জনে অনুপ্রেরণা প্রদান এবং অন্যদের উৎসাহিত করা। ইমাম ইসহাক (রহঃ)-এর অনুপ্রেরণায় সহীহ বুখারীর মতো মহান গ্রন্থ রচিত হয়েছে।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_ibn_majah",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে মাজাহ্ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম ইবনে মাজাহ্ (রহঃ)-এর পূর্ণ নাম আবু আবদুল্লাহ মুহাম্মদ ইবনে ইয়াযিদ ইবনে মাজাহ্ আল-রাবায়ী আল-কাযভিনী। তিনি ২০৯ হিজরিতে (৮২৪ খ্রিস্টাব্দে) কাযভিনে (বর্তমান ইরান) জন্মগ্রহণ করেন এবং ২৭৩ হিজরিতে (৮৮৭ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি সিহাহ সিত্তার (ছয়টি প্রামাণিক হাদিস গ্রন্থ) অন্যতম সংকলক।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি কাযভিনের এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন। অল্প বয়স থেকেই তিনি হাদিস শেখা শুরু করেন এবং তাঁর শহরের আলেমদের কাছ থেকে প্রাথমিক শিক্ষা লাভ করেন।",
      "বিস্তৃত জ্ঞান অর্জনের সফর\n\nহাদিস সংগ্রহের জন্য তিনি প্রায় ১৫ বছর ধরে মুসলিম বিশ্বের বিভিন্ন অঞ্চলে ভ্রমণ করেন। তিনি বাগদাদ, বসরা, কুফা, মক্কা, মদীনা, সিরিয়া, মিশর এবং রায় সফর করেন এবং সেখানকার বড় বড় মুহাদ্দিসদের কাছ থেকে হাদিস সংগ্রহ করেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি প্রায় তিন হাজারেরও বেশি শিক্ষকের কাছ থেকে হাদিস শুনেছেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে ছিলেন আলী ইবনে মুহাম্মদ আল-তানাফিসী, জুবারা ইবনে মুগাল্লিস এবং মুহাম্মদ ইবনে রুমহ আল-মিসরী।",
      "সুনান ইবনে মাজাহ্ সংকলন\n\nইমাম ইবনে মাজাহ্ (রহঃ)-এর সবচেয়ে বড় অবদান হলো তাঁর সংকলিত 'সুনান ইবনে মাজাহ্'। এই গ্রন্থে তিনি প্রায় ৪,৩৪১টি হাদিস সংকলন করেছেন। গ্রন্থটি ফিকহী অধ্যায় অনুসারে সাজানো এবং এতে এমন অনেক হাদিস রয়েছে যা অন্য সিহাহ সিত্তার গ্রন্থে নেই।",
      "সুনানের বৈশিষ্ট্য\n\nসুনান ইবনে মাজাহ্-এ প্রায় ১,৩৩৯টি এমন হাদিস রয়েছে যা অন্য পাঁচটি সহীহ গ্রন্থে নেই। তবে এই গ্রন্থে কিছু দুর্বল হাদিসও রয়েছে, যার কারণে কিছু আলেম এটিকে সিহাহ সিত্তার মধ্যে অন্তর্ভুক্ত করার বিষয়ে মতভেদ করেছেন। তবে অধিকাংশ আলেম এটিকে সিহাহ সিত্তার অন্তর্ভুক্ত করেছেন।",
      "তাফসীর ও ইতিহাস\n\nহাদিস ছাড়াও তিনি তাফসীর ও ইতিহাসেও পারদর্শী ছিলেন। তিনি একটি তাফসীর গ্রন্থ এবং কাযভিনের ইতিহাস সম্পর্কে একটি গ্রন্থ রচনা করেছিলেন।",
      "চরিত্র ও তাকওয়া\n\nতিনি অত্যন্ত পরহেজগার, বিনয়ী এবং ইবাদতগুজার ছিলেন। তিনি সর্বদা সত্য বলতেন এবং হাদিস বর্ণনায় অত্যন্ত সতর্ক ছিলেন।",
      "ইন্তেকাল ও উত্তরাধিকার\n\nইমাম ইবনে মাজাহ্ (রহঃ) ২৭৩ হিজরিতে (৮৮৭ খ্রিস্টাব্দে) কাযভিনে ইন্তেকাল করেন। তাঁর সুনান আজও মুসলিম বিশ্বে ব্যাপকভাবে পঠিত এবং হাদিসশাস্ত্রের একটি মৌলিক গ্রন্থ হিসেবে স্বীকৃত।"
    ],
    "moral": "দীর্ঘ সফর ও কঠোর পরিশ্রমের মাধ্যমে জ্ঞান সংগ্রহ করা। ইমাম ইবনে মাজাহ্ (রহঃ) ১৫ বছর ভ্রমণ করে হাদিস সংগ্রহ করেছেন এবং উম্মাহর জন্য একটি মূল্যবান গ্রন্থ রেখে গেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_abu_dawud",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু দাউদ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু দাউদ (রহঃ)-এর পূর্ণ নাম আবু দাউদ সুলাইমান ইবনে আল-আশ'আস ইবনে ইসহাক আল-আযদী আল-সিজিস্তানী। তিনি ২০২ হিজরিতে (৮১৭ খ্রিস্টাব্দে) সিজিস্তানে (বর্তমান আফগানিস্তান-ইরান সীমান্ত) জন্মগ্রহণ করেন এবং ২৭৫ হিজরিতে (৮৮৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। তিনি সিহাহ সিত্তার অন্যতম সংকলক এবং ফিকহী হাদিসের ইমাম।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি সিজিস্তানের এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন। শৈশব থেকেই তিনি হাদিস শেখার প্রতি আগ্রহী ছিলেন এবং স্থানীয় আলেমদের কাছ থেকে প্রাথমিক শিক্ষা লাভ করেন।",
      "বিশাল জ্ঞান অর্জনের সফর\n\nহাদিস সংগ্রহের জন্য তিনি প্রায় ২০ বছর ধরে মুসলিম বিশ্বের প্রায় সব বড় শহরে ভ্রমণ করেন। তিনি খোরাসান, ইরাক, হিজাজ, মিশর, সিরিয়া, জাযিরা এবং অন্যান্য অঞ্চলে সফর করেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি তাঁর যুগের প্রায় সকল বড় মুহাদ্দিসের কাছ থেকে হাদিস শুনেছেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে ছিলেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ), আলী ইবনে আল-মাদীনী (রহঃ) এবং কুতাইবা ইবনে সাঈদ (রহঃ)।",
      "সুনান আবু দাউদ সংকলন\n\nইমাম আবু দাউদ (রহঃ)-এর সবচেয়ে বড় অবদান হলো 'সুনান আবু দাউদ'। এই গ্রন্থটি ফিকহী হাদিসের সবচেয়ে গুরুত্বপূর্ণ সংকলনগুলির একটি। তিনি প্রায় ৫ লাখ হাদিস থেকে যাচাই-বাছাই করে ৪,৮০০টি হাদিস এই গ্রন্থে সংকলন করেছেন।",
      "সুনানের বৈশিষ্ট্য\n\nসুনান আবু দাউদের বিশেষত্ব হলো এতে প্রধানত ফিকহী বিধান সম্পর্কিত হাদিস সংকলিত হয়েছে। তিনি প্রতিটি ফিকহী মাসআলার জন্য সংশ্লিষ্ট হাদিস এনেছেন এবং হাদিসের মান সম্পর্কে মন্তব্য করেছেন। ইমাম আবু দাউদ নিজে বলেছেন, 'আমি এই গ্রন্থে এমন কোনো হাদিস অন্তর্ভুক্ত করিনি যা আলেমদের কাছে পরিত্যক্ত।'",
      "ইমাম আহমাদের প্রশংসা\n\nইমাম আহমাদ ইবনে হাম্বল (রহঃ) তাঁর সম্পর্কে বলেছেন, 'আবু দাউদ হাদিসশাস্ত্রে অদ্বিতীয়। তাঁর মতো আর কেউ নেই।'",
      "বসরায় বসবাস ও শিক্ষাদান\n\nজীবনের শেষ দিকে তিনি বসরায় বসতি স্থাপন করেন এবং সেখানে হাদিসের শিক্ষাদান করেন। তাঁর মজলিসে হাজার হাজার ছাত্র জ্ঞান অর্জন করতেন।",
      "অন্যান্য রচনা\n\nসুনান ছাড়াও তিনি 'কিতাব আল-মারাসিল', 'কিতাব আল-যুহদ' এবং 'কিতাব আল-নাসিখ ওয়াল মানসুখ' সহ বেশ কয়েকটি গ্রন্থ রচনা করেছেন।",
      "ইন্তেকাল\n\nইমাম আবু দাউদ (রহঃ) ২৭৫ হিজরিতে (৮৮৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। তাঁর সুনান আজও ফিকহ ও হাদিসশাস্ত্রের ছাত্রদের জন্য অপরিহার্য গ্রন্থ এবং সিহাহ সিত্তার অন্যতম স্তম্ভ।"
    ],
    "moral": "ফিকহী বিধান সম্পর্কিত হাদিস সংরক্ষণ করা এবং আলেমদের জন্য সহজ করা। ইমাম আবু দাউদ (রহঃ) ৫ লাখ হাদিস থেকে ফিকহী হাদিস বাছাই করে উম্মাহর জন্য সহজ করে দিয়েছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_tirmidhi",
    "categoryId": "imam_jibon",
    "title": "ইমাম তিরমিযী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম তিরমিযী (রহঃ)-এর পূর্ণ নাম আবু ঈসা মুহাম্মদ ইবনে ঈসা ইবনে সাওরা ইবনে মুসা আল-তিরমিযী। তিনি ২০৯ হিজরিতে (৮২৪ খ্রিস্টাব্দে) তিরমিয অঞ্চলে জন্মগ্রহণ করেন এবং ২৭৯ হিজরিতে (৮৯২ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি সিহাহ সিত্তার অন্যতম সংকলক এবং হাদিসের ইলাল (ত্রুটি) শাস্ত্রের ইমাম।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি তিরমিয অঞ্চলের (বর্তমান উজবেকিস্তান) এক সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন। অল্প বয়স থেকেই তিনি হাদিস শেখা শুরু করেন এবং স্থানীয় আলেমদের কাছ থেকে প্রাথমিক শিক্ষা লাভ করেন।",
      "বিস্তৃত জ্ঞান অর্জনের সফর\n\nহাদিস সংগ্রহের জন্য তিনি খোরাসান, ইরাক, হিজাজ এবং অন্যান্য অঞ্চলে ব্যাপক সফর করেন। তিনি প্রায় ২০ বছর ধরে জ্ঞান অর্জনের জন্য ভ্রমণ করেছেন।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি তাঁর যুগের শ্রেষ্ঠ মুহাদ্দিসদের কাছ থেকে হাদিস শুনেছেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে ছিলেন ইমাম বুখারী (রহঃ), কুতাইবা ইবনে সাঈদ (রহঃ), ইসহাক ইবনে মুসা (রহঃ) এবং মাহমুদ ইবনে গাইলান (রহঃ)। তিনি ইমাম বুখারীর বিশেষ ছাত্র ছিলেন এবং তাঁর কাছ থেকে হাদিসের ইলাল শাস্ত্র শিখেছিলেন।",
      "জামি আল-তিরমিযী সংকলন\n\nইমাম তিরমিযী (রহঃ)-এর সবচেয়ে বড় অবদান হলো 'জামি আল-তিরমিযী' বা 'সুনান আল-তিরমিযী'। এই গ্রন্থে তিনি প্রায় ৩,৯৫৬টি হাদিস সংকলন করেছেন। গ্রন্থটি ফিকহী অধ্যায় অনুসারে সাজানো এবং প্রতিটি হাদিসের পর তিনি বিস্তারিত ব্যাখ্যা ও হাদিসের মান সম্পর্কে মন্তব্য করেছেন।",
      "জামির বৈশিষ্ট্য\n\nজামি আল-তিরমিযীর সবচেয়ে বড় বৈশিষ্ট্য হলো প্রতিটি হাদিসের পর ইমাম তিরমিযী সেই হাদিসটি সহীহ, হাসান, যঈফ নাকি মুনকার তা উল্লেখ করেছেন। এছাড়াও তিনি সাহাবী ও তাবেয়ীদের আমল এবং বিভিন্ন ফকীহদের মতামত উল্লেখ করেছেন। এই কারণে তাঁর গ্রন্থটি হাদিস ও ফিকহ উভয় শাস্ত্রের ছাত্রদের জন্য অত্যন্ত উপকারী।",
      "হাদিসের ইলাল শাস্ত্রে পারদর্শিতা\n\nইমাম তিরমিযী (রহঃ) হাদিসের ইলাল (গোপন ত্রুটি) শাস্ত্রে অত্যন্ত পারদর্শী ছিলেন। তিনি 'কিতাব আল-ইলাল' নামে একটি পৃথক গ্রন্থ রচনা করেছিলেন যেখানে হাদিসের সূক্ষ্ম ত্রুটিগুলো আলোচনা করা হয়েছে।",
      "দৃষ্টিশক্তি হারানো\n\nজীবনের শেষ দিকে তিনি দৃষ্টিশক্তি হারিয়ে ফেলেন। কথিত আছে, অতিরিক্ত কান্নার কারণে তাঁর চোখের দৃষ্টি চলে যায়। তিনি ইমাম বুখারী (রহঃ)-এর মৃত্যুতে এত বেশি কেঁদেছিলেন যে তাঁর চোখ অন্ধ হয়ে যায়।",
      "অন্যান্য রচনা\n\nজামি ছাড়াও তিনি 'কিতাব আল-শামাইল আল-মুহাম্মদিয়া' (নবী সাঃ-এর গুণাবলী), 'কিতাব আল-ইলাল' এবং 'কিতাব আল-তারিখ' রচনা করেছেন।",
      "ইন্তেকাল\n\nইমাম তিরমিযী (রহঃ) ২৭৯ হিজরিতে (৮৯২ খ্রিস্টাব্দে) তিরমিয অঞ্চলে ইন্তেকাল করেন। তাঁর জামি আজও সিহাহ সিত্তার অন্যতম স্তম্ভ এবং হাদিসশাস্ত্রের ছাত্রদের জন্য অপরিহার্য গ্রন্থ।"
    ],
    "moral": "হাদিসের মান যাচাই করা এবং প্রতিটি হাদিসের ব্যাখ্যা প্রদান করা। ইমাম তিরমিযী (রহঃ) প্রতিটি হাদিসের মান উল্লেখ করে উম্মাহর জন্য হাদিস বুঝা সহজ করে দিয়েছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_nasai",
    "categoryId": "imam_jibon",
    "title": "ইমাম নাসাঈ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম নাসাঈ (রহঃ)-এর পূর্ণ নাম আবু আবদুর রহমান আহমাদ ইবনে শু'আইব ইবনে আলী আল-খোরাসানী আল-নাসাঈ। তিনি ২১৫ হিজরিতে (৮৩০ খ্রিস্টাব্দে) নাসা অঞ্চলে (বর্তমান তুর্কমেনিস্তান) জন্মগ্রহণ করেন এবং ৩০৩ হিজরিতে (৯১৫ খ্রিস্টাব্দে) দামেস্কে শাহাদাত বরণ করেন। তিনি সিহাহ সিত্তার সর্বশেষ সংকলক এবং হাদিসের রিজাল (বর্ণনাকারী) শাস্ত্রের ইমাম।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি খোরাসানের নাসা অঞ্চলে জন্মগ্রহণ করেন। ১৫ বছর বয়স থেকেই তিনি হাদিস শেখা শুরু করেন এবং স্থানীয় আলেমদের কাছ থেকে প্রাথমিক শিক্ষা লাভ করেন।",
      "বিশাল জ্ঞান অর্জনের সফর\n\nহাদিস সংগ্রহের জন্য তিনি প্রায় ৫০ বছর ধরে মুসলিম বিশ্বের বিভিন্ন অঞ্চলে ভ্রমণ করেন। তিনি খোরাসান, ইরাক, হিজাজ, মিশর, সিরিয়া, জাযিরা এবং অন্যান্য অঞ্চলে সফর করেন। তাঁর জ্ঞান অর্জনের সফর ছিল সিহাহ সিত্তার সংকলকদের মধ্যে সবচেয়ে দীর্ঘ।",
      "প্রধান শিক্ষকবৃন্দ\n\nতিনি তাঁর যুগের এবং পূর্ববর্তী যুগের অনেক বড় মুহাদ্দিসের কাছ থেকে হাদিস শুনেছেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে ছিলেন ইসহাক ইবনে রাহাওয়াইহ (রহঃ), কুতাইবা ইবনে সাঈদ (রহঃ), মুহাম্মদ ইবনে বাশশার (রহঃ) এবং হিশাম ইবনে আম্মার (রহঃ)।",
      "আল-সুনান আল-কুবরা ও আল-মুজতাবা\n\nইমাম নাসাঈ (রহঃ) প্রথমে 'আল-সুনান আল-কুবরা' (বড় সুনান) নামে একটি বিশাল হাদিস গ্রন্থ সংকলন করেন। পরবর্তীতে তিনি এই গ্রন্থ থেকে সবচেয়ে বিশুদ্ধ হাদিসগুলো বাছাই করে 'আল-মুজতাবা' বা 'আল-সুনান আল-সুগরা' (ছোট সুনান) নামে একটি সংক্ষিপ্ত সংস্করণ তৈরি করেন। এটিই 'সুনান আল-নাসাঈ' নামে পরিচিত এবং সিহাহ সিত্তার অন্তর্ভুক্ত।",
      "সুনানের বৈশিষ্ট্য\n\nসুনান আল-নাসাঈতে প্রায় ৫,৭৬১টি হাদিস রয়েছে। এই গ্রন্থের বিশেষত্ব হলো এতে অত্যন্ত কম সংখ্যক দুর্বল হাদিস রয়েছে। অনেক আলেম বলেছেন যে, বিশুদ্ধতার দিক থেকে সুনান আল-নাসাঈ সহীহ মুসলিমের পরেই স্থান পায়। ইমাম নাসাঈ হাদিসের বর্ণনাকারীদের সম্পর্কে অত্যন্ত কঠোর ছিলেন এবং শুধুমাত্র নির্ভরযোগ্য বর্ণনাকারীদের হাদিস গ্রহণ করতেন।",
      "রিজাল শাস্ত্রে পারদর্শিতা\n\nইমাম নাসাঈ (রহঃ) হাদিসের রিজাল (বর্ণনাকারী) শাস্ত্রে অত্যন্ত পারদর্শী ছিলেন। তিনি 'কিতাব আল-যু'আফা ওয়াল মাতরুকিন' (দুর্বল ও পরিত্যক্ত বর্ণনাকারীদের গ্রন্থ) রচনা করেছেন।",
      "ফাযায়িলে আলী\n\nতিনি 'খাসায়িস আমিরিল মু'মিনীন আলী ইবনে আবি তালিব' নামে হযরত আলী (রাঃ)-এর ফযিলত সম্পর্কে একটি বিশেষ গ্রন্থ রচনা করেছিলেন।",
      "শাহাদাত\n\nইমাম নাসাঈ (রহঃ) দামেস্কে অবস্থানকালে হযরত আলী (রাঃ)-এর ফযিলত সম্পর্কে একটি গ্রন্থ রচনা করেন। তখন দামেস্কে উমাইয়া খান্দানের প্রতি সমর্থন ছিল এবং হযরত আলী (রাঃ)-এর প্রতি বিদ্বেষ ছিল। যখন তাঁকে হযরত মুয়াবিয়া (রাঃ)-এর ফযিলত সম্পর্কে লিখতে বলা হয়, তিনি বলেন, 'আমি তাঁর ফযিলত খুঁজে পাইনি যে তিনি তাঁর শত্রুদের বিরুদ্ধে দোয়া করেছিলেন।' এই কথায় কিছু লোক ক্ষুব্ধ হয়ে তাঁকে মসজিদে প্রহার করে। এই আঘাতের ফলে তিনি গুরুতর আহত হন এবং মক্কায় নিয়ে যাওয়ার পথে ৩০৩ হিজরিতে (৯১৫ খ্রিস্টাব্দে) ফিলিস্তিনের রামলায় শাহাদাত বরণ করেন।",
      "উত্তরাধিকার\n\nইমাম নাসাঈ (রহঃ)-এর সুনান আজও সিহাহ সিত্তার অন্যতম স্তম্ভ এবং বিশুদ্ধতার দিক থেকে অত্যন্ত উচ্চ মর্যাদার অধিকারী। তাঁর শাহাদাত হাদিসশাস্ত্রের ইতিহাসে একটি মর্মান্তিক ঘটনা।"
    ],
    "moral": "সত্যের পথে অবিচল থাকা এবং জ্ঞানের জন্য জীবন উৎসর্গ করা। ইমাম নাসাঈ (রহঃ) সত্য বলার কারণে শাহাদাত বরণ করেছেন এবং উম্মাহর জন্য একটি বিশুদ্ধ হাদিস গ্রন্থ রেখে গেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_ibn_abi_shaybah",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে আবী শাইবা (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম ইবনে আবী শাইবা (রহঃ)-এর পূর্ণ নাম আবু বকর আবদুল্লাহ ইবনে মুহাম্মদ ইবনে আবী শাইবা আল-কুফী। তিনি ১৫৯ হিজরিতে (৭৭৬ খ্রিস্টাব্দে) কুফায় জন্মগ্রহণ করেন এবং ২৩৫ হিজরিতে (৮৪৯ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি ছিলেন হাদিস ও আছারের বিশাল সংকলক।",
      "প্রাথমিক জীবন ও শিক্ষা\n\nতিনি কুফার এক জ্ঞানী পরিবারে জন্মগ্রহণ করেন। তাঁর ভাই উসমান ইবনে আবী শাইবাও একজন বিখ্যাত মুহাদ্দিস ছিলেন। অল্প বয়স থেকেই তিনি হাদিস শেখা শুরু করেন।",
      "আল-মুসান্নাফ সংকলন\n\nইমাম ইবনে আবী শাইবা (রহঃ)-এর সবচেয়ে বড় অবদান হলো তাঁর বিশাল গ্রন্থ 'আল-মুসান্নাফ'। এই গ্রন্থে তিনি প্রায় ৩৭,০০০ হাদিস ও আছার সংকলন করেছেন। এটি ফিকহী অধ্যায় অনুসারে সাজানো এবং এতে নবী (সাঃ)-এর হাদিসের পাশাপাশি সাহাবী ও তাবেয়ীদের ফতোয়া ও আমল সংকলিত হয়েছে।",
      "মুসান্নাফের গুরুত্ব\n\nআল-মুসান্নাফ ইসলামী ফিকহ ও হাদিসশাস্ত্রের একটি অমূল্য সম্পদ। এতে প্রথম যুগের মুসলিমদের ফিকহী মতামত ও আমল সংরক্ষিত আছে। অনেক ফকীহ ও মুহাদ্দিস এই গ্রন্থ থেকে উপকৃত হয়েছেন।",
      "শিক্ষকতা\n\nতিনি কুফায় হাদিসের শিক্ষাদান করতেন। তাঁর ছাত্রদের মধ্যে ইমাম বুখারী (রহঃ), ইমাম মুসলিম (রহঃ), ইমাম আবু দাউদ (রহঃ) এবং ইমাম নাসাঈ (রহঃ) অন্যতম।",
      "ইন্তেকাল\n\nইমাম ইবনে আবী শাইবা (রহঃ) ২৩৫ হিজরিতে (৮৪৯ খ্রিস্টাব্দে) কুফায় ইন্তেকাল করেন। তাঁর মুসান্নাফ আজও ইসলামী ফিকহ ও হাদিসশাস্ত্রের গবেষকদের জন্য অপরিহার্য।"
    ],
    "moral": "সাহাবী ও তাবেয়ীদের আমল সংরক্ষণ করা। ইমাম ইবনে আবী শাইবা (রহঃ) প্রথম যুগের মুসলিমদের ফিকহী মতামত সংরক্ষণ করে উম্মাহর জন্য একটি মূল্যবান সম্পদ রেখে গেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_darimi",
    "categoryId": "imam_jibon",
    "title": "ইমাম আল-দারিমী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আল-দারিমী (রহঃ)-এর পূর্ণ নাম আবু মুহাম্মদ আবদুল্লাহ ইবনে আবদুর রহমান ইবনে আল-ফাদল আল-দারিমী আল-সামারকান্দী। তিনি ১৮১ হিজরিতে (৭৯৭ খ্রিস্টাব্দে) সামারকান্দে জন্মগ্রহণ করেন এবং ২৫৫ হিজরিতে (৮৬৯ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন।",
      "জ্ঞান অর্জনের সফর\n\nতিনি জ্ঞান অর্জনের জন্য খোরাসান, ইরাক, হিজাজ, মিশর এবং সিরিয়ায় ব্যাপক সফর করেন। তিনি ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ) এবং আলী ইবনে আল-মাদীনী (রহঃ)-এর মতো বড় মুহাদ্দিসদের কাছ থেকে হাদিস শুনেছেন।",
      "সুনান আল-দারিমী\n\nতাঁর সংকলিত 'সুনান আল-দারিমী' বা 'মুসনাদ আল-দারিমী' একটি গুরুত্বপূর্ণ হাদিস গ্রন্থ। এতে প্রায় ৩,৫০০ হাদিস রয়েছে যা ফিকহী অধ্যায় অনুসারে সাজানো। এই গ্রন্থটি সিহাহ সিত্তার পরবর্তী গুরুত্বপূর্ণ হাদিস গ্রন্থগুলির মধ্যে অন্যতম।",
      "আকীদাহ ও সুন্নাহর রক্ষক\n\nইমাম দারিমী (রহঃ) আহলুস সুন্নাহ ওয়াল জামা'আতের আকীদাহর একজন দৃঢ় রক্ষক ছিলেন। তিনি বিদ'আতীদের বিরুদ্ধে লিখেছেন এবং সুন্নাহর পক্ষে শক্তিশালী যুক্তি উপস্থাপন করেছেন।",
      "ইন্তেকাল\n\nইমাম দারিমী (রহঃ) ২৫৫ হিজরিতে (৮৬৯ খ্রিস্টাব্দে) সামারকান্দে ইন্তেকাল করেন। তাঁর সুনান আজও হাদিসশাস্ত্রের একটি মূল্যবান গ্রন্থ।"
    ],
    "moral": "সুন্নাহর পক্ষে দৃঢ় থাকা এবং বিদ'আতের বিরুদ্ধে লড়াই করা। ইমাম দারিমী (রহঃ) সুন্নাহর রক্ষায় অবিচল ছিলেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "imam_zuhri",
    "categoryId": "imam_jibon",
    "title": "ইমাম যুহরী (রহঃ)",
    "summary": "হাদিস লিপিবদ্ধকরণের অগ্রদূত এবং তাবেয়ীদের মধ্যে শ্রেষ্ঠতম হাফিয",
    "paragraphs": [
      "ইমাম যুহরী (রহঃ)-এর পূর্ণ নাম আবু বকর মুহাম্মাদ ইবনে মুসলিম ইবনে উবাইদুল্লাহ ইবনে শিহাব আয-যুহরী আল-কুরাশী। তিনি আনুমানিক ৫১ হিজরি (৬৭১ খ্রিস্টাব্দ) সালে মদিনা মুনাওয়ারায় জন্মগ্রহণ করেন এবং ১২৪ হিজরি (৭৪২ খ্রিস্টাব্দ) সালে সিরিয়ার নিকটবর্তী শারা অঞ্চলে ইন্তেকাল করেন। তিনি ছিলেন তাবেয়ীদের মধ্যে শ্রেষ্ঠতম হাফিয এবং হাদীস লিপিবদ্ধকরণের অগ্রদূত। তাঁর বংশ কুরাইশ বংশের বনু যুহরা গোত্রের সঙ্গে সম্পর্কিত।",
      "জন্ম ও শৈশব (৫১ হি. - ৭০ হি.)\n\nইমাম যুহরী (রহঃ) মদিনায় জন্মগ্রহণ করেন, যা তখনো নবী (সাঃ)-এর সাহাবী ও তাবেয়ীদের জ্ঞানচর্চার কেন্দ্র ছিল। তিনি ছোটবেলা থেকেই তাঁর প্রখর মেধার জন্য পরিচিত ছিলেন। তাঁর চাচা তাঁকে মদিনার প্রখ্যাত আলেমদের মজলিসে নিয়ে যেতেন। মদিনার জ্ঞানসমৃদ্ধ পরিবেশে বেড়ে ওঠার কারণে তিনি অল্প বয়সেই হাদিস ও ফিকহের প্রতি গভীর আগ্রহী হয়ে ওঠেন।",
      "জ্ঞানার্জন ও শিক্ষকগণ (৭০ হি. - ১১০ হি.)\n\nইমাম যুহরী (রহঃ) জীবনের শুরুতেই নিজেকে জ্ঞানার্জনে উৎসর্গ করেন। তিনি বলেন, তিনি দিনের বেলা সাঈদ ইবনুল মুসাইয়াব (রহঃ)-এর কাছে ফিকহ এবং রাতে উরওয়াহ ইবনে যুবাইর (রহঃ)-এর কাছে হাদীস শিক্ষা করতেন। তিনি সাহাবী আনাস ইবনে মালিক (রাঃ), সাহল ইবনে সা'দ (রাঃ), এবং প্রখ্যাত তাবেয়ী সাঈদ ইবনুল মুসাইয়াব (রহঃ), উরওয়াহ ইবনে যুবাইর (রহঃ), আবদুল্লাহ ইবনে উমর (রাঃ)-এর মতো ব্যক্তিত্বের কাছ থেকে শিক্ষা লাভ করেন। তাঁর স্মৃতিশক্তি ছিল অসাধারণ। বলা হয়ে থাকে, তিনি কোনো আলেম থেকে হাদীস শুনলে তা ভুলতেন না। তিনি স্বল্প সময়ের মধ্যে অনেক হাদীস মুখস্থ করে ফেলতেন এবং প্রয়োজনে অবিকল বলতে পারতেন।",
      "হাদীস সংকলনে ঐতিহাসিক ভূমিকা\n\nইমাম যুহরী (রহঃ)-এর জীবনের সবচেয়ে গুরুত্বপূর্ণ অধ্যায় হলো হাদীস সংকলনে তাঁর নেতৃত্ব। উমাইয়া খলিফা উমর ইবনে আব্দুল আযীয (রহঃ) দেখলেন যে, সাহাবী ও তাবেয়ীদের সংখ্যা কমে আসছে এবং জাল হাদীসের ফিতনা শুরু হচ্ছে। খলিফা উমর ইবনে আব্দুল আযীয (রহঃ) ১০০ হিজরির দিকে ইমাম যুহরী (রহঃ)-কে আনুষ্ঠানিকভাবে হাদীস লিপিবদ্ধ করার এবং মুসলিম বিশ্বের সব অঞ্চলে হাদীস সংগ্রহের নির্দেশ দেন। খলিফা বলেছিলেন, 'আমি আশঙ্কা করি যে হাদীসের জ্ঞান হারিয়ে যাবে।' ইমাম যুহরী (রহঃ) হাদীসগুলো সংগ্রহ করে লিখিত আকারে সংরক্ষণ করেন। খলিফা উমর (রহঃ) সেই সংকলনের অনুলিপি রাজ্যের বিভিন্ন প্রদেশে পাঠিয়ে দেন। এই প্রচেষ্টাকেই ইসলামে হাদীস সংকলনের প্রথম সরকারি উদ্যোগ হিসেবে গণ্য করা হয়।",
      "শিক্ষাদান ও প্রভাব\n\nইমাম যুহরী (রহঃ) মদিনা ও দামেস্কে হাদিসের শিক্ষাদান করতেন। তাঁর ছাত্রদের মধ্যে ইমাম মালিক (রহঃ), সুফিয়ান ইবনে উয়াইনা (রহঃ), ইমাম আওযায়ী (রহঃ), লাইস ইবনে সা'দ (রহঃ) এবং আরো অনেক বড় বড় ইমাম ছিলেন। তাঁর সংকলিত হাদিসগুলো পরবর্তী সকল হাদিস গ্রন্থের ভিত্তি হয়েছে। ইমাম মালিক (রহঃ) বলেছেন, 'আমি যুহরীর চেয়ে বড় হাফিয দেখিনি।' ইমাম আওযায়ী (রহঃ) বলেছেন, 'আমরা যুহরীর কাছে যেতাম এবং তাঁর জ্ঞানের সাগর থেকে উপকৃত হতাম।'",
      "শেষ জীবন ও মৃত্যু (১১০ হি. - ১২৪ হি.)\n\nইমাম যুহরী (রহঃ) উমাইয়া খিলাফতের কিছু প্রশাসনিক ও শিক্ষাগত পদে নিয়োজিত ছিলেন, যার ফলে তাঁর রাজনৈতিক সংশ্লিষ্টতা নিয়ে কিছু সমালোচনা ছিল। তবে জ্ঞান ও হাদীস শাস্ত্রে তাঁর মর্যাদা ছিল প্রশ্নাতীত। তিনি জীবনের শেষ দিকে সিরিয়ার নিকটবর্তী শারা অঞ্চলে চলে যান এবং সেখানেই ১২৪ হিজরিতে মৃত্যুবরণ করেন। তাঁর মৃত্যুতে সমগ্র মুসলিম বিশ্ব শোকাহত হয়। তাঁর হাদিস সংকলনের কাজ পরবর্তী সকল মুহাদ্দিসদের জন্য পথ প্রদর্শক হয়েছে এবং তাঁর সংকলিত হাদিসগুলো সিহাহ সিত্তা সহ সকল হাদিস গ্রন্থে স্থান পেয়েছে।"
    ],
    "moral": "হাদিস লিপিবদ্ধ করে সংরক্ষণ করা এবং পরবর্তী প্রজন্মের জন্য জ্ঞান সংরক্ষণ করা অপরিহার্য। ইমাম যুহরী (রহঃ) হাদিস লিখিতভাবে সংরক্ষণের কাজ শুরু করে উম্মাহর জন্য অসাধারণ অবদান রেখেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে সা'দ, তাবাকাত; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_sufyan_thawri",
    "categoryId": "imam_jibon",
    "title": "ইমাম সুফিয়ান আল-সাওরী (রহঃ)",
    "summary": "আমীর আল-মু'মিনীন ফীল হাদিস এবং যুহদ ও তাকওয়ার প্রতীক",
    "paragraphs": [
      "ইমাম সুফিয়ান আল-সাওরী (রহঃ)-এর পূর্ণ নাম আবু আব্দুল্লাহ সুফিয়ান ইবনে সাঈদ ইবনে মাসরুক আস-সাওরী আত-তামিমি। তিনি ৯৭ হিজরি (৭১৬ খ্রিস্টাব্দ) সালে কুফা, ইরাকে জন্মগ্রহণ করেন এবং ১৬১ হিজরি (৭৭৮ খ্রিস্টাব্দ) সালে বসরা, ইরাকে ইন্তেকাল করেন। তাঁকে 'আমীরুল মু'মিনীন ফীল হাদীস' (হাদিসে মুমিনদের নেতা) এবং 'সাইয়্যেদুল ফুকাহা' (ফিকহবিদদের নেতা) উপাধিতে ভূষিত করা হয়েছিল। তিনি ছিলেন সাওরীর ফিকহী মাযহাবের প্রতিষ্ঠাতা এবং যুহদ ও তাকওয়ার প্রতীক।",
      "জন্ম ও শিক্ষা জীবন (৯৭ হি. - ১২০ হি.)\n\nইমাম সুফিয়ান সাওরী (রহঃ) কুফাতে এক সম্ভ্রান্ত আলেম পরিবারে জন্মগ্রহণ করেন। তাঁর বাবা ও দাদা উভয়েই মুহাদ্দিস ও ফকীহ ছিলেন। তিনি কুফার হাদীস ও ফিকহ শিক্ষার প্রধান কেন্দ্র হিসেবে নিজেকে গড়ে তোলেন। তাঁর পিতা সাঈদ ইবনে মাসরুক তাঁকে হাদিস শিক্ষা দিতেন এবং বলতেন, 'হে পুত্র! হাদিস শেখো এবং আমি তোমার খরচের ব্যবস্থা করব।' তিনি তাঁর সময়ের শ্রেষ্ঠ আলেম, যেমন- জাফর আস-সাদিক (রহঃ), আইয়ুব আল-সাখতিয়ানী (রহঃ), আব্দুল্লাহ ইবনে উসমান আল-সাকাফী (রহঃ), এবং শু'বা ইবনে আল-হাজ্জাজ (রহঃ)-এর মতো অসংখ্য শায়খের নিকট থেকে শিক্ষা লাভ করেন। তিনি কুফা, বসরা, মক্কা, মদীনা, ইয়েমেন এবং অন্যান্য শহরে ভ্রমণ করে জ্ঞান অর্জন করেন। তিনি প্রায় ১,০০০ শাইখের কাছ থেকে হাদিস শুনেছেন।",
      "হাদীস ও ফিকহে পারদর্শিতা\n\nইমাম সুফিয়ান সাওরী (রহঃ) তাঁর যুগের সবচেয়ে বড় হাফিয ছিলেন। তিনি হাজার হাজার হাদিস মুখস্থ করেছিলেন এবং হাদিসের সনদ ও মতন সম্পর্কে গভীর জ্ঞান রাখতেন। তিনি হাদীস যাচাইয়ে কঠোরতা এবং ফিকহী সিদ্ধান্তে মধ্যপন্থা অবলম্বনের জন্য বিখ্যাত ছিলেন। ইমাম শাফেয়ী (রহঃ) বলেছেন, 'সুফিয়ান সাওরী না থাকলে হাদিস হারিয়ে যেত।' ইমাম আহমাদ ইবনে হাম্বল (রহঃ) বলেছেন, 'সুফিয়ান সাওরী হাদিসের ইমাম ছিলেন।' তাঁকে তাঁর ছাত্র ও সমসাময়িকরা আমীরুল মু'মিনীন ফীল হাদীস উপাধিতে ভূষিত করেছিলেন।",
      "ফিকহী মাযহাব ও যুহদ\n\nইমাম সাওরী (রহঃ) নিজস্ব ইজতিহাদ ও ফিকহী পদ্ধতি অনুসরণ করতেন, যার উপর ভিত্তি করে সাওরী মাযহাব প্রতিষ্ঠিত হয়েছিল। এই মাযহাবটি একসময় মধ্যপ্রাচ্যের কিছু অঞ্চলে অত্যন্ত প্রভাবশালী ছিল। তাঁর জীবনের সবচেয়ে উল্লেখযোগ্য দিক ছিল তাঁর গভীর আল্লাহভীতি ও দুনিয়াবিমুখতা। তিনি পার্থিব জীবনের ভোগ-বিলাস থেকে নিজেকে দূরে রাখতেন এবং সর্বদা সাদামাটা জীবন যাপন করতেন। তিনি বলতেন, 'দুনিয়া আমার কাছে মৃত কুকুরের চেয়েও নিকৃষ্ট।' তিনি রাতে দীর্ঘ সময় নামাজ পড়তেন এবং কুরআন তিলাওয়াত করতেন। তিনি প্রায়ই কাঁদতেন এবং আল্লাহর ভয়ে তাঁর হৃদয় কম্পিত হতো।",
      "রাজনৈতিক নিপীড়ন ও আত্মগোপন\n\nইমাম সুফিয়ান সাওরী (রহঃ) আব্বাসীয় খলিফাদের, বিশেষত আবূ জা'ফর আল-মানসূর-এর প্রশাসনের দুর্নীতি ও অবিচারের কঠোর সমালোচক ছিলেন। তিনি শাসকদের কাছ থেকে দূরে থাকতেন এবং তাঁদের সাথে মেলামেশা করতেন না। তিনি বলতেন, 'শাসকদের কাছে যাওয়া দ্বীনের জন্য ক্ষতিকর।' খলিফা তাঁকে বিচারকের (কাজী) পদ গ্রহণের জন্য বাধ্য করতে চাইলে, তিনি তা প্রত্যাখ্যান করেন এবং খলিফার হাত থেকে বাঁচতে দীর্ঘকাল আত্মগোপনে থাকেন। এর ফলে খলিফা তাঁর উপর রাগান্বিত হন এবং তাঁকে গ্রেফতারের নির্দেশ দেন। এই কারণে তিনি তাঁর ফিকহী জ্ঞান সুসংগঠিতভাবে সংকলন করার সুযোগ পাননি।",
      "শেষ জীবন ও মৃত্যু (১৬১ হি.)\n\nআত্মগোপন অবস্থায় ইমাম সাওরী (রহঃ) বিভিন্ন শহরে ঘুরে বেড়ান। অবশেষে তিনি বসরা শহরে এসে অবস্থান করেন। ১৬১ হিজরিতে শাওয়াল মাসে তিনি বসরাতে আত্মগোপন অবস্থায় ইন্তেকাল করেন। তাঁর বয়স হয়েছিল ৬৪ বছর। তাঁর জানাযায় হাজার হাজার মানুষ অংশগ্রহণ করেন। তাঁর মৃত্যুতে সমগ্র মুসলিম বিশ্ব শোকাহত হয়। আত্মগোপন জীবনের কারণে তাঁর মাযহাবের অনুসারীরা বিচ্ছিন্ন হয়ে পড়ে এবং তাঁর মাযহাব সময়ের সাথে সাথে বিলুপ্ত হয়ে যায়। তিনি হাদিস ও তাকওয়ার ক্ষেত্রে একটি অনন্য দৃষ্টান্ত রেখে গেছেন।"
    ],
    "moral": "হাদিসের জ্ঞানের সাথে তাকওয়া ও যুহদ একত্রিত করা এবং শাসকদের প্রলোভন থেকে দূরে থাকা। ইমাম সুফিয়ান সাওরী (রহঃ) হাদিসের হাফিয হওয়ার পাশাপাশি অত্যন্ত পরহেজগার ছিলেন এবং দুনিয়ার মোহ ত্যাগ করেছিলেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে সা'দ, তাবাকাত; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_awzai",
    "categoryId": "imam_jibon",
    "title": "ইমাম আওযায়ী (রহঃ)",
    "summary": "সিরিয়ার ইমাম এবং শাম অঞ্চলের প্রধান ফিকহী মাযহাবের প্রতিষ্ঠাতা",
    "paragraphs": [
      "ইমাম আওযায়ী (রহঃ)-এর পূর্ণ নাম আবু আমর আব্দুর রহমান ইবনে আমর আল-আওযায়ী। তিনি ৮৮ হিজরি (৭০৭ খ্রিস্টাব্দ) সালে বালাবেক বা দামেস্ক, শাম (সিরিয়া) অঞ্চলে জন্মগ্রহণ করেন এবং ১৫৭ হিজরি (৭৭৪ খ্রিস্টাব্দ) সালে বৈরুত, লেবাননে ইন্তেকাল করেন। তাঁকে 'ইমামু আহলিশ-শাম' (সিরিয়ার ইমাম) উপাধিতে ভূষিত করা হয়েছিল। তিনি ছিলেন শাম অঞ্চলের প্রধান ফিকহী মাযহাবের প্রতিষ্ঠাতা।",
      "জন্ম ও প্রাথমিক জীবন (৮৮ হি. - ১২০ হি.)\n\nইমাম আওযায়ী (রহঃ) ছিলেন মূলত একজন এতিম এবং তিনি অত্যন্ত দরিদ্র অবস্থায় জীবন শুরু করেন। শৈশবে তিনি তাঁর মায়ের সাথে দামেস্কের নিকটবর্তী আল-আওযা গ্রামে চলে আসেন, যার সাথে সম্পর্কিত হয়েই তিনি 'আওযায়ী' নামে পরিচিত হন। দারিদ্র্যের মধ্যেও তিনি জ্ঞানার্জনে মনোনিবেশ করেন এবং তাঁর প্রখর মেধার কারণে তিনি মাত্র ১৩ বছর বয়সে ফতোয়া দেওয়া শুরু করেন।",
      "শিক্ষা ও প্রজ্ঞা\n\nতিনি জ্ঞানার্জনের জন্য শাম, হিজাজ, ইয়েমেন এবং মিশরের মতো জ্ঞানকেন্দ্রগুলোতে ব্যাপক ভ্রমণ করেন। তিনি আতা ইবনে আবি রাবাহ (রহঃ), মুহাম্মাদ ইবনে মুসলিম আয-যুহরী (রহঃ)-এর মতো প্রখ্যাত আলেমদের নিকট থেকে শিক্ষা লাভ করেন। তাঁর জ্ঞান ও প্রজ্ঞার কারণে তিনি অল্প বয়সেই শাম অঞ্চলের প্রধান ফকীহ হিসেবে স্বীকৃতি পান।",
      "ফিকহী নেতৃত্ব ও মাযহাব\n\nইমাম আওযায়ী (রহঃ) সিরিয়া অঞ্চলের ফিকহী চিন্তাধারার প্রধান মুখ ছিলেন। তাঁর মাযহাব একসময় সিরিয়া, আন্দালুস (স্পেন) এবং উত্তর আফ্রিকার কিছু অংশে প্রধান আইন ব্যবস্থা হিসেবে প্রচলিত ছিল। তাঁর ফিকহ মূলত হাদীসের উপর নির্ভরশীল ছিল। তিনি হাদীস প্রয়োগের ক্ষেত্রে মদিনার আলেমদের মত (আহলে মদিনা) এবং কুফার আলেমদের মত (আহলে কুফা)-এর মধ্যে একটি ভারসাম্য রক্ষা করতেন। তাঁর ফিকহী পদ্ধতি ছিল মধ্যপন্থী এবং বাস্তবসম্মত।",
      "খলিফার দরবারে সাহস\n\nইমাম আওযায়ী (রহঃ) ছিলেন একজন সত্যবাদী আলেম। তিনি আব্বাসীয় খলিফা আবূ জা'ফর আল-মানসূর-এর দরবারে গিয়ে শাসকের দায়িত্ব ও ন্যায়বিচারের গুরুত্ব সম্পর্কে কঠোর ভাষায় নসিহত করেছিলেন, যা তৎকালীন আলেমদের জন্য এক বিরল সাহসিকতার উদাহরণ। তিনি খলিফাকে বলেছিলেন, 'হে আমীরুল মুমিনীন! আপনি আল্লাহর সামনে দাঁড়াবেন এবং আপনার প্রজাদের সম্পর্কে জবাবদিহি করতে হবে।' খলিফা তাঁর সাহসিকতা ও সত্যবাদিতার জন্য তাঁকে সম্মান করতেন।",
      "শেষ জীবন ও মৃত্যু (১৫৭ হি.)\n\nইমাম আওযায়ী (রহঃ) জীবনের শেষ দিকে বৈরুতে বসতি স্থাপন করেন। তিনি সেখানে সীমান্ত প্রহরী হিসেবে কাজ করতেন এবং ইবাদতে মগ্ন থাকতেন। তিনি জিহাদের গুরুত্ব সম্পর্কে সচেতন ছিলেন এবং মুসলিম সীমান্ত রক্ষায় নিজেকে নিয়োজিত রাখতেন। ১৫৭ হিজরিতে তিনি বৈরুতে ইন্তেকাল করেন। তাঁর ইন্তেকালের পরও তাঁর মাযহাব প্রায় দুই শত বছর পর্যন্ত শামের একটি অংশ ও আন্দালুসে প্রভাবশালী ছিল। পরবর্তীতে শাফেয়ী ও মালিকী মাযহাবের বিস্তারের কারণে তাঁর মাযহাব ধীরে ধীরে বিলুপ্ত হয়ে যায়।"
    ],
    "moral": "সত্য বলার সাহস এবং শাসকদের সামনেও ন্যায়ের পক্ষে দাঁড়ানো। ইমাম আওযায়ী (রহঃ) খলিফার দরবারে গিয়েও সত্য ও ন্যায়ের কথা বলতে ভয় পাননি।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে আসাকির, তারীখে দামেস্ক; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_layth_ibn_sad",
    "categoryId": "imam_jibon",
    "title": "ইমাম লাইস ইবনে সা'দ (রহঃ)",
    "summary": "মিশরের ইমাম এবং অতুলনীয় দানশীলতার প্রতীক",
    "paragraphs": [
      "ইমাম লাইস ইবনে সা'দ (রহঃ)-এর পূর্ণ নাম আবুল হারিস লাইস বিন সা'দ ইবনে আব্দুর রহমান আল-ফাহমী আল-কালকাশান্দি। তিনি ৯৪ হিজরি (৭১৩ খ্রিস্টাব্দ) সালে কালকাশান্দা গ্রাম, মিশরে জন্মগ্রহণ করেন এবং ১৭৫ হিজরি (৭৯১ খ্রিস্টাব্দ) সালে মিশরে ইন্তেকাল করেন। তাঁকে 'ইমামু আহলি মিসর' (মিশরের ইমাম) এবং 'শায়খুল ইসলাম' উপাধিতে ভূষিত করা হয়েছিল। তিনি ছিলেন মিশরের প্রধান মুহাদ্দিস ও ফকীহ এবং অতুলনীয় দানশীলতার প্রতীক।",
      "জন্ম ও শিক্ষা জীবন (৯৪ হি. - ১২০ হি.)\n\nইমাম লাইস ইবনে সা'দ (রহঃ) মিশরের কালকাশান্দা গ্রামে জন্মগ্রহণ করেন। তিনি ফারসি বংশোদ্ভূত ছিলেন। তিনি মিশরের প্রখ্যাত তাবেঈদের কাছ থেকে শিক্ষা লাভ করেন। মাত্র ২০ বছর বয়সে তিনি হজের উদ্দেশ্যে মক্কায় যান এবং সেখানে হিজাজের অনেক বড় আলেমদের কাছ থেকে হাদীস শ্রবণ করেন। তিনি মিশরে ফিরে আসেন এবং ফতোয়া দেওয়া শুরু করেন। তাঁর ফিকহী জ্ঞান এতটাই গভীর ছিল যে, ইমাম শাফে'ঈ (রহঃ) বলেছিলেন, 'লাইস ইবনে সা'দ ইমাম মালেক (রহঃ)-এর চেয়েও বড় ফকীহ ছিলেন।'",
      "জ্ঞান ও হাদীস\n\nইমাম লাইস (রহঃ) একাধারে মুহাদ্দিস, ফকীহ, এবং আল্লাহভীতি ও দানশীলতার প্রতীক ছিলেন। মিশরে হাদীসের চর্চা ও সংরক্ষণে তাঁর অবদান অপরিসীম। ইমাম বুখারী (রহঃ), ইমাম মুসলিম (রহঃ) সহ সিহাহ সিত্তার সকল ইমাম তাঁর বর্ণনা করেছেন। তাঁর ফিকহী মতামতও একসময় মিশরে প্রচলিত ছিল, যা পরে শাফে'ঈ মাযহাব দ্বারা প্রতিস্থাপিত হয়। তাঁর জ্ঞানের গভীরতা এবং হাদীসে পারদর্শিতা তাঁকে মিশরের সবচেয়ে সম্মানিত আলেমদের একজন করে তুলেছিল।",
      "অতুলনীয় দানশীলতা\n\nএটি তাঁর জীবনের সবচেয়ে চমকপ্রদ দিক। তাঁর বাৎসরিক আয় ছিল প্রায় ২৫ হাজার দীনার, যা ছিল তখনকার একজন আমীরের আয়ের সমান। তাঁর সম্পদের ওপর কখনো যাকাত ফরয হতো না, কারণ বছর শেষ হওয়ার আগেই তিনি তাঁর সমস্ত সম্পত্তি অভাবী, এতিম ও বিধবাদের মধ্যে বিলিয়ে দিতেন। তিনি নিজের জন্য কেবল সাধারণ খাবার (যেমন: রুটি ও যয়তুন) রাখতেন, কিন্তু তাঁর মেহমানদের জন্য সর্বদা উত্তম খাবারের আয়োজন করতেন। তাঁর দানশীলতা এতটাই বিখ্যাত ছিল যে মানুষ তাঁকে 'দানশীলদের ইমাম' বলে ডাকতেন।",
      "ক্ষমতা প্রত্যাখ্যান ও যুহদ\n\nতৎকালীন আব্বাসীয় খলিফা তাঁকে মিসরের গভর্নরের পদ বা বিচারকের পদে যোগদানের প্রস্তাব দিলেও তিনি তাঁর যুহদের কারণে তা বিনয়ের সাথে প্রত্যাখ্যান করেছিলেন। তিনি বলতেন, 'আমি শাসকদের কাছ থেকে দূরে থাকতে চাই এবং আমার জ্ঞান ও সম্পদ আল্লাহর পথে ব্যয় করতে চাই।' তিনি দুনিয়ার ভোগবিলাস থেকে দূরে থাকতেন এবং সর্বদা আল্লাহর সন্তুষ্টির জন্য কাজ করতেন।",
      "মৃত্যু (১৭৫ হি.)\n\nইমাম লাইস ইবনে সা'দ (রহঃ) ১৭৫ হিজরিতে মিশরে মৃত্যুবরণ করেন। তাঁর মৃত্যুতে মিশরের মানুষ গভীরভাবে শোকাহত হয়েছিল এবং তাঁর নাম ইসলামের ইতিহাসে একজন আদর্শ আলেম ও দাতা হিসেবে চিরস্মরণীয় হয়ে আছে। তাঁর জানাযায় হাজার হাজার মানুষ অংশগ্রহণ করেন এবং তাঁর জন্য দোয়া করেন। তাঁর জীবন আমাদের শেখায় যে, জ্ঞান ও সম্পদ উভয়ই আল্লাহর পথে ব্যয় করা উচিত এবং দানশীলতা একজন মুমিনের অন্যতম প্রধান গুণ।"
    ],
    "moral": "জ্ঞানের সাথে দানশীলতা একত্রিত করা এবং সম্পদ আল্লাহর পথে ব্যয় করা। ইমাম লাইস (রহঃ) বড় আলেম হওয়ার পাশাপাশি অত্যন্ত দানশীল ছিলেন এবং তাঁর সমস্ত সম্পদ দরিদ্রদের মধ্যে বিতরণ করতেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব; ইবনে আবদুল হাকাম, সীরাত লাইস ইবনে সা'দ"
  },
  {
    "id": "imam_abu_dawud",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু দাউদ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু দাউদ (রহঃ)-এর পূর্ণ নাম আবু দাউদ সুলাইমান ইবনে আল-আশআস ইবনে ইসহাক আল-আজদি আস-সিজিস্তানি। তিনি ২০২ হিজরিতে (৮১৭ খ্রিস্টাব্দে) বর্তমান আফগানিস্তানের সিজিস্তান অঞ্চলে জন্মগ্রহণ করেন এবং ২৭৫ হিজরিতে (৮৮৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। তিনি সিহাহ সিত্তাহ (ছয়টি বিশুদ্ধ হাদিস গ্রন্থ)-এর অন্যতম 'সুনান আবু দাউদ'-এর সংকলক।",
      "জন্ম ও বংশ পরিচয়\n\nইমাম আবু দাউদ (রহঃ) ২০২ হিজরিতে সিজিস্তানে জন্মগ্রহণ করেন। তাঁর ঊর্ধ্বতম পুরুষ ইমরান, যিনি হযরত আলী (রাঃ)-এর সঙ্গী হয়ে সীফফিনের যুদ্ধে শহীদ হয়েছিলেন। তখন আব্বাসীয় খলিফা মামুন ছিলেন রাষ্ট্রক্ষমতায়। ২০২ হিজরি সাল, যাকে ইসলামী জ্ঞান-বিজ্ঞানের সোনালি যুগ বলা হয়।",
      "প্রাথমিক শিক্ষা\n\nতাঁর প্রাথমিক শিক্ষা সম্পর্কে তেমন জানা যায় না। সম্ভবত তিনি নিজ গ্রামেই প্রাথমিক শিক্ষা লাভ করেন। তাঁর বয়স যখন দশ বছর তখন তিনি নিশাপুরের একটি মাদরাসায় ভর্তি হন এবং সেখানেই তিনি প্রখ্যাত মুহাদ্দিস ইবনু আসলামের নিকট হাদিসশাস্ত্র অধ্যয়ন করেন।",
      "বিস্তৃত সফর ও জ্ঞান অর্জন\n\nহাদিসে উচ্চ শিক্ষা লাভের জন্য ইমাম আবু দাউদ (রহঃ) মিশর, সিরিয়া, হিজাজ, ইরাক, বৃহত্তর খোরাসান প্রভৃতি বিখ্যাত হাদিস গবেষণা কেন্দ্রসমূহে ভ্রমণ করেন এবং তদানীন্তন সুবিখ্যাত মুহাদ্দিসগণের নিকট হাদিস শ্রবণ ও সংগ্রহ করেন। তিনি প্রায় ৫ লক্ষ হাদিস সংগ্রহ করেছিলেন।",
      "চরিত্র ও ব্যক্তিত্ব\n\nইমাম আবু দাউদ (রহঃ) ছিলেন ইবাদাতগুযার, পরহেজগার, যাহিদ ও ন্যায়পরায়ণ লোক। দুনিয়ার ভোগ বিলাসের প্রতি তাঁর কোন মোহ ছিল না। ইমাম ইবনু দাসাহ উল্লেখ করেন যে, ইমাম আবু দাউদের জামার একটি হাতা প্রশস্ত ও একটি হাতা সংকীর্ণ ছিল। এর কারণ জিজ্ঞাসা করা হলে তিনি বলেন, 'যে হাতাটি প্রশস্ত তার মধ্যে আমি লিখিত হাদিসগুলো রেখে দেই এবং যে সংকীর্ণ হাতার মধ্যে এ জাতীয় কিছুই নেই।'",
      "সুনান আবু দাউদ সংকলন\n\nইমাম আবু দাউদ (রহঃ)-এর সবচেয়ে বড় অবদান হলো তাঁর সংকলিত 'সুনান আবু দাউদ'। এই গ্রন্থে তিনি প্রায় ৫ লক্ষ হাদিসের মধ্য থেকে ৪,৮০০ হাদিস সংকলন করেছেন। তিনি বলেছেন যে, তিনি যেগুলোকে জয়িফ (দুর্বল) বলে উল্লেখ করেননি সেগুলো ছাড়া বাকি হাদিসগুলো সহিহ। তবে ইবনে হাজার আসকালানির মতানুযায়ী জয়িফ উল্লেখ করা হয়নি এমন হাদিসের মধ্যেও কিছু জয়িফ হাদিস রয়েছে।",
      "গ্রন্থের বৈশিষ্ট্য\n\nসুনান আবু দাউদের বিশেষত্ব হলো এটি মূলত ফিকহী বিষয়ক হাদিসের সংকলন। ইমাম আবু দাউদ (রহঃ) এতে বিশেষভাবে ফিকহ ও আহকাম সংক্রান্ত হাদিসগুলো সংকলন করেছেন। এই কারণে ফকীহগণ এই গ্রন্থকে অত্যন্ত গুরুত্বপূর্ণ মনে করেন।",
      "অন্যান্য রচনাবলী\n\nসুনান আবু দাউদ ছাড়াও তিনি আরো ২১টি বই লিখেছেন। এগুলোর মধ্যে রয়েছে কিতাব আল-মারাসিল (৬০০ মুরসাল হাদিস), রিসালাত আবি দাউদ ইলা আহলি মাক্কাহ (মক্কার বাসিন্দাদের প্রতি চিঠি), ইবতিদাউল ওয়াহী, আখবারুল খাওয়ারিজ, আ'লামুন নাবুয়্যাহ, আদ-দু'আ, আয-যুহদ এবং আরো অনেক।",
      "শিক্ষকবৃন্দ\n\nইমাম আবু দাউদ (রহঃ) তাঁর যুগের প্রায় সকল বড় মুহাদ্দিসের কাছ থেকে হাদিস সংগ্রহ করেন। তাঁর উল্লেখযোগ্য শিক্ষকদের মধ্যে রয়েছেন ইমাম আহমাদ ইবনে হাম্বল (রহঃ), ইয়াহইয়া ইবনে মাঈন (রহঃ), আলী ইবনুল মাদীনী (রহঃ), কুতাইবা ইবনে সাঈদ (রহঃ), মুসাদ্দাদ ইবনে মুসারহাদ (রহঃ) এবং আরো অনেকে।",
      "হাদিস সংকলনের পদ্ধতি\n\nইমাম আবু দাউদ (রহঃ) হাদিস সংকলনে অত্যন্ত সতর্ক ছিলেন। তিনি প্রথমে ফিকহী বিষয়গুলো নির্ধারণ করতেন, তারপর সেই বিষয়ে সহিহ হাদিস খুঁজতেন। তিনি দুর্বল হাদিস এড়িয়ে চলতেন এবং শুধুমাত্র বিশ্বস্ত বর্ণনাকারীদের হাদিস গ্রহণ করতেন।",
      "গ্রন্থ সংকলনের উদ্দেশ্য\n\nইমাম আবু দাউদ (রহঃ) তাঁর পুত্রকে লিখিত একটি চিঠিতে বলেছেন যে, তিনি সুনান গ্রন্থে শুধুমাত্র আহকাম (শরীয়তের বিধান) সংক্রান্ত হাদিস সংকলন করেছেন। তিনি ফাযায়েল (মর্যাদা), তারগীব (উৎসাহ প্রদান) এবং তারহীব (ভয় প্রদর্শন) সংক্রান্ত হাদিস এতে অন্তর্ভুক্ত করেননি।",
      "হাদিসের মান নির্ধারণ\n\nইমাম আবু দাউদ (রহঃ) বলেছেন, 'আমি আমার কিতাবে যে হাদিসকে অত্যন্ত দুর্বল বলে উল্লেখ করেছি, তা ছাড়া বাকি সব হাদিস হাসান (গ্রহণযোগ্য) পর্যায়ের।' তবে পরবর্তী মুহাদ্দিসগণ তাঁর গ্রন্থের কিছু হাদিসকে দুর্বল বলে চিহ্নিত করেছেন।",
      "আলেমদের প্রশংসা\n\nইমাম আবু দাউদ (রহঃ) সম্পর্কে ইমাম নাসাঈ (রহঃ) বলেছেন, 'আবু দাউদ তাঁর যুগের ইমাম ছিলেন।' ইমাম ইবনুল আরাবী বলেছেন, 'ফকীহদের জন্য সুনান আবু দাউদই যথেষ্ট।' ইমাম নববী (রহঃ) বলেছেন, 'সুনান আবু দাউদ ফিকহের ছাত্রদের জন্য অপরিহার্য।'",
      "বসরায় বসবাস\n\nজীবনের শেষ দিকে ইমাম আবু দাউদ (রহঃ) বসরায় স্থায়ীভাবে বসবাস করেন। সেখানে তিনি হাদিস শিক্ষাদান করতেন এবং ফতোয়া প্রদান করতেন। তাঁর মজলিসে দূর-দূরান্ত থেকে ছাত্ররা আসতেন।",
      "জ্ঞান ও তাকওয়া\n\nইমাম আবু দাউদ (রহঃ) শুধু হাদিসশাস্ত্রেই পারদর্শী ছিলেন না, বরং ফিকহ, উসূলে ফিকহ এবং আরবি ভাষায়ও গভীর জ্ঞান রাখতেন। তিনি অত্যন্ত মুত্তাকী এবং আল্লাহভীরু ছিলেন। দুনিয়ার প্রতি তাঁর কোনো আসক্তি ছিল না।",
      "ছাত্রবৃন্দ\n\nতাঁর ছাত্রদের মধ্যে রয়েছেন ইমাম তিরমিযী (রহঃ), ইমাম নাসাঈ (রহঃ), আবু আওয়ানা (রহঃ), আবু বকর ইবনে দাসাহ (রহঃ) এবং আরো অনেকে। তাঁর ছাত্ররা তাঁর সুনান গ্রন্থটি বিশ্বব্যাপী প্রচার করেন।",
      "মাযহাব\n\nইমাম আবু দাউদ (রহঃ) ফিকহী মাযহাবের ক্ষেত্রে হাম্বলী মাযহাবের অনুসারী ছিলেন। তবে তিনি হাদিসের ভিত্তিতে ফতোয়া প্রদান করতেন এবং কোনো মাযহাবের অন্ধ অনুসরণ করতেন না।",
      "মৃত্যুকাল\n\nইমাম আবু দাউদ (রহঃ) ২৭৫ হিজরির ১৬ শাওয়াল শুক্রবার (৮৮৯ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন। মৃত্যুকালে তাঁর বয়স হয়েছিল ৭৩ বছর। তাঁর জানাযায় বসরার হাজার হাজার মানুষ অংশগ্রহণ করেন।",
      "ঐতিহাসিক অবদান\n\nইমাম আবু দাউদ (রহঃ)-এর সুনান হাদিসশাস্ত্রে একটি মাইলফলক। এটি ফকীহদের জন্য সবচেয়ে উপকারী হাদিস গ্রন্থগুলোর একটি। তাঁর সংকলিত সুনান আবু দাউদ আজও সারা বিশ্বের মুসলমানদের কাছে হাদিসের অন্যতম প্রধান গ্রন্থ হিসেবে সম্মানিত এবং ইসলামী আইনশাস্ত্রের মূল ভিত্তি।"
    ],
    "moral": "হাদিস সংগ্রহে নিবেদিতপ্রাণ থাকা এবং ফিকহী বিষয়ে হাদিসের গুরুত্ব। ইমাম আবু দাউদ (রহঃ) ৫ লক্ষ হাদিস থেকে বাছাই করে ফিকহী হাদিসের একটি অমূল্য সংকলন তৈরি করেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  },
  {
    "id": "imam_tirmidhi",
    "categoryId": "imam_jibon",
    "title": "ইমাম তিরমিযী (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম তিরমিযী (রহঃ)-এর পূর্ণ নাম আবু ঈসা মুহাম্মদ ইবনে ঈসা ইবনে সাওরাহ আস-সুলামি আদ-দারির আল-বুগি আত-তিরমিজি। তিনি ২০৯ হিজরিতে (৮২৪ খ্রিস্টাব্দে) উজবেকিস্তানের তিরমিজ শহরের বুগ গ্রামে জন্মগ্রহণ করেন এবং ২৭৯ হিজরিতে (৮৯২ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি সিহাহ সিত্তাহর অন্যতম 'জামি আত-তিরমিজি' বা 'সুনান আত-তিরমিজি'-এর সংকলক। তাঁকে 'আদ-দাহহাক' (অন্ধ) লকব দিয়েও ডাকা হতো।",
      "জন্ম ও বংশ পরিচয়\n\nইমাম তিরমিযী আব্বাসীয় খলিফা আল-মামুনের শাসনামলে জন্মগ্রহণ করেন। তাঁর পরিবার আরব গোত্র বনু সুলাইমের অন্তর্ভুক্ত ছিল। তাঁর দাদা মার্ভের লোক ছিলেন এবং তিরমিজে বসতি স্থাপন করেন। তিনি বিশেষত তিরমিজের উপশহর বুগ গ্রামে জন্মগ্রহণ করেন, এ কারণে তাঁর নিসবাত হিসেবে 'আত-তিরমিজি' ও 'আল-বুগি' এসেছে।",
      "হাদিস অধ্যয়ন শুরু\n\nইমাম তিরমিযী (রহঃ) ২০ বছর বয়সে হাদিস অধ্যয়ন শুরু করেন। ২৩৫ হিজরি থেকে শুরু করে হাদিস সংগ্রহের জন্য তিনি খোরাসান, ইরাক ও হেজাজ সফর করেছেন। তৎকালীন সময়ে তাঁর জন্মস্থান খোরাসান জ্ঞানচর্চার কেন্দ্র ছিল এবং এখানে ব্যাপক সংখ্যক মুহাদ্দিসের আবাস ছিল।",
      "ইরাকে সফর\n\nইমাম তিরমিযীর সফর করা অন্যান্য জ্ঞানচর্চার কেন্দ্রগুলোর মধ্যে রয়েছে ইরাকি শহর কুফা ও বসরা। তিনি ৪২ জন কুফি শিক্ষকের কাছ থেকে হাদিস বর্ণনা করেছেন। তাঁর জামি গ্রন্থে তিনি অন্যান্য যেকোন শহরের শিক্ষকদের চেয়ে কুফার শিক্ষকদের বর্ণনা বেশি ব্যবহার করেছেন।",
      "ইমাম বুখারীর সান্নিধ্য\n\nইমাম তিরমিযী ইমাম বুখারীর ছাত্র ছিলেন। বুখারীও খোরাসানের বাসিন্দা ছিলেন। ইমাম যাহাবি লিখেছেন, 'তাঁর হাদিসের জ্ঞান আল-বুখারীর কাছ থেকে এসেছে।' তিনি তাঁর জামি গ্রন্থে ইমাম বুখারীর নাম মোট ১১৪ বার উল্লেখ করেছেন। হাদিসের বর্ণনায় বিবরণ বা বর্ণনাকারীদের তারতম্যের উল্লেখের সময় তিনি ইমাম বুখারীর 'কিতাব আত-তারিখ'কে সূত্র হিসেবে ব্যবহার করেছেন।",
      "ইমাম বুখারীর প্রশংসা\n\nইমাম তিরমিযী ইমাম বুখারীকে ইরাক বা খোরাসানে হাদিসের ক্ষেত্রে সবচেয়ে জ্ঞানী ব্যক্তি বলে প্রশংসা করেছেন। ইমাম বুখারীও তিরমিযীকে উচ্চ মর্যাদা দিতেন। বলা হয় যে তিনি তিরমিযীকে বলেছিলেন, 'আপনি আমার কাছ থেকে যতটা না উপকৃত হয়েছেন তার চেয়ে আমি আপনার কাছ থেকে বেশি উপকৃত হয়েছি।' ইমাম বুখারী তাঁর প্রণীত সহিহ বুখারীতে তিরমিযীর বর্ণিত দুইটি হাদিস লিপিবদ্ধ করেছেন।",
      "অন্যান্য শিক্ষকবৃন্দ\n\nইমাম তিরমিযী এছাড়াও ইমাম আবু দাউদ ও ইমাম মুসলিমের কাছ থেকে হাদিস বর্ণনা করেছেন। ইমাম মুসলিমও তাঁর সহিহ মুসলিম গ্রন্থে তিরমিযীর বর্ণিত হাদিস লিপিবদ্ধ করেছেন। তাঁর অন্যান্য শিক্ষকদের মধ্যে রয়েছেন কুতাইবা ইবনে সাঈদ (রহঃ), ইসহাক ইবনে মুসা (রহঃ), আবু রাজা উতাইবা ইবনে সাইদ (রহঃ), আলি ইবনে হুজর (রহঃ) এবং আরো অনেকে।",
      "জামি আত-তিরমিজি সংকলন\n\nইমাম তিরমিযী (রহঃ)-এর সবচেয়ে বড় অবদান হলো 'জামি আত-তিরমিজি' বা 'সুনান আত-তিরমিজি'। এই গ্রন্থের পূর্ণ নাম 'আল-জামি আল মুখতাসার মিন আস-সুনান আন-রাসুলিল্লাহ'। এই গ্রন্থে তিনি হাদিসের শব্দ, অর্থ, সনদ এবং ফিকহগত তাৎপর্য বিশ্লেষণ করেছেন।",
      "গ্রন্থের বৈশিষ্ট্য\n\nজামি আত-তিরমিজির বিশেষত্ব হলো প্রতিটি হাদিসের পরে তিনি হাদিসের মান (সহিহ, হাসান, দুর্বল) উল্লেখ করেছেন এবং ফিকহী মতামত ও বিভিন্ন মাযহাবের অবস্থান ব্যাখ্যা করেছেন। তাঁর কাছে ইমাম আবু হানিফার ফতোয়া উল্লেখের জন্য নির্ভরযোগ্য সূত্র ছিল না বিধায় ফকিহদের অভিমত বর্ণনার সময় তিনি আবু হানিফার নাম উল্লেখ করেননি। এর পরিবর্তে তিনি 'কুফার কিছু ব্যক্তি' বলে উল্লেখ করতেন।",
      "আশ-শামাইল আন-নাবাউয়িয়াহ\n\nজামি আত-তিরমিজি ছাড়াও তিনি 'আশ-শামাইল আন-নাবাউয়িয়াহ ওয়া আল-ফাদাইল আল-মুসতাফাউয়িয়াহ' রচনা করেছেন। এটি রাসূলুল্লাহ (সাঃ)-এর ব্যক্তি ও চরিত্র সম্পর্কে হাদিসের একটি সংগ্রহ। ইসলামি পণ্ডিতদের কাছে এটি হাদিস অধ্যয়নের জন্য একটি গুরুত্বপূর্ণ সম্পদ হিসেবে বিবেচিত হয়।",
      "অন্যান্য রচনাবলী\n\nতাঁর অন্যান্য রচনাবলীর মধ্যে রয়েছে 'আল-ইলাল আস-সুগরা' (হাদিসের ত্রুটি সম্পর্কে ছোট গ্রন্থ), 'আল-ইলাল আল-কুবরা' (হাদিসের ত্রুটি সম্পর্কে বড় গ্রন্থ), 'আজ-জুহদ' (যুহদ সম্পর্কে), 'আল-আসমা ওয়া আল-কুনা' (নাম ও উপনাম), 'কিতাব আত-তারিখ' (ইতিহাস গ্রন্থ) এবং আরো অনেক।",
      "মাযহাব\n\nইমাম তিরমিযী ইমাম বুখারীর খুব ঘনিষ্ঠ ছিলেন। তিনি শাফিয়ি বা হাম্বলি মাযহাবের অনুসারী ছিলেন। এমন হতে পারে যে তিনি নিজে একজন মুজতাহিদ ছিলেন অথবা ইমাম বুখারীর খুব ঘনিষ্ঠ হওয়ায় কিছু অভিমত অনুযায়ী তিনি তাঁর মাযহাব অনুসরণ করতেন।",
      "অন্ধত্ব\n\nইমাম যাহাবির মতানুযায়ী ইমাম তিরমিযী (রহঃ) তাঁর জীবনের শেষ দুই বছর অন্ধ অবস্থায় কাটান। বলা হয় যে আল্লাহর ভয়ে অথবা ইমাম বুখারীর মৃত্যুর কারণে অতিরিক্ত কান্নার জন্য তিনি দৃষ্টিহীন হয়েছিলেন। এ কারণে তাঁকে 'আদ-দাহহাক' (অন্ধ) লকব দেওয়া হয়েছিল।",
      "ইন্তেকাল\n\nইমাম তিরমিযী ২৭৯ হিজরির ১৩ রজব সোমবার রাতে (৮ অক্টোবর ৮৯২ খ্রিস্টাব্দ, রোববার রাত) বুগে ইন্তেকাল করেন। তাঁকে বর্তমান উজবেকিস্তানের তিরমিজ থেকে ৬০ কিমি উত্তরে শিরাবাদে দাফন করা হয়। তিরমিজে তিনি স্থানীয়ভাবে আবু ঈসা আত-তিরমিজি বা 'তিরমিজ উতা' (তিরমিজের পিতা) নামে পরিচিত।"
    ],
    "moral": "হাদিসের মান যাচাই ও ফিকহী ব্যাখ্যা প্রদান। ইমাম তিরমিযী (রহঃ) প্রতিটি হাদিসের মান উল্লেখ করে এবং ফিকহী মতামত ব্যাখ্যা করে হাদিসশাস্ত্রে অনন্য অবদান রেখেছেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_nasai",
    "categoryId": "imam_jibon",
    "title": "ইমাম নাসাঈ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম নাসাঈ (রহঃ)-এর পূর্ণ নাম আবু আবদুর রহমান আহমাদ ইবনে শুআইব ইবনে আলী ইবনে সিনান ইবনে বাহর আন-নাসাঈ। তিনি ২১৫ হিজরিতে (৮৩০ খ্রিস্টাব্দে) খোরাসানের নাসা শহরে জন্মগ্রহণ করেন এবং ৩০৩ হিজরিতে (৯১৫ খ্রিস্টাব্দে) দামেস্কে শহীদ হন। তিনি সিহাহ সিত্তাহর অন্যতম 'সুনান আন-নাসাঈ'-এর সংকলক।",
      "জন্ম ও প্রাথমিক জীবন\n\nইমাম নাসাঈ ২১৫ হিজরি সনে খোরাসানের নাসা শহরে জন্মগ্রহণ করেন। নাসা শহরটি বর্তমান তুর্কমেনিস্তানে অবস্থিত যা খোরাসানের অংশ। এটি পশ্চিম এশিয়া এবং মধ্য এশিয়ার একটি অঞ্চল যা ইসলামি শিক্ষাকেন্দ্রের জন্য সুপরিচিত। সেখানে ইমাম নাসাঈ 'হালকা' নামে পরিচিত জ্ঞান তপস্যার সমাবেশ-মজলিশে অংশ নিয়েছিলেন।",
      "প্রাথমিক শিক্ষা\n\nশৈশবকালে স্বদেশে তিনি যেসব খ্যাতিমান শায়খের কাছ থেকে শিক্ষার্জন করেন তাঁরা হলেন হুমাইদ ইবনে মাখলাদ (মৃত ২৪৪ হিজরি), আম্মার ইবনুল হাসান (মৃত ২৪২ হিজরি) প্রমুখ। শুধু স্বদেশেই তিনি সীমাবদ্ধ থাকেননি, জ্ঞান অর্জনের জন্য ইমাম নাসাঈ বিভিন্ন দেশে সফর করে হাদিসের বিখ্যাত শায়খদের সান্নিধ্য পান।",
      "বিস্তৃত সফর\n\nপ্রায় ১৫ বছর বয়সে তিনি কুতাইবাতে প্রথম যাত্রা শুরু করেন। তিনি ইরাক, কুফা, হিজাজ, সিরিয়া এবং মিশরের বিদ্বানদের কাছ থেকে জ্ঞান লাভ করে পুরো আরবীয় উপদ্বীপ অতিক্রম করেন এবং শেষ পর্যন্ত মিশরে স্থায়ীভাবে বসতি স্থাপন করেন। ইলমে হাদিসের অসংখ্য মনীষী থেকে তিনি হাদিস শ্রবণ করেছেন।",
      "শিক্ষকবৃন্দ\n\nইমাম ইবনু হাজার আল আসকালানী (রহঃ) বলেছেন, ইমাম নাসাঈ (রহঃ)-এর অসংখ্য শিক্ষক ছিলেন, তাঁদের সংখ্যা গোনা সম্ভব নয়, তবে তাঁর বেশিরভাগ শিক্ষকেরই নাম তাঁর সুনানে উল্লেখিত হয়ে গিয়েছে। সুনানু কুবরা-তে ইমাম নাসাঈ ৪০৩ জন শিক্ষকের নিকট থেকে এবং সুনানু ছুগরা তথা সুনানে নাসাঈ-তে ৩৩৫ জন শায়খের নিকট থেকে হাদিস বর্ণনা করেছেন।",
      "প্রধান শিক্ষকগণ\n\nতাঁর উল্লেখযোগ্য শিক্ষকের মধ্যে রয়েছেন ইসহাক ইবনু রাহওয়াইহ (যিনি ইমাম বুখারী রহঃ-এরও উস্তায), কুতাইবা ইবনু সাঈদ (মৃত ২৪০ হিজরি), মুহাম্মাদ ইবনু নযর, আলী ইবনু হাজার, ইউনুস ইবনু আব্দুল আলা, মুহাম্মাদ বিন বাশার, ইমাম আবূ দাঊদ সিজিস্তানী, বিশর ইবনে হেলাল, আল-হাসান ইবনুস সাববাহ আল-বাযযার এবং আরো অনেকে।",
      "সুনান আন-নাসাঈ\n\nইমাম নাসাঈ (রহঃ)-এর প্রধান গ্রন্থ 'সুনান আন-নাসাঈ' বা 'আল-মুজতাবা' হাদিসশাস্ত্রের অন্যতম নির্ভরযোগ্য গ্রন্থ। এই গ্রন্থে তিনি অত্যন্ত সতর্কতার সাথে সহিহ হাদিস সংকলন করেছেন। ইমাম নাসাঈ (রহঃ) হাদিসের সনদ যাচাইয়ে অত্যন্ত কঠোর ছিলেন এবং দুর্বল বর্ণনাকারীদের এড়িয়ে চলতেন।",
      "ছাত্রবৃন্দ\n\nতাঁর থেকে অনেক বিখ্যাত মুহাদ্দিসই হাদিস শাস্ত্র সম্পর্কে জ্ঞানার্জন করেছেন। তাঁদের মধ্যে বিখ্যাত কয়েকজনের নাম হলো ইমাম আবুল কাসিম তাবারানি, আবু জাফর আত-তাহাবী, ইব্রাহিম বিন মুহাম্মদ বিন সালিহ বিন সিনান, আবু আলী হোসাইন বিন মুহাম্মদ নিশাপুরী, মুহাম্মদ বিন মু'আভিয়া বিন আহমার আন্দালুসী, আল-হাসান বিন রাশিক, মুহাম্মদ বিন হাইওয়েহ, হামযা আল-কিনানী প্রমুখ।",
      "ফিকহী মাযহাব\n\nশাহ ওয়ালি উল্লাহ মুহাদ্দিসে দেহলভী, শাহ আবদুল আজিজ দেহলভী এবং অন্যান্য অনেক আলেমগণ তাঁকে শাফেয়ী মাযহাবের অনুসারী হিসাবে উল্লেখ করেছেন। তবে আল্লামা আনওয়ার শাহ কাশ্মীরি বিচার বিশ্লেষণ করে বলেছেন, ইমাম আবু দাউদ ও ইমাম আবু আব্দুর রহমান নাসাঈ (রহঃ) উভয়েই হাম্বলী মাযহাবের ছিলেন।",
      "হযরত আলী (রাঃ)-এর ফযীলত গ্রন্থ\n\nইমাম নাসাঈ (রহঃ) দামেস্কে অবস্থানকালে হযরত আলী (রাঃ)-এর ফযীলত সম্পর্কে একটি গ্রন্থ রচনা করেন। এই গ্রন্থে তিনি হযরত আলী (রাঃ)-এর মর্যাদা ও গুণাবলী সম্পর্কে সহিহ হাদিস সংকলন করেছিলেন। এতে কিছু লোক তাঁর প্রতি ক্ষুব্ধ হয় এবং তাঁকে মসজিদে প্রহার করে।",
      "শাহাদাত\n\nমসজিদে প্রহারের ফলে ইমাম নাসাঈ (রহঃ) গুরুতর আহত হন। এই আঘাতের ফলে তিনি ৩০৩ হিজরিতে (৯১৫ খ্রিস্টাব্দে) মক্কায় যাওয়ার পথে ইন্তেকাল করেন। তাঁকে মক্কায় দাফন করা হয়। তিনি সত্য প্রকাশের জন্য শাহাদাত বরণ করেছেন এবং হাদিসশাস্ত্রে তাঁর অবদান চিরস্মরণীয় হয়ে আছে।"
    ],
    "moral": "সত্যের পথে অটল থাকা এবং হাদিস যাচাইয়ে কঠোরতা। ইমাম নাসাঈ (রহঃ) সত্য প্রকাশের জন্য শাহাদাত বরণ করেছেন এবং হাদিস সংকলনে অত্যন্ত সতর্ক ছিলেন।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  },
  {
    "id": "imam_ibn_majah",
    "categoryId": "imam_jibon",
    "title": "ইমাম ইবনে মাজাহ (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম ইবনে মাজাহ (রহঃ)-এর পূর্ণ নাম আবু আবদিল্লাহ মুহাম্মাদ ইবনে ইয়াজিদ ইবনে মাজাহ আর-রাবঈ আল-কাযভীনী। তিনি ২০৯ হিজরিতে (৮২৪ খ্রিস্টাব্দে) ইরাকের প্রসিদ্ধ শহর কাযভীনে জন্মগ্রহণ করেন এবং ২৭৩ হিজরিতে (৮৮৭ খ্রিস্টাব্দে) সেখানেই ইন্তেকাল করেন। তিনি সিহাহ সিত্তাহর সর্বশেষ গ্রন্থ 'সুনান ইবনে মাজাহ'-এর সংকলক। তাঁর উপাধি ছিল 'আল-হাফিযুল কাবীর' (মহান হাফিয) এবং 'আল-মুফাসসির' (তাফসীরকার)।",
      "নাম ও পরিচিতি\n\nইমাম ইবনু মাজাহ-এর প্রকৃত নাম মুহাম্মাদ, পিতার নাম ইয়াযীদ, উপনাম আবু আব্দুল্লাহ। তাঁর পুরো বংশপরিক্রমা হলো 'আল-হাফিযুল কাবীর আল-মুফাসসির আবু আব্দুল্লাহ মুহাম্মাদ ইবনে ইয়াযীদ ইবনে আব্দুল্লাহ ইবনে মাজাহ আর-রাবঈ আল-কাযভীনী'। ইবনু মাজাহ-এর 'মাজাহ' নামটি কার উপাধি, এ ব্যাপারে ঐতিহাসিকদের মধ্যে মতবিরোধ রয়েছে। কেউ কেউ বলেন, মাজাহ তাঁর পিতার উপাধি, আবার কেউ বলেন, তাঁর দাদার উপাধি।",
      "জন্মস্থান\n\nমুসলিম জাহানের তৃতীয় খলীফা ওসমান বিন আফফান (রাঃ)-এর খেলাফতকালে কাযভীন শহরটি বিজিত হয়। এ শহরের প্রথম গভর্নর বা প্রশাসক ছিলেন বিশিষ্ট সাহাবী বারা ইবনু আযেব (রাঃ)। এই ঐতিহাসিক শহরেই ইমাম ইবনে মাজাহ জন্মগ্রহণ করেন।",
      "প্রাথমিক শিক্ষা\n\nইমাম ইবনু মাজাহ নিজ দেশেই প্রাথমিক শিক্ষা সমাপন করেন। এরপর তিনি কুরআনুল কারীম হিফয সম্পন্ন করেন। অতঃপর উচ্চশিক্ষা অর্জন এবং হাদিস সংগ্রহের জন্য তৎকালীন মুসলিম বিশ্বের প্রায় প্রতিটি দেশ ও জনপদের যুগশ্রেষ্ঠ মুহাদ্দিসদের দ্বারস্থ হয়েছেন।",
      "হাদিস সংগ্রহের সফর\n\nইমাম ইবনু মাজাহ ২৩০ হিজরি মোতাবেক ৮৪৪ খ্রিস্টাব্দে ২২ বছর বয়সে হাদিস সংগ্রহের উদ্দেশ্যে বিভিন্ন শহরের মুহাদ্দিসগণের নিকটে গমন করেন। তিনি হাদিস লিপিবদ্ধকরণ এবং শিক্ষার্জনের জন্য রায়, বসরা, কুফা, বাগদাদ, সিরিয়া, মিশর, হিজাজ, মক্কা প্রভৃতি দেশ ও জনপদে ভ্রমণ করেন এবং বহু মনীষীর নিকট থেকে হাদিস সংগ্রহ করেন। তিনি ১৫ বছরের অধিক সময় ইলম চর্চায় নিমগ্ন থাকেন।",
      "শিক্ষকমণ্ডলী\n\nইবনু মাজাহ দেশ-বিদেশের অনেক মনীষীর নিকট শিক্ষাগ্রহণ ও হাদিস সংগ্রহ করেছেন। তাঁর অসংখ্য উস্তাদের মধ্যে উল্লেখযোগ্য হলেন হাফেয আলী ইবনু মুহাম্মাদ আত-তানাফিসী, জুরারাহ ইবনুল মুগাল্লিস, মুসয়াব ইবনু আব্দুল্লাহ আয-যুবাইরী, সুয়াইদ ইবনে সাঈদ, আব্দুল্লাহ ইবনু মু'আবিয়া আল-জুমাহী, মুহাম্মাদ ইবনু রুমহ, ইবরাহীম ইবনুল মুনযির আল-হিফমী, মুহাম্মাদ ইবনু আব্দুল্লাহ ইবনে নুমাইর, আবু বকর ইবনু আবু শায়বা এবং আরো অনেকে।",
      "প্রিয় উস্তাদ\n\nবহু মুহাদ্দিসের নিকট থেকে হাদিস শিক্ষাগ্রহণ ও সংগ্রহ করলেও ইমাম ইবনু মাজাহ তাঁর সবচেয়ে প্রিয়তম উস্তাদ আবু বকর ইবনু আবু শায়বার নিকট থেকে সবচেয়ে বেশি উপকৃত হয়েছেন। তিনি তাঁর কাছ থেকে হাদিসের গভীর জ্ঞান অর্জন করেন।",
      "সুনান ইবনে মাজাহ\n\nইমাম ইবনে মাজাহ (রহঃ)-এর প্রধান গ্রন্থ 'সুনান ইবনে মাজাহ' সিহাহ সিত্তাহর ছয়টি গ্রন্থের মধ্যে সর্বশেষ। এই গ্রন্থে প্রায় ৪,০০০ হাদিস সংকলিত হয়েছে। গ্রন্থটিতে এমন কিছু হাদিস রয়েছে যা অন্য পাঁচটি গ্রন্থে নেই। এই কারণে এটি হাদিস গবেষকদের জন্য অত্যন্ত মূল্যবান।",
      "গ্রন্থের বৈশিষ্ট্য\n\nসুনান ইবনে মাজাহতে এমন অনেক হাদিস রয়েছে যা অন্য পাঁচটি সহিহ গ্রন্থে পাওয়া যায় না। তবে কিছু মুহাদ্দিসের মতে এতে কিছু দুর্বল হাদিসও রয়েছে। তবুও এটি সিহাহ সিত্তাহর অন্তর্ভুক্ত এবং হাদিস শাস্ত্রে এর গুরুত্ব অপরিসীম।",
      "অন্যান্য রচনাবলী\n\nআল-দাহাবীর মতানুসারে ইবনে মাজাহ-এর প্রধান রচনাগুলো হলো সুনান-এ-ইবনে মাজাহ (প্রধান ছয়টি হাদীস গ্রন্থের একটি), কিতাব আত-তাফসীর (আল-কুরআন-এর তাফসীর) এবং কিতাব আত-তারিক (ইতিহাস গ্রন্থ, মূলত হাদিসের বর্ণনাকারীদের তালিকা)। তবে সুনান ছাড়া অন্য দুটি গ্রন্থ বর্তমানে পাওয়া যায় না।",
      "ছাত্রবৃন্দ\n\nইমাম ইবনু মাজাহ-এর অসংখ্য ছাত্রের মধ্যে উল্লেখযোগ্য হলেন ইবরাহীম ইবনু দীনার আল-হাওশাবী, আহমাদ ইবনু ইবরাহীম আল-কাযভীনী (তিনি হাফেয আবু ইয়া'লা আল-খলীলীর দাদা), আবুত তাইয়্যেব আহমাদ ইবনু রাওহিন আল-বাগদাদী আশ-শা'রানী, আবু আমর আহমাদ ইবনু মুহাম্মাদ ইবনে হাকীম আল-মাদীনী আল-ইস্পাহানী এবং আরো অনেকে।",
      "মৃত্যু\n\nইবনু মাজাহ-এর মৃত্যু তারিখ সম্পর্কে মতভেদ রয়েছে। ইবনু কাসীর ও জামালুদ্দীন ইউসুফ আল-মিযযী বলেন, ইবনু মাজাহ ২৭৩ হিজরী ২২ রামাযান মোতাবেক ২০ নভেম্বর ৮৮৬ খ্রিস্টাব্দে সোমবার মৃত্যুবরণ করেন। পরের দিন মঙ্গলবার তাঁকে দাফন করা হয়। মৃত্যুকালে তাঁর বয়স হয়েছিল ৬৪ বছর।",
      "জানাযা ও দাফন\n\nতাঁকে গোসল করান মুহাম্মাদ ইবনে আলী কেহেরমান এবং ইবরাহীম ইবনে দীনার। জানাযায় ইমামতি করেন স্বীয় ভাই আবু বকর এবং কবরে লাশ নামান তাঁর ভাই আবু বকর ও আবু আব্দুল্লাহ এবং স্বীয় পুত্র আব্দুল্লাহ ইবনে মুহাম্মাদ ইবনে ইয়াযীদ। তাঁর সংকলিত সুনান ইবনে মাজাহ আজও সারা বিশ্বের মুসলমানদের কাছে হাদিসের অন্যতম প্রধান গ্রন্থ হিসেবে সম্মানিত।"
    ],
    "moral": "হাদিস সংকলনে পরিশ্রম এবং অনন্য হাদিস সংরক্ষণ। ইমাম ইবনে মাজাহ (রহঃ) এমন অনেক হাদিস সংকলন করেছেন যা অন্য গ্রন্থে পাওয়া যায় না।",
    "source": "ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা; ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব"
  }
]
