[
  {
    "id": "imam_abu_hanifa",
    "categoryId": "imam_jibon",
    "title": "ইমাম আবু হানিফা (রহঃ)",
    "summary": "",
    "paragraphs": [
      "ইমাম আবু হানিফার প্রকৃত নাম ছিল আল-নু'মান ইবনে সাবিত। তিনি ছিলেন ইসলামী আইনশাস্ত্রের (ফিকহ) চার সুন্নি মাযহাবের মধ্যে প্রথম এবং সর্বশ্রেষ্ঠ ইমাম। তাঁকে 'আল-ইমাম আল-আ'যম' (সর্বশ্রেষ্ঠ ইমাম) উপাধি দেওয়া হয়।",
      "জন্ম ও বংশ পরিচয়\n\n৮০ হিজরিতে (৬৯৯ খ্রিস্টাব্দে) ইরাকের বিখ্যাত জ্ঞানকেন্দ্র কুফায় তিনি জন্মগ্রহণ করেন। তাঁর পরিবার ছিল পারস্য বংশোদ্ভূত এবং অর্থনৈতিকভাবে সচ্ছল। তাঁর পিতা সাবিত একজন সফল রেশমী কাপড়ের ব্যবসায়ী ছিলেন। এই পারিবারিক সচ্ছলতা তাঁকে নির্বিঘ্নে জ্ঞান অন্বেষণে মনোযোগ দিতে সাহায্য করেছিল।",
      "তাবেয়ী মর্যাদা\n\nতিনি ছিলেন তাবেয়ী প্রজন্মের অন্তর্ভুক্ত। নির্ভরযোগ্য সূত্র অনুসারে, তিনি জীবনের প্রথম দিকে আনাস ইবনে মালিক (রাঃ) সহ কয়েকজন সাহাবীর সাক্ষাৎ লাভের সৌভাগ্য অর্জন করেন।",
      "ব্যবসা থেকে জ্ঞান সাধনায়\n\nইমাম আবু হানিফা (রহঃ) প্রথম জীবনে বাবার ব্যবসায় যোগ দেন এবং তাঁর অত্যন্ত সততার জন্য ব্যবসায়িক মহলে সুপরিচিত ছিলেন। কিন্তু কুফার প্রখ্যাত আলেম শা'বি (রহঃ)-এর অনুপ্রেরণায় তিনি জ্ঞান সাধনার দিকে ঝুঁকে পড়েন।",
      "প্রধান শিক্ষক\n\nতিনি তাঁর জীবনের প্রায় ১৮ বছর কুফার শ্রেষ্ঠ ফকীহ হাম্মাদ ইবনে আবি সুলায়মান (রহঃ)-এর মজলিসে অতিবাহিত করেন। হাম্মাদ (রহঃ)-এর মৃত্যুর পর, তাঁর ছাত্ররা ইমাম আবু হানিফা (রহঃ)-কেই তাঁর স্থলাভিষিক্ত হিসেবে মনোনীত করেন।",
      "বিস্তৃত জ্ঞান অন্বেষণ\n\nতিনি শুধুমাত্র কুফাতেই সীমাবদ্ধ থাকেননি। তিনি মক্কা, মদীনা এবং অন্যান্য জ্ঞানকেন্দ্রেও বহুবার সফর করে হাদিস ও ফিকহের জ্ঞান অর্জন করেন। তাঁর রচিত গ্রন্থের মধ্যে ইসলামী আকীদা সম্পর্কিত 'আল-ফিকহুল আকবর' এবং হাদিস সংকলন 'কিতাবুল আছার' অন্যতম।",
      "ফিকহে বৈপ্লবিক পদ্ধতি\n\nইমাম আবু হানিফা (রহঃ) তাঁর ফিকহী মাযহাব (হানাফি মাযহাব)-কে একটি বৈপ্লবিক পদ্ধতির মাধ্যমে সুসংগঠিত করেন। তিনি প্রায় ৪০ জন বিশেষজ্ঞ ফকীহ, মুহাদ্দিস ও উসূলবিদকে নিয়ে একটি ফিকহী গবেষণা পরিষদ গঠন করেন।",
      "গবেষণা পরিষদ\n\nএই মজলিসে একটি মাসআলা নিয়ে বিস্তারিত আলোচনার পর সম্মিলিত সিদ্ধান্তের মাধ্যমে ফায়সালা লিপিবদ্ধ করা হতো। ইসলামী আইনের ইতিহাসে এটি ছিল এক অনন্য পদ্ধতি।",
      "আইনের উৎস\n\nতাঁর ফিকহের ভিত্তি ছিল কুরআন, সুন্নাহ, সাহাবীদের ইজমা এবং এরপর কিয়াস (যুক্তি-তুলনা) ও ইসতিহসান (আইনী পচ্ছন্দ)-এর ব্যবহার। এই পদ্ধতি হানাফি ফিকহকে বাস্তব জীবনের প্রতিটি ক্ষেত্রে প্রয়োগের জন্য উপযোগী করে তোলে। তিনি হাদিসের বিশুদ্ধতার বিষয়ে অত্যন্ত কঠোর ছিলেন এবং শুধু শক্তিশালী ও নির্ভরযোগ্য হাদিসকেই ফিকহী বিধানে ব্যবহার করতেন।",
      "ব্যক্তিগত চরিত্র ও তাকওয়া\n\nইমাম আবু হানিফা (রহঃ)-এর ব্যক্তিগত জীবন ছিল উচ্চতর তাকওয়া (খোদাভীতি) ও ইবাদতের আদর্শ। তিনি দীর্ঘকাল ধরে সারারাত জেগে ইবাদত করতেন বলে বর্ণিত আছে।",
      "সততা ও দানশীলতা\n\nব্যবসায় তিনি ছিলেন অত্যন্ত সৎ। একবার তাঁর কর্মচারী ভুল করে ত্রুটিপূর্ণ কাপড় বিক্রি করলে, তিনি সেই কাপড়ের মূল্য দান করে দেন। তিনি তাঁর ছাত্রদের মাসিক ভাতা প্রদান করতেন এবং নিজের উপার্জনের বেশিরভাগই অভাবী ও জ্ঞান অন্বেষণকারীদের জন্য খরচ করতেন।",
      "শাসকদের সাথে আপসহীন অবস্থান\n\nইমাম আবু হানিফা (রহঃ) তাঁর জ্ঞান এবং নীতির প্রশ্নে ছিলেন আপসহীন ও নির্ভীক। তিনি কখনোই কোনো শাসকের অন্যায্য কাজে সহযোগিতা করতে রাজি হননি।",
      "উমাইয়া শাসকের প্রস্তাব প্রত্যাখ্যান\n\nউমাইয়া খলিফা মারওয়ান ইবনে মুহাম্মাদ তাঁকে কুফার প্রধান বিচারপতির (কাজীর) পদ গ্রহণের প্রস্তাব দিলে তিনি তা প্রত্যাখ্যান করেন। এই অস্বীকৃতির জন্য তাঁকে শারীরিক শাস্তি ভোগ করতে হয়।",
      "আব্বাসীয় খলিফার প্রস্তাব প্রত্যাখ্যান\n\nপরবর্তীতে আব্বাসীয় খলিফা আল-মানসুর তাঁকে বাগদাদের প্রধান বিচারপতির (কাজীউল কুজাত) পদ গ্রহণের জন্য চাপ দেন। ইমাম (রহঃ) দৃঢ়ভাবে বলেন যে, তিনি এই পদের যোগ্য নন এবং এটি গ্রহণ করতে রাজি নন।",
      "কারাবরণ ও নির্যাতন\n\nখলিফা আল-মানসুরের ক্রমাগত চাপ ও অস্বীকৃতির ফলে ইমাম আবু হানিফা (রহঃ)-কে কারাগারে বন্দী করা হয় এবং সেখানে তাঁর উপর কঠিন নির্যাতন চালানো হয়।",
      "ইন্তেকাল ও ঐতিহাসিক মর্যাদা\n\nদীর্ঘদিন শাসকের নির্যাতনের শিকার হয়ে ইমাম আবু হানিফা (রহঃ) ১৫০ হিজরিতে (৭৬৭ খ্রিস্টাব্দে) ইরাকের বাগদাদ শহরে কারাগারেই ইন্তেকাল করেন। তাঁর ইন্তেকালের পর তাঁর জানাযায় এত মানুষের সমাগম হয়েছিল যে, ভিড়ের কারণে ছয়বার জানাযার সালাত আদায় করতে হয়েছিল।",
      "উত্তরাধিকার\n\nতাঁর প্রতিষ্ঠিত হানাফি মাযহাব তাঁর দুই প্রধান ছাত্র ইমাম আবু ইউসুফ (রহঃ) এবং ইমাম মুহাম্মদ (রহঃ)-এর মাধ্যমে সুসংগঠিত ও প্রচারিত হয়। বর্তমানে বিশ্বের বিপুল সংখ্যক মুসলিম তাঁর মাযহাবের অনুসারী। ইমাম আবু হানিফা (রহঃ) তাঁর আপসহীনতা, গভীর জ্ঞান ও অসাধারণ তাকওয়ার জন্য ইসলামী ইতিহাসের ইমামে আ'যম হিসেবে সর্বদা শ্রদ্ধার আসনে অধিষ্ঠিত থাকবেন।"
    ],
    "moral": "জ্ঞান, সততা ও নীতির প্রশ্নে কখনো আপস করা যায় না। ইমাম আবু হানিফা (রহঃ) শাসকের চাপ ও নির্যাতনের মুখেও তাঁর নীতি থেকে সরে আসেননি।",
    "source": "ইবনে হাজার আল-আসকালানী, তাহযীবুত তাহযীব; আল-খতিব আল-বাগদাদী, তারীখে বাগদাদ"
  }
]
