[
  {
    "id": "jannat_jahannam_jannat_description",
    "categoryId": "jannat_jahannam",
    "title": "জান্নাতের বর্ণনা: চিরস্থায়ী সুখের আবাস",
    "summary": "জান্নাত হলো আল্লাহর মুমিন বান্দাদের জন্য প্রস্তুতকৃত চিরস্থায়ী সুখের আবাস। যেখানে থাকবে অকল্পনীয় নিয়ামত, সৌন্দর্য এবং শান্তি। কুরআন ও হাদিসে জান্নাতের এমন বর্ণনা এসেছে যা মানুষের কল্পনাকেও ছাড়িয়ে যায়।",
    "paragraphs": [
      "আল্লাহ তায়ালা পবিত্র কুরআনে জান্নাতের বর্ণনা দিয়ে বলেন:",
      "فِيهَا مَا تَشْتَهِيهِ الْأَنفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ وَأَنتُمْ فِيهَا خَالِدُونَ",
      "অর্থাৎ, সেখানে রয়েছে যা মন চায় এবং যাতে চোখ তৃপ্ত হয়। আর তোমরা সেখানে চিরকাল থাকবে। [সূরা আয-যুখরুফ: ৭১]",
      "**রাসূলুল্লাহ (সাঃ) বলেছেন:** 'জান্নাতে এমন সব নিয়ামত রয়েছে যা কোনো চোখ দেখেনি, কোনো কান শোনেনি এবং কোনো মানুষের হৃদয়ে তার কল্পনাও আসেনি।' [সহীহ বুখারী: ৩২৪৪]",
      "জান্নাতের মাটি হবে মিশক ও জাফরানের। সেখানে প্রবাহিত হবে দুধ, মধু, পানি এবং শরাবের নহর যা পান করলে মাথা ঘুরবে না বা কোনো ক্ষতি হবে না। জান্নাতের গাছগুলোর কাণ্ড হবে স্বর্ণ ও রূপার। সেখানে থাকবে অসংখ্য প্রাসাদ, বাগান এবং সুউচ্চ প্রাসাদ।",
      "জান্নাতে কোনো কষ্ট, দুঃখ, রোগ, বার্ধক্য বা মৃত্যু থাকবে না। সেখানে মানুষ চিরযুবা থাকবে এবং কখনো ক্লান্ত হবে না। জান্নাতবাসীরা পরস্পরকে ভালোবাসবে, কোনো হিংসা-বিদ্বেষ থাকবে না।",
      "জান্নাতের সবচেয়ে বড় নিয়ামত হবে আল্লাহ তায়ালার দিদার লাভ করা। মুমিনরা তাঁদের প্রভুকে দেখতে পাবেন, যা হবে সর্বোচ্চ আনন্দ ও তৃপ্তির মুহূর্ত।",
      "আল্লাহ তায়ালা বলেন: ",
      "وُجُوهٌ يَوْمَئِذٍ نَّاضِرَةٌ ۝ إِلَىٰ رَبِّهَا نَاظِرَةٌ",
      "অর্থাৎ, সেদিন কিছু চেহারা হবে উজ্জ্বল, তারা তাদের রবের দিকে তাকিয়ে থাকবে। [সূরা আল-কিয়ামাহ: ২২-২৩]",
      "জান্নাতে প্রবেশের জন্য প্রয়োজন ঈমান, সৎকর্ম, তাকওয়া এবং আল্লাহর রহমত। দুনিয়ার ক্ষণস্থায়ী কষ্ট সহ্য করে যারা আল্লাহর পথে অবিচল থাকবে, তাদের জন্য অপেক্ষা করছে এই অনন্ত সুখের আবাস।"
    ],
    "moral": "জান্নাত হলো আল্লাহর সর্বশ্রেষ্ঠ পুরস্কার। দুনিয়ার জীবন ক্ষণস্থায়ী, কিন্তু জান্নাতের সুখ চিরস্থায়ী। তাই আমাদের উচিত দুনিয়ার জীবনে আল্লাহর আনুগত্য করা এবং জান্নাতের জন্য প্রস্তুতি নেওয়া।",
    "source": "পবিত্র কুরআন (সূরা আয-যুখরুফ: ৭১, সূরা আল-কিয়ামাহ: ২২-২৩) এবং সহীহ বুখারী (৩২৪৪)।"
  },
  {
    "id": "jannat_jahannam_jahannam_warning",
    "categoryId": "jannat_jahannam",
    "title": "জাহান্নামের ভয়াবহতা: পাপীদের শাস্তির স্থান",
    "summary": "জাহান্নাম হলো কাফির ও পাপীদের জন্য প্রস্তুতকৃত শাস্তির স্থান। কুরআন ও হাদিসে জাহান্নামের এমন ভয়াবহ বর্ণনা এসেছে যা শুনলে মুমিনের হৃদয় কেঁপে ওঠে এবং তাকে পাপ থেকে বিরত থাকতে উদ্বুদ্ধ করে।",
    "paragraphs": [
      "আল্লাহ তায়ালা পবিত্র কুরআনে জাহান্নাম সম্পর্কে সতর্ক করে বলেন:",
      "فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَافِرِينَ",
      "অর্থাৎ, সুতরাং তোমরা সেই আগুন থেকে বাঁচো, যার ইন্ধন হবে মানুষ ও পাথর, যা কাফিরদের জন্য প্রস্তুত করা হয়েছে। [সূরা আল-বাকারাহ: ২৪]",
      "**জাহান্নামের আগুন দুনিয়ার আগুনের চেয়ে সত্তর গুণ বেশি উত্তপ্ত। রাসূলুল্লাহ (সাঃ) বলেছেন:** 'তোমাদের এই আগুন জাহান্নামের আগুনের সত্তর ভাগের এক ভাগ।' [সহীহ বুখারী: ৩২৬৫]",
      "জাহান্নামের শাস্তি হবে বহুমুখী। সেখানে থাকবে প্রচণ্ড আগুন, ফুটন্ত পানি, পুঁজ ও রক্তের পানীয়, যাক্কুম নামক কাঁটাযুক্ত বিষাক্ত বৃক্ষের ফল। জাহান্নামীদের চামড়া পুড়ে গেলে আবার নতুন চামড়া সৃষ্টি করা হবে যাতে তারা শাস্তির স্বাদ পেতে থাকে।",
      "আল্লাহ তায়ালা বলেন:",
      "إِنَّ الَّذِينَ كَفَرُوا بِآيَاتِنَا سَوْفَ نُصْلِيهِمْ نَارًا ۖ كُلَّمَا نَضِجَتْ جُلُودُهُم بَدَّلْنَاهُمْ جُلُودًا غَيْرَهَا لِيَذُوقُوا الْعَذَابَ",
      "অর্থাৎ, যারা আমার আয়াতসমূহ অস্বীকার করেছে, আমি অবশ্যই তাদেরকে আগুনে প্রবেশ করাব। যখনই তাদের চামড়া পুড়ে যাবে, আমি তাদেরকে নতুন চামড়া দিয়ে বদলে দেব, যাতে তারা শাস্তি আস্বাদন করতে থাকে। [সূরা আন-নিসা: ৫৬]",
      "জাহান্নামে থাকবে বিভিন্ন স্তর। সবচেয়ে নিচের স্তরে থাকবে মুনাফিকরা। প্রতিটি স্তরের শাস্তি হবে ভিন্ন ভিন্ন, পাপের পরিমাণ অনুযায়ী।",
      "জাহান্নামের সবচেয়ে ভয়াবহ দিক হলো সেখানে কোনো মৃত্যু নেই। জাহান্নামীরা মৃত্যু কামনা করবে কিন্তু মৃত্যু আসবে না। তারা চিরকাল সেখানে শাস্তি ভোগ করতে থাকবে।",
      "তবে আল্লাহ অসীম দয়ালু। যারা দুনিয়ায় তাওবা করবে, সৎকর্ম করবে এবং আল্লাহর কাছে ক্ষমা চাইবে, আল্লাহ তাদের ক্ষমা করে দেবেন। কারণ আল্লাহ বলেন:",
      "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا",
      "অর্থাৎ, বলো, হে আমার বান্দারা! যারা নিজেদের উপর বাড়াবাড়ি করেছ, তোমরা আল্লাহর রহমত থেকে নিরাশ হয়ো না। নিশ্চয় আল্লাহ সকল পাপ ক্ষমা করে দেন। [সূরা আয-যুমার: ৫৩]"
    ],
    "moral": "জাহান্নামের ভয়াবহতা আমাদের পাপ থেকে বিরত থাকতে এবং আল্লাহর আনুগত্য করতে উদ্বুদ্ধ করে। তবে আল্লাহর রহমত অসীম, তাই কখনো নিরাশ না হয়ে তাওবা করা এবং সৎপথে ফিরে আসা উচিত।",
    "source": "পবিত্র কুরআন (সূরা আল-বাকারাহ: ২৪, সূরা আন-নিসা: ৫৬, সূরা আয-যুমার: ৫৩) এবং সহীহ বুখারী (৩২৬৫)।"
  },
  {
    "id": "jannat_jahannam_bilal_dream",
    "categoryId": "jannat_jahannam",
    "title": "বিলাল (রাঃ)-এর জান্নাতের স্বপ্ন: জুতার শব্দ",
    "summary": "একবার রাসূলুল্লাহ (সাঃ) হযরত বিলাল (রাঃ)-কে জিজ্ঞাসা করলেন তাঁর সবচেয়ে আশাব্যঞ্জক আমল কী। বিলাল (রাঃ) এক অসাধারণ ঘটনা বর্ণনা করলেন যা জান্নাতের পথ দেখায়।",
    "paragraphs": [
      "একদিন ফজরের নামাজের পর রাসূলুল্লাহ (সাঃ) হযরত বিলাল (রাঃ)-কে ডেকে বললেন:",
      "'হে বিলাল! ইসলামে তোমার সবচেয়ে আশাব্যঞ্জক আমল কোনটি বলে তুমি মনে কর? কারণ আমি গত রাতে জান্নাতে তোমার জুতার শব্দ শুনেছি।'",
      "বিলাল (রাঃ) অবাক হয়ে বললেন:'ইয়া রাসূলাল্লাহ! আমি এমন কোনো বিশেষ আমল করিনি। তবে একটি বিষয় আছে—আমি যখনই অজু করি, তখনই আমি দুই রাকাত নামাজ পড়ি। আর দিনে বা রাতে যখনই আমার অজু ভেঙে যায়, আমি পুনরায় অজু করে দুই রাকাত নামাজ পড়ি।'",
      "রাসূলুল্লাহ (সাঃ) মুসকুরিয়ে বললেন: 'এই আমলের কারণেই তুমি জান্নাতে এই মর্যাদা পেয়েছ।' [সহীহ মুসলিম: ২৪৫৮]",
      "এই ঘটনা থেকে বোঝা যায় যে, ছোট ছোট নেক আমল যদি নিয়মিত ও আন্তরিকতার সাথে করা হয়, তাহলে তা জান্নাতের পথ সুগম করে দেয়।",
      "বিলাল (রাঃ) ছিলেন ইসলামের প্রথম মুয়াজ্জিন। তিনি মক্কায় দাসত্বের সময় ভয়াবহ নির্যাতন সহ্য করেছিলেন শুধুমাত্র 'আহাদ, আহাদ' (আল্লাহ এক, আল্লাহ এক) বলার কারণে। তাঁর ঈমান ও ধৈর্যের পুরস্কার হিসেবে আল্লাহ তাঁকে জান্নাতের সুসংবাদ দিয়েছিলেন।",
      "এই হাদিস আমাদের শেখায় যে, জান্নাত লাভের জন্য বড় বড় কাজ করতে হবে এমন নয়। বরং ছোট ছোট নেক আমল নিয়মিত ও একনিষ্ঠভাবে করলেই জান্নাতের দরজা খুলে যায়।"
    ],
    "moral": "ছোট ছোট নেক আমল যদি নিয়মিত ও আন্তরিকতার সাথে করা হয়, তাহলে তা জান্নাতের পথ সুগম করে। প্রতিটি অজুর পর দুই রাকাত নামাজ পড়ার মতো সহজ আমলও জান্নাতে উচ্চ মর্যাদার কারণ হতে পারে।",
    "source": "সহীহ মুসলিম (২৪৫৮)।"
  }
]
