[
  {
    "id": "khulafa_jibon_abu_bakr_cave",
    "categoryId": "khulafa_jibon",
    "title": "আবু বকর (রাঃ): গুহায় রাসূলের সঙ্গী",
    "summary": "হিজরতের সময় রাসূলুল্লাহ (সাঃ) যখন সওর গুহায় আশ্রয় নিয়েছিলেন, তখন আবু বকর (রাঃ) তাঁর একমাত্র সঙ্গী ছিলেন। কাফিররা গুহার মুখে এসে দাঁড়ালে আবু বকর (রাঃ) ভয় পেয়েছিলেন, কিন্তু রাসূল (সাঃ) তাঁকে সান্ত্বনা দিয়েছিলেন।",
    "paragraphs": [
      "যখন কাফিররা রাসূলুল্লাহ (সাঃ)-কে হত্যা করার ষড়যন্ত্র করল, তখন আল্লাহ তায়ালা তাঁকে মক্কা ছেড়ে মদীনায় হিজরত করার নির্দেশ দিলেন।",
      "রাসূলুল্লাহ (সাঃ) আবু বকর (রাঃ)-কে সাথে নিয়ে রাতের অন্ধকারে মক্কা ছেড়ে বের হলেন। তাঁরা সওর পর্বতের একটি গুহায় আশ্রয় নিলেন।",
      "আবু বকর (রাঃ) বলেন: 'আমি গুহায় প্রবেশের আগে নিজে ভেতরে ঢুকলাম এবং পরিষ্কার করলাম। আমি দেখলাম গুহার মধ্যে কিছু ছিদ্র আছে। আমি আমার কাপড় ছিঁড়ে সেগুলো বন্ধ করে দিলাম। তারপর রাসূলুল্লাহ (সাঃ)-কে ভেতরে আসতে বললাম।'",
      "রাসূলুল্লাহ (সাঃ) গুহায় প্রবেশ করলেন এবং আবু বকর (রাঃ)-এর কোলে মাথা রেখে ঘুমিয়ে পড়লেন। হঠাৎ একটি ছিদ্র থেকে বিষাক্ত কিছু বের হয়ে আবু বকর (রাঃ)-এর পায়ে আঘাত করল। তিনি ব্যথা পেলেন কিন্তু নড়লেন না, যাতে রাসূলুল্লাহ (সাঃ)-এর ঘুম ভেঙে না যায়। তাঁর চোখ থেকে অশ্রু গড়িয়ে পড়ল এবং রাসূলুল্লাহ (সাঃ)-এর মুখে পড়ল। রাসূল (সাঃ) জেগে উঠলেন এবং তাঁর পায়ে থুথু লাগিয়ে দিলেন, আর সাথে সাথে ব্যথা চলে গেল।",
      "তিন দিন পর কাফিররা তাঁদের খুঁজতে খুঁজতে গুহার মুখে এসে দাঁড়াল। আবু বকর (রাঃ) বলেন: ",
      "'ইয়া রাসূলাল্লাহ! তারা যদি তাদের পায়ের নিচে তাকায়, তাহলে আমাদের দেখে ফেলবে।'",
      "রাসূলুল্লাহ (সাঃ) শান্তভাবে বললেন: ",
      "لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
      "'চিন্তা করো না, নিশ্চয় আল্লাহ আমাদের সাথে আছেন।' [সহীহ বুখারী: ৩৬৫৩]",
      "আল্লাহ তায়ালা এই ঘটনা কুরআনে উল্লেখ করেছেন: ",
      "إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا",
      "অর্থাৎ, যখন তিনি তাঁর সঙ্গীকে বলেছিলেন: চিন্তা করো না, নিশ্চয় আল্লাহ আমাদের সাথে আছেন। [সূরা আত-তাওবাহ: ৪০]",
      "আল্লাহ তায়ালা গুহার মুখে মাকড়সার জাল এবং কবুতরের বাসা তৈরি করে দিলেন। কাফিররা দেখে ভাবল, এখানে কেউ প্রবেশ করেনি, তাই তারা ফিরে গেল।",
      "আবু বকর (রাঃ) ছিলেন রাসূলুল্লাহ (সাঃ)-এর সবচেয়ে বিশ্বস্ত সাহাবী। তাঁকে 'সিদ্দীক' (সত্যবাদী) উপাধি দেওয়া হয়েছিল। তিনি প্রথম খলীফা হিসেবে ইসলামকে সুদৃঢ় করেছিলেন।"
    ],
    "moral": "আল্লাহর উপর পূর্ণ ভরসা রাখলে তিনি অসম্ভবকে সম্ভব করে দেন। আবু বকর (রাঃ)-এর ত্যাগ, বিশ্বস্ততা এবং রাসূলের প্রতি ভালোবাসা আমাদের জন্য অনুকরণীয়।",
    "source": "পবিত্র কুরআন (সূরা আত-তাওবাহ: ৪০) এবং সহীহ বুখারী (৩৬৫৩)।"
  },
  {
    "id": "khulafa_jibon_umar_justice",
    "categoryId": "khulafa_jibon",
    "title": "উমর (রাঃ): ন্যায়বিচারের প্রতীক",
    "summary": "উমর (রাঃ) ছিলেন ইসলামের দ্বিতীয় খলীফা এবং ন্যায়বিচারের এক জীবন্ত প্রতীক। একবার মিশরের গভর্নরের ছেলে এক কপ্টিক খ্রিস্টানকে মারধর করেছিল। উমর (রাঃ) সেই মজলুমকে ন্যায়বিচার দিয়ে ইসলামের সুবিচারের এক অনন্য দৃষ্টান্ত স্থাপন করেছিলেন।",
    "paragraphs": [
      "উমর (রাঃ) যখন খলীফা ছিলেন, তখন ইসলামী সাম্রাজ্য বিশাল এলাকা জুড়ে বিস্তৃত ছিল। মিশরের গভর্নর ছিলেন আমর ইবনুল আস (রাঃ)।",
      "একদিন মিশর থেকে এক কপ্টিক খ্রিস্টান যুবক মদীনায় এসে উমর (রাঃ)-এর কাছে অভিযোগ করল: ",
      "'হে আমীরুল মুমিনীন! আমি আমর ইবনুল আসের ছেলের সাথে ঘোড়দৌড় প্রতিযোগিতায় অংশ নিয়েছিলাম এবং আমি জিতে গিয়েছিলাম। কিন্তু সে রাগে আমাকে চাবুক মেরে বলল: আমি গভর্নরের ছেলে!'",
      "উমর (রাঃ) এই কথা শুনে অত্যন্ত রাগান্বিত হলেন। তিনি সাথে সাথে আমর ইবনুল আস (রাঃ) এবং তাঁর ছেলেকে মদীনায় ডেকে পাঠালেন।",
      "তাঁরা মদীনায় এলে উমর (রাঃ) সেই কপ্টিক যুবককে ডেকে বললেন: ",
      "'নাও, এই চাবুক নিয়ে তুমি গভর্নরের ছেলেকে মারো, যেমন সে তোমাকে মেরেছিল।'",
      "যুবকটি চাবুক দিয়ে গভর্নরের ছেলেকে মারল। উমর (রাঃ) বললেন: 'এবার তার বাবা আমর ইবনুল আসের মাথায়ও মারো, কারণ তার ছেলে তার ক্ষমতার অহংকারে তোমাকে মেরেছিল।'",
      "যুবকটি বলল: 'না, হে আমীরুল মুমিনীন! আমি যাকে মারার ছিল তাকে মেরেছি। আমি সন্তুষ্ট।'",
      "তারপর উমর (রাঃ) আমর ইবনুল আসের দিকে ফিরে বিখ্যাত সেই কথা বললেন: ",
      "مَتَى اسْتَعْبَدْتُمُ النَّاسَ وَقَدْ وَلَدَتْهُمْ أُمَّهَاتُهُمْ أَحْرَارًا",
      "'তোমরা কখন থেকে মানুষকে দাস বানিয়ে ফেললে, অথচ তাদের মায়েরা তাদের স্বাধীন হিসেবে জন্ম দিয়েছিল?'",
      "এই ঘটনা পুরো মুসলিম বিশ্বে ছড়িয়ে পড়ল এবং মানুষ বুঝল যে, ইসলামে ধনী-গরীব, শাসক-প্রজা সবাই আইনের সামনে সমান।",
      "উমর (রাঃ) তাঁর শাসনামলে রাতের বেলা ছদ্মবেশে বের হতেন এবং প্রজাদের অবস্থা দেখতেন। একবার তিনি একজন বিধবা মহিলার ঘরে কান্নার শব্দ শুনলেন। ভেতরে গিয়ে দেখলেন, তার বাচ্চারা ক্ষুধার্ত। উমর (রাঃ) নিজে তাঁর কাঁধে আটার বস্তা নিয়ে এসে তাদের জন্য খাবার রান্না করে দিলেন।"
    ],
    "moral": "ইসলামে সবাই আইনের সামনে সমান। ক্ষমতা ও পদমর্যাদা কাউকে অন্যায় করার অধিকার দেয় না। উমর (রাঃ)-এর ন্যায়বিচার এবং প্রজাদের প্রতি দায়িত্বশীলতা প্রতিটি শাসকের জন্য অনুকরণীয়।",
    "source": "তারিখুল খুলাফা এবং ইসলামী ইতিহাস গ্রন্থসমূহ।"
  },
  {
    "id": "khulafa_jibon_uthman_generosity",
    "categoryId": "khulafa_jibon",
    "title": "উসমান (রাঃ): দানশীলতার মহান দৃষ্টান্ত",
    "summary": "উসমান (রাঃ) ছিলেন অত্যন্ত ধনী, কিন্তু তিনি তাঁর সম্পদ আল্লাহর পথে ব্যয় করতেন। তাবুক যুদ্ধের সময় তিনি এত বিশাল দান করেছিলেন যে রাসূলুল্লাহ (সাঃ) বলেছিলেন: 'আজকের পর উসমান যা-ই করুক, তা তার ক্ষতি করবে না।'",
    "paragraphs": [
      "উসমান (রাঃ) ছিলেন মক্কার অন্যতম ধনী ব্যবসায়ী। ইসলাম গ্রহণের পর তিনি তাঁর সম্পদ আল্লাহর পথে ব্যয় করতে শুরু করলেন।",
      "মদীনায় হিজরতের পর মুসলমানদের পানির সংকট ছিল। একটি কুয়া ছিল যার নাম 'বীরে রুমা', কিন্তু সেটি একজন ইহুদীর মালিকানায় ছিল এবং সে অত্যধিক মূল্যে পানি বিক্রি করত।",
      "রাসূলুল্লাহ (সাঃ) বললেন: 'কে এই কুয়াটি কিনে মুসলমানদের জন্য ওয়াক্ফ করে দেবে? তার জন্য জান্নাতে একটি ঝর্ণা থাকবে।'",
      "উসমান (রাঃ) সেই কুয়াটি অনেক বেশি দামে কিনে নিলেন এবং সকল মুসলমানের জন্য বিনামূল্যে ব্যবহারের জন্য ওয়াক্ফ করে দিলেন। [তিরমিযী: ৩৭০৩]",
      "তাবুক যুদ্ধের সময় মুসলমানদের অর্থনৈতিক অবস্থা খুবই খারাপ ছিল। রাসূলুল্লাহ (সাঃ) মুসলমানদের দান করার জন্য উৎসাহিত করলেন।",
      "উসমান (রাঃ) এসে বললেন: 'ইয়া রাসূলাল্লাহ! আমি ১০০টি উট সাজসরঞ্জাম সহ দান করছি।'",
      "রাসূলুল্লাহ (সাঃ) তাঁর জন্য দোয়া করলেন। উসমান (রাঃ) আবার এসে বললেন: 'আমি আরও ১০০টি উট দান করছি।'",
      "এভাবে তিনি মোট ৯০০ উট এবং ১০০ ঘোড়া দান করলেন। এছাড়াও তিনি ১০,০০০ দিনার স্বর্ণমুদ্রা দান করলেন।",
      "রাসূলুল্লাহ (সাঃ) এত খুশি হলেন যে তিনি তাঁর হাত উঠিয়ে বললেন: ",
      "'আজকের পর উসমান যা-ই করুক, তা তার ক্ষতি করবে না। আজকের পর উসমান যা-ই করুক, তা তার ক্ষতি করবে না।' [তিরমিযী: ৩৭০১]",
      "উসমান (রাঃ) তৃতীয় খলীফা হিসেবে ইসলামী সাম্রাজ্য আরও বিস্তৃত করেছিলেন এবং কুরআন সংকলনের মহান কাজ সম্পন্ন করেছিলেন। তিনি 'যুন-নূরাইন' (দুই নূরের অধিকারী) উপাধি পেয়েছিলেন কারণ তিনি রাসূলুল্লাহ (সাঃ)-এর দুই কন্যাকে বিয়ে করেছিলেন।"
    ],
    "moral": "সম্পদ আল্লাহর আমানত এবং তা আল্লাহর পথে ব্যয় করা উচিত। উসমান (রাঃ)-এর দানশীলতা এবং ত্যাগ প্রমাণ করে যে, দুনিয়ার সম্পদ দিয়ে আখিরাতের সম্পদ কেনা যায়।",
    "source": "তিরমিযী (৩৭০১, ৩৭০৩) এবং ইসলামী ইতিহাস গ্রন্থসমূহ।"
  }
]