[
  {
    "id": "khadija_first_iman",
    "categoryId": "mohiyoshi_nari",
    "title": "খাদিজা (রা.)-এর প্রথম ঈমান ও সমর্থন",
    "paragraphs": [
      "খাদিজা (রা.) ছিলেন ইসলামের প্রথম ঈমান আনয়নকারী এবং রাসূলুল্লাহ (সা.)-এর প্রথম স্ত্রী। নবুওয়াত প্রাপ্তির পূর্বে তাঁর সততায় মুগ্ধ হয়ে খাদিজা (রা.) তাঁকে ব্যবসার দায়িত্ব দেন।",
      "যখন হেরা গুহায় রাসূল (সা.)-এর ওপর প্রথম অহী নাযিল হলো, তিনি ভীত ও কাঁপতে কাঁপতে খাদিজা (রা.)-এর কাছে ফিরে এলেন। খাদিজা (রা.) তাঁকে সান্ত্বনা দিলেন, ভয় দূর করলেন এবং দৃঢ়ভাবে বললেন: 'কখনোই না! আল্লাহর কসম, আল্লাহ আপনাকে কখনোই অপদস্থ করবেন না। আপনি আত্মীয়-স্বজনের সাথে সদ্ব্যবহার করেন, দরিদ্রকে সাহায্য করেন, মেহমানের যত্ন নেন এবং সত্যকে সমর্থন করেন।'",
      "এরপর তিনি রাসূল (সা.)-কে নিয়ে ওয়ারাকা ইবনে নাওফালের কাছে গেলেন, যিনি নিশ্চিত করলেন যে, মুহাম্মাদ (সা.)-এর কাছে সেই ফেরেশতাই এসেছেন, যিনি মূসা (আ.)-এর কাছে এসেছিলেন।",
      "খাদিজা (রা.) তাঁর সমস্ত সম্পদ ইসলামের পথে উৎসর্গ করে দেন, যা ইসলামের প্রাথমিক ভিত্তি স্থাপন করেছিল।"
    ],
    "moral": "সংকটের মুহূর্তে স্বামীর পাশে দাঁড়ানো এবং তাকে সাহস দেওয়া একজন স্ত্রীর সবচেয়ে বড় গুণ। খাদিজা (রা.) প্রমাণ করেছেন যে একজন নারীর বিশ্বাস ও সমর্থন ইতিহাস বদলে দিতে পারে।",
    "source": "সহীহ বুখারী, কিতাবুত তাফসীর, হাদিস: ৪৯৫৩; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "ayesha_ifk_incident",
    "categoryId": "mohiyoshi_nari",
    "title": "আয়েশা (রা.)-এর পবিত্রতা ঘোষণা: ইফকের ঘটনা",
    "paragraphs": [
      "আয়েশা (রা.)-এর জীবনের অন্যতম কঠিন পরীক্ষা ছিল 'ইফকের ঘটনা' (মিথ্যা অপবাদ)। এক যুদ্ধ শেষে কাফেলায় তিনি অজান্তে পেছনে পড়ে যান এবং পরে এক সাহাবীর সাহায্যে কাফেলায় যোগ দেন।",
      "কিন্তু মুনাফিকরা তাঁর সতীত্ব নিয়ে মদীনায় মিথ্যা অপবাদ রটনা শুরু করে, যা রাসূল (সা.)-এর পরিবারে তীব্র কষ্ট সৃষ্টি করে।",
      "দীর্ঘ প্রায় এক মাস ধরে রাসূল (সা.) এবং আবূ বকর (রা.)-এর পরিবার চরম মানসিক যন্ত্রণায় কষ্ট পান। আয়েশা (রা.) অসুস্থ হয়ে পড়েন এবং অসহায় অবস্থায় কেবল আল্লাহর দিকেই রুজু হন।",
      "অবশেষে, আল্লাহ তা'আলা ওহীর মাধ্যমে আয়েশা (রা.)-এর পবিত্রতা ঘোষণা করে সূরা নূরের ১০টি আয়াত নাযিল করেন। এই আয়াতগুলো তাঁর সম্মান ও নির্দোষিতাকে চিরদিনের জন্য প্রতিষ্ঠিত করে।"
    ],
    "moral": "ধৈর্য ও আল্লাহর ওপর ভরসা সবচেয়ে বড় শক্তি। আয়েশা (রা.) প্রমাণ করেছেন যে মিথ্যা অপবাদের মুখেও যদি কেউ আল্লাহর ওপর নির্ভর করে, তবে আল্লাহ নিজেই তার সম্মান রক্ষা করেন।",
    "source": "সহীহ বুখারী, মাগাযী অধ্যায়, হাদিস: ৪১৪১; সহীহ মুসলিম, তাওবা অধ্যায়, হাদিস: ২৭৭০।"
  },
  {
    "id": "fatima_hardship",
    "categoryId": "mohiyoshi_nari",
    "title": "ফাতিমা (রা.)-এর কষ্টের জীবন ও শ্রম",
    "paragraphs": [
      "ফাতিমা (রা.) ছিলেন রাসূলুল্লাহ (সা.)-এর সবচেয়ে প্রিয় কন্যা এবং জান্নাতের নারীদের সর্দার। তিনি কঠোরতা ও দারিদ্র্যের জীবনযাপন করেছিলেন।",
      "আলী (রা.)-এর সাথে বিয়ের পর তাঁদের সংসার ছিল অত্যন্ত সাধারণ। ফাতিমা (রা.) নিজ হাতে সমস্ত কাজ করতেন—আটা পিষতেন, পানি আনতেন এবং ঘর ঝাড়ু দিতেন। একসময় ক্রমাগত আটা পিষতে পিষতে তাঁর হাতে ফোসকা পড়ে যায়।",
      "আলী (রা.) তাঁকে পরামর্শ দেন, রাসূল (সা.)-এর কাছে গিয়ে একটি খাদেম চেয়ে নিতে। রাসূল (সা.) দাসী দিতে অস্বীকার করলেন এবং বললেন: 'আমি কি তোমাদের এমন জিনিস শেখাব না, যা দাসীর চেয়েও উত্তম?'",
      "এরপর তিনি তাঁদের 'তাসবীহে ফাতিমা' (৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদুলিল্লাহ, এবং ৩৪ বার আল্লাহু আকবার) শিক্ষা দিলেন। এই ঘটনা তাঁদের জীবনের দারিদ্র্যেও ঈমানী সমৃদ্ধির এক মহান শিক্ষা দেয়।"
    ],
    "moral": "প্রকৃত সম্পদ হলো আল্লাহর যিকির। ফাতিমা (রা.) প্রমাণ করেছেন যে দুনিয়ার কষ্ট সহ্য করে আল্লাহর সন্তুষ্টি অর্জন করাই প্রকৃত সফলতা।",
    "source": "সহীহ বুখারী, কিতাবুল মাগাযী, হাদিস: ৫৯৬১; সহীহ মুসলিম, কিতাবুয যিকর, হাদিস: ৬৯০৮।"
  },
  {
    "id": "asma_hijrat",
    "categoryId": "mohiyoshi_nari",
    "title": "আসমা (রা.)-এর হিজরতে ত্যাগ ও সাহসিকতা",
    "paragraphs": [
      "আসমা (রা.) ছিলেন আবূ বকর সিদ্দীক (রা.)-এর কন্যা। হিজরতের সময় তাঁর ভূমিকা ছিল অতুলনীয়।",
      "রাসূল (সা.) এবং আবূ বকর (রা.) মদীনার উদ্দেশ্যে মক্কা ত্যাগ করার সময়, আসমা (রা.) অত্যন্ত সাহসিকতার সাথে তাঁদের জন্য খাদ্য ও পানীয় প্রস্তুত করেন।",
      "খাবার বাঁধার কিছু না থাকায় তিনি তাৎক্ষণিক নিজের কোমরের দুটি চাদর ছিঁড়ে একটি দিয়ে খাবার বাঁধলেন এবং অন্যটি দিয়ে পানীয়ের পাত্র বাঁধলেন। এই কারণে রাসূল (সা.) তাঁকে 'জাতুন-নিতাকাইন' (দুই চাদরওয়ালী) উপাধি দিয়েছিলেন।",
      "এরপর তিনি নিয়মিত গভীর রাতে মক্কার মুশরিকদের চোখ ফাঁকি দিয়ে মক্কার দুর্গম গুহা সাওরে খাবার পৌঁছে দিতেন। তিনি ছিলেন গর্ভবতী, তবুও এই ভয়ানক ঝুঁকি নিয়েছিলেন।"
    ],
    "moral": "আল্লাহর দ্বীনের জন্য ত্যাগ ও সাহসিকতা নারীদের মহান গুণ। আসমা (রা.) প্রমাণ করেছেন যে বিপদের মুখেও ঈমানদার নারী দৃঢ় থাকতে পারেন।",
    "source": "সহীহ বুখারী, কিতাবু মানাকিবিল আনসার, হাদিস: ৩৯০৫; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "umme_salamah_wisdom",
    "categoryId": "mohiyoshi_nari",
    "title": "উম্মে সালামাহ (রা.)-এর প্রজ্ঞা ও পরামর্শ",
    "paragraphs": [
      "উম্মে সালামাহ (রা.) ছিলেন রাসূল (সা.)-এর অন্যতম প্রজ্ঞাবান স্ত্রী। হুদাইবিয়ার সন্ধির পর তাঁর পরামর্শ ইসলামের জন্য ছিল অত্যন্ত গুরুত্বপূর্ণ।",
      "সন্ধির শর্তাবলীতে হতাশ সাহাবীরা রাসূল (সা.)-এর আদেশ (কুরবানী ও মাথা মুণ্ডন) পালনে দ্বিধাগ্রস্ত হলেন। রাসূল (সা.) একাধিকবার আদেশ দিয়েও কোনো সাড়া না পেয়ে হতাশ হয়ে উম্মে সালামাহ (রা.)-এর তাঁবুতে প্রবেশ করলেন।",
      "উম্মে সালামাহ (রা.) তখন অত্যন্ত প্রজ্ঞাপূর্ণ একটি পরামর্শ দিলেন: 'হে আল্লাহর রাসূল! আপনি কাউকে কিছু বলবেন না। আপনি নীরবে বেরিয়ে যান এবং আপনি নিজে কুরবানী করে মাথা মুণ্ডন করুন।'",
      "রাসূল (সা.) তাই করলেন। রাসূল (সা.)-কে কাজ করতে দেখে সাহাবীরা তাৎক্ষণিকভাবে তাঁর অনুসরণ শুরু করলেন। উম্মে সালামাহ (রা.)-এর এই বুদ্ধিমত্তা ও সময়োপযোগী পরামর্শ কঠিন পরিস্থিতিতে সাহাবীদের মানসিক স্থবিরতা কাটাতে সাহায্য করেছিল।"
    ],
    "moral": "প্রজ্ঞা ও সঠিক পরামর্শ সংকট সমাধানে অত্যন্ত কার্যকর। উম্মে সালামাহ (রা.) প্রমাণ করেছেন যে নারীর বুদ্ধিমত্তা ইতিহাস পরিবর্তন করতে পারে।",
    "source": "সহীহ বুখারী, কিতাবুল শুহুদ, হাদিস: ২৭৩৪; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "hafsa_quran_preservation",
    "categoryId": "mohiyoshi_nari",
    "title": "হাফসা (রা.)-এর কুরআনের সংরক্ষণ",
    "paragraphs": [
      "হাফসা (রা.) ছিলেন খলীফা উমর ইবনুল খাত্তাব (রা.)-এর কন্যা। তাঁর জীবনের সবচেয়ে গুরুত্বপূর্ণ অবদান ছিল ইসলামের পবিত্র গ্রন্থ কুরআনকে সংরক্ষণের দায়িত্ব পালন করা।",
      "খলীফা আবূ বকর সিদ্দীক (রা.)-এর খেলাফতকালে যখন কুরআনকে গ্রন্থাকারে সংকলন করা হয়, সেই মূল কপিটি (মুসহাফ) আবূ বকর (রা.)-এর ইন্তেকালের পর মুসলিম উম্মাহর সর্বোচ্চ আমানত হিসেবে হাফসা (রা.)-এর কাছে সংরক্ষণ করা হয়।",
      "পরবর্তীতে খলীফা উসমান (রা.) যখন কুরআনের বিভিন্ন কিরাতকে একত্র করে চূড়ান্তভাবে সংকলন করেন, তখন হাফসা (রা.)-এর কাছে সংরক্ষিত এই মুসহাফটিই মূল ভিত্তি হিসেবে ব্যবহৃত হয়েছিল।",
      "হাফসা (রা.) তাঁর কাছে এই মহামূল্যবান আমানত অত্যন্ত বিশ্বস্ততা ও সম্মানের সাথে রক্ষা করেছিলেন।"
    ],
    "moral": "আমানতদারিতা ও দায়িত্বশীলতা ইসলামের মূল শিক্ষা। হাফসা (রা.) প্রমাণ করেছেন যে নারীরা সর্বোচ্চ আমানত রক্ষায় সক্ষম।",
    "source": "সহীহ বুখারী, কিতাবুল ফাদাইলুল কুরআন, হাদিস: ৪৯৮৬।"
  },
  {
    "id": "zainab_marriage",
    "categoryId": "mohiyoshi_nari",
    "title": "যায়নাব (রা.)-এর আসমানি বিবাহ ও উদারতা",
    "paragraphs": [
      "যাইনাব বিনতে জাহশ (রা.) ছিলেন রাসূল (সা.)-এর ফুফাতো বোন। তাঁর বিবাহ স্বয়ং আল্লাহর নির্দেশে সম্পন্ন হয়েছিল।",
      "তাঁর বিবাহ সম্পূর্ণ হয় কুরআনের আয়াত নাযিলের মাধ্যমে। যায়নাব (রা.) এই ঘটনাকে খুবই গর্বের সাথে স্মরণ করতেন এবং রাসূল (সা.)-এর অন্যান্য স্ত্রীদের কাছে বলতেন: 'তোমাদের বিবাহ হয়েছে জমিনে, আর আমার বিবাহ হয়েছে সাত আসমানের ওপর থেকে!'",
      "এছাড়াও তিনি অত্যন্ত দানশীলা ছিলেন। তিনি নিজের উপার্জিত অর্থ আল্লাহর পথে দান করে দিতেন এবং দরিদ্রদের প্রতি তাঁর মমতা ছিল প্রশ্নাতীত।"
    ],
    "moral": "দানশীলতা ও উদারতা জান্নাতের পথ। যায়নাব (রা.) প্রমাণ করেছেন যে আল্লাহর পথে দান করা সর্বোচ্চ মর্যাদার কাজ।",
    "source": "সহীহ মুসলিম, কিতাবুন নিকাহ, হাদিস: ১৪২৮; সূরা আহযাব (৩৩:৩৭)।"
  },
  {
    "id": "umme_sulaim_patience",
    "categoryId": "mohiyoshi_nari",
    "title": "উম্মে সুলাইম (রা.)-এর চরম ধৈর্যের দৃষ্টান্ত",
    "paragraphs": [
      "উম্মে সুলাইম (রা.) ছিলেন আনাস ইবনে মালেক (রা.)-এর মা। তাঁদের শিশু পুত্র অসুস্থ হয়ে মারা গেলে, উম্মে সুলাইম (রা.) চরম ধৈর্য দেখালেন।",
      "তিনি কাউকে খবর না দিয়ে মৃত সন্তানকে ঘরে শুইয়ে রাখলেন। সকালে তিনি স্বামীকে জিজ্ঞেস করলেন: 'যদি আমানতের মালিক তা ফেরত চায়, তখন কি আমানতদারদের কষ্ট পাওয়া উচিত?'",
      "আবূ তালহা (রা.) বললেন: 'না, আমানত তো ফিরিয়ে দিতেই হয়।' তখন উম্মে সুলাইম (রা.) বললেন: 'আল্লাহ আপনার কাছে যে আমানত রেখেছিলেন—আপনার পুত্র—তিনি তা ফিরিয়ে নিয়েছেন। ধৈর্য ধরুন!'",
      "রাসূল (সা.) তাঁদের এই ধৈর্য শুনে মুগ্ধ হন এবং দু'আ করেন: 'আল্লাহ তোমাদের আজকের রাতে বরকত দিন!' এই দু'আর বরকতে তাঁদের আরও একটি পুত্র সন্তান হয়।"
    ],
    "moral": "ধৈর্য ও আল্লাহর ফয়সালায় সন্তুষ্টি সর্বোচ্চ ঈমানের পরিচয়। উম্মে সুলাইম (রা.) প্রমাণ করেছেন যে ধৈর্যের বিনিময়ে আল্লাহ বরকত দান করেন।",
    "source": "সহীহ বুখারী, কিতাবুল জানায়েয, হাদিস: ১২৮৬; সহীহ মুসলিম, হাদিস: ২১৪৪।"
  },
  {
    "id": "safiyyah_courage",
    "categoryId": "mohiyoshi_nari",
    "title": "সাফিয়্যাহ (রা.)-এর যুদ্ধক্ষেত্রের সাহস",
    "paragraphs": [
      "সাফিয়্যাহ (রা.) ছিলেন রাসূল (সা.)-এর ফুফু। খন্দকের যুদ্ধ (আহযাব) চলাকালীন, মুসলিম নারীদেরকে হাসসান ইবনে সাবিত (রা.)-এর দুর্গে সুরক্ষার জন্য রাখা হয়েছিল।",
      "একদিন এক ইহুদি গুপ্তচর দুর্গের চারপাশে ঘোরাফেরা করছিল। সাফিয়্যাহ (রা.) বুঝতে পারলেন, এই গুপ্তচর যদি ভেতরে প্রবেশ করে, তবে নারীদের নিরাপত্তা চরম বিপন্ন হবে।",
      "তিনি তখন কাউকে না ডেকে, নিজে সাহস করে একটি তাঁবুর খুঁটি হাতে নিলেন। তিনি নিচে নামলেন এবং সেই ইহুদি গুপ্তচরকে আঘাত করে হত্যা করলেন।",
      "এই একক বীরত্ব মুসলিম নারীদের মর্যাদা ও সম্মান রক্ষা করেছিল এবং তাঁর এই কাজটি ছিল চরম সাহসিকতার এক অনন্য দৃষ্টান্ত।"
    ],
    "moral": "সাহস ও আত্মরক্ষা নারীদের অধিকার। সাফিয়্যাহ (রা.) প্রমাণ করেছেন যে বিপদের মুখে নারীরাও বীরত্ব দেখাতে পারেন।",
    "source": "সীরাতে ইবনে হিশাম; ইবনে ইসহাক।"
  },
  {
    "id": "nusaybah_uhud",
    "categoryId": "mohiyoshi_nari",
    "title": "নুসাইবাহ (রা.)-এর উহুদ যুদ্ধের বীরত্ব",
    "paragraphs": [
      "নুসাইবাহ বিনতে কা'ব (রা.), যিনি উম্মে আম্মারাহ নামে পরিচিত, তিনি ছিলেন ইসলামের ইতিহাসে যুদ্ধক্ষেত্রে পুরুষের পাশাপাশি লড়াই করা অন্যতম নারী বীর।",
      "উহুদ যুদ্ধে তিনি প্রথমে আহতদের সেবার কাজ করছিলেন। কিন্তু যখন তিনি দেখলেন মুসলিম সৈন্যরা ছত্রভঙ্গ হয়ে যাচ্ছে এবং রাসূল (সা.) কুরাইশদের আক্রমণের মুখে চরম বিপদাপন্ন, তখন তিনি আর স্থির থাকতে পারলেন না।",
      "তিনি হাতে তরবারি ও ঢাল নিয়ে যুদ্ধক্ষেত্রে ঝাঁপিয়ে পড়লেন এবং সরাসরি রাসূল (সা.)-এর চারপাশে মানব-ঢাল হয়ে দাঁড়ালেন। তিনি কুরাইশদের আক্রমণ প্রতিহত করতে গিয়ে কাঁধ ও হাতে বহু আঘাত পেয়েছিলেন।",
      "রাসূল (সা.) তাঁর এই বীরত্ব দেখে মুগ্ধ হয়ে পরে বলেছিলেন: 'আমি যখনই ডানে বা বামে তাকাচ্ছিলাম, তখনই উম্মে আম্মারাহকে দেখছিলাম, তিনি আমার পক্ষ থেকে যুদ্ধ করছেন।'"
    ],
    "moral": "আল্লাহর দ্বীন রক্ষায় নারীরাও জীবন বাজি রাখতে পারেন। নুসাইবাহ (রা.) প্রমাণ করেছেন যে ঈমানদার নারী যুদ্ধক্ষেত্রেও বীরত্ব দেখাতে পারেন।",
    "source": "সহীহ বুখারী (কিছু অংশে); সীরাতে ইবনে হিশাম; মাগাযী আল-ওয়াকিদী।"
  },
  {
    "id": "rabiyah_ashura",
    "categoryId": "mohiyoshi_nari",
    "title": "রাবিয়াহ (রা.)-এর আশুরার প্রস্তুতি",
    "paragraphs": [
      "রাবিয়াহ বিনতে মুআওবিয (রা.) ছিলেন একজন আনসারী সাহাবী। রাসূলুল্লাহ (সা.) যখন আশুরার দিনে রোজা রাখার আদেশ দিলেন, তখন মদীনার শিশুরা যেন এই ইবাদতে অংশ নিতে পারে, সে জন্য তিনি এক সুন্দর কৌশল অবলম্বন করেছিলেন।",
      "তিনি বলেন, 'আমরা আমাদের শিশুদের রোজা রাখতে অভ্যস্ত করতাম। আমরা তাদের জন্য পশমের খেলনা তৈরি করতাম।",
      "যখন কোনো শিশু ক্ষুধার যন্ত্রণায় কাঁদত, তখন আমরা তাকে সেই খেলনা দিয়ে ভুলিয়ে রাখতাম এবং ইফতারের সময় হওয়া পর্যন্ত তাকে শান্ত করতাম।'",
      "এই ঘটনা প্রমাণ করে, ইসলামের প্রাথমিক যুগে নারীরা কীভাবে শিশুদেরকে ছোট থেকেই ইবাদতে উৎসাহিত করতে এবং তাদের শিক্ষণ পদ্ধতিকে মজাদার করতে পারতেন।"
    ],
    "moral": "শিশুদের ইসলামী শিক্ষা দেওয়া মায়েদের গুরুত্বপূর্ণ দায়িত্ব। রাবিয়াহ (রা.) প্রমাণ করেছেন যে সৃজনশীলতার মাধ্যমে শিশুদের ইবাদতে অভ্যস্ত করা যায়।",
    "source": "সহীহ বুখারী, কিতাবুস সাওম, হাদিস: ১৯৫৬।"
  },
  {
    "id": "umme_habiba_firmness",
    "categoryId": "mohiyoshi_nari",
    "title": "উম্মে হাবীবা (রা.)-এর দৃঢ়তা ও পিতার প্রত্যাখ্যান",
    "paragraphs": [
      "উম্মে হাবীবা রামলা বিনতে আবূ সুফিয়ান (রা.) ছিলেন রাসূল (সা.)-এর স্ত্রী। তিনি এবং তাঁর স্বামী উবাইদুল্লাহ ইবনে জাহশ প্রথমে আবিসিনিয়ায় হিজরত করেন।",
      "সেখানে তাঁর স্বামী খ্রিস্টান ধর্ম গ্রহণ করলেও উম্মে হাবীবা (রা.) ইসলামের ওপর দৃঢ় থাকেন এবং স্বামীকে প্রত্যাখ্যান করেন। এরপর তিনি সম্পূর্ণ একা হয়ে পড়েন।",
      "রাসূল (সা.) তাঁর ঈমানের দৃঢ়তা ও ত্যাগ সম্পর্কে জানতে পেরে আবিসিনিয়ার বাদশাহ নাজ্জাশীর মাধ্যমে তাঁকে বিবাহের প্রস্তাব পাঠান।",
      "বাদশাহ নাজ্জাশী স্বয়ং উম্মে হাবীবা (রা.)-এর উকিল হিসেবে তাঁর সাথে রাসূল (সা.)-এর বিবাহ সম্পন্ন করান এবং তাঁর পক্ষ থেকে মোহরও পরিশোধ করেন।"
    ],
    "moral": "ঈমানের জন্য সবকিছু ত্যাগ করার সাহস নারীদের মহান গুণ। উম্মে হাবীবা (রা.) প্রমাণ করেছেন যে আল্লাহর জন্য ত্যাগ করলে আল্লাহ সম্মান দান করেন।",
    "source": "সুনানে আবূ দাউদ, কিতাবুন নিকাহ, হাদিস: ২১০০; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "umme_atiyyah_knowledge",
    "categoryId": "mohiyoshi_nari",
    "title": "উম্মে আতিয়্যাহ (রা.)-এর ফিকহী জ্ঞান ও যুদ্ধের সেবা",
    "paragraphs": [
      "উম্মে আতিয়্যাহ আল-আনসারিয়্যাহ (রা.) ছিলেন মদীনার একজন জ্ঞানী নারী সাহাবী। তিনি বিভিন্ন যুদ্ধে রাসূল (সা.)-এর সাথে অংশগ্রহণ করতেন এবং মুসলিম নারীদের চিকিৎসা ও আহতদের সেবা করতেন।",
      "তিনি বলেন, 'আমি রাসূল (সা.)-এর সাথে সাতটি যুদ্ধে অংশ নিয়েছি। আমি তাঁদের জন্য খাবার তৈরি করতাম, আহতদের সেবা করতাম এবং তীর তুলে এনে যোদ্ধাদের হাতে দিতাম।'",
      "তাঁর এই অভিজ্ঞতা তাঁকে ব্যবহারিক ফিকহ (ইসলামী আইন)-এর গভীর জ্ঞান দিয়েছিল। বিশেষ করে জানাযার গোসল সংক্রান্ত তাঁর বর্ণনাগুলো আজও ফিকহের গুরুত্বপূর্ণ অংশ হিসেবে বিবেচিত।",
      "তাঁর জ্ঞান ও সেবা যুদ্ধের ময়দানে নারীদের অপরিহার্য ভূমিকা প্রমাণ করে।"
    ],
    "moral": "জ্ঞান অর্জন ও সেবা নারীদের মহান গুণ। উম্মে আতিয়্যাহ (রা.) প্রমাণ করেছেন যে নারীরা ফিকহী জ্ঞানে পারদর্শী হতে পারেন।",
    "source": "সহীহ মুসলিম, কিতাবুল জানায়েয, হাদিস: ৯৩৮; সহীহ বুখারী, কিতাবুল মাগাযী, হাদিস: ৪২০৯।"
  },
  {
    "id": "khawla_complaint",
    "categoryId": "mohiyoshi_nari",
    "title": "খাউলা (রা.)-এর আরযি (আবেদন)",
    "paragraphs": [
      "খাউলা বিনতে সা'লাবাহ (রা.) ছিলেন এমন একজন নারী, যাঁর কারণে কুরআনের আয়াত নাযিল হয়েছিল। তাঁর স্বামী আউস ইবনে সামিত (রা.) রাগের মাথায় তাঁকে 'যিহার' করে বসেন।",
      "জাহিলিয়াতের প্রথা অনুসারে 'যিহার' (স্ত্রীকে মায়ের পিঠের সাথে তুলনা করা) করলে বিবাহবন্ধন চিরতরে ছিন্ন হয়ে যেত। খাউলা (রা.) এই ঘটনায় অত্যন্ত মর্মাহত হন, কারণ তিনি তাঁর স্বামীকে ভালোবাসতেন এবং তাঁদের সন্তান ছিল।",
      "তিনি সরাসরি রাসূল (সা.)-এর কাছে গেলেন এবং কাঁদতে কাঁদতে তাঁর সমস্যা পেশ করলেন। রাসূল (সা.) প্রথমে নিরুপায় ছিলেন। তখন খাউলা (রা.) আল্লাহর কাছে আকুল আবেদন জানালেন।",
      "এর ফলস্বরূপ, আল্লাহ তা'আলা সূরা মুজাদালাহ-এর প্রথম আয়াতগুলো নাযিল করেন, যা 'যিহার'-এর প্রথা বাতিল করে এর জন্য কাফফারা (প্রায়শ্চিত্ত) নির্ধারণ করে।"
    ],
    "moral": "আল্লাহর কাছে আকুল আবেদন সবসময় শোনা হয়। খাউলা (রা.) প্রমাণ করেছেন যে নারীর দু'আ আল্লাহর কাছে গ্রহণযোগ্য এবং তা ইতিহাস পরিবর্তন করতে পারে।",
    "source": "সুনানে আবূ দাউদ, কিতাবুত তালাক, হাদিস: ২২১৩; সূরা মুজাদালাহ (৫৮:১-৪)।"
  },
  {
    "id": "umme_haram_dream",
    "categoryId": "mohiyoshi_nari",
    "title": "উম্মে হারামের (রা.) স্বপ্নে জান্নাত লাভ",
    "paragraphs": [
      "উম্মে হারাম বিনতে মিলহান (রা.) ছিলেন আনাস ইবনে মালেক (রা.)-এর খালা এবং উম্মে সুলাইম (রা.)-এর বোন। তিনি ছিলেন রাসূল (সা.)-এর কাছে অত্যন্ত সম্মানিত।",
      "একদিন রাসূল (সা.) তাঁর বাড়িতে বিশ্রাম নিচ্ছিলেন এবং ঘুম থেকে উঠে হাসছিলেন। উম্মে হারাম (রা.) এর কারণ জানতে চাইলে রাসূল (সা.) বললেন, 'আমি স্বপ্নে দেখলাম, আমার উম্মতের একদল মানুষ সমুদ্রের ওপর দিয়ে বাদশাহদের মতো আরোহণ করে আল্লাহর পথে জিহাদ করছে।'",
      "উম্মে হারাম (রা.) তখন আরজি জানালেন: 'ইয়া রাসূলুল্লাহ! আপনি আল্লাহর কাছে দু'আ করুন, যেন আমি সেই দলে থাকি।' রাসূল (সা.) তাঁর জন্য দু'আ করলেন: 'তুমি তাদের মধ্যে থাকবে।'",
      "পরবর্তীতে, তিনি উসমান (রা.)-এর খেলাফতকালে সাইপ্রাসে মুসলিমদের প্রথম নৌ-অভিযানে অংশগ্রহণ করেন এবং সেখানে শহীদ হন।"
    ],
    "moral": "আল্লাহর পথে জিহাদের আকাঙ্ক্ষা নারীদেরও থাকতে পারে। উম্মে হারাম (রা.) প্রমাণ করেছেন যে রাসূল (সা.)-এর দু'আ বাস্তবায়িত হয়।",
    "source": "সহীহ বুখারী, কিতাবুল জিহাদ ওয়াস সিয়্যার, হাদিস: ২৭৮৮।"
  },
  {
    "id": "sumayyah_martyrdom",
    "categoryId": "mohiyoshi_nari",
    "title": "সুমাইয়া (রা.)-এর শাহাদাত",
    "paragraphs": [
      "সুমাইয়া বিনতে খাইয়াত (রা.) ছিলেন ইসলামের ইতিহাসে প্রথম শহীদ। তিনি ছিলেন দাসী। ইসলাম গ্রহণের পর মক্কার মুশরিকরা, বিশেষ করে আবূ জাহল, তাঁকে ও তাঁর পরিবারকে (ইয়াসির ও আম্মার (রা.)) অকথ্য নির্যাতন করত।",
      "তাঁদের ওপর নির্যাতন যখন চরম পর্যায়ে পৌঁছাল, রাসূল (সা.) তখন তাঁদের পাশ দিয়ে যাওয়ার সময় শুধু সান্ত্বনা দিতেন: 'তোমরা ধৈর্য ধরো, হে ইয়াসিরের পরিবার! তোমাদের জন্য জান্নাতের ওয়াদা রয়েছে।'",
      "সুমাইয়া (রা.) মুশরিকদের শিরকের আহ্বানে সাড়া না দিয়ে দৃঢ়ভাবে আল্লাহর একত্ব ঘোষণা করতে থাকলেন। আবূ জাহল ক্রোধে উন্মত্ত হয়ে বর্শা দিয়ে তাঁর ওপর আঘাত করে তাঁকে নির্মমভাবে হত্যা করে।",
      "সুমাইয়া (রা.) আল্লাহর দ্বীনের জন্য নিজের জীবন উৎসর্গ করে মুসলিম নারীদের ত্যাগের এক সর্বোচ্চ দৃষ্টান্ত স্থাপন করেছিলেন।"
    ],
    "moral": "ঈমানের জন্য জীবন দেওয়া সর্বোচ্চ ত্যাগ। সুমাইয়া (রা.) প্রমাণ করেছেন যে আল্লাহর দ্বীনের জন্য নারীরাও শাহাদাত বরণ করতে পারেন।",
    "source": "সীরাতে ইবনে হিশাম; মুসনাদ আহমাদ, হাদিস: ৩৮৩০।"
  },
  {
    "id": "rumaisa_mahr",
    "categoryId": "mohiyoshi_nari",
    "title": "রুমাইসা (রা.)-এর মোহরানা",
    "paragraphs": [
      "উম্মে সুলাইম বিনতে মিলহান (রা.) যখন বিধবা হলেন, তখন আবূ তালহা (রা.) তাঁকে বিবাহের প্রস্তাব দেন। আবূ তালহা (রা.) তখনো ইসলাম গ্রহণ করেননি।",
      "উম্মে সুলাইম (রা.) তখন শর্ত দিলেন: 'আমার মতো নারীকে আপনি (আবূ তালহা) ফিরিয়ে দিতে পারেন না। কিন্তু আপনি একজন মুশরিক, আর আমি একজন মুসলিম নারী। আপনার এই শিরক আমার কাছে আপনার মোহরানা হওয়ার অযোগ্য।'",
      "এরপর তিনি বললেন: 'যদি আপনি ইসলাম গ্রহণ করেন, তবে আমি আপনার স্ত্রী হব, এবং আপনার ইসলাম গ্রহণই হবে আমার মোহরানা।'",
      "আবূ তালহা (রা.) তাঁর এই শর্ত মেনে নিয়ে ইসলাম গ্রহণ করলেন। তাঁর ইসলাম গ্রহণের এই ঘটনা ইতিহাসের সবচেয়ে মূল্যবান মোহরানা হিসেবে পরিচিত।"
    ],
    "moral": "ঈমানকে সবকিছুর ওপরে স্থান দেওয়া নারীদের মহান গুণ। উম্মে সুলাইম (রা.) প্রমাণ করেছেন যে ধর্ম পার্থিব সম্পদের চেয়ে বেশি মূল্যবান।",
    "source": "সুনানে নাসাঈ, কিতাবুন নিকাহ, হাদিস: ৩৩৭৫।"
  },
  {
    "id": "fatima_divorce",
    "categoryId": "mohiyoshi_nari",
    "title": "ফাতিমা বিনতে কায়েস (রা.)-এর তালাক সংক্রান্ত হাদিস",
    "paragraphs": [
      "ফাতিমা বিনতে কায়েস (রা.) ছিলেন ইসলামের প্রাথমিক যুগের একজন মুহাজির নারী। তাঁর তালাক ও ইদ্দত সংক্রান্ত ফিকহী মাসআলা নিয়ে তিনি যে বর্ণনা দিয়েছেন, তা মুসলিম নারীদের ইদ্দত পালন ও বাসস্থান সংক্রান্ত ফিকহের জন্য অত্যন্ত গুরুত্বপূর্ণ।",
      "তাঁর স্বামী তাঁকে তিন তালাক দেওয়ার পর যখন তিনি ইদ্দতকালে থাকার জন্য খোরপোশ চাইলেন, তখন রাসূল (সা.) বললেন, 'তোমার জন্য খোরপোশ বা বাসস্থান নেই।'",
      "এই ফয়সালা সে সময়ের জন্য ছিল ব্যতিক্রমী এবং এটি ইদ্দতকালীন বিধিনিষেধের ওপর গভীর আলোকপাত করে। তাঁর বর্ণনা বহু সাহাবীর সাথে বিতর্কের জন্ম দিলেও, তার হাদিসটি ফিকহ শাস্ত্রের একটি মূলনীতি হিসেবে প্রতিষ্ঠিত হয়েছে।"
    ],
    "moral": "ফিকহী জ্ঞান বর্ণনায় নারীদের গুরুত্বপূর্ণ ভূমিকা রয়েছে। ফাতিমা (রা.) প্রমাণ করেছেন যে নারীরা কঠিন ফিকহী মাসআলা নির্ভুলভাবে বর্ণনা করতে পারেন।",
    "source": "সহীহ মুসলিম, কিতাবুত তালাক, হাদিস: ১৪৮০।"
  },
  {
    "id": "asma_representation",
    "categoryId": "mohiyoshi_nari",
    "title": "আসমা বিনতে ইয়াযিদ (রা.)-এর প্রতিনিধিত্ব",
    "paragraphs": [
      "আসমা বিনতে ইয়াযিদ আল-আনসারিয়্যাহ (রা.) ছিলেন একজন জ্ঞানপিপাসু ও প্রজ্ঞাবান নারী সাহাবী। তিনি নারীদের পক্ষ থেকে রাসূল (সা.)-এর কাছে প্রতিনিধি হিসেবে যেতেন।",
      "একবার তিনি নারীদের পক্ষ থেকে রাসূল (সা.)-কে জিজ্ঞেস করলেন: 'ইয়া রাসূলুল্লাহ! আল্লাহ আপনার উম্মতের পুরুষ ও নারীর জন্য জিহাদ, হজ্জ এবং অন্যান্য ইবাদতের পথ উন্মুক্ত করেছেন, কিন্তু আমরা নারী জাতি কী করব? আমরা পুরুষের চেয়ে কম নেকি পাচ্ছি কেন?'",
      "রাসূল (সা.) তাঁর এই প্রশ্ন শুনে মুগ্ধ হলেন এবং বললেন, 'তোমার প্রশ্ন শুনে আমি মুগ্ধ। তোমার প্রশ্নটি অত্যন্ত প্রজ্ঞাপূর্ণ।'",
      "এরপর রাসূল (সা.) নারীদের দায়িত্ব ও ঘরের কাজ, যা তাঁরা অত্যন্ত ধৈর্য ও যত্নের সাথে করেন, সেগুলোকে পুরুষের জিহাদের সমতুল্য মর্যাদা দিয়ে বর্ণনা করেন।"
    ],
    "moral": "জ্ঞানের জন্য প্রশ্ন করা নারীদের অধিকার। আসমা (রা.) প্রমাণ করেছেন যে নারীরা নিজেদের অধিকার সম্পর্কে সচেতন এবং প্রশ্ন করতে পারেন।",
    "source": "মুসনাদ আহমাদ, হাদিস: ২৭৬৪৬।"
  },
  {
    "id": "umme_darda_knowledge",
    "categoryId": "mohiyoshi_nari",
    "title": "উম্মে দারদা (রা.)-এর জ্ঞান ও ইবাদত",
    "paragraphs": [
      "উম্মে দারদা (রা.) ছিলেন বিশিষ্ট সাহাবী আবূ দারদা (রা.)-এর স্ত্রী। তিনি ছিলেন মদীনার একজন প্রখ্যাত ফকীহ (ইসলামী আইনজ্ঞ) এবং শিক্ষিকা।",
      "স্বামীর ইন্তেকালের পর তিনি নিজেকে ইবাদত, জ্ঞানার্জন এবং জ্ঞান বিতরণে নিয়োজিত করেন। তিনি সিরিয়ার দামেস্কের মসজিদে নিয়মিত দরস (শিক্ষাদান) দিতেন এবং তাঁর দরসে পুরুষ ও নারী উভয়ই অংশ নিত।",
      "এমনকি খলীফা আব্দুল মালিক ইবনে মারওয়ানও তাঁর শিক্ষায় মুগ্ধ হয়েছেন বলে জানা যায়। তাঁর জ্ঞানার্জনের দৃঢ়তা এবং শিক্ষাদান সমাজে নারীদের ফিকহী ভূমিকা পালনের এক উজ্জ্বল দৃষ্টান্ত।",
      "তিনি তাঁর জীবনে রাত জেগে ইবাদত এবং নফল সালাতের জন্য পরিচিত ছিলেন।"
    ],
    "moral": "জ্ঞান অর্জন ও শিক্ষাদান নারীদের মহান দায়িত্ব। উম্মে দারদা (রা.) প্রমাণ করেছেন যে নারীরা ফিকহী জ্ঞানে পারদর্শী এবং শিক্ষক হতে পারেন।",
    "source": "সিয়ারু আ'লামিন নুবালা (আল-জাহাবী); ইবনে আসাকিরের তারিখ।"
  }
]