[
  {
    "id": "mujahid_jibon_salahuddin_ayubi",
    "categoryId": "mujahid_jibon",
    "title": "সালাহউদ্দিন আইয়ুবী: জেরুজালেম বিজয়ী",
    "summary": "",
    "paragraphs": [
      "সুলতান সালাহউদ্দিন ইউসুফ ইবনে আইয়ুব ছিলেন ইসলামের ইতিহাসে সবচেয়ে সম্মানিত এবং প্রশংসিত শাসকদের একজন। তিনি ১১৩৮ খ্রিস্টাব্দে তিকরিতে (বর্তমান ইরাক) জন্মগ্রহণ করেন। তাঁর পরিবার ছিল কুর্দি বংশোদ্ভূত এবং তাঁর পিতা নাজমুদ্দিন আইয়ুব ছিলেন একজন সামরিক কর্মকর্তা। ছোটবেলা থেকেই সালাহউদ্দিন কুরআন, হাদিস, ফিকহ এবং সামরিক বিদ্যা শিখেছিলেন।",
      "সালাহউদ্দিন তাঁর চাচা আসাদুদ্দিন শিরকুহের সাথে মিসর অভিযানে গিয়েছিলেন এবং সেখানে তাঁর যোগ্যতা প্রমাণ করেছিলেন। ১১৬৯ খ্রিস্টাব্দে মাত্র ৩১ বছর বয়সে তিনি মিসরের উজির (প্রধানমন্ত্রী) হন। তিনি ফাতেমীয় খিলাফতের অবসান ঘটিয়ে মিসরকে আব্বাসীয় খিলাফতের অধীনে নিয়ে আসেন এবং সুন্নি ইসলাম প্রতিষ্ঠা করেন। ১১৭৪ খ্রিস্টাব্দে তিনি মিসর ও সিরিয়ার সুলতান হন এবং আইয়ুবী সাম্রাজ্য প্রতিষ্ঠা করেন।",
      "সালাহউদ্দিনের সবচেয়ে বড় লক্ষ্য ছিল জেরুজালেম পুনরুদ্ধার করা। ১০৯৯ খ্রিস্টাব্দে ক্রুসেডাররা জেরুজালেম দখল করেছিল এবং এত নৃশংস হত্যাকাণ্ড চালিয়েছিল যে রাস্তায় ঘোড়ার পায়ের গোড়ালি পর্যন্ত রক্ত জমেছিল। তারা মসজিদুল আকসায় আশ্রয় নেওয়া ৭০,০০০ মুসলমানকে হত্যা করেছিল। ৮৮ বছর ধরে জেরুজালেম ক্রুসেডারদের দখলে ছিল এবং মুসলমানরা সেখানে যেতে পারত না।",
      "সালাহউদ্দিন প্রথমে মুসলমানদের একত্রিত করার কাজ শুরু করলেন। তিনি মিসর, সিরিয়া, ইরাক এবং ইয়েমেনের মুসলিম শাসকদের এক পতাকার নিচে নিয়ে আসলেন। তিনি বলতেন: 'আমরা যতদিন বিভক্ত থাকব, ততদিন ক্রুসেডাররা আমাদের উপর বিজয়ী থাকবে।' তিনি একটি শক্তিশালী সেনাবাহিনী গড়ে তুললেন এবং ক্রুসেডারদের বিরুদ্ধে ছোট ছোট যুদ্ধে জয়ী হতে থাকলেন।",
      "১১৮৭ খ্রিস্টাব্দের ৪ জুলাই হিত্তিনের যুদ্ধ হলো। এই যুদ্ধ ছিল ক্রুসেডারদের বিরুদ্ধে সবচেয়ে গুরুত্বপূর্ণ যুদ্ধ। ক্রুসেডার রাজা গাই অফ লুসিগনান ৬০,০০০ সৈন্য নিয়ে এসেছিলেন। সালাহউদ্দিন তাঁর সৈন্যদের এমন কৌশলে যুদ্ধ করালেন যে ক্রুসেডাররা পানির অভাবে দুর্বল হয়ে পড়ল। প্রচণ্ড গরমে তারা ক্লান্ত হয়ে গেল। মুসলমানরা চারদিক থেকে আক্রমণ করল এবং ক্রুসেডাররা সম্পূর্ণভাবে পরাজিত হলো। রাজা গাই এবং অনেক ক্রুসেডার নেতা বন্দী হলেন।",
      "হিত্তিনের বিজয়ের পর সালাহউদ্দিন একের পর এক ক্রুসেডার দুর্গ বিজয় করতে থাকলেন। আক্কা, সিডন, বৈরুত, আসকালন—সব শহর মুসলমানদের অধীনে এলো। অবশেষে ১১৮৭ খ্রিস্টাব্দের ২ অক্টোবর সালাহউদ্দিন জেরুজালেম অবরোধ করলেন। ১২ দিন অবরোধের পর ২ অক্টোবর জেরুজালেম আত্মসমর্পণ করল। এই দিনটি ছিল মিরাজের রাত—যেদিন রাসূলুল্লাহ (সাঃ) মসজিদুল আকসায় নামাজ পড়েছিলেন।",
      "সালাহউদ্দিন যখন জেরুজালেম প্রবেশ করলেন, তিনি কোনো খ্রিস্টানকে হত্যা করেননি। তিনি ঘোষণা করলেন: 'যারা মুক্তিপণ দিতে পারবে, তারা নিরাপদে চলে যেতে পারবে। যারা দিতে পারবে না, তাদেরও আমি ক্ষমা করে দিচ্ছি।' অনেক দরিদ্র খ্রিস্টান মুক্তিপণ দিতে পারছিল না। সালাহউদ্দিন নিজের কোষাগার থেকে তাদের মুক্তিপণ দিয়ে মুক্ত করে দিলেন। তিনি গির্জাগুলো রক্ষা করলেন এবং খ্রিস্টানদের নিরাপদে বের হতে দিলেন। ইউরোপের ইতিহাসবিদরাও সালাহউদ্দিনের এই মহানুভবতার প্রশংসা করেছেন।",
      "জেরুজালেম বিজয়ের পর ইউরোপ থেকে তৃতীয় ক্রুসেড শুরু হলো। ইংল্যান্ডের রাজা রিচার্ড দ্য লায়নহার্ট, ফ্রান্সের রাজা ফিলিপ এবং জার্মানির সম্রাট ফ্রেডরিক—সবাই মিলে বিশাল বাহিনী নিয়ে এলেন। কিন্তু সালাহউদ্দিন তাঁদের সাথে যুদ্ধ করলেন এবং জেরুজালেম রক্ষা করলেন। একবার রিচার্ড যুদ্ধক্ষেত্রে অসুস্থ হয়ে পড়লেন। সালাহউদ্দিন তাঁর কাছে নিজের চিকিৎসক এবং বরফ ও ফল পাঠিয়ে দিলেন। আরেকবার রিচার্ডের ঘোড়া যুদ্ধে মারা গেলে সালাহউদ্দিন তাঁর কাছে দুটি ঘোড়া উপহার পাঠালেন এবং বার্তা পাঠালেন: 'একজন রাজার পায়ে হেঁটে যুদ্ধ করা উচিত নয়।' রিচার্ড এই মহানুভবতায় মুগ্ধ হয়েছিলেন।",
      "সালাহউদ্দিন অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তিনি রাজপ্রাসাদে থাকতেন না, সাধারণ ঘরে থাকতেন। তিনি নিজের জন্য কিছু জমা করতেন না, সবকিছু দরিদ্রদের মধ্যে বিতরণ করে দিতেন। তাঁর মৃত্যুর পর দেখা গেল তাঁর কোষাগারে মাত্র একটি স্বর্ণমুদ্রা এবং ৪৭টি রৌপ্যমুদ্রা আছে—যা দিয়ে তাঁর কাফনের কাপড় কেনা হয়েছিল। তিনি প্রতিদিন ফজরের নামাজ জামাতে পড়তেন এবং কুরআন তিলাওয়াত করতেন।",
      "১১৯৩ খ্রিস্টাব্দের ৪ মার্চ, মাত্র ৫৫ বছর বয়সে সালাহউদ্দিন আইয়ুবী দামেস্কে ইন্তেকাল করেন। তাঁর জানাজায় মুসলমান এবং খ্রিস্টান—উভয়েই কাঁদছিল। খ্রিস্টানরা বলেছিল: 'আমরা আমাদের সবচেয়ে বড় শত্রুকে হারিয়েছি, কিন্তু সবচেয়ে সম্মানিত মানুষকেও হারিয়েছি।' সালাহউদ্দিন ছিলেন ন্যায়বিচার, দয়া, সাহসিকতা এবং তাকওয়ার প্রতীক। তাঁর কবর দামেস্কের উমাইয়া মসজিদের পাশে আছে।"
    ],
    "moral": "",
    "source": "ইসলামী ইতিহাস এবং ক্রুসেড যুদ্ধের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_tariq_ibn_ziyad",
    "categoryId": "mujahid_jibon",
    "title": "**তারিক ইবনে জিয়াদ:** স্পেন বিজয়ী",
    "paragraphs": [
      "৭১১ খ্রিস্টাব্দে উমাইয়া খলীফা ওয়ালিদ ইবনে আবদুল মালিকের নির্দেশে মুসা ইবনে নুসাইর তারিক ইবনে জিয়াদকে স্পেন বিজয়ের জন্য পাঠালেন।",
      "তারিক ইবনে জিয়াদ ৭,০০০ সৈন্য নিয়ে জিব্রাল্টার প্রণালী পার হয়ে স্পেনে পৌঁছালেন। সামনে ছিল ভিসিগথ রাজা রডারিকের ১,০০,০০০ সৈন্যের বিশাল বাহিনী।",
      "তারিক ইবনে জিয়াদ তাঁর সৈন্যদের সাথে উপকূলে নামার পর একটি ঐতিহাসিক সিদ্ধান্ত নিলেন—তিনি সকল নৌকা পুড়িয়ে ফেলার নির্দেশ দিলেন।",
      "**সৈন্যরা অবাক হয়ে জিজ্ঞাসা করল:** 'আমরা কীভাবে ফিরে যাব?'",
      "**তারিক ইবনে জিয়াদ তখন তাঁর বিখ্যাত ভাষণ দিলেন:** ",
      "'হে মানুষ! তোমাদের পেছনে সমুদ্র, সামনে শত্রু। আল্লাহর কসম! তোমাদের সামনে শুধু সততা এবং ধৈর্য ছাড়া আর কিছু নেই।'",
      "'তোমরা জেনে রাখো, এই দ্বীপে তোমরা পিতৃহীন এতিমের চেয়েও বেশি অসহায়। তোমাদের শত্রু সংখ্যায় অনেক বেশি এবং তাদের সাহায্যকারীও অনেক। তোমাদের কাছে আল্লাহ ছাড়া কোনো সাহায্যকারী নেই।'",
      "'সুতরাং যদি তোমরা ধৈর্য ধারণ করো এবং আল্লাহর পথে অবিচল থাকো, তাহলে আল্লাহ তোমাদের বিজয় দান করবেন। আর যদি তোমরা পালিয়ে যেতে চাও, তাহলে জেনে রাখো—পালানোর কোনো পথ নেই। হয় বিজয়, নয়তো শাহাদাত!'",
      "এই ভাষণ শুনে সৈন্যদের মনোবল আকাশচুম্বী হয়ে গেল। তারা বুঝল যে, এখন শুধু দুটি পথ—হয় বিজয়, নয়তো শাহাদাত।",
      "গুয়াদালেতে নদীর তীরে ভয়াবহ যুদ্ধ হলো। মুসলমানরা এমন সাহসিকতার সাথে যুদ্ধ করল যে, ১,০০,০০০ সৈন্যের বিশাল বাহিনী পরাজিত হলো। রাজা রডারিক নিহত হলেন।",
      "এই বিজয়ের পর মুসলমানরা স্পেনে ৮০০ বছর শাসন করেছিল এবং সেখানে জ্ঞান-বিজ্ঞান, শিল্প-সাহিত্যের এক স্বর্ণযুগ সৃষ্টি করেছিল। কর্ডোভা, গ্রানাডা, টলেডো—এই শহরগুলো জ্ঞানের কেন্দ্র হয়ে উঠেছিল।",
      "তারিক ইবনে জিয়াদের নামে জিব্রাল্টার (জাবাল আত-তারিক = তারিকের পাহাড়) নামকরণ করা হয়েছে, যা আজও তাঁর স্মৃতি বহন করছে।"
    ],
    "source": "ইসলামী ইতিহাস এবং স্পেন বিজয়ের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_muhammad_bin_qasim",
    "categoryId": "mujahid_jibon",
    "title": "**মুহাম্মাদ বিন কাসিম:** সিন্ধু বিজয়ী",
    "paragraphs": [
      "৭১১ খ্রিস্টাব্দে সিংহল (শ্রীলংকা) থেকে কিছু মুসলিম বণিক জাহাজে করে দেবল বন্দরের কাছে যাচ্ছিল। রাজা দাহির তাদের জাহাজ আটক করে লুট করলেন এবং মুসলিম নারী-শিশুদের বন্দী করলেন। মুসলিম নারীরা সাহায্যের জন্য চিৎকার করছিল।",
      "উমাইয়া খলীফা ওয়ালিদ ইবনে আবদুল মালিক এই খবর শুনে ক্রুদ্ধ হলেন এবং হাজ্জাজ ইবনে ইউসুফকে সিন্ধু বিজয়ের নির্দেশ দিলেন। হাজ্জাজ তাঁর ভাগ্নে মুহাম্মাদ বিন কাসিমকে সেনাপতি নিযুক্ত করলেন। তখন মুহাম্মাদ বিন কাসিমের বয়স মাত্র ১৭ বছর।",
      "মুহাম্মাদ বিন কাসিম ৬,০০০ সৈন্য নিয়ে সিন্ধুর দিকে রওনা হলেন। তিনি প্রথমে দেবল দুর্গ অবরোধ করলেন। দুর্গটি ছিল অত্যন্ত শক্তিশালী এবং উঁচু প্রাচীর দিয়ে ঘেরা। মুসলমানরা 'মানজানিক' (বিশাল পাথর নিক্ষেপক যন্ত্র) ব্যবহার করে দুর্গের প্রাচীর ভেঙে ফেললেন এবং দেবল বিজয় করলেন। বন্দী মুসলিম নারী-শিশুদের মুক্ত করা হলো।",
      "এরপর তিনি রাওয়ার, সিওয়ান এবং সিসাম দুর্গ একের পর এক বিজয় করতে থাকলেন। অবশেষে রাজা দাহিরের রাজধানী আরোরের কাছে ভয়াবহ যুদ্ধ হলো। রাজা দাহির হাতির পিঠে বসে যুদ্ধ করছিলেন। মুসলমানরা তীর নিক্ষেপ করে হাতি ও দাহিরকে হত্যা করলেন। সিন্ধু মুসলমানদের অধীনে এলো।",
      "মুহাম্মাদ বিন কাসিম অত্যন্ত ন্যায়পরায়ণ শাসক ছিলেন। তিনি হিন্দু ও বৌদ্ধদের তাদের ধর্ম পালনের স্বাধীনতা দিলেন। তিনি বললেন, 'তোমরা তোমাদের মন্দিরে পূজা করতে পারবে। আমরা তোমাদের উপর জিজিয়া কর ধার্য করব এবং তোমাদের রক্ষা করব।' এই ন্যায়বিচারের কারণে অনেক হিন্দু ও বৌদ্ধ ইসলাম গ্রহণ করল।",
      "কিন্তু দুর্ভাগ্যবশত, খলীফা ওয়ালিদ ইবনে আবদুল মালিক ইন্তেকাল করলেন এবং নতুন খলীফা সুলাইমান ইবনে আবদুল মালিক হাজ্জাজ ইবনে ইউসুফের শত্রু ছিলেন। তিনি মুহাম্মাদ বিন কাসিমকে ফিরিয়ে আনলেন এবং কারাগারে বন্দী করলেন। মাত্র ২০ বছর বয়সে এই মহান সেনাপতি কারাগারে শহীদ হলেন।",
      "মুহাম্মাদ বিন কাসিমের বিজয়ের মাধ্যমে ভারতীয় উপমহাদেশে ইসলামের দরজা খুলে গিয়েছিল। পরবর্তীতে সুলতান মাহমুদ গজনভী, মুহাম্মাদ ঘুরী এবং মুঘল সম্রাটরা এই পথ ধরেই ভারতে ইসলাম প্রচার করেছিলেন।"
    ],
    "source": "চাচনামা (সিন্ধু বিজয়ের ইতিহাস গ্রন্থ) এবং ইসলামী ইতিহাস।"
  },
  {
    "id": "mujahid_jibon_nuruddin_zangi",
    "categoryId": "mujahid_jibon",
    "title": "**নূরউদ্দীন জঙ্গী:** ন্যায়বিচারের প্রতীক",
    "paragraphs": [
      "নূরউদ্দীন জঙ্গী ১১৪৬ খ্রিস্টাব্দে সিরিয়া ও উত্তর ইরাকের শাসক হন। তখন ক্রুসেডাররা জেরুজালেম, আন্তাকিয়া এবং এদেসা দখল করে রেখেছিল। মুসলমানরা বিভক্ত ছিল এবং একে অপরের বিরুদ্ধে যুদ্ধ করছিল।",
      "নূরউদ্দীন প্রথমে মুসলমানদের একত্রিত করার কাজ শুরু করলেন। তিনি বললেন, 'আমরা যতদিন বিভক্ত থাকব, ততদিন ক্রুসেডাররা আমাদের উপর বিজয়ী থাকবে।' তিনি একের পর এক মুসলিম শাসকদের সাথে মিত্রতা করলেন এবং ক্রুসেডারদের বিরুদ্ধে ঐক্যবদ্ধ হলেন।",
      "১১৪৪ খ্রিস্টাব্দে তিনি এদেসা পুনরুদ্ধার করলেন। এটি ছিল ক্রুসেডারদের হাত থেকে প্রথম বড় বিজয়। এরপর তিনি আন্তাকিয়া অবরোধ করলেন এবং ক্রুসেডারদের পরাজিত করলেন।",
      "নূরউদ্দীন শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন একজন ন্যায়পরায়ণ শাসক। তিনি প্রতিদিন নিজে আদালতে বসতেন এবং মানুষের বিচার করতেন। একবার এক বৃদ্ধা মহিলা তাঁর বিরুদ্ধে অভিযোগ করল যে তাঁর সৈন্যরা তার জমি দখল করেছে। নূরউদ্দীন তাৎক্ষণিক তদন্ত করলেন এবং জমি ফিরিয়ে দিলেন।",
      "তিনি অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তিনি নিজ হাতে কুরআনের কপি লিখে বিক্রি করতেন এবং সেই অর্থ দিয়ে পরিবার চালাতেন। তিনি বলতেন: 'আমি বাইতুল মাল (রাষ্ট্রীয় কোষাগার) থেকে একটি দিরহামও ব্যক্তিগত কাজে খরচ করব না।'",
      "নূরউদ্দীন সালাহউদ্দিন আইয়ুবীকে তাঁর সেনাপতি নিযুক্ত করেছিলেন এবং তাঁকে মিসর বিজয়ের জন্য পাঠিয়েছিলেন। সালাহউদ্দিন নূরউদ্দীনের কাছ থেকে ন্যায়বিচার, তাকওয়া এবং জিহাদের শিক্ষা নিয়েছিলেন।",
      "১১৭৪ খ্রিস্টাব্দে নূরউদ্দীন জঙ্গী ইন্তেকাল করেন। তাঁর মৃত্যুর পর সালাহউদ্দিন আইয়ুবী তাঁর কাজ এগিয়ে নিয়ে যান এবং জেরুজালেম পুনরুদ্ধার করেন। নূরউদ্দীন ছিলেন সালাহউদ্দিনের পথপ্রদর্শক এবং অনুপ্রেরণা।"
    ],
    "source": "ইসলামী ইতিহাস এবং ক্রুসেড যুদ্ধের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_alp_arslan",
    "categoryId": "mujahid_jibon",
    "title": "**আলপ আরসালান:** মালাজগির্দের বীর",
    "paragraphs": [
      "সুলতান আলপ আরসালান ছিলেন সেলজুক সাম্রাজ্যের একজন মহান শাসক যিনি ১০৭১ খ্রিস্টাব্দে মালাজগির্দের যুদ্ধে বাইজেন্টাইন সাম্রাজ্যকে পরাজিত করেছিলেন। এই বিজয় আনাতোলিয়ায় (তুরস্ক) ইসলামের দরজা খুলে দিয়েছিল। তাঁর নাম 'আলপ আরসালান' অর্থ 'সাহসী সিংহ'।",
      "আলপ আরসালান ১০৬৩ খ্রিস্টাব্দে সেলজুক সাম্রাজ্যের সুলতান হন। তিনি ছিলেন একজন দক্ষ যোদ্ধা এবং ন্যায়পরায়ণ শাসক। ১০৭১ খ্রিস্টাব্দে বাইজেন্টাইন সম্রাট রোমানোস চতুর্থ ডায়োজেনিস ২,০০,০০০ সৈন্যের বিশাল বাহিনী নিয়ে সেলজুক সাম্রাজ্য আক্রমণ করলেন। তিনি বলেছিলেন: 'আমি মুসলমানদের ধ্বংস করে দেব এবং তাদের রাজধানী দখল করব।'",
      "আলপ আরসালান তখন সিরিয়ায় ছিলেন। এই খবর শুনে তিনি দ্রুত আনাতোলিয়ার দিকে রওনা হলেন। তাঁর কাছে ছিল মাত্র ৪০,০০০ সৈন্য। সংখ্যায় শত্রু পাঁচগুণ বেশি ছিল। যুদ্ধের আগের রাতে আলপ আরসালান সাদা কাফন পরলেন এবং সৈন্যদের বললেন, 'আগামীকাল হয় আমরা বিজয়ী হব, নয়তো শহীদ হব। আমি তোমাদের মতোই একজন সৈন্য। যদি আমি মারা যাই, তাহলে আমার পুত্র মালিক শাহকে সুলতান বানাবে।' তিনি দুই রাকাত নামাজ পড়লেন এবং আল্লাহর কাছে কাঁদলেন।",
      "মালাজগির্দের ময়দানে ভয়াবহ যুদ্ধ হলো। আলপ আরসালান তাঁর সৈন্যদের এমন কৌশলে যুদ্ধ করালেন যে বাইজেন্টাইন বাহিনী বিভ্রান্ত হয়ে গেল। মুসলমানরা শত্রুদের চারদিক থেকে ঘিরে ফেলল। সম্রাট রোমানোস নিজেই বন্দী হলেন। সম্রাট রোমানোসকে আলপ আরসালানের সামনে আনা হলো। সম্রাট ভয়ে কাঁপছিলেন। তিনি জিজ্ঞেস করলেন: 'আপনি আমার সাথে কী করবেন?' আলপ আরসালান বললেন, 'আমি যদি আপনার বন্দী হতাম, আপনি আমার সাথে কী করতেন?' সম্রাট বললেন, 'আমি আপনাকে হত্যা করতাম।' আলপ আরসালান বললেন, 'কিন্তু আমি আপনাকে ক্ষমা করে দিচ্ছি। এটাই ইসলামের শিক্ষা।'",
      "তিনি সম্রাটকে সম্মানের সাথে মুক্তি দিলেন এবং শুধু মুক্তিপণ নিলেন। সম্রাট রোমানোস এই দয়ায় মুগ্ধ হলেন এবং বললেন, 'আমি আপনার মতো মহান শাসক কখনো দেখিনি।' মালাজগির্দের বিজয়ের পর আনাতোলিয়ায় (বর্তমান তুরস্ক) মুসলমানদের শাসন প্রতিষ্ঠিত হলো। পরবর্তীতে উসমানীয় সাম্রাজ্য এই ভূমিতে প্রতিষ্ঠিত হয় এবং ৬০০ বছর শাসন করে। ১০৭২ খ্রিস্টাব্দে আলপ আরসালান একটি দুর্গ অবরোধ করার সময় শত্রুর তীরে আহত হন এবং শহীদ হন।"
    ],
    "source": "ইসলামী ইতিহাস এবং সেলজুক সাম্রাজ্যের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_sultan_mahmud_ghaznavi",
    "categoryId": "mujahid_jibon",
    "title": "**সুলতান মাহমুদ গজনভী:** ভারত বিজয়ী",
    "paragraphs": [
      "সুলতান মাহমুদ গজনভী ছিলেন গজনভী সাম্রাজ্যের একজন মহান শাসক যিনি ১৭ বার ভারত আক্রমণ করেছিলেন এবং ইসলাম প্রচার করেছিলেন। তিনি ছিলেন একজন দক্ষ সেনাপতি এবং ইলমের পৃষ্ঠপোষক। সুলতান মাহমুদ ৯৯৮ খ্রিস্টাব্দে গজনী (বর্তমান আফগানিস্তান) এর শাসক হন।",
      "সুলতান মাহমুদ ১০০১ থেকে ১০২৭ খ্রিস্টাব্দ পর্যন্ত ১৭ বার ভারত আক্রমণ করেছিলেন। তিনি পাঞ্জাব, সিন্ধু, কাশ্মীর এবং উত্তর ভারতের বিভিন্ন অঞ্চল বিজয় করেছিলেন। তাঁর সবচেয়ে বিখ্যাত অভিযান ছিল সোমনাথ মন্দির আক্রমণ। সোমনাথ মন্দির ছিল হিন্দুদের একটি বিখ্যাত মন্দির যেখানে বিশাল সম্পদ জমা ছিল। ১০২৬ খ্রিস্টাব্দে সুলতান মাহমুদ সোমনাথ আক্রমণ করলেন। মন্দিরের পুরোহিতরা বলল, 'আমাদের দেবতা তোমাদের ধ্বংস করে দেবে।' কিন্তু মুসলমানরা মন্দির বিজয় করলেন এবং মূর্তি ভেঙে ফেললেন। এই বিজয়ের পর অনেক হিন্দু বুঝতে পারল যে মূর্তি কোনো ক্ষমতা রাখে না এবং অনেকে ইসলাম গ্রহণ করল।",
      "সুলতান মাহমুদ শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন ইলম ও জ্ঞানের পৃষ্ঠপোষক। তিনি তাঁর রাজদরবারে বিখ্যাত পণ্ডিত ও কবিদের আমন্ত্রণ জানাতেন। মহাকবি ফেরদৌসী তাঁর রাজদরবারে ছিলেন এবং বিখ্যাত 'শাহনামা' গ্রন্থ লিখেছিলেন। ইমাম আবু হানিফা (রহঃ) এর মাজহাব অনুসরণকারী আলেমদের তিনি সম্মান করতেন এবং তাঁদের সাহায্য করতেন।",
      "সুলতান মাহমুদ গজনীতে একটি বিশাল লাইব্রেরি এবং বিশ্ববিদ্যালয় প্রতিষ্ঠা করেছিলেন। তিনি বলতেন: 'তরবারি দিয়ে রাজ্য জয় করা যায়, কিন্তু ইলম দিয়ে হৃদয় জয় করা যায়।' ১০৩০ খ্রিস্টাব্দে সুলতান মাহমুদ গজনভী ইন্তেকাল করেন। তাঁর বিজয়ের ফলে ভারতীয় উপমহাদেশে ইসলামের প্রসার ঘটেছিল এবং পরবর্তীতে মুঘল সাম্রাজ্য প্রতিষ্ঠিত হয়েছিল।"
    ],
    "source": "ইসলামী ইতিহাস এবং গজনভী সাম্রাজ্যের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_muhammad_al_fatih",
    "categoryId": "mujahid_jibon",
    "title": "**মুহাম্মাদ আল-ফাতিহ:** কনস্টান্টিনোপল বিজয়ী",
    "paragraphs": [
      "সুলতান মুহাম্মাদ আল-ফাতিহ (মুহাম্মাদ দ্বিতীয়) ছিলেন উসমানীয় সাম্রাজ্যের সপ্তম সুলতান যিনি ১৪৫৩ খ্রিস্টাব্দে কনস্টান্টিনোপল (বর্তমান ইস্তাম্বুল) বিজয় করেছিলেন। রাসূলুল্লাহ (সাঃ) বলেছিলেন: 'কনস্টান্টিনোপল অবশ্যই বিজিত হবে। যে সেনাপতি তা বিজয় করবে, সে কতই না উত্তম সেনাপতি! এবং যে সৈন্যবাহিনী তা বিজয় করবে, তারা কতই না উত্তম সৈন্যবাহিনী!' [মুসনাদে আহমাদ]",
      "মুহাম্মাদ আল-ফাতিহ ১৪৩২ খ্রিস্টাব্দে জন্মগ্রহণ করেন। তিনি ছোটবেলা থেকেই অত্যন্ত মেধাবী ছিলেন। তিনি আরবি, ফার্সি, তুর্কি, গ্রিক এবং ল্যাটিন ভাষা জানতেন। তিনি কুরআন হিফজ করেছিলেন এবং হাদিস, ফিকহ, গণিত, জ্যোতির্বিদ্যা এবং সামরিক কৌশল শিখেছিলেন। মাত্র ২১ বছর বয়সে তিনি উসমানীয় সাম্রাজ্যের সুলতান হন।",
      "কনস্টান্টিনোপল ছিল বাইজেন্টাইন সাম্রাজ্যের রাজধানী এবং খ্রিস্টান জগতের কেন্দ্র। এই শহর ১১০০ বছর ধরে অজেয় ছিল। শহরটি ছিল তিনদিক থেকে সমুদ্র দিয়ে ঘেরা এবং বিশাল প্রাচীর দিয়ে সুরক্ষিত। অনেক মুসলিম সেনাপতি এই শহর বিজয়ের চেষ্টা করেছিলেন কিন্তু ব্যর্থ হয়েছিলেন। মুহাম্মাদ আল-ফাতিহ দৃঢ়প্রতিজ্ঞ ছিলেন যে তিনি রাসূলুল্লাহ (সাঃ) এর ভবিষ্যদ্বাণী পূর্ণ করবেন।",
      "১৪৫৩ খ্রিস্টাব্দের ৬ এপ্রিল মুহাম্মাদ আল-ফাতিহ ১,৫০,০০০ সৈন্য নিয়ে কনস্টান্টিনোপল অবরোধ শুরু করলেন। তিনি বিশাল কামান তৈরি করেছিলেন যা প্রাচীর ভাঙতে পারত। কিন্তু শহরের একদিকে ছিল 'গোল্ডেন হর্ন' নামক একটি উপসাগর যেখানে বাইজেন্টাইনরা বিশাল শিকল দিয়ে বন্ধ করে রেখেছিল যাতে মুসলিম জাহাজ প্রবেশ করতে না পারে।",
      "মুহাম্মাদ আল-ফাতিহ এক অসাধারণ কৌশল অবলম্বন করলেন। তিনি ৭০টি জাহাজকে স্থলপথে টেনে নিয়ে গেলেন! তিনি কাঠের রাস্তা তৈরি করলেন এবং জাহাজগুলোকে পাহাড়ের উপর দিয়ে টেনে গোল্ডেন হর্নে নামিয়ে দিলেন। বাইজেন্টাইনরা এই দৃশ্য দেখে হতবাক হয়ে গেল। তারা বুঝতে পারল যে এই সেনাপতি অসাধারণ।",
      "৫৩ দিন অবরোধের পর ২৯ মে ১৪৫৩ খ্রিস্টাব্দে ফজরের নামাজের পর চূড়ান্ত আক্রমণ শুরু হলো। মুসলমানরা 'আল্লাহু আকবর' ধ্বনি দিয়ে আক্রমণ করল। প্রচণ্ড যুদ্ধের পর মুসলমানরা প্রাচীর ভেঙে শহরে প্রবেশ করল। সম্রাট কনস্টান্টাইন একাদশ যুদ্ধে নিহত হলেন। কনস্টান্টিনোপল বিজিত হলো।",
      "মুহাম্মাদ আল-ফাতিহ ঘোড়ায় চড়ে শহরে প্রবেশ করলেন এবং সরাসরি হাগিয়া সোফিয়া গির্জায় গেলেন। তিনি সেখানে নামাজ পড়লেন এবং গির্জাটিকে মসজিদে রূপান্তরিত করলেন। তিনি ঘোষণা করলেন: 'যারা লুকিয়ে আছে, তারা বের হয়ে আসো। তোমাদের জান-মাল নিরাপদ। তোমরা তোমাদের ধর্ম পালন করতে পারবে।' তিনি কোনো খ্রিস্টানকে হত্যা করেননি এবং তাদের গির্জা রক্ষা করেছিলেন।",
      "মুহাম্মাদ আল-ফাতিহ কনস্টান্টিনোপলের নাম পরিবর্তন করে 'ইস্তাম্বুল' রাখলেন এবং এটিকে উসমানীয় সাম্রাজ্যের রাজধানী বানালেন। তিনি শহরে মসজিদ, মাদ্রাসা, হাসপাতাল এবং লাইব্রেরি নির্মাণ করলেন। ইস্তাম্বুল ইসলামী সভ্যতার কেন্দ্র হয়ে উঠল। ১৪৮১ খ্রিস্টাব্দে মাত্র ৪৯ বছর বয়সে মুহাম্মাদ আল-ফাতিহ ইন্তেকাল করেন। তিনি ছিলেন একজন মহান বিজয়ী, ন্যায়পরায়ণ শাসক এবং ইলমের পৃষ্ঠপোষক।"
    ],
    "source": "ইসলামী ইতিহাস, উসমানীয় সাম্রাজ্যের দলিলসমূহ এবং মুসনাদে আহমাদ।"
  },
  {
    "id": "mujahid_jibon_umar_ibn_abdul_aziz",
    "categoryId": "mujahid_jibon",
    "title": "**উমর ইবনে আবদুল আজিজ:** পঞ্চম খলীফা",
    "paragraphs": [
      "উমর ইবনে আবদুল আজিজ ছিলেন উমাইয়া খিলাফতের অষ্টম খলীফা কিন্তু তাঁকে 'পঞ্চম খলীফা' বলা হয় কারণ তিনি খুলাফায়ে রাশেদিনের মতো ন্যায়বিচার ও তাকওয়ার সাথে শাসন করেছিলেন। তিনি ৬৮২ খ্রিস্টাব্দে মদিনায় জন্মগ্রহণ করেন। তাঁর মা ছিলেন উমর ইবনুল খাত্তাব (রাঃ) এর নাতনি। ছোটবেলা থেকেই তিনি কুরআন, হাদিস এবং ফিকহ শিখেছিলেন এবং মদিনার বিখ্যাত আলেমদের সাথে পড়াশোনা করেছিলেন।",
      "উমর ইবনে আবদুল আজিজ যুবক বয়সে অত্যন্ত সুদর্শন এবং বিলাসবহুল জীবনযাপন করতেন। তিনি সুগন্ধি ব্যবহার করতেন এবং সুন্দর পোশাক পরতেন। কিন্তু একদিন তিনি একটি জানাজা দেখলেন এবং মৃত্যু সম্পর্কে চিন্তা করতে শুরু করলেন। তিনি আলেমদের কাছে গেলেন এবং তাঁরা তাঁকে আখিরাতের কথা বললেন। এরপর থেকে তিনি তাঁর জীবন পরিবর্তন করলেন এবং সাদাসিধে জীবনযাপন শুরু করলেন।",
      "৭১৭ খ্রিস্টাব্দে উমর ইবনে আবদুল আজিজ খলীফা হন। খলীফা হওয়ার পর তিনি প্রথমেই সব বিলাসবহুল জিনিস বাইতুল মালে (রাষ্ট্রীয় কোষাগার) জমা দিলেন। তাঁর স্ত্রী ফাতিমা বিনতে আবদুল মালিক ছিলেন খলীফার মেয়ে এবং তাঁর কাছে অনেক দামি গহনা ছিল। উমর তাঁকে বললেন, 'হয় এই গহনা বাইতুল মালে জমা দাও, নয়তো আমাকে তালাক দাও।' ফাতিমা কাঁদতে কাঁদতে সব গহনা জমা দিলেন এবং বললেন, 'আমি আপনাকে ছাড়ব না।'",
      "উমর ইবনে আবদুল আজিজ এমন ন্যায়বিচার প্রতিষ্ঠা করলেন যে মানুষ তাঁকে উমর ইবনুল খাত্তাব (রাঃ) এর সাথে তুলনা করতে লাগল। তিনি জুলুম বন্ধ করলেন এবং যারা জুলুম করেছিল তাদের শাস্তি দিলেন। তিনি বললেন, 'যদি কেউ জুলুম করে থাকে, তাহলে সে যত বড় হোক না কেন, তাকে শাস্তি দিতে হবে।' তিনি উমাইয়া শাসকদের দ্বারা জবরদখল করা জমি মালিকদের ফিরিয়ে দিলেন।",
      "তাঁর শাসনামলে ইসলাম দ্রুত ছড়িয়ে পড়ল। তিনি বিভিন্ন দেশে দাঈ (ইসলাম প্রচারক) পাঠালেন। তিনি বলতেন: 'আমি চাই মানুষ ভয়ে নয়, ভালোবেসে ইসলাম গ্রহণ করুক।' তাঁর ন্যায়বিচার দেখে অনেক অমুসলিম ইসলাম গ্রহণ করল। একবার জিজিয়া কর এত কমে গেল যে রাজস্ব কমে গেল। কিন্তু উমর খুশি হলেন এবং বললেন, 'আল্লাহর শুকরিয়া যে মানুষ ইসলাম গ্রহণ করছে।'",
      "উমর ইবনে আবদুল আজিজ অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তিনি নিজে রাতে মোমবাতি জ্বালিয়ে রাষ্ট্রীয় কাজ করতেন এবং যখন ব্যক্তিগত কাজ করতেন তখন মোমবাতি নিভিয়ে দিতেন। তিনি বলতেন: 'বাইতুল মালের একটি পয়সাও ব্যক্তিগত কাজে খরচ করা যাবে না।' তিনি এত কম খেতেন যে তাঁর শরীর দুর্বল হয়ে গিয়েছিল।",
      "মাত্র ২ বছর ৫ মাস খিলাফত করার পর ৭২০ খ্রিস্টাব্দে ৩৯ বছর বয়সে উমর ইবনে আবদুল আজিজ ইন্তেকাল করেন। অনেকে বিশ্বাস করেন তাঁকে বিষ দেওয়া হয়েছিল কারণ তিনি জালিমদের শাস্তি দিয়েছিলেন। তাঁর মৃত্যুর পর দেখা গেল তাঁর কাছে মাত্র ১৭ দিনার ছিল। তাঁর স্ত্রী কাঁদছিলেন এবং বলছিলেন: 'আমি এত গহনা জমা দিয়েছিলাম, আর এখন আমার কাছে কিছুই নেই।' কিন্তু পরে তিনি বললেন, 'আমি গর্বিত যে আমার স্বামী এত ন্যায়পরায়ণ ছিলেন।' উমর ইবনে আবদুল আজিজ ছিলেন ন্যায়বিচার, তাকওয়া এবং সততার প্রতীক।"
    ],
    "source": "ইসলামী ইতিহাস এবং সিয়ারু আলামিন নুবালা।"
  },
  {
    "id": "mujahid_jibon_qutaybah_ibn_muslim",
    "categoryId": "mujahid_jibon",
    "title": "**কুতাইবা ইবনে মুসলিম:** মধ্য এশিয়া বিজয়ী",
    "paragraphs": [
      "কুতাইবা ইবনে মুসলিম আল-বাহিলি ছিলেন উমাইয়া খিলাফতের একজন মহান সেনাপতি যিনি মধ্য এশিয়া (বর্তমান উজবেকিস্তান, তাজিকিস্তান, কিরগিজস্তান এবং তুর্কমেনিস্তান) বিজয় করেছিলেন। তিনি ৬৬৯ খ্রিস্টাব্দে আরবে জন্মগ্রহণ করেন এবং ছোটবেলা থেকেই সামরিক প্রশিক্ষণ নিয়েছিলেন। তিনি ছিলেন অত্যন্ত সাহসী এবং কৌশলী সেনাপতি।",
      "৭০৫ খ্রিস্টাব্দে হাজ্জাজ ইবনে ইউসুফ কুতাইবা ইবনে মুসলিমকে খোরাসান (বর্তমান ইরান ও আফগানিস্তানের অংশ) এর গভর্নর নিযুক্ত করলেন। তখন মধ্য এশিয়ায় বিভিন্ন তুর্কি এবং পারসিক রাজ্য ছিল যারা ইসলামের বিরুদ্ধে যুদ্ধ করছিল। কুতাইবা একের পর এক এই রাজ্যগুলো বিজয় করতে শুরু করলেন।",
      "কুতাইবা প্রথমে বুখারা আক্রমণ করলেন। বুখারা ছিল মধ্য এশিয়ার একটি বড় শহর এবং জ্ঞান-বিজ্ঞানের কেন্দ্র। কিন্তু সেখানে অগ্নিপূজা হতো। কুতাইবা কয়েকবার আক্রমণ করার পর ৭০৯ খ্রিস্টাব্দে বুখারা বিজয় করলেন। তিনি সেখানে মসজিদ নির্মাণ করলেন এবং মানুষকে ইসলামের দাওয়াত দিলেন। অনেক মানুষ ইসলাম গ্রহণ করল।",
      "এরপর কুতাইবা সমরকন্দ আক্রমণ করলেন। সমরকন্দ ছিল সোগদিয়ানা রাজ্যের রাজধানী এবং অত্যন্ত শক্তিশালী দুর্গ। ৭১১ খ্রিস্টাব্দে দীর্ঘ অবরোধের পর সমরকন্দ আত্মসমর্পণ করল। কুতাইবা সেখানে ন্যায়বিচার প্রতিষ্ঠা করলেন এবং মানুষকে তাদের ধর্ম পালনের স্বাধীনতা দিলেন। তিনি বললেন, 'যারা ইসলাম গ্রহণ করবে, তারা আমাদের ভাই। যারা করবে না, তারা জিজিয়া দেবে এবং আমরা তাদের রক্ষা করব।'",
      "কুতাইবা খোয়ারিজম (বর্তমান উজবেকিস্তান ও তুর্কমেনিস্তান), ফারগানা (বর্তমান উজবেকিস্তান ও কিরগিজস্তান) এবং শাশ (বর্তমান তাশখন্দ) বিজয় করলেন। তিনি এমনকি চীনের সীমান্ত পর্যন্ত পৌঁছেছিলেন এবং কাশগর বিজয় করেছিলেন। তাঁর বিজয়ের ফলে মধ্য এশিয়ায় ইসলাম প্রতিষ্ঠিত হলো এবং পরবর্তীতে এই অঞ্চল থেকে ইমাম বুখারী, ইমাম তিরমিযী, ইমাম নাসাঈ এবং আল-খাওয়ারিজমীর মতো মহান আলেম ও বিজ্ঞানী জন্মগ্রহণ করেন।",
      "কুতাইবা শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন একজন ন্যায়পরায়ণ শাসক। তিনি বিজিত অঞ্চলে মসজিদ, মাদ্রাসা এবং হাসপাতাল নির্মাণ করতেন। তিনি স্থানীয় মানুষদের সম্মান করতেন এবং তাদের সাথে ভালো ব্যবহার করতেন। এই কারণে অনেক মানুষ স্বেচ্ছায় ইসলাম গ্রহণ করেছিল।",
      "৭১৫ খ্রিস্টাব্দে কুতাইবা ইবনে মুসলিম ফারগানায় ইন্তেকাল করেন। তাঁর মৃত্যুর পর মধ্য এশিয়ায় কিছু বিদ্রোহ হয়েছিল কিন্তু ইসলাম সেখানে প্রতিষ্ঠিত থেকে গেল। আজ উজবেকিস্তান, তাজিকিস্তান, কিরগিজস্তান এবং তুর্কমেনিস্তান মুসলিম দেশ এবং এটা কুতাইবা ইবনে মুসলিমের অবদান।"
    ],
    "source": "ইসলামী ইতিহাস এবং তারিখে তাবারি।"
  },
  {
    "id": "mujahid_jibon_baybars",
    "categoryId": "mujahid_jibon",
    "title": "**বাইবার্স:** মঙ্গোল পরাজয়কারী",
    "paragraphs": [
      "সুলতান বাইবার্স ছিলেন মামলুক সাম্রাজ্যের চতুর্থ সুলতান এবং ইসলামের ইতিহাসে সবচেয়ে সাহসী যোদ্ধাদের একজন। তিনি মঙ্গোলদের পরাজিত করেছিলেন যারা বাগদাদ ধ্বংস করে লক্ষ লক্ষ মুসলমানকে হত্যা করেছিল। বাইবার্স ১২২৩ খ্রিস্টাব্দে কৃষ্ণ সাগরের কাছে জন্মগ্রহণ করেন। তিনি ছিলেন কিপচাক তুর্কি বংশোদ্ভূত। ছোটবেলায় তাঁকে দাস হিসেবে বিক্রি করা হয়েছিল এবং মিসরে নিয়ে আসা হয়েছিল।",
      "মিসরে বাইবার্সকে মামলুক (দাস সৈনিক) হিসেবে প্রশিক্ষণ দেওয়া হয়েছিল। মামলুকরা ছিল বিশেষ প্রশিক্ষিত সৈনিক যারা ছোটবেলা থেকে যুদ্ধবিদ্যা, ঘোড়সওয়ারি এবং তীরন্দাজি শিখত। বাইবার্স অত্যন্ত মেধাবী এবং সাহসী ছিলেন। তিনি দ্রুত উন্নতি করলেন এবং একজন সেনাপতি হলেন।",
      "১২৫৮ খ্রিস্টাব্দে মঙ্গোল নেতা হালাকু খান বাগদাদ আক্রমণ করলেন এবং আব্বাসীয় খিলাফতের শেষ খলীফা আল-মুস্তাসিম বিল্লাহকে হত্যা করলেন। মঙ্গোলরা বাগদাদে এত নৃশংস হত্যাকাণ্ড চালিয়েছিল যে দজলা নদীর পানি রক্তে লাল হয়ে গিয়েছিল। তারা ১০ লক্ষ মুসলমানকে হত্যা করেছিল এবং হাজার হাজার বই পুড়িয়ে ফেলেছিল। মুসলিম বিশ্ব ভয়ে কাঁপছিল। মঙ্গোলরা বলত: 'আমরা অপরাজেয়। আমরা চীন, পারস্য, রাশিয়া সব জয় করেছি।'",
      "১২৬০ খ্রিস্টাব্দে মঙ্গোলরা সিরিয়া দখল করে মিসরের দিকে এগিয়ে আসছিল। তারা মিসরের সুলতান কুতুজের কাছে বার্তা পাঠাল: 'আত্মসমর্পণ করো, নয়তো আমরা তোমাদের ধ্বংস করে দেব।' সুলতান কুতুজ মঙ্গোল দূতদের হত্যা করলেন এবং যুদ্ধের ঘোষণা দিলেন। তিনি বাইবার্সকে সেনাপতি নিযুক্ত করলেন।",
      "১২৬০ খ্রিস্টাব্দের ৩ সেপ্টেম্বর আইন জালুতের যুদ্ধ হলো। এই যুদ্ধ ছিল ইসলামের ইতিহাসে সবচেয়ে গুরুত্বপূর্ণ যুদ্ধগুলোর একটি। বাইবার্স এমন কৌশল অবলম্বন করলেন যে মঙ্গোলরা ফাঁদে পড়ে গেল। তিনি কিছু সৈন্য দিয়ে মঙ্গোলদের আক্রমণ করলেন এবং তারপর পিছু হটলেন। মঙ্গোলরা তাদের তাড়া করল এবং একটি উপত্যকায় প্রবেশ করল। হঠাৎ চারদিক থেকে মুসলিম সৈন্যরা আক্রমণ করল। প্রচণ্ড যুদ্ধের পর মঙ্গোলরা পরাজিত হলো এবং তাদের সেনাপতি কিতবুগা নিহত হলো। এই প্রথমবার মঙ্গোলরা বড় যুদ্ধে পরাজিত হলো।",
      "আইন জালুতের বিজয়ের পর বাইবার্স মিসর ও সিরিয়ার সুলতান হলেন। তিনি ক্রুসেডারদের বিরুদ্ধেও যুদ্ধ করলেন এবং একের পর এক তাদের দুর্গ বিজয় করলেন। তিনি আন্তাকিয়া, জাফা, এবং অনেক দুর্গ বিজয় করলেন। তিনি মঙ্গোলদের বিরুদ্ধেও আরো যুদ্ধ করলেন এবং তাদের সিরিয়া থেকে বের করে দিলেন।",
      "বাইবার্স শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন একজন দক্ষ শাসক। তিনি মিসর ও সিরিয়ায় রাস্তা, মসজিদ, মাদ্রাসা এবং হাসপাতাল নির্মাণ করলেন। তিনি ডাক ব্যবস্থা উন্নত করলেন যাতে কায়রো থেকে দামেস্ক পর্যন্ত চিঠি মাত্র ৪ দিনে পৌঁছাত। তিনি সেনাবাহিনীকে শক্তিশালী করলেন এবং দুর্গ নির্মাণ করলেন।",
      "১২৭৭ খ্রিস্টাব্দে ৫৪ বছর বয়সে বাইবার্স দামেস্কে ইন্তেকাল করেন। তাঁর মৃত্যুর পর মুসলিম বিশ্ব শোকে মুহ্যমান হয়েছিল। তিনি ছিলেন সাহসী যোদ্ধা এবং দক্ষ শাসক যিনি মঙ্গোলদের থামিয়ে দিয়েছিলেন এবং ইসলামকে রক্ষা করেছিলেন। তাঁর কবর দামেস্কের জাহিরিয়া লাইব্রেরিতে আছে।"
    ],
    "source": "তারিখে ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া এবং মামলুক সাম্রাজ্যের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_muhammad_ghori",
    "categoryId": "mujahid_jibon",
    "title": "**মুহাম্মাদ ঘুরী:** ভারত বিজয়ের পথপ্রদর্শক",
    "paragraphs": [
      "শিহাবুদ্দিন মুহাম্মাদ ঘুরী ছিলেন ঘুরী সাম্রাজ্যের সুলতান যিনি উত্তর ভারতে ইসলামী শাসন প্রতিষ্ঠা করেছিলেন। তিনি ১১৪৯ খ্রিস্টাব্দে আফগানিস্তানের ঘুর অঞ্চলে জন্মগ্রহণ করেন। তাঁর বড় ভাই গিয়াসুদ্দিন ছিলেন ঘুরী সাম্রাজ্যের সুলতান এবং মুহাম্মাদ ঘুরী ছিলেন সেনাপতি।",
      "১১৭৫ খ্রিস্টাব্দে মুহাম্মাদ ঘুরী প্রথমবার ভারত আক্রমণ করেন এবং মুলতান বিজয় করেন। ১১৭৮ খ্রিস্টাব্দে তিনি গুজরাট আক্রমণ করেন কিন্তু পরাজিত হন। এই পরাজয় তাঁকে দমাতে পারেনি। ১১৮৬ খ্রিস্টাব্দে তিনি লাহোর বিজয় করেন।",
      "১১৯১ খ্রিস্টাব্দে তারাইনের প্রথম যুদ্ধে তিনি পৃথ্বীরাজ চৌহানের কাছে পরাজিত হন। কিন্তু ১১৯২ খ্রিস্টাব্দে তারাইনের দ্বিতীয় যুদ্ধে তিনি বিজয়ী হন এবং পৃথ্বীরাজ চৌহান বন্দী হন। এই বিজয় ভারতে ইসলামী শাসনের দরজা খুলে দিল।",
      "তারাইনের বিজয়ের পর তিনি কুতুবুদ্দিন আইবককে ভারতের শাসক নিযুক্ত করেন। ১২০৬ খ্রিস্টাব্দে কুতুবুদ্দিন আইবক দিল্লি সালতানাত প্রতিষ্ঠা করেন যা ৩২০ বছর টিকে ছিল।",
      "১২০৬ খ্রিস্টাব্দে মুহাম্মাদ ঘুরী পাঞ্জাবে নামাজ পড়ার পর আক্রান্ত হন এবং শহীদ হন। তাঁর বিজয়ের ফলে ভারতে ইসলামী শাসন প্রতিষ্ঠিত হয় যা ৬০০ বছরেরও বেশি সময় ধরে বজায় থাকে।"
    ],
    "source": "তারিখে ফিরিশতা, তাবাকাতে নাসিরি এবং ভারতীয় উপমহাদেশের ইসলামী ইতিহাস।"
  },
  {
    "id": "mujahid_jibon_yusuf_ibn_tashfin",
    "categoryId": "mujahid_jibon",
    "title": "**ইউসুফ ইবনে তাশফিন:** আলমোরাভিদ সাম্রাজ্যের প্রতিষ্ঠাতা",
    "paragraphs": [
      "ইউসুফ ইবনে তাশফিন ছিলেন আলমোরাভিদ সাম্রাজ্যের প্রতিষ্ঠাতা এবং উত্তর আফ্রিকা ও স্পেনের মহান শাসক। তিনি ১০০৯ খ্রিস্টাব্দে মরক্কোতে জন্মগ্রহণ করেন এবং ১০০ বছর বয়স পর্যন্ত বেঁচে ছিলেন।",
      "১০৬০ খ্রিস্টাব্দে তিনি আলমোরাভিদ আন্দোলনের নেতা হন। তিনি মরক্কো একত্রিত করেন এবং ১০৬২ খ্রিস্টাব্দে মারাকেশ শহর প্রতিষ্ঠা করেন। তিনি আলজেরিয়া এবং তিউনিসিয়াও বিজয় করেন।",
      "১০৮৬ খ্রিস্টাব্দে স্পেনের মুসলিম শাসকরা তাঁর কাছে সাহায্য চান। তিনি স্পেনে যান এবং জালাকার যুদ্ধে কাস্তিলের রাজা আলফনসো ষষ্ঠকে পরাজিত করেন। এই বিজয় স্পেনে মুসলিম শাসন আরো ৪০০ বছর টিকিয়ে রাখে।",
      "তিনি অত্যন্ত সাদাসিধে জীবনযাপন করতেন এবং মোটা কাপড়ের পোশাক পরতেন। তিনি প্রতিদিন কুরআন তিলাওয়াত করতেন এবং রাতে তাহাজ্জুদ পড়তেন।",
      "১১০৬ খ্রিস্টাব্দে ১০০ বছর বয়সে তিনি মারাকেশে ইন্তেকাল করেন। তিনি উত্তর আফ্রিকা এবং স্পেনে একটি শক্তিশালী ইসলামী সাম্রাজ্য রেখে যান।"
    ],
    "source": "আল-কামিল ফিত তারিখ (ইবনুল আসির), তারিখুল মাগরিব এবং আন্দালুসের ইতিহাস।"
  },
  {
    "id": "mujahid_jibon_imaduddin_zangi",
    "categoryId": "mujahid_jibon",
    "title": "**ইমাদুদ্দিন জঙ্গী:** ক্রুসেডারদের বিরুদ্ধে প্রথম বিজয়ী",
    "paragraphs": [
      "ইমাদুদ্দিন জঙ্গী ছিলেন নূরউদ্দিন জঙ্গীর পিতা এবং ক্রুসেডারদের বিরুদ্ধে প্রথম বড় বিজয়ের নায়ক। তিনি ১০৮৭ খ্রিস্টাব্দে জন্মগ্রহণ করেন এবং ১১২৭ খ্রিস্টাব্দে মসুল ও আলেপ্পোর শাসক হন।",
      "১১৪৪ খ্রিস্টাব্দে তিনি এদেসা অবরোধ করেন এবং ২৮ দিন পর এদেসা বিজয় করেন। এটি ছিল ক্রুসেডারদের হাত থেকে প্রথম বড় বিজয়। এই বিজয় মুসলিম বিশ্বে আশার সঞ্চার করে।",
      "এদেসা বিজয়ের পর ইউরোপ থেকে দ্বিতীয় ক্রুসেড শুরু হয়। কিন্তু ইমাদুদ্দিন জঙ্গী এবং দামেস্কের শাসক মিলে তাদের পরাজিত করেন।",
      "তিনি মসজিদ, মাদ্রাসা এবং হাসপাতাল নির্মাণ করতেন। তিনি বলতেন: 'জিহাদ শুধু তরবারি দিয়ে নয়, ইলম এবং ন্যায়বিচার দিয়েও করা যায়।'",
      "১১৪৬ খ্রিস্টাব্দে তিনি ইন্তেকাল করেন। তাঁর পুত্র নূরউদ্দিন জঙ্গী তাঁর কাজ এগিয়ে নিয়ে যান এবং পরবর্তীতে সালাহউদ্দিন আইয়ুবী জেরুজালেম পুনরুদ্ধার করেন।"
    ],
    "source": "আল-কামিল ফিত তারিখ (ইবনুল আসির), তারিখে ইবনে কাসীর এবং ক্রুসেড যুদ্ধের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_alauddin_khilji",
    "categoryId": "mujahid_jibon",
    "title": "**আলাউদ্দিন খিলজি:** মঙ্গোল আক্রমণ প্রতিরোধকারী",
    "paragraphs": [
      "আলাউদ্দিন খিলজি ছিলেন দিল্লি সালতানাতের খিলজি বংশের দ্বিতীয় সুলতান এবং ভারতের ইতিহাসে সবচেয়ে শক্তিশালী শাসকদের একজন। তিনি ১২৯৬ খ্রিস্টাব্দে সুলতান হন এবং ২০ বছর শাসন করেন।",
      "১২৯৭ থেকে ১৩০৮ খ্রিস্টাব্দ পর্যন্ত মঙ্গোলরা ৬ বার ভারত আক্রমণ করে। তারা ২,০০,০০০ সৈন্য নিয়ে এসেছিল এবং দিল্লি পর্যন্ত পৌঁছেছিল। কিন্তু আলাউদ্দিন খিলজি প্রতিবারই তাদের পরাজিত করেন।",
      "তিনি একটি শক্তিশালী সেনাবাহিনী গড়ে তোলেন এবং সীমান্তে অনেক দুর্গ নির্মাণ করেন। তাঁর সেনাপতি মালিক কাফুর দক্ষিণ ভারত বিজয় করেন এবং প্রায় সমগ্র ভারত দিল্লি সালতানাতের অধীনে আসে।",
      "তিনি বাজার নিয়ন্ত্রণ ব্যবস্থা চালু করেন এবং খাদ্যদ্রব্যের দাম নির্ধারণ করে দেন যাতে দরিদ্র মানুষ সস্তায় খাবার কিনতে পারে।",
      "১৩১৬ খ্রিস্টাব্দে তিনি ইন্তেকাল করেন। তিনি ভারতকে মঙ্গোল আক্রমণ থেকে রক্ষা করেছিলেন। যদি তিনি না থাকতেন, তাহলে মঙ্গোলরা ভারত ধ্বংস করে দিত যেমন তারা বাগদাদ ধ্বংস করেছিল।"
    ],
    "source": "তারিখে ফিরিশতা, তাবাকাতে নাসিরি, জিয়াউদ্দিন বারানির তারিখে ফিরোজশাহী।"
  },
  {
    "id": "mujahid_jibon_tipu_sultan",
    "categoryId": "mujahid_jibon",
    "title": "**টিপু সুলতান:** মহীশূরের বাঘ",
    "paragraphs": [
      "টিপু সুলতান ছিলেন মহীশূর রাজ্যের সুলতান এবং ব্রিটিশদের বিরুদ্ধে সবচেয়ে সাহসী যোদ্ধাদের একজন। তিনি ১৭৫০ খ্রিস্টাব্দে কর্ণাটকে জন্মগ্রহণ করেন। তাঁর পিতা হায়দার আলী ছিলেন মহীশূরের শাসক।",
      "১৭৮২ খ্রিস্টাব্দে টিপু সুলতান মহীশূরের সুলতান হন। তিনি বললেন, 'শিয়ালের মতো ১০০ বছর বাঁচার চেয়ে বাঘের মতো ১ দিন বাঁচা ভালো।' তিনি ব্রিটিশদের বিরুদ্ধে লড়াই করার জন্য দৃঢ়প্রতিজ্ঞ ছিলেন।",
      "টিপু সুলতান ব্রিটিশদের বিরুদ্ধে চারটি যুদ্ধ করেছিলেন। প্রথম ও দ্বিতীয় মহীশূর যুদ্ধে তিনি বিজয়ী হন এবং ব্রিটিশরা শান্তি চুক্তি করতে বাধ্য হয়। তৃতীয় মহীশূর যুদ্ধে তিনি পরাজিত হন এবং তাঁর অর্ধেক রাজ্য হারান।",
      "টিপু সুলতান রকেট ব্যবহার করে যুদ্ধ করতেন যা সেই সময়ে অত্যাধুনিক অস্ত্র ছিল। তিনি শিল্প ও বাণিজ্যের উন্নতি করেছিলেন এবং ফরাসি ও তুর্কিদের সাথে মিত্রতা করেছিলেন।",
      "১৭৯৯ খ্রিস্টাব্দে চতুর্থ মহীশূর যুদ্ধে ব্রিটিশরা শ্রীরঙ্গপত্তনম দুর্গ আক্রমণ করে। টিপু সুলতান তরবারি হাতে যুদ্ধ করতে করতে শহীদ হন। তিনি আত্মসমর্পণ করেননি। ব্রিটিশ জেনারেল ওয়েলেসলি বলেছিলেন: 'টিপু সুলতান ছিলেন আমাদের সবচেয়ে বড় শত্রু এবং সবচেয়ে সাহসী যোদ্ধা।'"
    ],
    "source": "তারিখে টিপু সুলতান, ব্রিটিশ ইস্ট ইন্ডিয়া কোম্পানির দলিলসমূহ এবং ভারতীয় ইতিহাস।"
  },
  {
    "id": "mujahid_jibon_aurangzeb",
    "categoryId": "mujahid_jibon",
    "title": "**আওরঙ্গজেব আলমগীর:** মুঘল সাম্রাজ্যের শেষ মহান সম্রাট",
    "paragraphs": [
      "আবুল মুজাফফর মুহিউদ্দিন মুহাম্মাদ আওরঙ্গজেব আলমগীর ছিলেন মুঘল সাম্রাজ্যের ষষ্ঠ সম্রাট এবং ভারতের ইতিহাসে সবচেয়ে দীর্ঘ সময় শাসনকারী সম্রাট। তিনি ১৬১৮ খ্রিস্টাব্দে গুজরাটে জন্মগ্রহণ করেন এবং ৪৯ বছর (১৬৫৮-১৭০৭) শাসন করেন।",
      "আওরঙ্গজেব ছোটবেলা থেকেই কুরআন হিফজ করেছিলেন এবং হাদিস ও ফিকহ শিখেছিলেন। তিনি অত্যন্ত তাকওয়াবান ছিলেন এবং প্রতিদিন পাঁচ ওয়াক্ত নামাজ জামাতে পড়তেন। তিনি নিজ হাতে কুরআনের কপি লিখতেন এবং টুপি সেলাই করে বিক্রি করতেন। সেই অর্থ দিয়ে তিনি তাঁর ব্যক্তিগত খরচ চালাতেন।",
      "আওরঙ্গজেবের শাসনামলে মুঘল সাম্রাজ্য সবচেয়ে বড় হয়েছিল। তিনি দক্ষিণ ভারতের বিজাপুর এবং গোলকুন্ডা সালতানাত বিজয় করেন এবং প্রায় সমগ্র ভারত মুঘল সাম্রাজ্যের অধীনে আসে। তাঁর সাম্রাজ্য ছিল ৩২ লক্ষ বর্গ কিলোমিটার এবং ১৫ কোটি মানুষ তাঁর অধীনে ছিল।",
      "আওরঙ্গজেব ফতোয়ায়ে আলমগীরি সংকলন করান যা ছিল হানাফি ফিকহের একটি বিশাল গ্রন্থ। তিনি মসজিদ, মাদ্রাসা এবং হাসপাতাল নির্মাণ করেন। তিনি জিজিয়া কর পুনরায় চালু করেন এবং শরীয়াহ আইন প্রতিষ্ঠা করেন।",
      "আওরঙ্গজেব অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তিনি রাজকোষ থেকে ব্যক্তিগত খরচ করতেন না। তিনি বলতেন: 'আমি রাজকোষের অভিভাবক, মালিক নই।' তাঁর মৃত্যুর পর দেখা গেল তাঁর কাছে মাত্র ৩০৫ টাকা ছিল যা দিয়ে তাঁর কাফন কেনা হয়েছিল।",
      "১৭০৭ খ্রিস্টাব্দে ৮৮ বছর বয়সে আওরঙ্গজেব আহমেদনগরে ইন্তেকাল করেন। তাঁর মৃত্যুর পর মুঘল সাম্রাজ্য দুর্বল হয়ে যায় এবং ১০০ বছর পর ব্রিটিশরা ভারত দখল করে। তিনি ছিলেন ভারতের শেষ মহান মুসলিম সম্রাট।"
    ],
    "source": "আলমগীরনামা, মাসিরে আলমগীরি, খাফি খানের মুনতাখাবুল লুবাব এবং মুঘল ইতিহাস।"
  },
  {
    "id": "mujahid_jibon_sultan_qalawun",
    "categoryId": "mujahid_jibon",
    "title": "**সুলতান কালাউন:** মামলুক সাম্রাজ্যের মহান শাসক",
    "paragraphs": [
      "সুলতান কালাউন ছিলেন মামলুক সাম্রাজ্যের পঞ্চম সুলতান এবং বাইবার্সের পর সবচেয়ে শক্তিশালী শাসক। তিনি ১২২২ খ্রিস্টাব্দে মধ্য এশিয়ায় জন্মগ্রহণ করেন। ছোটবেলায় তাঁকে দাস হিসেবে মিসরে নিয়ে আসা হয় এবং মামলুক হিসেবে প্রশিক্ষণ দেওয়া হয়।",
      "কালাউন বাইবার্সের অধীনে সেনাপতি ছিলেন এবং আইন জালুতের যুদ্ধে মঙ্গোলদের বিরুদ্ধে লড়াই করেছিলেন। ১২৭৯ খ্রিস্টাব্দে তিনি মিসর ও সিরিয়ার সুলতান হন এবং ২১ বছর শাসন করেন।",
      "কালাউন মঙ্গোলদের বিরুদ্ধে আরো যুদ্ধ করেন এবং তাদের পরাজিত করেন। ১২৮১ খ্রিস্টাব্দে হিমসের যুদ্ধে তিনি মঙ্গোলদের বিশাল বাহিনীকে পরাজিত করেন। তিনি ক্রুসেডারদের বিরুদ্ধেও যুদ্ধ করেন এবং ত্রিপোলি, লাতাকিয়া এবং অনেক দুর্গ বিজয় করেন।",
      "কালাউন মিসরে অনেক হাসপাতাল নির্মাণ করেন। তাঁর নির্মিত কালাউন হাসপাতাল ছিল বিশ্বের সবচেয়ে বড় হাসপাতালগুলোর একটি যেখানে ৮,০০০ রোগী চিকিৎসা নিতে পারত। এই হাসপাতালে ধনী-গরিব সবাই বিনামূল্যে চিকিৎসা পেত।",
      "১২৯০ খ্রিস্টাব্দে ৬৮ বছর বয়সে কালাউন ইন্তেকাল করেন। তাঁর পুত্র আল-আশরাফ খলীল তাঁর কাজ এগিয়ে নিয়ে যান এবং ১২৯১ খ্রিস্টাব্দে আক্কা বিজয় করেন যা ছিল ক্রুসেডারদের শেষ শহর। এভাবে ক্রুসেডারদের শাসনের সম্পূর্ণ অবসান হয়।"
    ],
    "source": "তারিখে ইবনে কাসীর, আল-মাকরিজির আল-সুলুক এবং মামলুক সাম্রাজ্যের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_osman_gazi",
    "categoryId": "mujahid_jibon",
    "title": "**উসমান গাজী:** উসমানীয় সাম্রাজ্যের প্রতিষ্ঠাতা",
    "paragraphs": [
      "উসমান গাজী ছিলেন উসমানীয় সাম্রাজ্যের প্রতিষ্ঠাতা যা ৬০০ বছর টিকে ছিল এবং তিন মহাদেশে বিস্তৃত ছিল। তিনি ১২৫৮ খ্রিস্টাব্দে আনাতোলিয়ায় (বর্তমান তুরস্ক) জন্মগ্রহণ করেন। তাঁর পিতা আরতুগ্রুল গাজী ছিলেন একটি ছোট তুর্কি গোত্রের নেতা।",
      "১২৮১ খ্রিস্টাব্দে আরতুগ্রুলের মৃত্যুর পর উসমান গাজী তাঁর গোত্রের নেতা হন। তখন তাঁর কাছে ছিল মাত্র ৪,০০০ সৈন্য এবং একটি ছোট এলাকা। কিন্তু তিনি স্বপ্ন দেখেছিলেন যে তাঁর বংশ একটি বিশাল সাম্রাজ্য প্রতিষ্ঠা করবে।",
      "উসমান গাজী বাইজেন্টাইন সাম্রাজ্যের বিরুদ্ধে যুদ্ধ শুরু করেন এবং একের পর এক শহর বিজয় করতে থাকেন। তিনি বিলেসিক, ইনেগল এবং ইয়েনিশেহির বিজয় করেন। ১৩০১ খ্রিস্টাব্দে কয়ুনহিসারের যুদ্ধে তিনি বাইজেন্টাইনদের পরাজিত করেন এবং বুরসা অবরোধ করেন।",
      "উসমান গাজী শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন একজন দূরদর্শী নেতা। তিনি ন্যায়বিচার প্রতিষ্ঠা করেন এবং খ্রিস্টানদের সাথে ভালো ব্যবহার করেন। অনেক খ্রিস্টান তাঁর ন্যায়বিচার দেখে ইসলাম গ্রহণ করে। তিনি বলতেন: 'আমরা গাজী (ইসলামের জন্য যোদ্ধা)। আমাদের লক্ষ্য ইসলাম প্রচার করা এবং জুলুম বন্ধ করা।'",
      "১৩২৬ খ্রিস্টাব্দে ৬৮ বছর বয়সে উসমান গাজী ইন্তেকাল করেন। তাঁর পুত্র উরহান গাজী বুরসা বিজয় করেন এবং উসমানীয় সাম্রাজ্য আরো বড় হতে থাকে। পরবর্তীতে মুহাম্মাদ আল-ফাতিহ কনস্টান্টিনোপল বিজয় করেন এবং সুলাইমান দ্য ম্যাগনিফিসেন্ট ইউরোপের অর্ধেক বিজয় করেন। উসমান গাজীর স্বপ্ন বাস্তবায়িত হয় এবং উসমানীয় সাম্রাজ্য ৬০০ বছর টিকে থাকে।"
    ],
    "source": "উসমানীয় ইতিহাস, আশিকপাশাজাদের তারিখ এবং তুর্কি দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_sultan_suleiman",
    "categoryId": "mujahid_jibon",
    "title": "**সুলাইমান দ্য ম্যাগনিফিসেন্ট:** উসমানীয় সাম্রাজ্যের স্বর্ণযুগ",
    "paragraphs": [
      "সুলতান সুলাইমান প্রথম, যিনি 'সুলাইমান দ্য ম্যাগনিফিসেন্ট' নামে পরিচিত, ছিলেন উসমানীয় সাম্রাজ্যের দশম সুলতান এবং সবচেয়ে মহান শাসকদের একজন। তিনি ১৪৯৪ খ্রিস্টাব্দে ত্রাবজনে জন্মগ্রহণ করেন এবং ৪৬ বছর (১৫২০-১৫৬৬) শাসন করেন।",
      "সুলাইমানের শাসনামলে উসমানীয় সাম্রাজ্য তার সর্বোচ্চ শিখরে পৌঁছায়। তিনি হাঙ্গেরি, রোডস, বেলগ্রেড, বাগদাদ এবং ইয়েমেন বিজয় করেন। তাঁর সাম্রাজ্য ছিল ৫৫ লক্ষ বর্গ কিলোমিটার এবং তিন মহাদেশে বিস্তৃত—ইউরোপ, এশিয়া এবং আফ্রিকা।",
      "১৫২৬ খ্রিস্টাব্দে মোহাচের যুদ্ধে সুলাইমান হাঙ্গেরির রাজা লুই দ্বিতীয়কে পরাজিত করেন এবং হাঙ্গেরি বিজয় করেন। ১৫২৯ খ্রিস্টাব্দে তিনি ভিয়েনা অবরোধ করেন এবং ইউরোপ কাঁপিয়ে দেন। যদিও ভিয়েনা বিজয় হয়নি, কিন্তু উসমানীয় সাম্রাজ্য ইউরোপের সবচেয়ে শক্তিশালী রাষ্ট্র হয়ে ওঠে।",
      "সুলাইমান 'কানুনি' (আইনপ্রণেতা) নামেও পরিচিত কারণ তিনি অনেক আইন প্রণয়ন করেন এবং ন্যায়বিচার প্রতিষ্ঠা করেন। তিনি মসজিদ, সেতু, রাস্তা এবং হাসপাতাল নির্মাণ করেন। তাঁর স্থপতি মিমার সিনান ছিলেন বিশ্বের সেরা স্থপতিদের একজন যিনি সুলাইমানিয়া মসজিদ নির্মাণ করেন।",
      "সুলাইমান শিল্প, সাহিত্য এবং বিজ্ঞানের পৃষ্ঠপোষক ছিলেন। তাঁর শাসনামলে উসমানীয় সাম্রাজ্যে স্বর্ণযুগ ছিল। তিনি নিজেও কবিতা লিখতেন এবং 'মুহিব্বি' ছদ্মনামে কবিতা প্রকাশ করতেন।",
      "১৫৬৬ খ্রিস্টাব্দে ৭২ বছর বয়সে সুলাইমান হাঙ্গেরিতে যুদ্ধক্ষেত্রে ইন্তেকাল করেন। তিনি ছিলেন উসমানীয় সাম্রাজ্যের সবচেয়ে মহান সুলতান এবং তাঁর শাসনামলে ইসলামী সভ্যতা তার শিখরে পৌঁছেছিল।"
    ],
    "source": "উসমানীয় ইতিহাস, পেচেভির তারিখ এবং ইউরোপীয় দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_abdur_rahman_ghafiqi",
    "categoryId": "mujahid_jibon",
    "title": "**আবদুর রহমান আল-গাফিকি:** তুর যুদ্ধের বীর",
    "paragraphs": [
      "আবদুর রহমান আল-গাফিকি ছিলেন আন্দালুস (স্পেন) এর উমাইয়া গভর্নর এবং একজন মহান সেনাপতি। তিনি ৬৯০ খ্রিস্টাব্দে ইয়েমেনে জন্মগ্রহণ করেন এবং যুবক বয়সে স্পেনে চলে যান।",
      "৭৩২ খ্রিস্টাব্দে আবদুর রহমান আল-গাফিকি আন্দালুসের গভর্নর হন। তিনি ফ্রান্স আক্রমণের সিদ্ধান্ত নেন এবং পাইরিনিজ পর্বত পার হয়ে ফ্রান্সে প্রবেশ করেন। তিনি বর্দো, পোয়াতিয়ে এবং অনেক শহর বিজয় করেন এবং প্যারিসের দিকে এগিয়ে যান।",
      "৭৩২ খ্রিস্টাব্দের অক্টোবরে তুর (পোয়াতিয়ে) এর যুদ্ধ হয়। ফ্রাঙ্কদের রাজা চার্লস মার্টেল বিশাল বাহিনী নিয়ে মুসলমানদের বিরুদ্ধে দাঁড়ান। ৭ দিন ধরে যুদ্ধ চলে। আবদুর রহমান আল-গাফিকি বীরত্বের সাথে যুদ্ধ করেন কিন্তু শহীদ হন। তাঁর শাহাদাতের পর মুসলিম সেনাবাহিনী পিছু হটে।",
      "তুর যুদ্ধ ইউরোপের ইতিহাসে একটি গুরুত্বপূর্ণ যুদ্ধ। ইউরোপীয় ইতিহাসবিদরা বলেন যদি মুসলমানরা এই যুদ্ধে জিতত, তাহলে সমগ্র ইউরোপ ইসলামী হয়ে যেত। আবদুর রহমান আল-গাফিকি ছিলেন একজন সাহসী যোদ্ধা যিনি ইসলাম প্রচারের জন্য জীবন দিয়েছিলেন।",
      "তাঁর শাহাদাতের পর মুসলমানরা আর ফ্রান্স বিজয় করতে পারেনি কিন্তু স্পেনে ৮০০ বছর ইসলামী শাসন টিকে ছিল এবং সেখানে জ্ঞান-বিজ্ঞানের স্বর্ণযুগ সৃষ্টি হয়েছিল।"
    ],
    "source": "তারিখুল আন্দালুস, ইবনে আবদুল হাকামের ফুতুহু মিসর এবং ইউরোপীয় দলিলসমূহ।"
  },
  {
    "id": "muhammad_ibne_kasim",
    "categoryId": "mujahid_jibon",
    "title": "মুহাম্মদ ইবনে কাসিম : সিন্দ বিজয়ের স্থপতি ও উমাইয়া বীর সেনাপতি",
    "summary": "",
    "paragraphs": [
      "মুহাম্মদ ইবনে কাসিম আছ-ছাকাফী ছিলেন উমাইয়া খিলাফতের ইতিহাসে এক অত্যন্ত উজ্জ্বল এবং কিংবদন্তী সামরিক ব্যক্তিত্ব। তিনি কেবল একজন সেনাপতি ছিলেন না, বরং একজন দূরদর্শী প্রশাসক এবং ন্যায়পরায়ণ শাসক হিসেবেও পরিচিতি লাভ করেছিলেন। তাঁর সামরিক প্রতিভা এমন ছিল যে মাত্র সতেরো বছর বয়সে তৎকালীন রাজা দাহিরকে পরাজিত করে সিন্ধু জয় করেন এবং এর মধ্য দিয়ে ভারতীয় উপমহাদেশে মুসলিম শাসনের এক সুদূরপ্রসারী ভিত্তি স্থাপন করেন। তাঁর পুরো নাম ছিল ইমাদুদ্দীন মুহাম্মদ বিন কাসিম আছ-ছাকাফী, এবং তাঁর জীবনকাল ছিল ৬৯৫ খ্রিস্টাব্দ (৭৬ হিজরী) থেকে ৭১৫ খ্রিস্টাব্দ (৯৬ হিজরী)।",
      "**নাম, বংশ পরিচয় এবং ব্যতিক্রমী প্রারম্ভিক জীবন ও শিক্ষা:** মুহাম্মদের জন্ম হয়েছিল আনুমানিক ৬৯৫ খ্রিস্টাব্দে (৭৬ হিজরী)। তাঁর জন্মস্থান নিয়ে ঐতিহাসিকদের মধ্যে কিছুটা ভিন্নমত থাকলেও, এটি প্রায় নিশ্চিতভাবে হেজাজের (পশ্চিম আরব) ঐতিহ্যবাহী সাকিফ গোত্রের এলাকা, যেমন তায়েফ, মক্কা অথবা মদিনা ছিল। তিনি বিখ্যাত সাকীফ গোত্রের বানু আউফ শাখার আবু আকিল পরিবারের অন্তর্ভুক্ত ছিলেন। এই গোত্রটি প্রাথমিক মুসলিম বিজয়ের সময় এবং পরে বিশেষ করে ইরাকে গুরুত্বপূর্ণ সামরিক ও অর্থনৈতিক ভূমিকা পালন করেছিল। তাঁর পিতা আল কাসিম বিন ইউসুফ তাঁর বাল্যকালেই ইন্তেকাল করেন। পিতার অকাল মৃত্যুর পর, তাঁর লালন-পালনের দায়িত্ব নেন তাঁর অত্যন্ত প্রভাবশালী চাচা হাজ্জাজ বিন ইউসুফ আছ-ছাকাফী, যিনি তৎকালীন উমাইয়া খিলাফতের ইরাকের শক্তিশালী গভর্নর ছিলেন। হাজ্জাজ ছিলেন উমাইয়া খলিফা আবদুল মালিক (৬৮৫–৭০৫) এর অত্যন্ত বিশ্বস্ত একজন সেনাপতি। হাজ্জাজের তত্ত্বাবধানে মুহাম্মদ ইবনে কাসিম শৈশব থেকেই সামরিক কৌশল, প্রশাসনিক দক্ষতা এবং নেতৃত্বের গুণাবলীতে সুচারুভাবে প্রশিক্ষণ লাভ করেন। হাজ্জাজ ইরাকের প্রাদেশিক রাজধানী ওয়াসিত (যা হাজ্জাজ ৭০২ সালে প্রতিষ্ঠা করেছিলেন) শহরে তাঁর পৃষ্ঠপোষকতায় মুহাম্মদ ইবনে কাসিমকে শিক্ষিত ও প্রশিক্ষিত করে তোলেন। হাজ্জাজ তাঁকে এতটাই পছন্দ করতেন এবং তাঁর প্রতিভার স্বীকৃতি দিয়েছিলেন যে তিনি তাঁকে নিজের মেয়ে জয়নাবকে বিয়ে করার জন্য যথেষ্ট মর্যাদাপূর্ণ মনে করতেন। কিতাবুল আগানিতে, ১৭ বছর বয়সী মুহাম্মদকে \"তার সময়ের সর্বশ্রেষ্ঠ সাকফি\" বলে উল্লেখ করা হয়েছে, যা তাঁর অল্প বয়সেই অর্জিত অসাধারণ দক্ষতার ইঙ্গিত বহন করে। আধুনিক ঐতিহাসিক নবী বখশ বালুচ মনে করেন, মোহাম্মদ অনুকূল পরিবেশে একজন দক্ষ, উদ্যমী এবং সূক্ষ্ম রুচির সংস্কৃতিবান ছেলে হয়ে বেড়ে উঠেছিলেন।",
      "**প্রথম সামরিক ও প্রশাসনিক দায়িত্ব:** ফর্সের গভর্নর হিসেবে নিয়োগ: মুহাম্মদ ইবনে কাসিমের কর্মজীবনের সূচনা হয় আধুনিক ইরানের ফর্স প্রদেশে, যেখানে তিনি কৈশোরেই গুরুত্বপূর্ণ দায়িত্ব লাভ করেন। তাঁর প্রথম সামরিক অ্যাসাইনমেন্ট ছিল এই প্রদেশের কুর্দিদের একটি বিদ্রোহী দলকে বশীভূত করা। তিনি এই মিশন অত্যন্ত সফলভাবে শেষ করেন, যা তাঁর প্রারম্ভিক সামরিক সক্ষমতা প্রমাণ করে। এই সাফল্যের পর, তিনি সম্ভবত তাঁর ছোট চাচা মোহাম্মদ বিন ইউসুফ আস সাকাফির স্থলাভিষিক্ত হয়ে ফারসের গভর্নর হিসেবে নিযুক্ত হন। এই পদে তাঁর দায়িত্ব ছিল কেবলমাত্র সামরিক নয়, বরং প্রশাসনিকও। দায়িত্ব পাওয়ার পর, তিনি শিরাজ শহরটিকে পুনরুজ্জীবিত করেন, সেখানে একটি রাজকীয় ভিলা এবং এর কাছাকাছি একটি সামরিক ক্যাম্প তৈরি করেন। তাঁর প্রশাসনিক দক্ষতার আরেকটি প্রমাণ হলো, তাঁকে শিরাজের দক্ষিণে কাস্পিয়ান সাগরের নিকটবর্তী জুরজানের কিছু অঞ্চল বশীভূত করার দায়িত্বও দেওয়া হয়েছিল, যা তিনি কার্যকরভাবে সম্পন্ন করেন। এই সময়ে, ইবনে আশ'আসের বিদ্রোহের কিছু অবশিষ্ট সমর্থক ফর্সে সক্রিয় ছিল। হাজ্জাজের আদেশে মুহাম্মদ বিন কাসিম এই বিদ্রোহীদের দমন করেন এবং তাঁদের মধ্যে অন্যতম শিয়া ব্যক্তিত্ব আতিয়া ইবনে সা'দ আউফীকে গ্রেফতার করেন। আতিয়াকে হযরত আলী (রাঃ)-কে গালি দিতে বলা হলে তিনি অস্বীকার করেন এবং এর শাস্তি হিসেবে তাঁকে ৪০০ বেত্রাঘাত করা হয় ও লাঞ্ছনার জন্য চুল ও দাড়ি কামিয়ে দেওয়া হয়। এই ঘটনাটি হাজ্জাজের কঠোর শাসনের একটি চিত্র তুলে ধরে এবং মুহাম্মদ ইবনে কাসিমের ওপর অর্পিত কঠিন দায়িত্বের প্রকৃতিও প্রকাশ করে।",
      "**সিন্ধু বিজয়ের ঐতিহাসিক প্রেক্ষাপট ও কৌশলগত গুরুত্ব:** উমাইয়া খিলাফতের জন্য সিন্ধু অঞ্চল ছিল কেবল একটি দূরবর্তী প্রদেশ নয়, বরং এটি অর্থনৈতিক এবং কৌশলগত উভয় দিক থেকেই অত্যন্ত গুরুত্বপূর্ণ ছিল। উমাইয়া খিলাফতের সম্প্রসারণের মানচিত্র অনুযায়ী, এই অঞ্চলে তাদের আগ্রহ ক্রমাগত বৃদ্ধি পাচ্ছিল। সিন্দ বিজয়ের তাৎক্ষণিক কারণ ছিল বারবার দেবল বন্দরের জলদস্যুদের দ্বারা মুসলিম জাহাজ ও ব্যবসায়ীদের ওপর আক্রমণ ও লুটপাট। মেদ (সিন্ধুতে বসবাসকারী সিথিয়ানদের একটি উপজাতি) এবং অন্যান্য স্থানীয় উপজাতিরা দজলার মুখ থেকে শ্রীলঙ্কার উপকূল পর্যন্ত তাদের বাওয়ারিজ থেকে সাসানি জাহাজগুলোতে জলদস্যুতা করত এবং তারা দেবল, কচ্ছ ও কাথিয়াবাড়ের ঘাঁটি থেকে আরব জাহাজ শিকার করতে সক্ষম হয়েছিল। ৭১০ সালে শ্রীলঙ্কা থেকে আরবে ভ্রমণকারী মুসলিম মহিলাদের অপহরণের ঘটনাটি ছিল চরম উস্কানিমূলক। ইরাকের গভর্নর হাজ্জাজ বিন ইউসুফ সিন্ধুর শাসক রাজা দাহিরের কাছে এই ঘটনার ক্ষতিপূরণ এবং বন্দীদের মুক্তি দাবি করেন। কিন্তু রাজা দাহির এই বলে প্রত্যাখ্যান করেন যে, জলদস্যুদের উপর তাঁর কোনো নিয়ন্ত্রণ নেই। এছাড়াও, উমাইয়াদের থেকে পালিয়ে আসা সাসানি এবং আরব বিদ্রোহীদের আশ্রয় প্রদানের জন্যও আরবরা সিন্ধু অভিযানে আগ্রহী ছিল। এই সব কারণ একত্রিত হয়ে হাজ্জাজ বিন ইউসুফকে সিন্ধুর বিরুদ্ধে একটি চূড়ান্ত সামরিক ব্যবস্থা নিতে বাধ্য করে। তিনি পূর্বের দুটি অভিযানের ব্যর্থতার পর, খলিফা আল-ওয়ালিদ ইবনে আবদুল মালিকের অনুমতিক্রমে ৭১১ খ্রিস্টাব্দে (৯২ হিজরী) মাত্র সতেরো বছর বয়সী মুহাম্মদ বিন কাসিমকে এই ঐতিহাসিক সিন্ধু বিজয়ের কঠিন দায়িত্ব দেন। হাজ্জাজ এই অভিযানটি পূর্বের তুলনায় অধিক যত্ন ও পরিকল্পনা করেছিলেন, যা এই অভিযানের গুরুত্ব প্রমাণ করে।",
      "**সুসংগঠিত সামরিক অভিযান এবং দেবল দুর্গের পতন (৭১১ খ্রিস্টাব্দ):** মুহাম্মদ ইবনে কাসিমের সিন্ধু অভিযান ছিল তাঁর সামরিক প্রতিভার এক উজ্জ্বল দৃষ্টান্ত। ৭১১ খ্রিস্টাব্দে (৯২ হিজরী) তিনি প্রায় ৬,০০০ জন সিরীয় অশ্বারোহী এবং ইরাক থেকে আসা মাওয়ালিদের একটি দল নিয়ে শিরাজ থেকে মাক্রান (বেলুচিস্তান) হয়ে সিন্ধুর দিকে রওয়ানা হন। তাঁর সৈন্যবাহিনীতে আরও একটি অগ্রিম বাহিনী এবং ছয় হাজার উটের অশ্বারোহী বাহিনী যোগ দিয়েছিল। তাঁর সামরিক কৌশলের একটি অন্যতম দিক ছিল সুসংগঠিত সরবরাহ ব্যবস্থা; স্থলপথে সৈন্যরা অগ্রসর হলেও, মিনজানিক (ম্যাঙ্গোনেল)-সহ ভারী সামরিক সরঞ্জাম ও রসদ সাগরের পথ ধরে জাহাজে করে সিন্ধু নদীর মোহনায় দেবলে স্থানান্তরিত করা হতো। এই অভিযানের প্রথম লক্ষ্য ছিল সিন্ধুর গুরুত্বপূর্ণ বন্দর নগরী দেবল। দেবল দুর্গ ছিল অত্যন্ত শক্তিশালী এবং এর একটি উঁচু মন্দিরের চূড়ায় উড়ছিল একটি পতাকা, যা স্থানীয়দের বিশ্বাস অনুযায়ী দুর্গের অক্ষয়তার প্রতীক ছিল। হাজ্জাজের নির্দেশ অনুযায়ী মুহাম্মদ দেবলের ঔদ্ধত্যের জবাব দিতে মন্দিরটিকে গুড়িয়ে দেন। তিনি দূরপাল্লার কামানের সাহায্যে মন্দির চূড়ার পতাকা নামিয়ে দেন, যা দুর্গের রক্ষকদের মনোবল সম্পূর্ণরূপে ভেঙে দেয়। কঠোর অবরোধ এবং সুনিপুণ সামরিক কৌশলের মাধ্যমে দেবল দুর্গের পতন ঘটে। এই বিজয় সিন্ধু বিজয়ের সূচনা করে এবং মুসলিম বাহিনীর আত্মবিশ্বাস বহুগুণ বাড়িয়ে দেয়। দেবল বিজয়ের পর, আরব সৈন্যরা যুদ্ধ ছাড়াই উত্তর-পূর্ব দিকে যাত্রা করে নেরুণ ও সাদুসানের (সেহওয়ান) মতো শহরগুলি জয় করেন।",
      "**রাজা দাহিরের সাথে চূড়ান্ত যুদ্ধ ও আরোরের পতন (৭১২ খ্রিস্টাব্দ):** দেবল বিজয়ের পর মুহাম্মদ ইবনে কাসিম রাজা দাহিরের মুখোমুখি হওয়ার জন্য অগ্রসর হন। রাজা দাহির সিন্ধু নদের পূর্ব তীরে তাঁর বিশাল বাহিনী ও যুদ্ধহাতি নিয়ে প্রস্তুত ছিলেন। মুহাম্মদ ইবনে কাসিম হাজ্জাজের পাঠানো অতিরিক্ত শক্তি পুনরায় সরবরাহ ও গ্রহণ করার জন্য নেরুনে ফিরে আসেন। এরপর তিনি দক্ষতার সাথে সিন্ধু নদ পার হন, জাট ও নৌকা মালিকদের সাথে দর কষাকষি করে বেট দ্বীপের রাজা মোকাহ বাসায়ার সাহায্য গ্রহণ করেন। ৭১২ খ্রিস্টাব্দে আররুরে (রোহরি) মুহাম্মাদ সম্মুখযুদ্ধে রাজা দাহিরের বাহিনী ও পূর্ব-জাটদের মুখোমুখি হন। এই যুদ্ধে রাজা দাহির তাঁর যুদ্ধহাতির পিঠে বসে লড়াই করেন। কিন্তু মুহাম্মদ ইবনে কাসিমের তীরন্দাজদের নিখুঁত লক্ষ্যে দাহিরের হাতি আহত হয় এবং রাজা নিহত হন। রাজা নিহত হওয়ার পর তাঁর বাহিনী ছত্রভঙ্গ হয়ে যায় এবং মুসলিমদের বিজয় নিশ্চিত হয়। এই বিজয়ের পর তিনি ব্রাহ্মণাবাদ ও আলোরের মতো গুরুত্বপূর্ণ শহরগুলোও দখল করেন। রাজা দাহিরের শিরশ্ছেদ করে তাঁর মাথা বসরার গভর্নর হাজ্জাজের কাছে পাঠানো হয়। মুহাম্মদ বিন কাসিম এইভাবে প্রথম মুসলিম বিজেতা হিসেবে সফলভাবে ভারতীয় ভূমি দখল করেন।",
      "**প্রশাসনিক নীতি, ন্যায়পরায়ণতা এবং জিম্মি ব্যবস্থা:** মুহাম্মদ ইবনে কাসিম শুধু একজন সামরিক বিজেতা ছিলেন না, তিনি ছিলেন একজন ব্যতিক্রমী ও দূরদর্শী প্রশাসক। সিন্ধু বিজয়ের পর তাঁর প্রধান কাজ ছিল একটি স্থিতিশীল প্রশাসনিক কাঠামো স্থাপন করা, যা একটি নতুন বিজিত বিদেশি ভূমিকে মুসলিম শাসনের অন্তর্ভুক্ত করবে। তিনি একটি সমঝোতামূলক নীতি গ্রহণ করেন এবং স্থানীয়দের তাদের ধর্মীয় কর্মকাণ্ডে হস্তক্ষেপ না করার বিনিময়ে মুসলিম শাসন মেনে নেওয়ার অনুরোধ করেন। মুসলিমরা বিজিত অঞ্চলে ইসলামি শরিয়া আইন প্রতিষ্ঠা করলেও, হিন্দু ও বৌদ্ধদের তাদের গ্রাম শাসন এবং নিজস্ব আইন অনুসারে তাদের মধ্যকার বিরোধ নিষ্পত্তি করার অনুমতি দেওয়া হয়। তিনি গ্রামের ঐতিহ্যবাহী নেতৃত্ব (রঈস ও সর্দার) বজায় রাখেন। অমুসলিমদের জিজিয়া কর প্রদানের বিনিময়ে জিম্মি (সংরক্ষিত ব্যক্তি) হিসেবে মর্যাদা দেওয়া হয়, যা তাদের নিরাপত্তা, সম্পদ ও উপাসনালয় সংরক্ষণের নিশ্চয়তা দিত। স্থানীয় অমুসলিমদের সেনাবাহিনীর চাকরি ও মুসলিমদের উপর আরোপিত জাকাত থেকে অব্যাহতি দেওয়া হয়। সরকারি রাজস্বের তিন শতাংশ ব্রাহ্মণদের জন্য বরাদ্দ ছিল, যা তাঁর উদার নীতির প্রমাণ। তিনি প্রশাসনে হিন্দু ও বৌদ্ধদের বিশ্বস্ত উপদেষ্টা ও গভর্নর হিসেবে অন্তর্ভুক্ত করেন; এমনকি একজন হিন্দু কাকসা তাঁর প্রশাসনের দ্বিতীয় গুরুত্বপূর্ণ সদস্য ছিলেন। এই উদার নীতি বিজিত জনগণের মধ্যে মুসলিম শাসনের প্রতি সমর্থন তৈরি করেছিল।",
      "**সামরিক ও রাজনৈতিক কৌশল এবং সমালোচনামূলক আলোচনা:** হাজ্জাজ কর্তৃক মুহাম্মাদকে পাঠানো চিঠিতে সামরিক কৌশলের রূপরেখা দেওয়া হয়েছিল: \"আহলে হার্বের (যোদ্ধাদের) সবাইকে হত্যা করো; তাদের ছেলে-মেয়েদের জিম্মি করে আটক করে বন্দি করো। যারা আমাদের বিরুদ্ধে যুদ্ধ করে না...তাদের আমান (শান্তি ও নিরাপত্তা) দান করো এবং তাদের সম্মান ও সম্পদের জিম্মি (সংরক্ষণকারী ব্যক্তি) হিসাবে নিজেকে স্থির করো।\" আরবদের প্রথম লক্ষ্য ছিল অর্থনৈতিক অবকাঠামো সংরক্ষণের সাথে স্বল্পকায় হতাহতের মাধ্যমে সিন্ধু বিজয়কে সহজতর করা। শহরগুলিকে দুটি বিকল্প দেওয়া হয়েছিল: হয় শান্তিপূর্ণভাবে আত্মসমর্পণ অথবা বলপ্রয়োগের মাধ্যমে প্রতিরোধের মুখোমুখি হওয়া। যেখানে প্রতিরোধ শক্তিশালী ছিল, সেখানে মুহাম্মদ বিন কাসিমের প্রতিক্রিয়া ছিল কঠিন; রাওয়ারে ৬,০০০ জন, ব্রাহ্মণাবাদে ৬,০০০ থেকে ২৬,০০০, ইস্কাল্টানে ৪,০০০ এবং মুলতানে ৬,০০০ মানুষের মৃত্যু হয়। তবে সুলহের (পরামর্শ/চুক্তি) মাধ্যমে দখলকৃত এলাকা, যেমন: আরমাবিল, নিরুন ও আরোরে প্রতিক্রিয়া ছিল খুবই হালকা। হাজ্জাজ একবার মুহাম্মাদকে অতি নম্র হওয়ার জন্য তিরস্কারও করেছিলেন।",
      "**ধর্মীয় সহনশীলতা এবং বিতর্কের অবসান:** মুহাম্মদ বিন কাসিমকে ধর্মীয় সহনশীলতার আদর্শ প্রতীক হিসেবে দেখা হয়। তিনি হিন্দু ও বৌদ্ধদের জিম্মি শ্রেণীতে অন্তর্ভুক্তির ন্যায্যতা প্রদানকারী প্রাচীনতম বিবৃতি দিয়েছিলেন: 'মূর্তিভরা মন্দিরগুলি খ্রিস্টানদের গীর্জা, ইহুদিদের সিনাগগ ও জরাথুস্ট্রীয়দের মন্দিরের মতো।' তাঁর এই উক্তিকে ঐতিহাসিকরা অত্যন্ত গুরুত্বপূর্ণ মনে করেন, যা ইসলামের ধর্মীয় সহনশীলতার ভিত্তি স্থাপন করে। লেন-পুল (১৯৭০) এর বর্ণনা অনুযায়ী, তাঁর বিজয় ছিল \"উদারপন্থী\", এবং তিনি অমুসলিম স্থানীয়দের জিম্মি করে তাঁদের জীবন ও জমি রক্ষা করেছিলেন। এমনকি হিন্দু ও বৌদ্ধ উপাসনালয়গুলিও অপবিত্র রাখা হয়নি। তবে, কিছু মন্দির ধ্বংস এবং বেসামরিক গণহত্যা ঘটলেও, তা ছিল ব্যতিক্রম। কিছু ঐতিহাসিক জোরপূর্বক ধর্মান্তরকরণের কথা বললেও, মুসলিম ঐতিহাসিকরা দাবি করেন যে সিন্ধুতে জোরপূর্বক কোনো ধর্মান্তর ঘটেনি। মানান আহমেদ আসিফ এবং অন্যান্য আধুনিক মুসলিম ঐতিহাসিকরা বিশ্বাস করেন যে সিন্ধু বিজয় মূলত শান্তিপূর্ণ ছিল এবং ধর্মান্তরও সম্পূর্ণরূপে স্বেচ্ছামূলক ছিল।",
      "**ব্যক্তিগত গুণাবলী, নেতৃত্ব এবং জনগণের উপর প্রভাব:** মুহাম্মদ বিন কাসিম ছোটবেলা থেকেই সাহস, প্রজ্ঞা এবং নম্রতার এক বিরল সংমিশ্রণ দেখিয়েছিলেন। হাজ্জাজ বিন ইউসুফ তাঁকে দায়িত্বের প্রাক্কালে উপদেশ দিয়েছিলেন: \"যদি তুমি কোনো দেশ নিয়ন্ত্রণে রাখতে চাও, তবে তার প্রতি দয়ালু হও। যারা তোমার সাথে ভালো ব্যবহার করেছে, তাদের সাথে আচরণ করার ক্ষেত্রে উদার হও এবং নিজের শত্রুকে বোঝার চেষ্টা করো। যে তোমার বিরোধিতা করে তার সাথেও সম্ভব হলে করুণাময় হও।\" মুহাম্মদ এই উক্তিগুলির স্বার্থক প্রয়োগ ঘটান। তিনি অত্যন্ত নম্রতার বৈশিষ্ট্যযুক্ত ছিলেন এবং তাঁর সেনাবাহিনীতে যারা বয়সে বড় ছিলেন, তাদের পরামর্শ ব্যতীত আদেশ করতেন না। তিনি যেখানেই গিয়েছেন প্রতিটি স্থানেই তিনি মসজিদ নির্মাণ এবং জনকল্যাণমূলক কাজ করেছেন এবং ইসলামি সংস্কৃতির প্রচার ও প্রসারের জন্য কাজ করেছেন। ঐতিহাসিক লেনপুল বলেন, মোহাম্মাদ বিন কাসিম ছিলেন উদার এবং সহনশীল বিজেতা শাসক। তাঁর উদারতার জন্যই পরবর্তীতে হিন্দু সম্প্রদায় তাঁর মূর্তি বানিয়ে পূজা করত বলেও কথিত আছে।",
      "**মৃত্যু ও দুর্ভাগ্যজনক পরিসমাপ্তি (৭১৫ খ্রিস্টাব্দ):** হাজ্জাজ ৭১৪ সালে মারা যান এবং তাঁর এক বছর পর খলিফা প্রথম আল ওয়ালিদও ইন্তেকাল করেন। আল ওয়ালিদের পর তাঁর ভাই সুলায়মান খিলাফতের স্থলাভিষিক্ত হন। হাজ্জাজ আল ওয়ালিদের একান্ত বিশ্বস্ত ছিলেন এবং খিলাফতের বিষয়ে তাঁর ছেলের পক্ষে প্রচারণা চালিয়েছিলেন, যার ফলে তিনি সুলাইমানের বিরাগভাজন হন। সুলায়মান হাজ্জাজের ঘনিষ্ঠ জেনারেল ও কর্মকর্তাদের বিরুদ্ধে প্রতিশোধ নেওয়া শুরু করেন। এই রাজনৈতিক কোন্দলের শিকার হন মুহাম্মদ বিন কাসিম। তাঁকে সিন্ধু থেকে প্রত্যাহার করে ইরাকে ডেকে পাঠানো হয় এবং সেখানে খলিফার নির্দেশে মাত্র ২০ বছর বয়সে (৭১৫ খ্রিস্টাব্দে) তাঁকে বন্দী করা হয়। মুহাম্মদ বিন কাসিম ৭১৫ সালের ১৮ জুলাই ইরাকের মসুলে মারা যান। তাঁর ভাগ্যের বিবরণ সম্পর্কে দুটি ভিন্ন বর্ণনা পাওয়া যায়:",
      "**বালাজুরীর বর্ণনা মতে:** ইরাকের নতুন গভর্নর ইয়াজিদ ইবনে আবি কাবশা, যিনি পূর্বের হাজ্জাজের হাতে নির্যাতিত ও বন্দী ছিলেন, তাঁর সাথে পারিবারিক কলহের জের ধরে এবং খলিফা সুলাইমানের নির্দেশে মুহাম্মদ বিন কাসিমকে গ্রেফতার করে নির্যাতন করা হয় এবং হত্যা করা হয়। এই বর্ণনায় মুহাম্মদের মৃত্যুর জন্য রাজনৈতিক প্রতিশোধকে দায়ী করা হয়।",
      "**চাচ নামা-এর বর্ণনা মতে:** এই গ্রন্থে একটি রোমান্টিক এবং বিতর্কিত গল্প বর্ণিত হয়েছে। বলা হয়, রাজা দাহিরের কন্যা সূর্য দেবী এবং পরিমল দেবী, যারা সিন্ধু বিজয়ের সময় বন্দী হয়েছিলেন, তারা খলিফার কাছে মিথ্যা অভিযোগ করেন যে মুহাম্মদ তাদের এখানে পাঠানোর আগে তাদের ইজ্জত লঙ্ঘন করেছিলেন। এই অভিযোগের ভিত্তিতে মুহাম্মদকে একটি মরা গরুর চামড়ায় মুড়ে সেলাই করা হয়েছিল এবং সেই অবস্থায় তাঁকে সিরিয়ায় পাঠানো হয়। শ্বাসরোধ হয়ে পথেই তাঁর মৃত্যু হয়। তবে, এই বিবরণের সত্যতা নিয়ে অনেক অভিযোগ উত্থাপিত হয়েছে এবং এটিকে একটি সন্দেহজনক উৎস হিসেবে বিবেচনা করা হয়।",
      "**মুহাম্মদ পরবর্তী সিন্ধুর পরিস্থিতি:** মুহাম্মদ বিন কাসিমের প্রস্থানের পর সিন্ধু অঞ্চলে উমাইয়া খিলাফতের নিয়ন্ত্রণ দুর্বল হয়ে পড়ে। পরবর্তী নিযুক্ত আরব গভর্নর অল্প দিনের মধ্যেই মারা যান। দাহিরের পলায়নকারী পুত্র সিন্ধুতে ফিরে আসেন এবং ব্রাহ্মনাবাদ পুনরুদ্ধার করেন। ৭২০ সালে দ্বিতীয় অভিযানে ব্রাহ্মনাবাদ পুনরুদ্ধার হলেও, উমাইয়ারা উত্তরাধিকার সংকটে জড়িয়ে পড়লে সিন্ধুতে তাদের বিচ্ছেদ ঘটে। ৮৭০ সালে আব্বাসীয় আমলে স্থানীয় আমিররা খলিফার প্রতি সমস্ত আনুগত্য বন্ধ করে দেন। ১০ শতকের মধ্যে সিন্ধু দুটি দুর্বল রাজ্যে বিভক্ত হয়ে যায় এবং পরবর্তীতে ইসমাইলীদের হাতে পরাস্ত হয়। মাহমুদ গজনভির আগমনের আগ পর্যন্ত উত্তর ও পূর্বের হিন্দু রাজারা প্রায় তিন শতাব্দী ধরে আরব বিজয় ঠেকিয়ে রেখেছিল।",
      "**ঐতিহাসিক গুরুত্ব এবং বিতর্কের পর্যালোচনা:** মুহাম্মদ বিন কাসিমের সিন্ধু জয় ছিল অত্যন্ত ব্যয়বহুল, কিন্তু এটি উমাইয়া খিলাফতের জন্য একটি বড় লাভ ছিল। এর ফলে ইসলাম ভারতীয় উপমহাদেশে প্রবেশ করে এবং গোটা অঞ্চলে ছড়িয়ে যায়। তাঁর সামরিক ও প্রশাসনিক সাফল্য ভারতীয় উপমহাদেশে ইসলামের দীর্ঘমেয়াদী প্রভাবের সূচনা করে। যদিও তাঁর বিজয়ের কিছু কঠোরতা ও মৃত্যুর ঘটনা বিতর্কিত, তবুও তাঁর উদার এবং সহনশীল শাসননীতি তাঁকে একজন দূরদর্শী নেতা হিসেবে প্রতিষ্ঠিত করে। তাঁর জীবন এক দুর্ভাগ্যজনক রাজনৈতিক ষড়যন্ত্রের মাধ্যমে শেষ হলেও, সিন্ধু বিজয়ী হিসেবে তাঁর অবদান ভারতীয় উপমহাদেশের ইতিহাসে এক নতুন দিগন্ত উন্মোচন করেছিল এবং তাঁকে ইতিহাসের পাতায় অমর করে রেখেছে।"
    ],
    "moral": "",
    "source": "আল বিদায়া ওয়ান নিহায়া, আল কামিল ফিত তারিখ, তারিখুল খুলাফা, তারিখুল ইসলাম, ফুতুহুল বুলদান (বালাজুরি), কিতাবুল বুলদান (ইয়াকুবি), চাচ নামা, সহীহ বুখারী, Lane-Poole (Medieval India), Wink (Al-Hind)।"
  }
]