[
  {
    "id": "mujahid_jibon_khalid_ibn_walid",
    "categoryId": "mujahid_jibon",
    "title": "খালিদ ইবনে ওয়ালিদ (রাঃ): আল্লাহর তরবারি",
    "paragraphs": [
      "খালিদ ইবনে ওয়ালিদ (রাঃ) ছিলেন ইসলামের সর্বশ্রেষ্ঠ সেনাপতি এবং যুদ্ধকৌশলের এক অতুলনীয় মাস্টার। তিনি মক্কার বনু মাখযুম গোত্রের সম্ভ্রান্ত পরিবারে জন্মগ্রহণ করেন। ছোটবেলা থেকেই তিনি ছিলেন অসাধারণ যোদ্ধা এবং ঘোড়সওয়ার। কুরাইশরা তাঁকে তাদের সেরা সেনাপতি হিসেবে মনে করত।",
      "ইসলামের প্রথম দিকে খালিদ (রাঃ) মুসলমানদের বিরুদ্ধে যুদ্ধ করতেন। উহুদ যুদ্ধে তিনি কাফিরদের পক্ষে যুদ্ধ করেছিলেন এবং তাঁর অসাধারণ কৌশলের কারণে মুসলমানরা কঠিন পরিস্থিতিতে পড়েছিল। তিনি মুসলিম তীরন্দাজদের পেছন থেকে আক্রমণ করে যুদ্ধের মোড় ঘুরিয়ে দিয়েছিলেন। কিন্তু আল্লাহ তাঁর জন্য হেদায়েত লিখে রেখেছিলেন।",
      "হুদাইবিয়ার সন্ধির পর খালিদ (রাঃ) ইসলামের সৌন্দর্য দেখতে পেলেন। তিনি বুঝতে পারলেন যে মুহাম্মাদ (সাঃ) সত্যিই আল্লাহর রাসূল। ৬২৯ খ্রিস্টাব্দে তিনি আমর ইবনুল আস (রাঃ) এবং উসমান ইবনে তালহা (রাঃ) এর সাথে মদিনায় গেলেন এবং ইসলাম গ্রহণ করলেন। রাসূলুল্লাহ (সাঃ) তাঁকে দেখে অত্যন্ত খুশি হলেন এবং বললেন: 'আল্লাহর শুকরিয়া যে তিনি তোমাকে হেদায়েত দিয়েছেন। তোমার মতো বুদ্ধিমান ব্যক্তি ইসলামের সৌন্দর্য বুঝতে পারবে না এটা হতে পারে না।'",
      "ইসলাম গ্রহণের পর খালিদ (রাঃ) প্রথম যুদ্ধে অংশ নেন মুতার যুদ্ধে। এই যুদ্ধে রাসূলুল্লাহ (সাঃ) যায়েদ ইবনে হারিসা (রাঃ), জাফর ইবনে আবি তালিব (রাঃ) এবং আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) কে সেনাপতি নিযুক্ত করেছিলেন। কিন্তু তিনজনই একের পর এক শহীদ হলেন। তখন সাহাবীরা খালিদ (রাঃ)-কে সেনাপতি নির্বাচন করলেন। সামনে ছিল ২,০০,০০০ রোমান সৈন্যের বিশাল বাহিনী আর মুসলমানদের সংখ্যা ছিল মাত্র ৩,০০০। খালিদ (রাঃ) এমন অসাধারণ কৌশল অবলম্বন করলেন যে রোমানরা ভাবল মুসলমানদের সাহায্য এসেছে। তিনি রাতের অন্ধকারে সৈন্যদের নিরাপদে ফিরিয়ে আনলেন।",
      "রাসূলুল্লাহ (সাঃ) মদিনায় দাঁড়িয়ে মুতার যুদ্ধের বর্ণনা দিচ্ছিলেন। তিনি বললেন: 'যায়েদ পতাকা নিয়ে এগিয়ে গেলেন এবং শহীদ হলেন। তারপর জাফর পতাকা নিলেন এবং শহীদ হলেন। তারপর আবদুল্লাহ পতাকা নিলেন এবং শহীদ হলেন। এরপর আল্লাহর তরবারিগুলোর একটি তরবারি পতাকা নিল এবং আল্লাহ তাদের বিজয় দান করলেন।' [ইবনে হিব্বান: ৬৯২৮] এরপর থেকে খালিদ (রাঃ) 'সাইফুল্লাহ' (আল্লাহর তরবারি) নামে পরিচিত হলেন।",
      "রাসূলুল্লাহ (সাঃ) এর ইন্তেকালের পর যখন আরবের বিভিন্ন গোত্র ইসলাম ত্যাগ করতে শুরু করল এবং মিথ্যা নবীরা দাবি করতে লাগল, তখন আবু বকর (রাঃ) খালিদ (রাঃ) কে পাঠালেন। খালিদ (রাঃ) একের পর এক যুদ্ধে বিদ্রোহীদের পরাজিত করলেন। সবচেয়ে কঠিন যুদ্ধ ছিল ইয়ামামার যুদ্ধ যেখানে মুসাইলিমা কাযযাব নামক মিথ্যা নবীর বিরুদ্ধে যুদ্ধ হয়েছিল। এই যুদ্ধে ৭০ জন হাফিজে কুরআন শহীদ হয়েছিলেন। কিন্তু খালিদ (রাঃ) এর অসাধারণ নেতৃত্বে মুসলমানরা বিজয়ী হলেন এবং মুসাইলিমা নিহত হলো।",
      "এরপর খালিদ (রাঃ) পারস্য সাম্রাজ্যের বিরুদ্ধে যুদ্ধে গেলেন। তিনি একের পর এক পারস্যের শক্তিশালী দুর্গ বিজয় করলেন। হিরা, আল-আনবার, আইন আল-তামর—সব জায়গায় তিনি বিজয়ী হলেন। তারপর তিনি সিরিয়ার দিকে রওনা হলেন রোমান সাম্রাজ্যের বিরুদ্ধে। দামেস্ক, হিমস, আলেপ্পো—একের পর এক শহর তিনি বিজয় করলেন। ইয়ারমুকের যুদ্ধে তিনি ২,৪০,০০০ রোমান সৈন্যকে পরাজিত করলেন মাত্র ৪০,০০০ মুসলিম সৈন্য নিয়ে। এই যুদ্ধ ছিল ইসলামের ইতিহাসে সবচেয়ে গুরুত্বপূর্ণ যুদ্ধগুলোর একটি।",
      "খালিদ (রাঃ) এর সামরিক কৌশল ছিল অতুলনীয়। তিনি 'পিন্সার মুভমেন্ট' (দুই দিক থেকে ঘিরে ফেলা), 'ফ্ল্যাঙ্কিং ম্যানুভার' (পাশ থেকে আক্রমণ), এবং 'ফেইন্ট অ্যাটাক' (ভুয়া আক্রমণ) এর মতো কৌশল ব্যবহার করতেন। আজও বিশ্বের সামরিক একাডেমিতে তাঁর যুদ্ধকৌশল পড়ানো হয়। তিনি ১০০টিরও বেশি যুদ্ধে অংশ নিয়েছিলেন এবং কখনো পরাজিত হননি।",
      "উমর (রাঃ) খলীফা হওয়ার পর খালিদ (রাঃ) কে সেনাপতির পদ থেকে সরিয়ে দিলেন। এটা খালিদ (রাঃ) এর কোনো দোষের কারণে নয়, বরং উমর (রাঃ) চাইতেন না যে মানুষ ভাবুক বিজয় খালিদ (রাঃ) এর কারণে হয়েছে। বিজয় আল্লাহর পক্ষ থেকে। খালিদ (রাঃ) কোনো অভিযোগ করলেন না এবং সাধারণ সৈনিক হিসেবে যুদ্ধ চালিয়ে গেলেন।",
      "জীবনের শেষ দিকে খালিদ (রাঃ) হিমসে (সিরিয়া) বসবাস করছিলেন। তিনি মৃত্যুশয্যায় কাঁদতে কাঁদতে বলেছিলেন: 'আমি ১০০টিরও বেশি যুদ্ধে অংশ নিয়েছি। আমার শরীরের এমন কোনো স্থান নেই যেখানে তরবারি, বর্শা বা তীরের আঘাতের চিহ্ন নেই। আমার সারা শরীর ক্ষতবিক্ষত। অথচ আমি শহীদ হতে পারলাম না। আমি বিছানায় মরছি যেমন উট মরে। কাপুরুষরা ঘুমিয়ে ঘুমিয়ে মরে।' তিনি শাহাদাতের জন্য কাঁদছিলেন।",
      "৬৪২ খ্রিস্টাব্দে ৫৮ বছর বয়সে খালিদ ইবনে ওয়ালিদ (রাঃ) ইন্তেকাল করেন। উমর (রাঃ) তাঁর মৃত্যুর সংবাদ শুনে কাঁদলেন এবং বললেন: 'নারীরা আর খালিদের মতো সন্তান জন্ম দিতে পারবে না।' তাঁর জানাজায় হাজার হাজার মুসলমান অংশ নিয়েছিল। তিনি ছিলেন আল্লাহর তরবারি, ইসলামের রক্ষক এবং মুসলমানদের গর্ব।"
    ],
    "source": "ইবনে হিব্বান (৬৯২৮) এবং ইসলামী ইতিহাস গ্রন্থসমূহ।"
  },
  {
    "id": "mujahid_jibon_salahuddin_ayubi",
    "categoryId": "mujahid_jibon",
    "title": "সালাহউদ্দিন আইয়ুবী: জেরুজালেম বিজয়ী",
    "paragraphs": [
      "১১৮৭ খ্রিস্টাব্দে সালাহউদ্দিন আইয়ুবী হিত্তিনের যুদ্ধে ক্রুসেডারদের পরাজিত করেন এবং জেরুজালেম অবরোধ করেন। ৮৮ বছর পর মুসলমানরা জেরুজালেম পুনরুদ্ধার করতে সক্ষম হয়।",
      "যখন ক্রুসেডাররা ১০৯৯ সালে জেরুজালেম দখল করেছিল, তখন তারা এত নৃশংসভাবে হত্যাকাণ্ড চালিয়েছিল যে রাস্তায় ঘোড়ার পায়ের গোড়ালি পর্যন্ত রক্ত জমেছিল। তারা মসজিদে আশ্রয় নেওয়া হাজার হাজার মুসলমানকে হত্যা করেছিল।",
      "কিন্তু সালাহউদ্দিন যখন জেরুজালেম পুনরুদ্ধার করলেন, তিনি কোনো খ্রিস্টানকে হত্যা করেননি। তিনি ঘোষণা করলেন:",
      "'যারা মুক্তিপণ দিতে পারবে, তারা নিরাপদে চলে যেতে পারবে। যারা দিতে পারবে না, তাদেরও আমি ক্ষমা করে দিচ্ছি।'",
      "অনেক দরিদ্র খ্রিস্টান মুক্তিপণ দিতে পারছিল না। সালাহউদ্দিন নিজের কোষাগার থেকে তাদের মুক্তিপণ দিয়ে মুক্ত করে দিলেন।",
      "ক্রুসেডার রাজা রিচার্ড দ্য লায়নহার্ট একবার যুদ্ধক্ষেত্রে অসুস্থ হয়ে পড়লেন। সালাহউদ্দিন তাঁর কাছে নিজের চিকিৎসক এবং ফল পাঠিয়ে দিলেন।",
      "আরেকবার রিচার্ডের ঘোড়া যুদ্ধে মারা গেলে সালাহউদ্দিন তাঁর কাছে দুটি ঘোড়া উপহার পাঠালেন এবং বার্তা পাঠালেন: 'একজন রাজার পায়ে হেঁটে যুদ্ধ করা উচিত নয়।'",
      "সালাহউদ্দিনের ন্যায়বিচার এবং দয়ার কারণে অনেক খ্রিস্টান ইসলাম গ্রহণ করেছিল। তাঁর শত্রুরাও তাঁকে সম্মান করত।",
      "তিনি অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তাঁর মৃত্যুর পর দেখা গেল তাঁর কোষাগারে মাত্র একটি স্বর্ণমুদ্রা এবং ৪৭টি রৌপ্যমুদ্রা আছে। তিনি সবকিছু দরিদ্রদের মধ্যে বিতরণ করে দিতেন।",
      "১১৯৩ খ্রিস্টাব্দে দামেস্কে তিনি ইন্তেকাল করেন। তাঁর জানাজায় মুসলমান এবং খ্রিস্টান—উভয়েই কাঁদছিল।"
    ],
    "source": "ইসলামী ইতিহাস এবং ক্রুসেড যুদ্ধের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_tariq_ibn_ziyad",
    "categoryId": "mujahid_jibon",
    "title": "তারিক ইবনে জিয়াদ: স্পেন বিজয়ী",
    "paragraphs": [
      "৭১১ খ্রিস্টাব্দে উমাইয়া খলীফা ওয়ালিদ ইবনে আবদুল মালিকের নির্দেশে মুসা ইবনে নুসাইর তারিক ইবনে জিয়াদকে স্পেন বিজয়ের জন্য পাঠালেন।",
      "তারিক ইবনে জিয়াদ ৭,০০০ সৈন্য নিয়ে জিব্রাল্টার প্রণালী পার হয়ে স্পেনে পৌঁছালেন। সামনে ছিল ভিসিগথ রাজা রডারিকের ১,০০,০০০ সৈন্যের বিশাল বাহিনী।",
      "তারিক ইবনে জিয়াদ তাঁর সৈন্যদের সাথে উপকূলে নামার পর একটি ঐতিহাসিক সিদ্ধান্ত নিলেন—তিনি সকল নৌকা পুড়িয়ে ফেলার নির্দেশ দিলেন।",
      "সৈন্যরা অবাক হয়ে জিজ্ঞাসা করল: 'আমরা কীভাবে ফিরে যাব?'",
      "তারিক ইবনে জিয়াদ তখন তাঁর বিখ্যাত ভাষণ দিলেন: ",
      "'হে মানুষ! তোমাদের পেছনে সমুদ্র, সামনে শত্রু। আল্লাহর কসম! তোমাদের সামনে শুধু সততা এবং ধৈর্য ছাড়া আর কিছু নেই।'",
      "'তোমরা জেনে রাখো, এই দ্বীপে তোমরা পিতৃহীন এতিমের চেয়েও বেশি অসহায়। তোমাদের শত্রু সংখ্যায় অনেক বেশি এবং তাদের সাহায্যকারীও অনেক। তোমাদের কাছে আল্লাহ ছাড়া কোনো সাহায্যকারী নেই।'",
      "'সুতরাং যদি তোমরা ধৈর্য ধারণ করো এবং আল্লাহর পথে অবিচল থাকো, তাহলে আল্লাহ তোমাদের বিজয় দান করবেন। আর যদি তোমরা পালিয়ে যেতে চাও, তাহলে জেনে রাখো—পালানোর কোনো পথ নেই। হয় বিজয়, নয়তো শাহাদাত!'",
      "এই ভাষণ শুনে সৈন্যদের মনোবল আকাশচুম্বী হয়ে গেল। তারা বুঝল যে, এখন শুধু দুটি পথ—হয় বিজয়, নয়তো শাহাদাত।",
      "গুয়াদালেতে নদীর তীরে ভয়াবহ যুদ্ধ হলো। মুসলমানরা এমন সাহসিকতার সাথে যুদ্ধ করল যে, ১,০০,০০০ সৈন্যের বিশাল বাহিনী পরাজিত হলো। রাজা রডারিক নিহত হলেন।",
      "এই বিজয়ের পর মুসলমানরা স্পেনে ৮০০ বছর শাসন করেছিল এবং সেখানে জ্ঞান-বিজ্ঞান, শিল্প-সাহিত্যের এক স্বর্ণযুগ সৃষ্টি করেছিল। কর্ডোভা, গ্রানাডা, টলেডো—এই শহরগুলো জ্ঞানের কেন্দ্র হয়ে উঠেছিল।",
      "তারিক ইবনে জিয়াদের নামে জিব্রাল্টার (জাবাল আত-তারিক = তারিকের পাহাড়) নামকরণ করা হয়েছে, যা আজও তাঁর স্মৃতি বহন করছে।"
    ],
    "source": "ইসলামী ইতিহাস এবং স্পেন বিজয়ের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_muhammad_bin_qasim",
    "categoryId": "mujahid_jibon",
    "title": "মুহাম্মাদ বিন কাসিম: সিন্ধু বিজয়ী",
    "paragraphs": [
      "৭১১ খ্রিস্টাব্দে সিংহল (শ্রীলংকা) থেকে কিছু মুসলিম বণিক জাহাজে করে দেবল বন্দরের কাছে যাচ্ছিল। রাজা দাহির তাদের জাহাজ আটক করে লুট করলেন এবং মুসলিম নারী-শিশুদের বন্দী করলেন। মুসলিম নারীরা সাহায্যের জন্য চিৎকার করছিল।",
      "উমাইয়া খলীফা ওয়ালিদ ইবনে আবদুল মালিক এই খবর শুনে ক্রুদ্ধ হলেন এবং হাজ্জাজ ইবনে ইউসুফকে সিন্ধু বিজয়ের নির্দেশ দিলেন। হাজ্জাজ তাঁর ভাগ্নে মুহাম্মাদ বিন কাসিমকে সেনাপতি নিযুক্ত করলেন। তখন মুহাম্মাদ বিন কাসিমের বয়স মাত্র ১৭ বছর।",
      "মুহাম্মাদ বিন কাসিম ৬,০০০ সৈন্য নিয়ে সিন্ধুর দিকে রওনা হলেন। তিনি প্রথমে দেবল দুর্গ অবরোধ করলেন। দুর্গটি ছিল অত্যন্ত শক্তিশালী এবং উঁচু প্রাচীর দিয়ে ঘেরা। মুসলমানরা 'মানজানিক' (বিশাল পাথর নিক্ষেপক যন্ত্র) ব্যবহার করে দুর্গের প্রাচীর ভেঙে ফেললেন এবং দেবল বিজয় করলেন। বন্দী মুসলিম নারী-শিশুদের মুক্ত করা হলো।",
      "এরপর তিনি রাওয়ার, সিওয়ান এবং সিসাম দুর্গ একের পর এক বিজয় করতে থাকলেন। অবশেষে রাজা দাহিরের রাজধানী আরোরের কাছে ভয়াবহ যুদ্ধ হলো। রাজা দাহির হাতির পিঠে বসে যুদ্ধ করছিলেন। মুসলমানরা তীর নিক্ষেপ করে হাতি ও দাহিরকে হত্যা করলেন। সিন্ধু মুসলমানদের অধীনে এলো।",
      "মুহাম্মাদ বিন কাসিম অত্যন্ত ন্যায়পরায়ণ শাসক ছিলেন। তিনি হিন্দু ও বৌদ্ধদের তাদের ধর্ম পালনের স্বাধীনতা দিলেন। তিনি বললেন: 'তোমরা তোমাদের মন্দিরে পূজা করতে পারবে। আমরা তোমাদের উপর জিজিয়া কর ধার্য করব এবং তোমাদের রক্ষা করব।' এই ন্যায়বিচারের কারণে অনেক হিন্দু ও বৌদ্ধ ইসলাম গ্রহণ করল।",
      "কিন্তু দুর্ভাগ্যবশত, খলীফা ওয়ালিদ ইবনে আবদুল মালিক ইন্তেকাল করলেন এবং নতুন খলীফা সুলাইমান ইবনে আবদুল মালিক হাজ্জাজ ইবনে ইউসুফের শত্রু ছিলেন। তিনি মুহাম্মাদ বিন কাসিমকে ফিরিয়ে আনলেন এবং কারাগারে বন্দী করলেন। মাত্র ২০ বছর বয়সে এই মহান সেনাপতি কারাগারে শহীদ হলেন।",
      "মুহাম্মাদ বিন কাসিমের বিজয়ের মাধ্যমে ভারতীয় উপমহাদেশে ইসলামের দরজা খুলে গিয়েছিল। পরবর্তীতে সুলতান মাহমুদ গজনভী, মুহাম্মাদ ঘুরী এবং মুঘল সম্রাটরা এই পথ ধরেই ভারতে ইসলাম প্রচার করেছিলেন।"
    ],
    "source": "চাচনামা (সিন্ধু বিজয়ের ইতিহাস গ্রন্থ) এবং ইসলামী ইতিহাস।"
  },
  {
    "id": "mujahid_jibon_nuruddin_zangi",
    "categoryId": "mujahid_jibon",
    "title": "নূরউদ্দীন জঙ্গী: ন্যায়বিচারের প্রতীক",
    "paragraphs": [
      "নূরউদ্দীন জঙ্গী ১১৪৬ খ্রিস্টাব্দে সিরিয়া ও উত্তর ইরাকের শাসক হন। তখন ক্রুসেডাররা জেরুজালেম, আন্তাকিয়া এবং এদেসা দখল করে রেখেছিল। মুসলমানরা বিভক্ত ছিল এবং একে অপরের বিরুদ্ধে যুদ্ধ করছিল।",
      "নূরউদ্দীন প্রথমে মুসলমানদের একত্রিত করার কাজ শুরু করলেন। তিনি বললেন: 'আমরা যতদিন বিভক্ত থাকব, ততদিন ক্রুসেডাররা আমাদের উপর বিজয়ী থাকবে।' তিনি একের পর এক মুসলিম শাসকদের সাথে মিত্রতা করলেন এবং ক্রুসেডারদের বিরুদ্ধে ঐক্যবদ্ধ হলেন।",
      "১১৪৪ খ্রিস্টাব্দে তিনি এদেসা পুনরুদ্ধার করলেন। এটি ছিল ক্রুসেডারদের হাত থেকে প্রথম বড় বিজয়। এরপর তিনি আন্তাকিয়া অবরোধ করলেন এবং ক্রুসেডারদের পরাজিত করলেন।",
      "নূরউদ্দীন শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন একজন ন্যায়পরায়ণ শাসক। তিনি প্রতিদিন নিজে আদালতে বসতেন এবং মানুষের বিচার করতেন। একবার এক বৃদ্ধা মহিলা তাঁর বিরুদ্ধে অভিযোগ করল যে তাঁর সৈন্যরা তার জমি দখল করেছে। নূরউদ্দীন তাৎক্ষণিক তদন্ত করলেন এবং জমি ফিরিয়ে দিলেন।",
      "তিনি অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তিনি নিজ হাতে কুরআনের কপি লিখে বিক্রি করতেন এবং সেই অর্থ দিয়ে পরিবার চালাতেন। তিনি বলতেন: 'আমি বাইতুল মাল (রাষ্ট্রীয় কোষাগার) থেকে একটি দিরহামও ব্যক্তিগত কাজে খরচ করব না।'",
      "নূরউদ্দীন সালাহউদ্দিন আইয়ুবীকে তাঁর সেনাপতি নিযুক্ত করেছিলেন এবং তাঁকে মিসর বিজয়ের জন্য পাঠিয়েছিলেন। সালাহউদ্দিন নূরউদ্দীনের কাছ থেকে ন্যায়বিচার, তাকওয়া এবং জিহাদের শিক্ষা নিয়েছিলেন।",
      "১১৭৪ খ্রিস্টাব্দে নূরউদ্দীন জঙ্গী ইন্তেকাল করেন। তাঁর মৃত্যুর পর সালাহউদ্দিন আইয়ুবী তাঁর কাজ এগিয়ে নিয়ে যান এবং জেরুজালেম পুনরুদ্ধার করেন। নূরউদ্দীন ছিলেন সালাহউদ্দিনের পথপ্রদর্শক এবং অনুপ্রেরণা।"
    ],
    "source": "ইসলামী ইতিহাস এবং ক্রুসেড যুদ্ধের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_alp_arslan",
    "categoryId": "mujahid_jibon",
    "title": "আলপ আরসালান: মালাজগির্দের বীর",
    "paragraphs": [
      "সুলতান আলপ আরসালান ছিলেন সেলজুক সাম্রাজ্যের একজন মহান শাসক যিনি ১০৭১ খ্রিস্টাব্দে মালাজগির্দের যুদ্ধে বাইজেন্টাইন সাম্রাজ্যকে পরাজিত করেছিলেন। এই বিজয় আনাতোলিয়ায় (তুরস্ক) ইসলামের দরজা খুলে দিয়েছিল। তাঁর নাম 'আলপ আরসালান' অর্থ 'সাহসী সিংহ'।",
      "আলপ আরসালান ১০৬৩ খ্রিস্টাব্দে সেলজুক সাম্রাজ্যের সুলতান হন। তিনি ছিলেন একজন দক্ষ যোদ্ধা এবং ন্যায়পরায়ণ শাসক। ১০৭১ খ্রিস্টাব্দে বাইজেন্টাইন সম্রাট রোমানোস চতুর্থ ডায়োজেনিস ২,০০,০০০ সৈন্যের বিশাল বাহিনী নিয়ে সেলজুক সাম্রাজ্য আক্রমণ করলেন। তিনি বলেছিলেন: 'আমি মুসলমানদের ধ্বংস করে দেব এবং তাদের রাজধানী দখল করব।'",
      "আলপ আরসালান তখন সিরিয়ায় ছিলেন। এই খবর শুনে তিনি দ্রুত আনাতোলিয়ার দিকে রওনা হলেন। তাঁর কাছে ছিল মাত্র ৪০,০০০ সৈন্য। সংখ্যায় শত্রু পাঁচগুণ বেশি ছিল। যুদ্ধের আগের রাতে আলপ আরসালান সাদা কাফন পরলেন এবং সৈন্যদের বললেন: 'আগামীকাল হয় আমরা বিজয়ী হব, নয়তো শহীদ হব। আমি তোমাদের মতোই একজন সৈন্য। যদি আমি মারা যাই, তাহলে আমার পুত্র মালিক শাহকে সুলতান বানাবে।' তিনি দুই রাকাত নামাজ পড়লেন এবং আল্লাহর কাছে কাঁদলেন।",
      "মালাজগির্দের ময়দানে ভয়াবহ যুদ্ধ হলো। আলপ আরসালান তাঁর সৈন্যদের এমন কৌশলে যুদ্ধ করালেন যে বাইজেন্টাইন বাহিনী বিভ্রান্ত হয়ে গেল। মুসলমানরা শত্রুদের চারদিক থেকে ঘিরে ফেলল। সম্রাট রোমানোস নিজেই বন্দী হলেন। সম্রাট রোমানোসকে আলপ আরসালানের সামনে আনা হলো। সম্রাট ভয়ে কাঁপছিলেন। তিনি জিজ্ঞেস করলেন: 'আপনি আমার সাথে কী করবেন?' আলপ আরসালান বললেন: 'আমি যদি আপনার বন্দী হতাম, আপনি আমার সাথে কী করতেন?' সম্রাট বললেন: 'আমি আপনাকে হত্যা করতাম।' আলপ আরসালান বললেন: 'কিন্তু আমি আপনাকে ক্ষমা করে দিচ্ছি। এটাই ইসলামের শিক্ষা।'",
      "তিনি সম্রাটকে সম্মানের সাথে মুক্তি দিলেন এবং শুধু মুক্তিপণ নিলেন। সম্রাট রোমানোস এই দয়ায় মুগ্ধ হলেন এবং বললেন: 'আমি আপনার মতো মহান শাসক কখনো দেখিনি।' মালাজগির্দের বিজয়ের পর আনাতোলিয়ায় (বর্তমান তুরস্ক) মুসলমানদের শাসন প্রতিষ্ঠিত হলো। পরবর্তীতে উসমানীয় সাম্রাজ্য এই ভূমিতে প্রতিষ্ঠিত হয় এবং ৬০০ বছর শাসন করে। ১০৭২ খ্রিস্টাব্দে আলপ আরসালান একটি দুর্গ অবরোধ করার সময় শত্রুর তীরে আহত হন এবং শহীদ হন।"
    ],
    "source": "ইসলামী ইতিহাস এবং সেলজুক সাম্রাজ্যের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_sultan_mahmud_ghaznavi",
    "categoryId": "mujahid_jibon",
    "title": "সুলতান মাহমুদ গজনভী: ভারত বিজয়ী",
    "paragraphs": [
      "সুলতান মাহমুদ গজনভী ছিলেন গজনভী সাম্রাজ্যের একজন মহান শাসক যিনি ১৭ বার ভারত আক্রমণ করেছিলেন এবং ইসলাম প্রচার করেছিলেন। তিনি ছিলেন একজন দক্ষ সেনাপতি এবং ইলমের পৃষ্ঠপোষক। সুলতান মাহমুদ ৯৯৮ খ্রিস্টাব্দে গজনী (বর্তমান আফগানিস্তান) এর শাসক হন।",
      "সুলতান মাহমুদ ১০০১ থেকে ১০২৭ খ্রিস্টাব্দ পর্যন্ত ১৭ বার ভারত আক্রমণ করেছিলেন। তিনি পাঞ্জাব, সিন্ধু, কাশ্মীর এবং উত্তর ভারতের বিভিন্ন অঞ্চল বিজয় করেছিলেন। তাঁর সবচেয়ে বিখ্যাত অভিযান ছিল সোমনাথ মন্দির আক্রমণ। সোমনাথ মন্দির ছিল হিন্দুদের একটি বিখ্যাত মন্দির যেখানে বিশাল সম্পদ জমা ছিল। ১০২৬ খ্রিস্টাব্দে সুলতান মাহমুদ সোমনাথ আক্রমণ করলেন। মন্দিরের পুরোহিতরা বলল: 'আমাদের দেবতা তোমাদের ধ্বংস করে দেবে।' কিন্তু মুসলমানরা মন্দির বিজয় করলেন এবং মূর্তি ভেঙে ফেললেন। এই বিজয়ের পর অনেক হিন্দু বুঝতে পারল যে মূর্তি কোনো ক্ষমতা রাখে না এবং অনেকে ইসলাম গ্রহণ করল।",
      "সুলতান মাহমুদ শুধু একজন যোদ্ধা ছিলেন না, তিনি ছিলেন ইলম ও জ্ঞানের পৃষ্ঠপোষক। তিনি তাঁর রাজদরবারে বিখ্যাত পণ্ডিত ও কবিদের আমন্ত্রণ জানাতেন। মহাকবি ফেরদৌসী তাঁর রাজদরবারে ছিলেন এবং বিখ্যাত 'শাহনামা' গ্রন্থ লিখেছিলেন। ইমাম আবু হানিফা (রহঃ) এর মাজহাব অনুসরণকারী আলেমদের তিনি সম্মান করতেন এবং তাঁদের সাহায্য করতেন।",
      "সুলতান মাহমুদ গজনীতে একটি বিশাল লাইব্রেরি এবং বিশ্ববিদ্যালয় প্রতিষ্ঠা করেছিলেন। তিনি বলতেন: 'তরবারি দিয়ে রাজ্য জয় করা যায়, কিন্তু ইলম দিয়ে হৃদয় জয় করা যায়।' ১০৩০ খ্রিস্টাব্দে সুলতান মাহমুদ গজনভী ইন্তেকাল করেন। তাঁর বিজয়ের ফলে ভারতীয় উপমহাদেশে ইসলামের প্রসার ঘটেছিল এবং পরবর্তীতে মুঘল সাম্রাজ্য প্রতিষ্ঠিত হয়েছিল।"
    ],
    "source": "ইসলামী ইতিহাস এবং গজনভী সাম্রাজ্যের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_muhammad_al_fatih",
    "categoryId": "mujahid_jibon",
    "title": "মুহাম্মাদ আল-ফাতিহ: কনস্টান্টিনোপল বিজয়ী",
    "paragraphs": [
      "সুলতান মুহাম্মাদ আল-ফাতিহ (মুহাম্মাদ দ্বিতীয়) ছিলেন উসমানীয় সাম্রাজ্যের সপ্তম সুলতান যিনি ১৪৫৩ খ্রিস্টাব্দে কনস্টান্টিনোপল (বর্তমান ইস্তাম্বুল) বিজয় করেছিলেন। রাসূলুল্লাহ (সাঃ) বলেছিলেন: 'কনস্টান্টিনোপল অবশ্যই বিজিত হবে। যে সেনাপতি তা বিজয় করবে, সে কতই না উত্তম সেনাপতি! এবং যে সৈন্যবাহিনী তা বিজয় করবে, তারা কতই না উত্তম সৈন্যবাহিনী!' [মুসনাদে আহমাদ]",
      "মুহাম্মাদ আল-ফাতিহ ১৪৩২ খ্রিস্টাব্দে জন্মগ্রহণ করেন। তিনি ছোটবেলা থেকেই অত্যন্ত মেধাবী ছিলেন। তিনি আরবি, ফার্সি, তুর্কি, গ্রিক এবং ল্যাটিন ভাষা জানতেন। তিনি কুরআন হিফজ করেছিলেন এবং হাদিস, ফিকহ, গণিত, জ্যোতির্বিদ্যা এবং সামরিক কৌশল শিখেছিলেন। মাত্র ২১ বছর বয়সে তিনি উসমানীয় সাম্রাজ্যের সুলতান হন।",
      "কনস্টান্টিনোপল ছিল বাইজেন্টাইন সাম্রাজ্যের রাজধানী এবং খ্রিস্টান জগতের কেন্দ্র। এই শহর ১১০০ বছর ধরে অজেয় ছিল। শহরটি ছিল তিনদিক থেকে সমুদ্র দিয়ে ঘেরা এবং বিশাল প্রাচীর দিয়ে সুরক্ষিত। অনেক মুসলিম সেনাপতি এই শহর বিজয়ের চেষ্টা করেছিলেন কিন্তু ব্যর্থ হয়েছিলেন। মুহাম্মাদ আল-ফাতিহ দৃঢ়প্রতিজ্ঞ ছিলেন যে তিনি রাসূলুল্লাহ (সাঃ) এর ভবিষ্যদ্বাণী পূর্ণ করবেন।",
      "১৪৫৩ খ্রিস্টাব্দের ৬ এপ্রিল মুহাম্মাদ আল-ফাতিহ ১,৫০,০০০ সৈন্য নিয়ে কনস্টান্টিনোপল অবরোধ শুরু করলেন। তিনি বিশাল কামান তৈরি করেছিলেন যা প্রাচীর ভাঙতে পারত। কিন্তু শহরের একদিকে ছিল 'গোল্ডেন হর্ন' নামক একটি উপসাগর যেখানে বাইজেন্টাইনরা বিশাল শিকল দিয়ে বন্ধ করে রেখেছিল যাতে মুসলিম জাহাজ প্রবেশ করতে না পারে।",
      "মুহাম্মাদ আল-ফাতিহ এক অসাধারণ কৌশল অবলম্বন করলেন। তিনি ৭০টি জাহাজকে স্থলপথে টেনে নিয়ে গেলেন! তিনি কাঠের রাস্তা তৈরি করলেন এবং জাহাজগুলোকে পাহাড়ের উপর দিয়ে টেনে গোল্ডেন হর্নে নামিয়ে দিলেন। বাইজেন্টাইনরা এই দৃশ্য দেখে হতবাক হয়ে গেল। তারা বুঝতে পারল যে এই সেনাপতি অসাধারণ।",
      "৫৩ দিন অবরোধের পর ২৯ মে ১৪৫৩ খ্রিস্টাব্দে ফজরের নামাজের পর চূড়ান্ত আক্রমণ শুরু হলো। মুসলমানরা 'আল্লাহু আকবর' ধ্বনি দিয়ে আক্রমণ করল। প্রচণ্ড যুদ্ধের পর মুসলমানরা প্রাচীর ভেঙে শহরে প্রবেশ করল। সম্রাট কনস্টান্টাইন একাদশ যুদ্ধে নিহত হলেন। কনস্টান্টিনোপল বিজিত হলো।",
      "মুহাম্মাদ আল-ফাতিহ ঘোড়ায় চড়ে শহরে প্রবেশ করলেন এবং সরাসরি হাগিয়া সোফিয়া গির্জায় গেলেন। তিনি সেখানে নামাজ পড়লেন এবং গির্জাটিকে মসজিদে রূপান্তরিত করলেন। তিনি ঘোষণা করলেন: 'যারা লুকিয়ে আছে, তারা বের হয়ে আসো। তোমাদের জান-মাল নিরাপদ। তোমরা তোমাদের ধর্ম পালন করতে পারবে।' তিনি কোনো খ্রিস্টানকে হত্যা করেননি এবং তাদের গির্জা রক্ষা করেছিলেন।",
      "মুহাম্মাদ আল-ফাতিহ কনস্টান্টিনোপলের নাম পরিবর্তন করে 'ইস্তাম্বুল' রাখলেন এবং এটিকে উসমানীয় সাম্রাজ্যের রাজধানী বানালেন। তিনি শহরে মসজিদ, মাদ্রাসা, হাসপাতাল এবং লাইব্রেরি নির্মাণ করলেন। ইস্তাম্বুল ইসলামী সভ্যতার কেন্দ্র হয়ে উঠল। ১৪৮১ খ্রিস্টাব্দে মাত্র ৪৯ বছর বয়সে মুহাম্মাদ আল-ফাতিহ ইন্তেকাল করেন। তিনি ছিলেন একজন মহান বিজয়ী, ন্যায়পরায়ণ শাসক এবং ইলমের পৃষ্ঠপোষক।"
    ],
    "source": "ইসলামী ইতিহাস, উসমানীয় সাম্রাজ্যের দলিলসমূহ এবং মুসনাদে আহমাদ।"
  }
]