[
  {
    "id": "muhammad_ibne_kasim",
    "categoryId": "mujahid_jibon",
    "title": "মুহাম্মদ ইবনে কাসিম : সিন্দ বিজয়ের স্থপতি ও উমাইয়া বীর সেনাপতি",
    "summary": "",
    "paragraphs": [
      "মুহাম্মদ ইবনে কাসিম আছ-ছাকাফী ছিলেন উমাইয়া খিলাফতের ইতিহাসে এক অত্যন্ত উজ্জ্বল এবং কিংবদন্তী সামরিক ব্যক্তিত্ব। তিনি কেবল একজন সেনাপতি ছিলেন না, বরং একজন দূরদর্শী প্রশাসক এবং ন্যায়পরায়ণ শাসক হিসেবেও পরিচিতি লাভ করেছিলেন। তাঁর সামরিক প্রতিভা এমন ছিল যে মাত্র সতেরো বছর বয়সে তৎকালীন রাজা দাহিরকে পরাজিত করে সিন্ধু জয় করেন এবং এর মধ্য দিয়ে ভারতীয় উপমহাদেশে মুসলিম শাসনের এক সুদূরপ্রসারী ভিত্তি স্থাপন করেন। তাঁর পুরো নাম ছিল ইমাদুদ্দীন মুহাম্মদ বিন কাসিম আছ-ছাকাফী, এবং তাঁর জীবনকাল ছিল ৬৯৫ খ্রিস্টাব্দ (৭৬ হিজরী) থেকে ৭১৫ খ্রিস্টাব্দ (৯৬ হিজরী)।",
      "**নাম, বংশ পরিচয় এবং ব্যতিক্রমী প্রারম্ভিক জীবন ও শিক্ষা:** মুহাম্মদের জন্ম হয়েছিল আনুমানিক ৬৯৫ খ্রিস্টাব্দে (৭৬ হিজরী)। তাঁর জন্মস্থান নিয়ে ঐতিহাসিকদের মধ্যে কিছুটা ভিন্নমত থাকলেও, এটি প্রায় নিশ্চিতভাবে হেজাজের (পশ্চিম আরব) ঐতিহ্যবাহী সাকিফ গোত্রের এলাকা, যেমন তায়েফ, মক্কা অথবা মদিনা ছিল। তিনি বিখ্যাত সাকীফ গোত্রের বানু আউফ শাখার আবু আকিল পরিবারের অন্তর্ভুক্ত ছিলেন। এই গোত্রটি প্রাথমিক মুসলিম বিজয়ের সময় এবং পরে বিশেষ করে ইরাকে গুরুত্বপূর্ণ সামরিক ও অর্থনৈতিক ভূমিকা পালন করেছিল। তাঁর পিতা আল কাসিম বিন ইউসুফ তাঁর বাল্যকালেই ইন্তেকাল করেন। পিতার অকাল মৃত্যুর পর, তাঁর লালন-পালনের দায়িত্ব নেন তাঁর অত্যন্ত প্রভাবশালী চাচা হাজ্জাজ বিন ইউসুফ আছ-ছাকাফী, যিনি তৎকালীন উমাইয়া খিলাফতের ইরাকের শক্তিশালী গভর্নর ছিলেন। হাজ্জাজ ছিলেন উমাইয়া খলিফা আবদুল মালিক (৬৮৫–৭০৫) এর অত্যন্ত বিশ্বস্ত একজন সেনাপতি। হাজ্জাজের তত্ত্বাবধানে মুহাম্মদ ইবনে কাসিম শৈশব থেকেই সামরিক কৌশল, প্রশাসনিক দক্ষতা এবং নেতৃত্বের গুণাবলীতে সুচারুভাবে প্রশিক্ষণ লাভ করেন। হাজ্জাজ ইরাকের প্রাদেশিক রাজধানী ওয়াসিত (যা হাজ্জাজ ৭০২ সালে প্রতিষ্ঠা করেছিলেন) শহরে তাঁর পৃষ্ঠপোষকতায় মুহাম্মদ ইবনে কাসিমকে শিক্ষিত ও প্রশিক্ষিত করে তোলেন। হাজ্জাজ তাঁকে এতটাই পছন্দ করতেন এবং তাঁর প্রতিভার স্বীকৃতি দিয়েছিলেন যে তিনি তাঁকে নিজের মেয়ে জয়নাবকে বিয়ে করার জন্য যথেষ্ট মর্যাদাপূর্ণ মনে করতেন। কিতাবুল আগানিতে, ১৭ বছর বয়সী মুহাম্মদকে \"তার সময়ের সর্বশ্রেষ্ঠ সাকফি\" বলে উল্লেখ করা হয়েছে, যা তাঁর অল্প বয়সেই অর্জিত অসাধারণ দক্ষতার ইঙ্গিত বহন করে। আধুনিক ঐতিহাসিক নবী বখশ বালুচ মনে করেন, মোহাম্মদ অনুকূল পরিবেশে একজন দক্ষ, উদ্যমী এবং সূক্ষ্ম রুচির সংস্কৃতিবান ছেলে হয়ে বেড়ে উঠেছিলেন।",
      "**প্রথম সামরিক ও প্রশাসনিক দায়িত্ব:** ফর্সের গভর্নর হিসেবে নিয়োগ: মুহাম্মদ ইবনে কাসিমের কর্মজীবনের সূচনা হয় আধুনিক ইরানের ফর্স প্রদেশে, যেখানে তিনি কৈশোরেই গুরুত্বপূর্ণ দায়িত্ব লাভ করেন। তাঁর প্রথম সামরিক অ্যাসাইনমেন্ট ছিল এই প্রদেশের কুর্দিদের একটি বিদ্রোহী দলকে বশীভূত করা। তিনি এই মিশন অত্যন্ত সফলভাবে শেষ করেন, যা তাঁর প্রারম্ভিক সামরিক সক্ষমতা প্রমাণ করে। এই সাফল্যের পর, তিনি সম্ভবত তাঁর ছোট চাচা মোহাম্মদ বিন ইউসুফ আস সাকাফির স্থলাভিষিক্ত হয়ে ফারসের গভর্নর হিসেবে নিযুক্ত হন। এই পদে তাঁর দায়িত্ব ছিল কেবলমাত্র সামরিক নয়, বরং প্রশাসনিকও। দায়িত্ব পাওয়ার পর, তিনি শিরাজ শহরটিকে পুনরুজ্জীবিত করেন, সেখানে একটি রাজকীয় ভিলা এবং এর কাছাকাছি একটি সামরিক ক্যাম্প তৈরি করেন। তাঁর প্রশাসনিক দক্ষতার আরেকটি প্রমাণ হলো, তাঁকে শিরাজের দক্ষিণে কাস্পিয়ান সাগরের নিকটবর্তী জুরজানের কিছু অঞ্চল বশীভূত করার দায়িত্বও দেওয়া হয়েছিল, যা তিনি কার্যকরভাবে সম্পন্ন করেন। এই সময়ে, ইবনে আশ'আসের বিদ্রোহের কিছু অবশিষ্ট সমর্থক ফর্সে সক্রিয় ছিল। হাজ্জাজের আদেশে মুহাম্মদ বিন কাসিম এই বিদ্রোহীদের দমন করেন এবং তাঁদের মধ্যে অন্যতম শিয়া ব্যক্তিত্ব আতিয়া ইবনে সা'দ আউফীকে গ্রেফতার করেন। আতিয়াকে হযরত আলী (রাঃ)-কে গালি দিতে বলা হলে তিনি অস্বীকার করেন এবং এর শাস্তি হিসেবে তাঁকে ৪০০ বেত্রাঘাত করা হয় ও লাঞ্ছনার জন্য চুল ও দাড়ি কামিয়ে দেওয়া হয়। এই ঘটনাটি হাজ্জাজের কঠোর শাসনের একটি চিত্র তুলে ধরে এবং মুহাম্মদ ইবনে কাসিমের ওপর অর্পিত কঠিন দায়িত্বের প্রকৃতিও প্রকাশ করে।",
      "**সিন্ধু বিজয়ের ঐতিহাসিক প্রেক্ষাপট ও কৌশলগত গুরুত্ব:** উমাইয়া খিলাফতের জন্য সিন্ধু অঞ্চল ছিল কেবল একটি দূরবর্তী প্রদেশ নয়, বরং এটি অর্থনৈতিক এবং কৌশলগত উভয় দিক থেকেই অত্যন্ত গুরুত্বপূর্ণ ছিল। উমাইয়া খিলাফতের সম্প্রসারণের মানচিত্র অনুযায়ী, এই অঞ্চলে তাদের আগ্রহ ক্রমাগত বৃদ্ধি পাচ্ছিল। সিন্দ বিজয়ের তাৎক্ষণিক কারণ ছিল বারবার দেবল বন্দরের জলদস্যুদের দ্বারা মুসলিম জাহাজ ও ব্যবসায়ীদের ওপর আক্রমণ ও লুটপাট। মেদ (সিন্ধুতে বসবাসকারী সিথিয়ানদের একটি উপজাতি) এবং অন্যান্য স্থানীয় উপজাতিরা দজলার মুখ থেকে শ্রীলঙ্কার উপকূল পর্যন্ত তাদের বাওয়ারিজ থেকে সাসানি জাহাজগুলোতে জলদস্যুতা করত এবং তারা দেবল, কচ্ছ ও কাথিয়াবাড়ের ঘাঁটি থেকে আরব জাহাজ শিকার করতে সক্ষম হয়েছিল। ৭১০ সালে শ্রীলঙ্কা থেকে আরবে ভ্রমণকারী মুসলিম মহিলাদের অপহরণের ঘটনাটি ছিল চরম উস্কানিমূলক। ইরাকের গভর্নর হাজ্জাজ বিন ইউসুফ সিন্ধুর শাসক রাজা দাহিরের কাছে এই ঘটনার ক্ষতিপূরণ এবং বন্দীদের মুক্তি দাবি করেন। কিন্তু রাজা দাহির এই বলে প্রত্যাখ্যান করেন যে, জলদস্যুদের উপর তাঁর কোনো নিয়ন্ত্রণ নেই। এছাড়াও, উমাইয়াদের থেকে পালিয়ে আসা সাসানি এবং আরব বিদ্রোহীদের আশ্রয় প্রদানের জন্যও আরবরা সিন্ধু অভিযানে আগ্রহী ছিল। এই সব কারণ একত্রিত হয়ে হাজ্জাজ বিন ইউসুফকে সিন্ধুর বিরুদ্ধে একটি চূড়ান্ত সামরিক ব্যবস্থা নিতে বাধ্য করে। তিনি পূর্বের দুটি অভিযানের ব্যর্থতার পর, খলিফা আল-ওয়ালিদ ইবনে আবদুল মালিকের অনুমতিক্রমে ৭১১ খ্রিস্টাব্দে (৯২ হিজরী) মাত্র সতেরো বছর বয়সী মুহাম্মদ বিন কাসিমকে এই ঐতিহাসিক সিন্ধু বিজয়ের কঠিন দায়িত্ব দেন। হাজ্জাজ এই অভিযানটি পূর্বের তুলনায় অধিক যত্ন ও পরিকল্পনা করেছিলেন, যা এই অভিযানের গুরুত্ব প্রমাণ করে।",
      "**সুসংগঠিত সামরিক অভিযান এবং দেবল দুর্গের পতন (৭১১ খ্রিস্টাব্দ):** মুহাম্মদ ইবনে কাসিমের সিন্ধু অভিযান ছিল তাঁর সামরিক প্রতিভার এক উজ্জ্বল দৃষ্টান্ত। ৭১১ খ্রিস্টাব্দে (৯২ হিজরী) তিনি প্রায় ৬,০০০ জন সিরীয় অশ্বারোহী এবং ইরাক থেকে আসা মাওয়ালিদের একটি দল নিয়ে শিরাজ থেকে মাক্রান (বেলুচিস্তান) হয়ে সিন্ধুর দিকে রওয়ানা হন। তাঁর সৈন্যবাহিনীতে আরও একটি অগ্রিম বাহিনী এবং ছয় হাজার উটের অশ্বারোহী বাহিনী যোগ দিয়েছিল। তাঁর সামরিক কৌশলের একটি অন্যতম দিক ছিল সুসংগঠিত সরবরাহ ব্যবস্থা; স্থলপথে সৈন্যরা অগ্রসর হলেও, মিনজানিক (ম্যাঙ্গোনেল)-সহ ভারী সামরিক সরঞ্জাম ও রসদ সাগরের পথ ধরে জাহাজে করে সিন্ধু নদীর মোহনায় দেবলে স্থানান্তরিত করা হতো। এই অভিযানের প্রথম লক্ষ্য ছিল সিন্ধুর গুরুত্বপূর্ণ বন্দর নগরী দেবল। দেবল দুর্গ ছিল অত্যন্ত শক্তিশালী এবং এর একটি উঁচু মন্দিরের চূড়ায় উড়ছিল একটি পতাকা, যা স্থানীয়দের বিশ্বাস অনুযায়ী দুর্গের অক্ষয়তার প্রতীক ছিল। হাজ্জাজের নির্দেশ অনুযায়ী মুহাম্মদ দেবলের ঔদ্ধত্যের জবাব দিতে মন্দিরটিকে গুড়িয়ে দেন। তিনি দূরপাল্লার কামানের সাহায্যে মন্দির চূড়ার পতাকা নামিয়ে দেন, যা দুর্গের রক্ষকদের মনোবল সম্পূর্ণরূপে ভেঙে দেয়। কঠোর অবরোধ এবং সুনিপুণ সামরিক কৌশলের মাধ্যমে দেবল দুর্গের পতন ঘটে। এই বিজয় সিন্ধু বিজয়ের সূচনা করে এবং মুসলিম বাহিনীর আত্মবিশ্বাস বহুগুণ বাড়িয়ে দেয়। দেবল বিজয়ের পর, আরব সৈন্যরা যুদ্ধ ছাড়াই উত্তর-পূর্ব দিকে যাত্রা করে নেরুণ ও সাদুসানের (সেহওয়ান) মতো শহরগুলি জয় করেন।",
      "**রাজা দাহিরের সাথে চূড়ান্ত যুদ্ধ ও আরোরের পতন (৭১২ খ্রিস্টাব্দ):** দেবল বিজয়ের পর মুহাম্মদ ইবনে কাসিম রাজা দাহিরের মুখোমুখি হওয়ার জন্য অগ্রসর হন। রাজা দাহির সিন্ধু নদের পূর্ব তীরে তাঁর বিশাল বাহিনী ও যুদ্ধহাতি নিয়ে প্রস্তুত ছিলেন। মুহাম্মদ ইবনে কাসিম হাজ্জাজের পাঠানো অতিরিক্ত শক্তি পুনরায় সরবরাহ ও গ্রহণ করার জন্য নেরুনে ফিরে আসেন। এরপর তিনি দক্ষতার সাথে সিন্ধু নদ পার হন, জাট ও নৌকা মালিকদের সাথে দর কষাকষি করে বেট দ্বীপের রাজা মোকাহ বাসায়ার সাহায্য গ্রহণ করেন। ৭১২ খ্রিস্টাব্দে আররুরে (রোহরি) মুহাম্মাদ সম্মুখযুদ্ধে রাজা দাহিরের বাহিনী ও পূর্ব-জাটদের মুখোমুখি হন। এই যুদ্ধে রাজা দাহির তাঁর যুদ্ধহাতির পিঠে বসে লড়াই করেন। কিন্তু মুহাম্মদ ইবনে কাসিমের তীরন্দাজদের নিখুঁত লক্ষ্যে দাহিরের হাতি আহত হয় এবং রাজা নিহত হন। রাজা নিহত হওয়ার পর তাঁর বাহিনী ছত্রভঙ্গ হয়ে যায় এবং মুসলিমদের বিজয় নিশ্চিত হয়। এই বিজয়ের পর তিনি ব্রাহ্মণাবাদ ও আলোরের মতো গুরুত্বপূর্ণ শহরগুলোও দখল করেন। রাজা দাহিরের শিরশ্ছেদ করে তাঁর মাথা বসরার গভর্নর হাজ্জাজের কাছে পাঠানো হয়। মুহাম্মদ বিন কাসিম এইভাবে প্রথম মুসলিম বিজেতা হিসেবে সফলভাবে ভারতীয় ভূমি দখল করেন।",
      "**প্রশাসনিক নীতি, ন্যায়পরায়ণতা এবং জিম্মি ব্যবস্থা:** মুহাম্মদ ইবনে কাসিম শুধু একজন সামরিক বিজেতা ছিলেন না, তিনি ছিলেন একজন ব্যতিক্রমী ও দূরদর্শী প্রশাসক। সিন্ধু বিজয়ের পর তাঁর প্রধান কাজ ছিল একটি স্থিতিশীল প্রশাসনিক কাঠামো স্থাপন করা, যা একটি নতুন বিজিত বিদেশি ভূমিকে মুসলিম শাসনের অন্তর্ভুক্ত করবে। তিনি একটি সমঝোতামূলক নীতি গ্রহণ করেন এবং স্থানীয়দের তাদের ধর্মীয় কর্মকাণ্ডে হস্তক্ষেপ না করার বিনিময়ে মুসলিম শাসন মেনে নেওয়ার অনুরোধ করেন। মুসলিমরা বিজিত অঞ্চলে ইসলামি শরিয়া আইন প্রতিষ্ঠা করলেও, হিন্দু ও বৌদ্ধদের তাদের গ্রাম শাসন এবং নিজস্ব আইন অনুসারে তাদের মধ্যকার বিরোধ নিষ্পত্তি করার অনুমতি দেওয়া হয়। তিনি গ্রামের ঐতিহ্যবাহী নেতৃত্ব (রঈস ও সর্দার) বজায় রাখেন। অমুসলিমদের জিজিয়া কর প্রদানের বিনিময়ে জিম্মি (সংরক্ষিত ব্যক্তি) হিসেবে মর্যাদা দেওয়া হয়, যা তাদের নিরাপত্তা, সম্পদ ও উপাসনালয় সংরক্ষণের নিশ্চয়তা দিত। স্থানীয় অমুসলিমদের সেনাবাহিনীর চাকরি ও মুসলিমদের উপর আরোপিত জাকাত থেকে অব্যাহতি দেওয়া হয়। সরকারি রাজস্বের তিন শতাংশ ব্রাহ্মণদের জন্য বরাদ্দ ছিল, যা তাঁর উদার নীতির প্রমাণ। তিনি প্রশাসনে হিন্দু ও বৌদ্ধদের বিশ্বস্ত উপদেষ্টা ও গভর্নর হিসেবে অন্তর্ভুক্ত করেন; এমনকি একজন হিন্দু কাকসা তাঁর প্রশাসনের দ্বিতীয় গুরুত্বপূর্ণ সদস্য ছিলেন। এই উদার নীতি বিজিত জনগণের মধ্যে মুসলিম শাসনের প্রতি সমর্থন তৈরি করেছিল।",
      "**সামরিক ও রাজনৈতিক কৌশল এবং সমালোচনামূলক আলোচনা:** হাজ্জাজ কর্তৃক মুহাম্মাদকে পাঠানো চিঠিতে সামরিক কৌশলের রূপরেখা দেওয়া হয়েছিল: \"আহলে হার্বের (যোদ্ধাদের) সবাইকে হত্যা করো; তাদের ছেলে-মেয়েদের জিম্মি করে আটক করে বন্দি করো। যারা আমাদের বিরুদ্ধে যুদ্ধ করে না...তাদের আমান (শান্তি ও নিরাপত্তা) দান করো এবং তাদের সম্মান ও সম্পদের জিম্মি (সংরক্ষণকারী ব্যক্তি) হিসাবে নিজেকে স্থির করো।\" আরবদের প্রথম লক্ষ্য ছিল অর্থনৈতিক অবকাঠামো সংরক্ষণের সাথে স্বল্পকায় হতাহতের মাধ্যমে সিন্ধু বিজয়কে সহজতর করা। শহরগুলিকে দুটি বিকল্প দেওয়া হয়েছিল: হয় শান্তিপূর্ণভাবে আত্মসমর্পণ অথবা বলপ্রয়োগের মাধ্যমে প্রতিরোধের মুখোমুখি হওয়া। যেখানে প্রতিরোধ শক্তিশালী ছিল, সেখানে মুহাম্মদ বিন কাসিমের প্রতিক্রিয়া ছিল কঠিন; রাওয়ারে ৬,০০০ জন, ব্রাহ্মণাবাদে ৬,০০০ থেকে ২৬,০০০, ইস্কাল্টানে ৪,০০০ এবং মুলতানে ৬,০০০ মানুষের মৃত্যু হয়। তবে সুলহের (পরামর্শ/চুক্তি) মাধ্যমে দখলকৃত এলাকা, যেমন: আরমাবিল, নিরুন ও আরোরে প্রতিক্রিয়া ছিল খুবই হালকা। হাজ্জাজ একবার মুহাম্মাদকে অতি নম্র হওয়ার জন্য তিরস্কারও করেছিলেন।",
      "**ধর্মীয় সহনশীলতা এবং বিতর্কের অবসান:** মুহাম্মদ বিন কাসিমকে ধর্মীয় সহনশীলতার আদর্শ প্রতীক হিসেবে দেখা হয়। তিনি হিন্দু ও বৌদ্ধদের জিম্মি শ্রেণীতে অন্তর্ভুক্তির ন্যায্যতা প্রদানকারী প্রাচীনতম বিবৃতি দিয়েছিলেন: 'মূর্তিভরা মন্দিরগুলি খ্রিস্টানদের গীর্জা, ইহুদিদের সিনাগগ ও জরাথুস্ট্রীয়দের মন্দিরের মতো।' তাঁর এই উক্তিকে ঐতিহাসিকরা অত্যন্ত গুরুত্বপূর্ণ মনে করেন, যা ইসলামের ধর্মীয় সহনশীলতার ভিত্তি স্থাপন করে। লেন-পুল (১৯৭০) এর বর্ণনা অনুযায়ী, তাঁর বিজয় ছিল \"উদারপন্থী\", এবং তিনি অমুসলিম স্থানীয়দের জিম্মি করে তাঁদের জীবন ও জমি রক্ষা করেছিলেন। এমনকি হিন্দু ও বৌদ্ধ উপাসনালয়গুলিও অপবিত্র রাখা হয়নি। তবে, কিছু মন্দির ধ্বংস এবং বেসামরিক গণহত্যা ঘটলেও, তা ছিল ব্যতিক্রম। কিছু ঐতিহাসিক জোরপূর্বক ধর্মান্তরকরণের কথা বললেও, মুসলিম ঐতিহাসিকরা দাবি করেন যে সিন্ধুতে জোরপূর্বক কোনো ধর্মান্তর ঘটেনি। মানান আহমেদ আসিফ এবং অন্যান্য আধুনিক মুসলিম ঐতিহাসিকরা বিশ্বাস করেন যে সিন্ধু বিজয় মূলত শান্তিপূর্ণ ছিল এবং ধর্মান্তরও সম্পূর্ণরূপে স্বেচ্ছামূলক ছিল।",
      "**ব্যক্তিগত গুণাবলী, নেতৃত্ব এবং জনগণের উপর প্রভাব:** মুহাম্মদ বিন কাসিম ছোটবেলা থেকেই সাহস, প্রজ্ঞা এবং নম্রতার এক বিরল সংমিশ্রণ দেখিয়েছিলেন। হাজ্জাজ বিন ইউসুফ তাঁকে দায়িত্বের প্রাক্কালে উপদেশ দিয়েছিলেন: \"যদি তুমি কোনো দেশ নিয়ন্ত্রণে রাখতে চাও, তবে তার প্রতি দয়ালু হও। যারা তোমার সাথে ভালো ব্যবহার করেছে, তাদের সাথে আচরণ করার ক্ষেত্রে উদার হও এবং নিজের শত্রুকে বোঝার চেষ্টা করো। যে তোমার বিরোধিতা করে তার সাথেও সম্ভব হলে করুণাময় হও।\" মুহাম্মদ এই উক্তিগুলির স্বার্থক প্রয়োগ ঘটান। তিনি অত্যন্ত নম্রতার বৈশিষ্ট্যযুক্ত ছিলেন এবং তাঁর সেনাবাহিনীতে যারা বয়সে বড় ছিলেন, তাদের পরামর্শ ব্যতীত আদেশ করতেন না। তিনি যেখানেই গিয়েছেন প্রতিটি স্থানেই তিনি মসজিদ নির্মাণ এবং জনকল্যাণমূলক কাজ করেছেন এবং ইসলামি সংস্কৃতির প্রচার ও প্রসারের জন্য কাজ করেছেন। ঐতিহাসিক লেনপুল বলেন, মোহাম্মাদ বিন কাসিম ছিলেন উদার এবং সহনশীল বিজেতা শাসক। তাঁর উদারতার জন্যই পরবর্তীতে হিন্দু সম্প্রদায় তাঁর মূর্তি বানিয়ে পূজা করত বলেও কথিত আছে।",
      "**মৃত্যু ও দুর্ভাগ্যজনক পরিসমাপ্তি (৭১৫ খ্রিস্টাব্দ):** হাজ্জাজ ৭১৪ সালে মারা যান এবং তাঁর এক বছর পর খলিফা প্রথম আল ওয়ালিদও ইন্তেকাল করেন। আল ওয়ালিদের পর তাঁর ভাই সুলায়মান খিলাফতের স্থলাভিষিক্ত হন। হাজ্জাজ আল ওয়ালিদের একান্ত বিশ্বস্ত ছিলেন এবং খিলাফতের বিষয়ে তাঁর ছেলের পক্ষে প্রচারণা চালিয়েছিলেন, যার ফলে তিনি সুলাইমানের বিরাগভাজন হন। সুলায়মান হাজ্জাজের ঘনিষ্ঠ জেনারেল ও কর্মকর্তাদের বিরুদ্ধে প্রতিশোধ নেওয়া শুরু করেন। এই রাজনৈতিক কোন্দলের শিকার হন মুহাম্মদ বিন কাসিম। তাঁকে সিন্ধু থেকে প্রত্যাহার করে ইরাকে ডেকে পাঠানো হয় এবং সেখানে খলিফার নির্দেশে মাত্র ২০ বছর বয়সে (৭১৫ খ্রিস্টাব্দে) তাঁকে বন্দী করা হয়। মুহাম্মদ বিন কাসিম ৭১৫ সালের ১৮ জুলাই ইরাকের মসুলে মারা যান। তাঁর ভাগ্যের বিবরণ সম্পর্কে দুটি ভিন্ন বর্ণনা পাওয়া যায়:",
      "**বালাজুরীর বর্ণনা মতে:** ইরাকের নতুন গভর্নর ইয়াজিদ ইবনে আবি কাবশা, যিনি পূর্বের হাজ্জাজের হাতে নির্যাতিত ও বন্দী ছিলেন, তাঁর সাথে পারিবারিক কলহের জের ধরে এবং খলিফা সুলাইমানের নির্দেশে মুহাম্মদ বিন কাসিমকে গ্রেফতার করে নির্যাতন করা হয় এবং হত্যা করা হয়। এই বর্ণনায় মুহাম্মদের মৃত্যুর জন্য রাজনৈতিক প্রতিশোধকে দায়ী করা হয়।",
      "**চাচ নামা-এর বর্ণনা মতে:** এই গ্রন্থে একটি রোমান্টিক এবং বিতর্কিত গল্প বর্ণিত হয়েছে। বলা হয়, রাজা দাহিরের কন্যা সূর্য দেবী এবং পরিমল দেবী, যারা সিন্ধু বিজয়ের সময় বন্দী হয়েছিলেন, তারা খলিফার কাছে মিথ্যা অভিযোগ করেন যে মুহাম্মদ তাদের এখানে পাঠানোর আগে তাদের ইজ্জত লঙ্ঘন করেছিলেন। এই অভিযোগের ভিত্তিতে মুহাম্মদকে একটি মরা গরুর চামড়ায় মুড়ে সেলাই করা হয়েছিল এবং সেই অবস্থায় তাঁকে সিরিয়ায় পাঠানো হয়। শ্বাসরোধ হয়ে পথেই তাঁর মৃত্যু হয়। তবে, এই বিবরণের সত্যতা নিয়ে অনেক অভিযোগ উত্থাপিত হয়েছে এবং এটিকে একটি সন্দেহজনক উৎস হিসেবে বিবেচনা করা হয়।",
      "**মুহাম্মদ পরবর্তী সিন্ধুর পরিস্থিতি:** মুহাম্মদ বিন কাসিমের প্রস্থানের পর সিন্ধু অঞ্চলে উমাইয়া খিলাফতের নিয়ন্ত্রণ দুর্বল হয়ে পড়ে। পরবর্তী নিযুক্ত আরব গভর্নর অল্প দিনের মধ্যেই মারা যান। দাহিরের পলায়নকারী পুত্র সিন্ধুতে ফিরে আসেন এবং ব্রাহ্মনাবাদ পুনরুদ্ধার করেন। ৭২০ সালে দ্বিতীয় অভিযানে ব্রাহ্মনাবাদ পুনরুদ্ধার হলেও, উমাইয়ারা উত্তরাধিকার সংকটে জড়িয়ে পড়লে সিন্ধুতে তাদের বিচ্ছেদ ঘটে। ৮৭০ সালে আব্বাসীয় আমলে স্থানীয় আমিররা খলিফার প্রতি সমস্ত আনুগত্য বন্ধ করে দেন। ১০ শতকের মধ্যে সিন্ধু দুটি দুর্বল রাজ্যে বিভক্ত হয়ে যায় এবং পরবর্তীতে ইসমাইলীদের হাতে পরাস্ত হয়। মাহমুদ গজনভির আগমনের আগ পর্যন্ত উত্তর ও পূর্বের হিন্দু রাজারা প্রায় তিন শতাব্দী ধরে আরব বিজয় ঠেকিয়ে রেখেছিল।",
      "**ঐতিহাসিক গুরুত্ব এবং বিতর্কের পর্যালোচনা:** মুহাম্মদ বিন কাসিমের সিন্ধু জয় ছিল অত্যন্ত ব্যয়বহুল, কিন্তু এটি উমাইয়া খিলাফতের জন্য একটি বড় লাভ ছিল। এর ফলে ইসলাম ভারতীয় উপমহাদেশে প্রবেশ করে এবং গোটা অঞ্চলে ছড়িয়ে যায়। তাঁর সামরিক ও প্রশাসনিক সাফল্য ভারতীয় উপমহাদেশে ইসলামের দীর্ঘমেয়াদী প্রভাবের সূচনা করে। যদিও তাঁর বিজয়ের কিছু কঠোরতা ও মৃত্যুর ঘটনা বিতর্কিত, তবুও তাঁর উদার এবং সহনশীল শাসননীতি তাঁকে একজন দূরদর্শী নেতা হিসেবে প্রতিষ্ঠিত করে। তাঁর জীবন এক দুর্ভাগ্যজনক রাজনৈতিক ষড়যন্ত্রের মাধ্যমে শেষ হলেও, সিন্ধু বিজয়ী হিসেবে তাঁর অবদান ভারতীয় উপমহাদেশের ইতিহাসে এক নতুন দিগন্ত উন্মোচন করেছিল এবং তাঁকে ইতিহাসের পাতায় অমর করে রেখেছে।"
    ],
    "moral": "",
    "source": "আল বিদায়া ওয়ান নিহায়া, আল কামিল ফিত তারিখ, তারিখুল খুলাফা, তারিখুল ইসলাম, ফুতুহুল বুলদান (বালাজুরি), কিতাবুল বুলদান (ইয়াকুবি), চাচ নামা, সহীহ বুখারী, Lane-Poole (Medieval India), Wink (Al-Hind)।"
  },
  {
    "id": "salahuddin_al_aiyub",
    "categoryId": "mujahid_jibon",
    "title": "আবু নাসির সালাহুদ্দিন ইউসুফ ইবনে আইয়ুব",
    "summary": "",
    "paragraphs": [
      "সালাহ আল-দীন ইউসুফ ইবনে আইয়ুব (সালাউদ্দিন আইয়ুবি) ছিলেন আইয়ুবী রাজবংশের প্রতিষ্ঠাতা এবং মিশরের প্রথম সুলতান। তিনি ছিলেন একজন কুর্দিশ সামরিক নেতা এবং সুন্নী ইসলামের অন্যতম প্রধান পুনরুজ্জীবনকারী। ১২ শতাব্দীর মুসলিম বিশ্বে তাঁর উত্থান ক্রুসেডারদের সামরিক আধিপত্যকে সম্পূর্ণভাবে ভেঙে দেয় এবং তিনি জেরুজালেম পুনরুদ্ধারের মাধ্যমে মুসলিম বিশ্বে চিরস্মরণীয় হয়ে আছেন।",
      "**নাম, বংশ পরিচয় এবং ব্যতিক্রমী প্রারম্ভিক জীবন ও শিক্ষা (১১৩৭–১১৬৪ খ্রিস্টাব্দ):** তাঁর পূর্ণ নাম ছিল আবুল মুজাফ্ফর ইউসুফ ইবনে আইয়ুব ইবনে শাদী, যিনি ইতিহাসে সালাহ আল-দীন (অর্থ: ধর্মের ন্যায়পরায়ণতা) এবং আল-মালিক আন-নাসির (অর্থ: বিজয়ী শাসক) উপাধিতে পরিচিত। তাঁর জন্ম আনুমানিক ১১৩৭ খ্রিস্টাব্দে বর্তমান ইরাকের তিকরিত শহরে। তিনি ছিলেন কুর্দি বংশোদ্ভূত এবং তাঁর পরিবার মধ্যযুগীয় আর্মেনিয়ার ডিভিন শহর থেকে আগত। তাঁর পিতা নাজমুদ্দিন আইয়ুবের তত্ত্বাবধানেই তাঁর প্রাথমিক জীবন কাটে। তাঁর চাচা ছিলেন আসাদউদ্দিন শিরকুহ, যিনি ছিলেন দামেস্কের সুলতান নুরুদ্দিন জেনগির একজন বিশ্বস্ত সামরিক কমান্ডার। সালাহ আল-দীন দামেস্কে তাঁর চাচার তত্ত্বাবধানে লালিত-পালিত হন এবং জ্ঞানচর্চায় গভীর মনোযোগ দেন। তিনি সামরিক বাহিনীর চেয়ে ধর্মীয় বিষয়ে বেশি আগ্রহী ছিলেন; তাঁর জীবনীকার আল ওয়াহরানির মতে, সালাহুদ্দিন ইউক্লিড, আলমাজেস্ট, পাটিগণিত ও আইন সম্পর্কিত প্রশ্নের উত্তর দিতে পারতেন। ইসলাম ছাড়াও বংশবৃত্তান্ত, জীবনী এবং আরবের ইতিহাস সম্পর্কে তাঁর গভীর জ্ঞান ছিল। তাঁর ধর্মীয় আগ্রহে প্রথম ক্রুসেডের সময় খ্রিস্টানদের কর্তৃক জেরুজালেম অধিকারের ঘটনাটি তীব্রভাবে প্রভাব ফেলেছিল।",
      "**মিশরে ক্ষমতা আরোহণ ও ফাতেমীয় খিলাফতের বিলুপ্তি (১১৬৪–১১৭১ খ্রিস্টাব্দ):** সালাহ আল-দীনের সামরিক কর্মজীবন শুরু হয় তাঁর চাচা শিরকুহের অধীনে। ফাতেমীয় মিশরে রাজনৈতিক কোন্দল শুরু হলে এবং ক্রুসেডাররা মিশরের দিকে অগ্রসর হলে, সুলতান নুরুদ্দিন জেনগি শিরকুহকে মিশরের প্রতিরক্ষার জন্য পাঠান। ক্রুসেডারদের আক্রমণের বিরুদ্ধে সামরিক সাফল্যের মাধ্যমে সালাহউদ্দীন ফাতেমীয় সরকারের উচ্চপদে পৌঁছান। তিনি শিরকুহের সাথে তিনটি প্রধান সামরিক অভিযানে মিশরে প্রবেশ করেন। ১১৬৯ খ্রিস্টাব্দে শিরকুহ-এর মৃত্যুর পর, ফাতেমীয় খলিফা আল আদিদ সালাহউদ্দীনকে তাঁর উজির (প্রধানমন্ত্রী) নিয়োগ দেন। আল ওয়াহরানি লিখেছেন যে, সালাহুদ্দিনের পরিবারের সুনাম ও তাঁর সামরিক দক্ষতার জন্য তাঁকে নিয়োগ দেওয়া হয়েছিল। শিয়া খলিফার অধীনে একজন সুন্নিকে উজির মনোনীত করা ছিল বিরল ঘটনা। উজির হিসেবে তিনি ফাতেমীয় শাসনের প্রতি বিরূপ ছিলেন এবং ১১৭১ খ্রিস্টাব্দের ১০ সেপ্টেম্বর খলিফা আল আদিদের মৃত্যুর পর তিনি ক্ষমতা গ্রহণ করেন, ফাতেমীয় খিলাফতের পতন ঘটিয়ে বাগদাদের আব্বাসীয় খিলাফতের আনুগত্য ঘোষণা করেন। এই ঘটনার মধ্য দিয়েই মিশরে আইয়ুবী রাজবংশ (তাঁর পিতা আইয়ুব ইবনে শাদীর নামানুসারে) প্রতিষ্ঠিত হয়। এরপরের বছরগুলোতে তিনি উচ্চ মিশরে ফাতেমীয়পন্থি বিদ্রোহ উৎখাত করেন এবং মিশরের প্রতিরক্ষা মজবুত করার জন্য কায়রো দুর্গের নির্মাণ শুরু করেন।",
      "**সিরিয়া একীকরণ ও জেঙ্গি শক্তির সাথে সংঘর্ষ (১১৭৪–১১৮২ খ্রিস্টাব্দ):** ১১৭৪ সালে সুলতান নুরুদ্দিন জেনগির আকস্মিক মৃত্যুর পর সালাহ আল-দীন কঠিন সিদ্ধান্তের সম্মুখীন হন। তিনি সরাসরি সিরিয়া আক্রমণ করলে ইসলামি বিধান লঙ্ঘিত হতে পারত। কিন্তু দামেস্কের শাসকের অনুরোধে তিনি শান্তিপূর্ণভাবে শহরে প্রবেশ করেন এবং ক্ষমতা গ্রহণ করেন। তিনি এরপর পূর্বে নুরউদ্দিনের অধিকারে থাকা আংশিক স্বাধীন শহরসমূহের দিকে রওনা দেন এবং হামা ও হিমস সহজে দখল করে নেন। তাঁর এই সাফল্য সাইফউদ্দিন গাজীর নেতৃত্বাধীন জেনগি শাসকদের সতর্ক করে তোলে। সাইফউদ্দিন সিরিয়া ও মেসোপটেমিয়াকে তাঁর পরিবারের বলে বিবেচনা করতেন এবং সালাহ আল-দীনের ক্ষমতা বৃদ্ধিতে রাগান্বিত হন। সাইফউদ্দিন একটি বড় আকারের সেনাদল গঠন করে আলেপ্পোর দিকে পাঠান। সালাহ আল-দীন জেনগি সেনাবাহিনীকে পরাজিত করেন এবং আব্বাসীয় খলিফা কর্তৃক মিশর ও সিরিয়ার সুলতান ঘোষিত হন। এরপরও জেনগিদের সাথে ক্ষমতার লড়াই চলতে থাকে। ১১৮২ সালে তিনি মোসুল থেকে ২৫ কিমি দূরে তিল সুলতানে জেনগি বাহিনীর সাথে লড়াই করেন এবং জয় লাভ করেন। ১১৮২ সালে আলেপ্পো জয়ের মাধ্যমে তিনি সিরিয়া বিজয়ের কাজটি সমাপ্ত করেন। তবে জেনগিদের মোসুলের শক্তঘাঁটি দখলে তিনি সমর্থ হননি।",
      "**হাশাশিনদের সাথে দ্বন্দ্ব এবং অভ্যন্তরীণ নিরাপত্তা:** অভ্যন্তরীণভাবে সালাহ আল-দীন রশিদউদ্দিন সিনানের নেতৃত্বাধীন হাশাশিনদের (ইসমাইলি) হুমকির সম্মুখীন হন, যারা ফাতেমীয় খিলাফত উচ্ছেদ করার কারণে তাঁর প্রতি বিরূপ ছিল। ১১৭৬ সালের আগস্টে তিনি নুসাইরিয়া পর্বতমালায় হাশাশিনদের দুর্গে অভিযান চালান। একবার তাঁর তাবুতে এক হাশাশিন হামলাকারী তাঁকে ছুরি দিয়ে মাথায় আক্রমণ করে, কিন্তু তাঁর শিরস্ত্রাণের ফলে হামলা সফল হয়নি। এই ঘটনা তাঁকে সতর্ক করে এবং তিনি হাশাশিনদের সাথে শান্তিচুক্তি করেন। এই চুক্তি অনুযায়ী, হাশাশিনরা ক্রুসেডারদের বিরুদ্ধে লড়াইয়ে সালাহ আল-দীনকে সহযোগিতা করে। সালাহ আল-দীন এরপর ক্যারাভান রুটগুলোর নিরাপত্তা নিশ্চিত করেন এবং ক্রুসেডারদের সাথে ব্যবসা করার অভিযোগে বেদুইনদের দুই তৃতীয়াংশ জায়গির অপসারণ করেন।",
      "**ক্রুসেডারদের বিরুদ্ধে প্রথম আক্রমণ এবং জেরুজালেমের পথে বাধা:** মিশরে অবস্থানকালে সালাহ আল-দীন ১১৭০ সালে দারুম অবরোধের মাধ্যমে ক্রুসেডারদের বিরুদ্ধে অভিযান শুরু করেন। ১১৭৭ সালের নভেম্বরে তিনি ফিলিস্তিনে আক্রমণ পরিচালনা করেন। এই সময় তিনি রাজা বল্ডউইনের সাথে মন্টগিজার্ডের যুদ্ধে রামলার কাছে অতর্কিত আক্রমণের সম্মুখীন হন এবং পরাজিত হয়ে মিশর ফিরে আসেন। এই পরাজয়ে দমে না গিয়ে তিনি সামরিক প্রস্তুতি জোরদার করেন। ১১৭৯ সালের এপ্রিলে তিনি ক্রুসেডারদের হামলা প্রতিহত করেন এবং পরে জেকব ফোর্ড‌ যুদ্ধক্ষেত্রে জয়ী হন। ১১৮০ সালে তিনি বল্ডউইনের সাথে একটি শান্তিচুক্তি করেন, কারণ খরা ও ফসল কম থাকায় তিনি যুদ্ধের জন্য প্রস্তুত ছিলেন না। রেনল্ড অব চ্যাটিলন এই চুক্তির বিরোধীতা করে লোহিত সাগরে মুসলিম বাণিজ্য ও হজ্বযাত্রীদের বহরকে আক্রমণ করেন এবং মক্কা ও মদিনা আক্রমণের হুমকি দেন। এর পাল্টা পদক্ষেপ হিসেবে সালাহুদ্দিন রেনল্ডকে নিজ হাতে হত্যার শপথ নেন।",
      "**হাত্তিনের ঐতিহাসিক বিজয় এবং জেরুজালেম পুনরুদ্ধার (১১৮৭ খ্রিস্টাব্দ):** রেনল্ডের অব্যাহত উস্কানির প্রতিক্রিয়ায় সালাহ আল-দীন তাঁর জীবনের সবচেয়ে গুরুত্বপূর্ণ সামরিক অভিযানে নামেন। ১১৮৭ সালের ৪ জুলাই গ্যালিল সাগরের কাছে হাত্তিনের প্রান্তরে তিনি ক্রুসেডারদের মূল সেনাবাহিনীর মুখোমুখি হন। সালাহ আল-দীনের রণকৌশল ছিল অসাধারণ; তিনি ক্রুসেডারদের জলবিহীন পথ দিয়ে যেতে বাধ্য করেন এবং তীব্র গরমে তাদের দুর্বল করে দেন। এই যুদ্ধে ক্রুসেডার সেনাবাহিনী সম্পূর্ণরূপে নিশ্চিহ্ন হয়ে যায়। যুদ্ধের পর সালাহ আল-দীন তাঁর শপথ রক্ষা করে রেনল্ড অব চ্যাটিলনকে ব্যক্তিগতভাবে হত্যা করেন। এই বিজয় মুসলিমদের জন্য ক্রুসেডারদের কাছ থেকে ফিলিস্তিন জয় করা সহজ করে দেয়। এরপর সালাহ আল-দীন জেরুজালেমের দিকে অগ্রসর হন এবং ১১ অক্টোবর ১১৮৭ খ্রিস্টাব্দে (২৭ রজব ৫৩৩ হিজরী) অবরোধের পর জেরুজালেম জয় করেন।",
      "**মানবিকতা ও ধর্মীয় সহনশীলতা:** জেরুজালেম বিজয়ের পর সালাহ আল-দীন যে মানবিকতা ও সহনশীলতা প্রদর্শন করেন, তা তাঁকে বিশ্বজুড়ে সম্মানিত করে তোলে। ক্রুসেডারদের গণহত্যার প্রতিশোধ না নিয়ে তিনি খ্রিস্টান নাগরিকদের জন্য সাধারণ ক্ষমা ঘোষণা করেন। তিনি মুক্তিপণ দিতে সক্ষমদের তা আদায় করে নিরাপদে যেতে দেন এবং দরিদ্রদের জন্য বিনামূল্যে বের হওয়ার ব্যবস্থা করেন। তিনি ইহুদিদের শহরে পুনরায় বসবাসের অনুমতি দেন। তাঁর এই উদারতা মুসলিম, আরব, তুর্কি ও কুর্দি সংস্কৃতিতে তাঁকে এক মহান নেতা ও ধর্মীয় সহনশীলতার প্রতীক হিসেবে প্রতিষ্ঠিত করে।",
      "**তৃতীয় ক্রুসেড, কিং রিচার্ডের সাথে দ্বন্দ্ব এবং রামলার চুক্তি (১১৮৯–১১৯২ খ্রিস্টাব্দ):** হাত্তিনের যুদ্ধ ও জেরুজালেমের পতন তৃতীয় ক্রুসেডকে উদ্বুদ্ধ করে। ইংল্যান্ডের রাজা রিচার্ড দ্য লায়নহার্ট এই ক্রুসেডের নেতৃত্ব দেন। রিচার্ডের বাহিনী এক্রে অবরোধ করে জয় করার পর নারী ও শিশুসহ প্রায় ৩,০০০ মুসলিম বন্দীকে হত্যা করে। সালাহ আল-দীন এর প্রতিশোধ নেন। রিচার্ডের সাথে তাঁর দীর্ঘ সামরিক ও কূটনৈতিক লড়াই চলে, যার মধ্যে আরসুফের যুদ্ধ উল্লেখযোগ্য। রিচার্ড দ্য লায়নহার্টের সামরিক প্রতিভার প্রতি সালাহ আল-দীনের গভীর শ্রদ্ধা ছিল। ১১৯২ খ্রিস্টাব্দে তাঁদের মধ্যে রামলার চুক্তি স্বাক্ষরিত হয়, যার মাধ্যমে জেরুজালেম মুসলিমদের হাতেই থাকে, তবে খ্রিস্টান তীর্থযাত্রীরা সেখানে অবাধে প্রবেশাধিকার পান।",
      "**ইন্তেকাল, সম্পদ ও ঐতিহাসিক উত্তরাধিকার:** রামলা চুক্তির কয়েক মাস পর, সালাহ আল-দীন দামেস্কে অসুস্থ হয়ে পড়েন এবং ১১৯৩ খ্রিস্টাব্দের ৪ মার্চ মাত্র ৫৬ বছর বয়সে মৃত্যুবরণ করেন। মৃত্যুর সময় তাঁর ব্যক্তিগত সম্পদে মাত্র এক টুকরো স্বর্ণ ও চল্লিশ টুকরো রূপা ছিল, কারণ তিনি তাঁর সকল সম্পদ জিহাদ ও দান-খয়রাতে ব্যয় করেছিলেন। দামেস্কের উমাইয়া মসজিদের বাইরে তাঁকে দাফন করা হয়। তাঁর প্রতিষ্ঠিত আইয়ুবী রাজবংশ তাঁর মৃত্যুর পর প্রায় ৫৭ বছর টিকে ছিল। আধুনিক আরব বিশ্বে, বিশেষত আরব-ইসরায়েলি সংঘাতের সময়, তাঁর বীরত্ব, নেতৃত্ব এবং জেরুজালেম বিজয় ঐক্যের প্রতীক হিসেবে কাজ করে। এই কারণে মিশরের জাতীয় প্রতীক হিসেবে সালাহুদ্দিনের ঈগল প্রতীক ব্যবহার করা হয়।"
    ],
    "moral": "",
    "source": "ইবনে শাদদাদ, ইবনে আল-আছীর, আল-মাকরিজি, The Rare and Excellent History of Saladin (Baha ad-Din), Chronicles of the Crusades."
  }
]