[
  {
    "id": "mujahid_jibon_khalid_ibn_walid",
    "categoryId": "mujahid_jibon",
    "title": "খালিদ ইবনে ওয়ালিদ (রাঃ): আল্লাহর তরবারি",
    "summary": "খালিদ ইবনে ওয়ালিদ (রাঃ) ছিলেন ইসলামের সর্বশ্রেষ্ঠ সেনাপতি। রাসূলুল্লাহ (সাঃ) তাঁকে 'সাইফুল্লাহ' (আল্লাহর তরবারি) উপাধি দিয়েছিলেন। তিনি ১০০টিরও বেশি যুদ্ধে অংশ নিয়েছিলেন এবং কখনো পরাজিত হননি।",
    "paragraphs": [
      "খালিদ ইবনে ওয়ালিদ (রাঃ) প্রথমে ইসলামের বিরুদ্ধে যুদ্ধ করতেন। উহুদ যুদ্ধে তিনি মুসলমানদের বিরুদ্ধে কাফিরদের পক্ষে যুদ্ধ করেছিলেন এবং তাঁর কৌশলের কারণে মুসলমানরা কঠিন পরিস্থিতিতে পড়েছিল।",
      "কিন্তু হুদাইবিয়ার সন্ধির পর তিনি ইসলাম গ্রহণ করলেন। রাসূলুল্লাহ (সাঃ) তাঁকে দেখে অত্যন্ত খুশি হলেন এবং বললেন:",
      "'আল্লাহর শুকরিয়া যে তিনি তোমাকে হেদায়েত দিয়েছেন। তোমার মতো বুদ্ধিমান ব্যক্তি ইসলামের সৌন্দর্য বুঝতে পারবে না এটা হতে পারে না।'",
      "মুতার যুদ্ধে তিনটি সেনাপতি শহীদ হওয়ার পর সাহাবীরা খালিদ (রাঃ)-কে সেনাপতি নির্বাচন করলেন। তিনি এমন কৌশল অবলম্বন করলেন যে, বিশাল রোমান বাহিনীর বিরুদ্ধে মুসলমানরা নিরাপদে ফিরে আসতে পারল।",
      "রাসূলুল্লাহ (সাঃ) তাঁকে স্বাগত জানিয়ে বললেন:",
      "'তুমি আল্লাহর তরবারিগুলোর একটি তরবারি।' এরপর থেকে তাঁকে 'সাইফুল্লাহ' (আল্লাহর তরবারি) বলা হতো। [ইবনে হিব্বান: ৬৯২৮]",
      "খালিদ (রাঃ) ইয়ামামার যুদ্ধে মুসাইলিমা কাযযাবের বিরুদ্ধে যুদ্ধ করেছিলেন। এই যুদ্ধে অনেক হাফিজে কুরআন শহীদ হয়েছিলেন, কিন্তু খালিদ (রাঃ)-এর নেতৃত্বে মুসলমানরা বিজয়ী হয়েছিল।",
      "তিনি পারস্য ও রোমান সাম্রাজ্যের বিরুদ্ধে অসংখ্য যুদ্ধে বিজয়ী হয়েছিলেন। তাঁর সামরিক কৌশল এত উন্নত ছিল যে আজও সামরিক একাডেমিতে তা পড়ানো হয়।",
      "খালিদ (রাঃ) বলতেন: 'আমার শরীরে এমন কোনো স্থান নেই যেখানে তরবারি, বর্শা বা তীরের আঘাতের চিহ্ন নেই। অথচ আমি আমার বিছানায় মৃত্যুবরণ করছি, যেমন উট মরে।'",
      "তিনি মৃত্যুশয্যায় কাঁদতে কাঁদতে বলেছিলেন: **'আমি ১০০টিরও বেশি যুদ্ধে অংশ নিয়েছি। আমার শরীরের প্রতিটি অংশে যুদ্ধের চিহ্ন আছে। অথচ আমি শহীদ হতে পারলাম না। আমি বিছানায় মরছি যেমন উট মরে।'**",
      "৬৪২ খ্রিস্টাব্দে তিনি হিমসে (সিরিয়া) ইন্তেকাল করেন। উমর (রাঃ) তাঁর মৃত্যুর সংবাদ শুনে কাঁদলেন এবং বললেন: **'নারীরা আর খালিদের মতো সন্তান জন্ম দিতে পারবে না।'**"
    ],
    "moral": "খালিদ (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে জিহাদ এবং কৌশলের সমন্বয়ে বিজয় আসে। তাঁর সাহস, বুদ্ধিমত্তা এবং আল্লাহর প্রতি ভরসা প্রতিটি মুসলমানের জন্য অনুকরণীয়।",
    "source": "ইবনে হিব্বান (৬৯২৮) এবং ইসলামী ইতিহাস গ্রন্থসমূহ।"
  },
  {
    "id": "mujahid_jibon_salahuddin_ayubi",
    "categoryId": "mujahid_jibon",
    "title": "সালাহউদ্দিন আইয়ুবী: জেরুজালেম বিজয়ী",
    "summary": "সুলতান সালাহউদ্দিন আইয়ুবী ছিলেন একজন মহান মুজাহিদ যিনি ক্রুসেডারদের কাছ থেকে জেরুজালেম পুনরুদ্ধার করেছিলেন। তাঁর ন্যায়বিচার, দয়া এবং সাহসিকতা শত্রুদেরও মুগ্ধ করেছিল।",
    "paragraphs": [
      "১১৮৭ খ্রিস্টাব্দে সালাহউদ্দিন আইয়ুবী হিত্তিনের যুদ্ধে ক্রুসেডারদের পরাজিত করেন এবং জেরুজালেম অবরোধ করেন। ৮৮ বছর পর মুসলমানরা জেরুজালেম পুনরুদ্ধার করতে সক্ষম হয়।",
      "যখন ক্রুসেডাররা ১০৯৯ সালে জেরুজালেম দখল করেছিল, তখন তারা এত নৃশংসভাবে হত্যাকাণ্ড চালিয়েছিল যে রাস্তায় ঘোড়ার পায়ের গোড়ালি পর্যন্ত রক্ত জমেছিল। তারা মসজিদে আশ্রয় নেওয়া হাজার হাজার মুসলমানকে হত্যা করেছিল।",
      "কিন্তু সালাহউদ্দিন যখন জেরুজালেম পুনরুদ্ধার করলেন, তিনি কোনো খ্রিস্টানকে হত্যা করেননি। তিনি ঘোষণা করলেন:",
      "'যারা মুক্তিপণ দিতে পারবে, তারা নিরাপদে চলে যেতে পারবে। যারা দিতে পারবে না, তাদেরও আমি ক্ষমা করে দিচ্ছি।'",
      "অনেক দরিদ্র খ্রিস্টান মুক্তিপণ দিতে পারছিল না। সালাহউদ্দিন নিজের কোষাগার থেকে তাদের মুক্তিপণ দিয়ে মুক্ত করে দিলেন।",
      "ক্রুসেডার রাজা রিচার্ড দ্য লায়নহার্ট একবার যুদ্ধক্ষেত্রে অসুস্থ হয়ে পড়লেন। সালাহউদ্দিন তাঁর কাছে নিজের চিকিৎসক এবং ফল পাঠিয়ে দিলেন।",
      "আরেকবার রিচার্ডের ঘোড়া যুদ্ধে মারা গেলে সালাহউদ্দিন তাঁর কাছে দুটি ঘোড়া উপহার পাঠালেন এবং বার্তা পাঠালেন: 'একজন রাজার পায়ে হেঁটে যুদ্ধ করা উচিত নয়।'",
      "সালাহউদ্দিনের ন্যায়বিচার এবং দয়ার কারণে অনেক খ্রিস্টান ইসলাম গ্রহণ করেছিল। তাঁর শত্রুরাও তাঁকে সম্মান করত।",
      "তিনি অত্যন্ত সাদাসিধে জীবনযাপন করতেন। তাঁর মৃত্যুর পর দেখা গেল তাঁর কোষাগারে মাত্র একটি স্বর্ণমুদ্রা এবং ৪৭টি রৌপ্যমুদ্রা আছে। তিনি সবকিছু দরিদ্রদের মধ্যে বিতরণ করে দিতেন।",
      "১১৯৩ খ্রিস্টাব্দে দামেস্কে তিনি ইন্তেকাল করেন। তাঁর জানাজায় মুসলমান এবং খ্রিস্টান—উভয়েই কাঁদছিল।"
    ],
    "moral": "সালাহউদ্দিন আইয়ুবীর জীবন প্রমাণ করে যে, ইসলামী জিহাদ শুধু যুদ্ধ নয়, বরং ন্যায়বিচার, দয়া এবং মানবতার প্রতীক। শত্রুর প্রতিও সদয় আচরণ করা ইসলামের শিক্ষা।",
    "source": "ইসলামী ইতিহাস এবং ক্রুসেড যুদ্ধের দলিলসমূহ।"
  },
  {
    "id": "mujahid_jibon_tariq_ibn_ziyad",
    "categoryId": "mujahid_jibon",
    "title": "তারিক ইবনে জিয়াদ: স্পেন বিজয়ী",
    "summary": "তারিক ইবনে জিয়াদ ছিলেন একজন মহান সেনাপতি যিনি ৭১১ খ্রিস্টাব্দে স্পেন বিজয় করেছিলেন। তিনি তাঁর সৈন্যদের উদ্দেশ্যে এমন এক ঐতিহাসিক ভাষণ দিয়েছিলেন যা আজও মানুষকে অনুপ্রাণিত করে।",
    "paragraphs": [
      "৭১১ খ্রিস্টাব্দে উমাইয়া খলীফা ওয়ালিদ ইবনে আবদুল মালিকের নির্দেশে মুসা ইবনে নুসাইর তারিক ইবনে জিয়াদকে স্পেন বিজয়ের জন্য পাঠালেন।",
      "তারিক ইবনে জিয়াদ ৭,০০০ সৈন্য নিয়ে জিব্রাল্টার প্রণালী পার হয়ে স্পেনে পৌঁছালেন। সামনে ছিল ভিসিগথ রাজা রডারিকের ১,০০,০০০ সৈন্যের বিশাল বাহিনী।",
      "তারিক ইবনে জিয়াদ তাঁর সৈন্যদের সাথে উপকূলে নামার পর একটি ঐতিহাসিক সিদ্ধান্ত নিলেন—তিনি সকল নৌকা পুড়িয়ে ফেলার নির্দেশ দিলেন।",
      "সৈন্যরা অবাক হয়ে জিজ্ঞাসা করল: **'আমরা কীভাবে ফিরে যাব?'**",
      "তারিক ইবনে জিয়াদ তখন তাঁর বিখ্যাত ভাষণ দিলেন:",
      "'হে মানুষ! তোমাদের পেছনে সমুদ্র, সামনে শত্রু। আল্লাহর কসম! তোমাদের সামনে শুধু সততা এবং ধৈর্য ছাড়া আর কিছু নেই।'",
      "'তোমরা জেনে রাখো, এই দ্বীপে তোমরা পিতৃহীন এতিমের চেয়েও বেশি অসহায়। তোমাদের শত্রু সংখ্যায় অনেক বেশি এবং তাদের সাহায্যকারীও অনেক। তোমাদের কাছে আল্লাহ ছাড়া কোনো সাহায্যকারী নেই।'",
      "'সুতরাং যদি তোমরা ধৈর্য ধারণ করো এবং আল্লাহর পথে অবিচল থাকো, তাহলে আল্লাহ তোমাদের বিজয় দান করবেন। আর যদি তোমরা পালিয়ে যেতে চাও, তাহলে জেনে রাখো—পালানোর কোনো পথ নেই। হয় বিজয়, নয়তো শাহাদাত!'",
      "এই ভাষণ শুনে সৈন্যদের মনোবল আকাশচুম্বী হয়ে গেল। তারা বুঝল যে, এখন শুধু দুটি পথ—হয় বিজয়, নয়তো শাহাদাত।",
      "গুয়াদালেতে নদীর তীরে ভয়াবহ যুদ্ধ হলো। মুসলমানরা এমন সাহসিকতার সাথে যুদ্ধ করল যে, ১,০০,০০০ সৈন্যের বিশাল বাহিনী পরাজিত হলো। রাজা রডারিক নিহত হলেন।",
      "এই বিজয়ের পর মুসলমানরা স্পেনে ৮০০ বছর শাসন করেছিল এবং সেখানে জ্ঞান-বিজ্ঞান, শিল্প-সাহিত্যের এক স্বর্ণযুগ সৃষ্টি করেছিল। কর্ডোভা, গ্রানাডা, টলেডো—এই শহরগুলো জ্ঞানের কেন্দ্র হয়ে উঠেছিল।",
      "তারিক ইবনে জিয়াদের নামে জিব্রাল্টার (জাবাল আত-তারিক = তারিকের পাহাড়) নামকরণ করা হয়েছে, যা আজও তাঁর স্মৃতি বহন করছে।"
    ],
    "moral": "তারিক ইবনে জিয়াদের জীবন শেখায় যে, আল্লাহর উপর পূর্ণ ভরসা এবং দৃঢ় সংকল্প থাকলে অসম্ভবকেও সম্ভব করা যায়। নৌকা পুড়িয়ে ফেলার সিদ্ধান্ত প্রমাণ করে যে, পিছু হটার পথ বন্ধ করে দিলে মানুষ সর্বোচ্চ চেষ্টা করে।",
    "source": "ইসলামী ইতিহাস এবং স্পেন বিজয়ের দলিলসমূহ।"
  }
]