[
  {
    "id": "nabi_adam_as",
    "categoryId": "nobider_jiboni",
    "title": "আদম (আঃ) - প্রথম মানব ও প্রথম নবী",
    "paragraphs": [
      "হযরত আদম (আঃ) ছিলেন প্রথম মানব এবং প্রথম নবী। আল্লাহ তা'আলা তাঁকে নিজ হাতে সৃষ্টি করেছেন এবং তাঁর মধ্যে রূহ ফুঁকে দিয়েছেন। তাঁর সৃষ্টির মাধ্যমে পৃথিবীতে মানব জাতির সূচনা হয়।",
      "**সৃষ্টির পূর্বে ফেরেশতাদের সাথে আলোচনা ও মাটি থেকে সৃষ্টি:** আল্লাহ যখন ফেরেশতাদের জানালেন যে তিনি পৃথিবীতে খলিফা (প্রতিনিধি) সৃষ্টি করবেন, তখন ফেরেশতারা বললেন:",
      "أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ",
      "আপনি কি এমন কাউকে সৃষ্টি করবেন যে সেখানে ফাসাদ করবে এবং রক্তপাত ঘটাবে? অথচ আমরা আপনার প্রশংসা ও পবিত্রতা ঘোষণা করছি। [সূরা বাকারা: ৩০]",
      "আল্লাহ বললেন: 'আমি যা জানি তোমরা তা জানো না।' ফেরেশতারা মানুষের ভবিষ্যৎ সম্পর্কে জানতেন না, কিন্তু আল্লাহ জানতেন যে মানুষের মধ্যে নবী, রাসূল, শহীদ এবং সৎকর্মশীল বান্দা থাকবে। আল্লাহ তা'আলা পৃথিবীর বিভিন্ন স্থান থেকে মাটি সংগ্রহ করলেন - লাল, সাদা, কালো, নরম, শক্ত - বিভিন্ন ধরনের। এজন্য মানুষের রং ও স্বভাব বিভিন্ন হয়। এই মাটি দিয়ে আদম (আঃ) এর দেহ তৈরি করা হলো। প্রথমে মাটি, তারপর কাদা, তারপর শুকনো ঠনঠনে মাটি। চল্লিশ দিন এই দেহ পড়ে রইল। ইবলিস এসে দেখল এবং ভাবল: এটা ফাঁপা, দুর্বল। আমি এর উপর প্রভাব বিস্তার করতে পারব।",
      "**রূহ ফুঁকে দেওয়া ও ফেরেশতাদের সিজদা:** আল্লাহ আদম (আঃ) এর দেহে রূহ ফুঁকে দিলেন। রূহ প্রথমে মাথায় প্রবেশ করল। চোখ খুলে গেল, চারদিক দেখতে পেলেন। নাকে প্রবেশ করলে হাঁচি এলো। আদম (আঃ) বললেন: 'আলহামদুলিল্লাহ' (সমস্ত প্রশংসা আল্লাহর জন্য)। আল্লাহ বললেন: 'ইয়ারহামুকাল্লাহ' (আল্লাহ তোমার প্রতি রহম করুন)। এভাবে প্রথম কথা ছিল আল্লাহর প্রশংসা। রূহ যখন পেটে পৌঁছল, ক্ষুধা অনুভব করলেন। পায়ে পৌঁছার আগেই উঠে দাঁড়াতে চাইলেন। এজন্য আল্লাহ বলেন:",
      "خُلِقَ الْإِنسَانُ مِنْ عَجَلٍ",
      "মানুষ সৃষ্টি করা হয়েছে তাড়াহুড়া করার জন্য। [সূরা আম্বিয়া: ৩৭]",
      "**আদম (আঃ) সম্পূর্ণ হওয়ার পর আল্লাহ সকল ফেরেশতাকে আদেশ দিলেন:** 'আদমকে সিজদা করো।' এটি ছিল সম্মানসূচক সিজদা, ইবাদতের সিজদা নয়। সকল ফেরেশতা সিজদা করলেন। কিন্তু ইবলিস অস্বীকার করল। সে ছিল জিন জাতির, ফেরেশতাদের সাথে ইবাদত করত। আল্লাহ জিজ্ঞাসা করলেন: 'কিসে তোমাকে বাধা দিল?' ইবলিস বলল:",
      "أَنَا خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ",
      "আমি তার চেয়ে উত্তম। আপনি আমাকে আগুন থেকে সৃষ্টি করেছেন আর তাকে মাটি থেকে। [সূরা আরাফ: ১২]",
      "এটি ছিল প্রথম অহংকার এবং প্রথম পাপ। আল্লাহ তাকে জান্নাত থেকে বের করে দিলেন।",
      "**জ্ঞান শিক্ষা ও হাওয়া (আঃ) এর সৃষ্টি:** আল্লাহ আদম (আঃ)-কে সকল জিনিসের নাম শিখিয়ে দিলেন। তারপর ফেরেশতাদের বললেন: 'এগুলোর নাম বলো যদি তোমরা সত্যবাদী হও।' ফেরেশতারা বললেন:",
      "سُبْحَانَكَ لَا عِلْمَ لَنَا إِلَّا مَا عَلَّمْتَنَا",
      "সুবহানাকা! আপনি আমাদের যা শিখিয়েছেন তা ছাড়া আমাদের কোনো জ্ঞান নেই। [সূরা বাকারা: ৩২]",
      "তারপর আল্লাহ আদম (আঃ)-কে বললেন: 'তুমি তাদের নাম বলে দাও।' আদম (আঃ) সব নাম বললেন। এভাবে প্রমাণিত হলো মানুষের শ্রেষ্ঠত্ব - জ্ঞান অর্জনের ক্ষমতা। আদম (আঃ) জান্নাতে একা ছিলেন। একদিন ঘুম থেকে উঠে দেখলেন পাশে এক নারী বসে আছেন। আল্লাহ আদমের বাম পাঁজরের হাড় থেকে হাওয়া (আঃ)-কে সৃষ্টি করেছেন। আদম (আঃ) জিজ্ঞাসা করলেন: 'তুমি কে?' হাওয়া (আঃ) বললেন: 'আমি নারী।' আদম (আঃ): 'কেন সৃষ্টি করা হয়েছে?' হাওয়া (আঃ): 'যাতে তুমি আমার কাছে শান্তি পাও।' [সহীহ বুখারী] ফেরেশতারা জিজ্ঞাসা করলেন: 'এর নাম কী?' আদম (আঃ) বললেন: 'হাওয়া।' কারণ তিনি জীবিত (হাই) থেকে সৃষ্টি হয়েছেন।",
      "**জান্নাতে জীবন ও শয়তানের ধোঁকা:** আল্লাহ আদম ও হাওয়াকে জান্নাতে বসবাস করতে দিলেন। বললেন:",
      "وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ",
      "তোমরা দুজন জান্নাতে বসবাস করো এবং যেখান থেকে ইচ্ছা খাও। কিন্তু এই গাছের কাছে যেও না, তাহলে জালিমদের অন্তর্ভুক্ত হবে। [সূরা বাকারা: ৩৫]",
      "কোন গাছ ছিল তা নিয়ে মতভেদ আছে - কেউ বলেন গম, কেউ বলেন আঙুর, কেউ বলেন ডুমুর। মূল বিষয় হলো আল্লাহর নিষেধাজ্ঞা। জান্নাতে তাঁরা সুখে শান্তিতে ছিলেন। কোনো কষ্ট, ক্ষুধা, তৃষ্ণা, গরম, ঠান্ডা ছিল না। ইবলিস (শয়তান) তাদের জান্নাত থেকে বের করার সুযোগ খুঁজছিল। সে তাদের কাছে এসে বলল: 'তোমাদের রব কি এই গাছ থেকে নিষেধ করেছেন শুধু এজন্য যে তোমরা ফেরেশতা হয়ে যাবে অথবা চিরকাল থাকবে?' সে কসম খেয়ে বলল: 'আমি তোমাদের শুভাকাঙ্ক্ষী।' [সূরা আরাফ: ২০-২১] শয়তান তাদের বোঝাল যে এই গাছের ফল খেলে তারা অমর হবে এবং ফেরেশতাদের মতো হবে। আদম ও হাওয়া (আঃ) ভুলে গেলেন এবং সেই গাছের ফল খেয়ে ফেললেন। সাথে সাথে তাঁদের লজ্জাস্থান খুলে গেল। তাঁরা জান্নাতের পাতা দিয়ে নিজেদের ঢাকতে লাগলেন।",
      "**তওবা, ক্ষমা ও পৃথিবীতে অবতরণ:** আল্লাহ ডাকলেন: 'আমি কি তোমাদের এই গাছ থেকে নিষেধ করিনি?' তাঁরা বুঝতে পারলেন ভুল হয়েছে। সাথে সাথে তওবা করলেন:",
      "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      "হে আমাদের রব! আমরা নিজেদের উপর জুলুম করেছি। যদি আপনি আমাদের ক্ষমা না করেন এবং রহম না করেন তাহলে আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব। [সূরা আরাফ: ২৩]",
      "আল্লাহ তাঁদের তওবা কবুল করলেন। কিন্তু বললেন: 'তোমরা সবাই নেমে যাও। তোমরা একে অপরের শত্রু। পৃথিবীতে তোমাদের জন্য নির্দিষ্ট সময় পর্যন্ত বসবাস ও ভোগ করার ব্যবস্থা আছে।' [সূরা বাকারা: ৩৬] আদম (আঃ) ভারতের সিলন (শ্রীলংকা) এ এবং হাওয়া (আঃ) জেদ্দায় অবতরণ করেন। দীর্ঘদিন পর আরাফাতের ময়দানে তাঁদের পুনর্মিলন হয়। এজন্য স্থানটির নাম 'আরাফাত' (পরিচয়)। তাঁরা পৃথিবীতে জীবন শুরু করলেন। চাষাবাদ, খাদ্য সংগ্রহ, বাসস্থান নির্মাণ - সব শিখলেন। আল্লাহ তাঁদের শিখিয়ে দিলেন। আদম (আঃ) ছিলেন প্রথম নবী। তিনি তাঁর সন্তানদের এক আল্লাহর ইবাদত শেখাতেন।",
      "**সন্তান-সন্ততি ও প্রথম কুরবানী:** হাওয়া (আঃ) থেকে অনেক সন্তান জন্ম নেয়। প্রতিবার যমজ - একজন ছেলে ও একজন মেয়ে। প্রথম যমজ ছিল কাবিল (কেইন) ও তার বোন। দ্বিতীয় যমজ ছিল হাবিল (আবেল) ও তার বোন। সেই সময় নিয়ম ছিল এক যমজের ছেলে অন্য যমজের মেয়েকে বিয়ে করবে। কিন্তু কাবিলের সাথে যে বোন জন্মেছিল সে ছিল সুন্দরী। কাবিল তাকে নিজেই বিয়ে করতে চাইল। আদম (আঃ) বললেন: এটা হারাম। কিন্তু কাবিল মানল না। আদম (আঃ) বললেন: তোমরা উভয়ে কুরবানী করো। যার কুরবানী কবুল হবে সে-ই সুন্দরী মেয়েটিকে বিয়ে করবে। হাবিল ছিল রাখাল। সে তার সবচেয়ে ভালো ভেড়া কুরবানী দিল। কাবিল ছিল কৃষক। সে খারাপ ফসল কুরবানী দিল। আকাশ থেকে আগুন এসে হাবিলের কুরবানী গ্রহণ করল। কাবিলের কুরবানী পড়ে রইল।",
      "**প্রথম হত্যাকাণ্ড ও লাশ কবর দেওয়া:** কাবিল রাগে জ্বলে উঠল। বলল: 'আমি তোমাকে হত্যা করব।' হাবিল বলল:",
      "لَئِن بَسَطتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَا بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ ۖ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ",
      "তুমি যদি আমাকে হত্যা করতে হাত বাড়াও, আমি তোমাকে হত্যা করতে হাত বাড়াব না। আমি আল্লাহকে ভয় করি। [সূরা মায়িদা: ২৮]",
      "কিন্তু কাবিল শুনল না। সে হাবিলকে পাথর দিয়ে মাথায় আঘাত করে হত্যা করল। এটি ছিল পৃথিবীর প্রথম হত্যাকাণ্ড। হাবিলের লাশ পড়ে রইল। কাবিল বুঝতে পারল না কী করবে। আল্লাহ একটি কাক পাঠালেন। কাকটি মাটি খুঁড়ে অন্য একটি মৃত কাক কবর দিল। কাবিল বলল:",
      "يَا وَيْلَتَىٰ أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي",
      "হায়! আমি কি এই কাকের মতোও হতে পারলাম না যে আমার ভাইয়ের লাশ কবর দিতে পারি? [সূরা মায়িদা: ৩১]",
      "সে মাটি খুঁড়ে হাবিলকে কবর দিল। এভাবে মানুষ কবর দেওয়া শিখল। আদম (আঃ) যখন জানলেন, অত্যন্ত দুঃখিত হলেন। একজন ছেলে মারা গেছে, অন্যজন খুনি হয়ে গেছে। তিনি আল্লাহর কাছে কাঁদলেন। আল্লাহ তাঁকে সান্ত্বনা দিলেন এবং আরেক ছেলে দান করলেন - শীস (আঃ)। শীস (আঃ) ছিলেন নেককার এবং পরবর্তীতে নবী হয়েছিলেন। আদম (আঃ) তাঁকে সব জ্ঞান শিখিয়ে দিলেন।",
      "**দীর্ঘ জীবন ও ইন্তেকাল:** আদম (আঃ) ৯৬০ বছর (মতান্তরে ১০০০ বছর) জীবিত ছিলেন। তিনি তাঁর সন্তান-সন্ততিদের তাওহীদ, নামাজ, এবং সৎকর্মের শিক্ষা দিয়েছেন। মৃত্যুর সময় ফেরেশতারা এসেছিলেন। তাঁর সন্তানরা কাঁদছিল। ফেরেশতারা বললেন: 'এটাই মৃত্যু। তোমাদের সবাইকে এই পথ অতিক্রম করতে হবে।' আদম (আঃ) ইন্তেকাল করলেন। ফেরেশতারা তাঁকে গোসল দিলেন, কাফন পরালেন, জানাযা পড়লেন এবং কবর দিলেন। এভাবে মানুষ জানাযার নিয়ম শিখল। তাঁকে মক্কার কাছে 'গারে আবু কুবাইস' এ দাফন করা হয় বলে কথিত আছে।"
    ],
    "moral": "আদম (আঃ) এর জীবন থেকে শিক্ষা: মানুষ আল্লাহর খলিফা, জ্ঞানের অধিকারী এবং শয়তানের শত্রু। ভুল হলে তওবা করা এবং আল্লাহর আনুগত্যে ফিরে আসাই মুক্তির পথ।",
    "source": "সূরা বাকারা: ৩০-৩৯; সূরা আরাফ: ১১-২৫; সূরা মায়িদা: ২৭-৩১; সহীহ বুখারী; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_idris_as",
    "categoryId": "nobider_jiboni",
    "title": "ইদরিস (আঃ) - সত্যবাদী নবী",
    "paragraphs": [
      "হযরত ইদরিস (আঃ) ছিলেন আদম (আঃ) এর পরে তৃতীয় নবী এবং শীস (আঃ) এর পৌত্র। তিনি ছিলেন অত্যন্ত সত্যবাদী এবং ধৈর্যশীল। আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেছেন। তিনি ছিলেন প্রথম মানুষ যিনি কলম দিয়ে লিখতেন এবং সেলাই শিল্প শিখিয়েছিলেন।",
      "**বংশ ও জন্ম:** ইদরিস (আঃ) এর পূর্ণ নাম ছিল ইদরিস ইবনে ইয়ারিদ ইবনে মাহলাইল। তিনি আদম (আঃ) এর পঞ্চম অথবা ষষ্ঠ বংশধর ছিলেন। তাঁর পিতা ইয়ারিদ এবং তাঁর দাদা মাহলাইল ছিলেন নেককার মানুষ। ইদরিস (আঃ) জন্মগ্রহণ করেন আদম (আঃ) এর ইন্তেকালের পরে বাবেল (বর্তমান ইরাক) অঞ্চলে। তাঁর জন্মের সময় মানুষ এখনও তাওহীদের উপর ছিল কিন্তু ধীরে ধীরে বিচ্যুতি শুরু হচ্ছিল।",
      "**নাম 'ইদরিস' এর অর্থ ও কুরআনে প্রশংসা:** 'ইদরিস' শব্দটি এসেছে 'দারাসা' (دَرَسَ) থেকে যার অর্থ অধ্যয়ন করা, পাঠ করা। তাঁকে এই নাম দেওয়া হয়েছিল কারণ তিনি অত্যধিক ইলম অর্জন করতেন এবং আল্লাহর কিতাব গভীরভাবে অধ্যয়ন করতেন। তিনি ছিলেন জ্ঞানী এবং প্রজ্ঞাবান। আল্লাহ তায়ালা কুরআনে ইদরিস (আঃ) এর প্রশংসা করে বলেন:",
      "وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ ۚ إِنَّهُ كَانَ صِدِّيقًا نَّبِيًّا",
      "এই কিতাবে ইদরিসের কথা স্মরণ করুন। নিশ্চয়ই তিনি ছিলেন সত্যবাদী, নবী। [সূরা মারইয়াম: ৫৬]",
      "وَرَفَعْنَاهُ مَكَانًا عَلِيًّا",
      "এবং আমি তাঁকে উচ্চ মর্যাদায় উন্নীত করেছি। [সূরা মারইয়াম: ৫৭]",
      "'সিদ্দিক' শব্দটি অত্যন্ত গুরুত্বপূর্ণ। এর অর্থ হলো যিনি সর্বদা সত্য বলেন এবং সত্যের উপর অটল থাকেন। নবীদের পরে সিদ্দিকদের মর্যাদা সবচেয়ে উঁচু।",
      "**নবুয়ত ও দাওয়াত:** ইদরিস (আঃ) নবুয়ত প্রাপ্ত হন যখন মানুষ আল্লাহর পথ থেকে বিচ্যুত হতে শুরু করেছিল। তিনি মানুষকে এক আল্লাহর ইবাদতের দিকে ডাকতেন এবং শিরক থেকে বিরত থাকতে বলতেন। তিনি মানুষকে সততা, ন্যায়পরায়ণতা এবং সৎকর্মের শিক্ষা দিতেন। তিনি বলতেন: 'আল্লাহ তোমাদের সৃষ্টি করেছেন এবং তিনিই তোমাদের রিযিক দেন। তাঁর ইবাদত করো এবং তাঁর শুকরিয়া আদায় করো।' তাঁর দাওয়াতে অনেক মানুষ ঈমান আনে এবং তাঁর অনুসরণ করে। তিনি তাঁর উম্মতকে তাওহীদ, নামাজ, রোজা এবং সৎকর্মের শিক্ষা দেন।",
      "**প্রথম লেখক ও জ্ঞান-বিজ্ঞান:** ইদরিস (আঃ) ছিলেন প্রথম মানুষ যিনি কলম দিয়ে লিখতেন। আল্লাহ তাঁকে লেখার জ্ঞান দান করেছিলেন। তিনি জ্ঞান-বিজ্ঞান লিখে রাখতেন যাতে পরবর্তী প্রজন্ম তা থেকে উপকৃত হতে পারে। তিনি বিভিন্ন বিষয়ে জ্ঞান রাখতেন:\n\n১. **জ্যোতির্বিদ্যা:** তিনি তারা, গ্রহ এবং আকাশের গতিবিধি সম্পর্কে জ্ঞান রাখতেন। তিনি মানুষকে শিখিয়েছিলেন কিভাবে তারা দেখে দিক নির্ণয় করতে হয় এবং সময় হিসাব করতে হয়।\n\n২. **গণিত:** তিনি হিসাব-নিকাশ এবং গণনা পদ্ধতি শিখিয়েছিলেন। তিনি মানুষকে শিখিয়েছিলেন কিভাবে সম্পদ হিসাব করতে হয় এবং লেনদেন করতে হয়।\n\n৩. **চিকিৎসা বিজ্ঞান:** তিনি রোগ-ব্যাধি এবং তার চিকিৎসা সম্পর্কে জ্ঞান রাখতেন। তিনি মানুষকে ভেষজ ঔষধ এবং চিকিৎসা পদ্ধতি শিখিয়েছিলেন।\n\n৪. **দর্শন ও প্রজ্ঞা:** তিনি জীবনের গভীর বিষয় নিয়ে চিন্তা করতেন এবং মানুষকে প্রজ্ঞার কথা শিখিয়েছিলেন।",
      "**সেলাই শিল্প ও পোশাক:** ইদরিস (আঃ) প্রথম সুই-সুতা দিয়ে কাপড় সেলাই করা শিখিয়েছিলেন। এর আগে মানুষ পশুর চামড়া বা পাতা দিয়ে শরীর ঢাকত। তিনি মানুষকে কাপড় বুনতে এবং সেলাই করতে শেখান। তিনি বিভিন্ন ধরনের পোশাক তৈরি করার পদ্ধতি শিখিয়েছিলেন। এটি ছিল মানব সভ্যতার একটি বড় অগ্রগতি। মানুষ এখন সুন্দর এবং পরিচ্ছন্ন পোশাক পরতে শুরু করল।",
      "**ইবাদত ও তাকওয়া:** ইদরিস (আঃ) ছিলেন অত্যন্ত ইবাদতগুজার। তিনি দিনে রোজা রাখতেন এবং রাতে নামাজ পড়তেন। তাঁর জীবন ছিল সাদাসিধা এবং দুনিয়াবিমুখ। তিনি সবসময় আল্লাহর জিকিরে মশগুল থাকতেন। তিনি খুব কম খেতেন এবং খুব কম ঘুমাতেন। তাঁর সময়ের বেশিরভাগ অংশ কাটত ইবাদত, জ্ঞান অর্জন এবং মানুষকে দাওয়াত দেওয়ার মধ্যে। তিনি ছিলেন অত্যন্ত বিনয়ী এবং নম্র। তিনি গরিব-দুঃখীদের সাহায্য করতেন এবং মানুষের সেবা করতেন।",
      "**উচ্চ মর্যাদায় উন্নীত:** আল্লাহ তায়ালা ইদরিস (আঃ) কে উচ্চ মর্যাদায় উন্নীত করেছেন। 'মাকানান আলিয়্যা' (উচ্চ স্থান) এর ব্যাখ্যা নিয়ে মুফাসসিরদের মধ্যে মতভেদ আছে:\n\n১. **চতুর্থ আকাশে:** অনেক মুফাসসির বলেন যে আল্লাহ তাঁকে জীবিত অবস্থায় আসমানে উঠিয়ে নিয়েছেন। তিনি চতুর্থ আকাশে আছেন। মিরাজের রাতে রাসূল (সাঃ) চতুর্থ আকাশে ইদরিস (আঃ) এর সাথে সাক্ষাত করেন। ইদরিস (আঃ) তাঁকে স্বাগত জানান এবং বলেন: 'মারহাবা বিন নাবিয়্যিস সালিহ ওয়াল আখিস সালিহ' (স্বাগতম সৎ নবী ও সৎ ভাই)। [সহীহ বুখারী: ৩৪৩০]\n\n২. **জান্নাতে:** কেউ বলেন তিনি জান্নাতে আছেন জীবিত অবস্থায়, ঈসা (আঃ) এর মতো।\n\n৩. **উচ্চ মর্যাদা:** কেউ বলেন এর অর্থ হলো আল্লাহ তাঁকে নবীদের মধ্যে উচ্চ মর্যাদা দান করেছেন।",
      "**মৃত্যু নাকি জীবিত:** ইদরিস (আঃ) এর মৃত্যু সম্পর্কে মতভেদ আছে:\n\n১. **জীবিত উত্থান:** অনেক আলেম বলেন তিনি ঈসা (আঃ) এর মতো জীবিত অবস্থায় আসমানে উঠিয়ে নেওয়া হয়েছে এবং এখনও জীবিত আছেন। তিনি মৃত্যুর স্বাদ গ্রহণ করেননি।\n\n২. **মৃত্যুর পর উত্থান:** কেউ বলেন তিনি মারা গেছেন এবং তাঁর রূহ চতুর্থ আকাশে আছে।\n\n৩. **পৃথিবীতে মৃত্যু:** কেউ বলেন তিনি পৃথিবীতেই মারা গেছেন এবং 'উচ্চ মর্যাদা' বলতে তাঁর আধ্যাত্মিক মর্যাদা বোঝানো হয়েছে।\n\nসবচেয়ে শক্তিশালী মত হলো তিনি জীবিত অবস্থায় আসমানে উঠিয়ে নেওয়া হয়েছেন। আল্লাহই ভালো জানেন।",
      "**জীবনকাল ও উত্তরাধিকার:** ইদরিস (আঃ) প্রায় ৩৬৫ বছর পৃথিবীতে ছিলেন (কিছু বর্ণনা মতে)। তারপর আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেন। তাঁর জীবন ছিল ইবাদত, জ্ঞান এবং দাওয়াতে পূর্ণ। তিনি তাঁর উম্মতকে অনেক কিছু শিখিয়ে গেছেন - লেখা, সেলাই, জ্ঞান-বিজ্ঞান এবং সর্বোপরি তাওহীদ। তাঁর পরে তাঁর সন্তানরা এবং অনুসারীরা তাঁর শিক্ষা ছড়িয়ে দেন। তাঁর বংশ থেকে পরবর্তীতে নূহ (আঃ) আসেন।"
    ],
    "moral": "ইদরিস (আঃ) এর জীবন থেকে শিক্ষা: সত্যবাদিতা, জ্ঞান অর্জন এবং ইবাদতে নিমগ্ন থাকা মানুষকে উচ্চ মর্যাদায় পৌঁছে দেয়।",
    "source": "সূরা মারইয়াম: ৫৬-৫৭; সহীহ বুখারী: ৩৪৩০; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"
  },
  {
    "id": "nabi_nuh_as",
    "categoryId": "nobider_jiboni",
    "title": "নূহ (আঃ) - মহাপ্লাবনের নবী",
    "paragraphs": [
      "হযরত নূহ (আঃ) ছিলেন আদম (আঃ) এর দশম বংশধর এবং মহাপ্লাবনের নবী। তিনি ৯৫০ বছর তাঁর জাতিকে দাওয়াত দিয়েছেন কিন্তু খুব কম মানুষ ঈমান এনেছে। আল্লাহ তাঁর দোয়ায় কাফিরদের ধ্বংস করেন এবং মুমিনদের রক্ষা করেন। তিনি 'উলুল আজম' পাঁচ নবীর একজন।",
      "**বংশ ও শিরকের সূচনা:** নূহ (আঃ) এর পূর্ণ নাম ছিল নূহ ইবনে লামাক ইবনে মাতুশালাহ। তিনি আদম (আঃ) এর দশম বংশধর এবং ইদরিস (আঃ) এর পৌত্র ছিলেন। তিনি জন্মগ্রহণ করেন ইরাক অঞ্চলে। তাঁর জন্মের সময় পৃথিবীতে শিরক ও পাপাচার ব্যাপক হয়ে গিয়েছিল। আদম (আঃ) এর সময়ে পাঁচজন নেককার মানুষ ছিলেন - ওয়াদ, সুওয়া, ইয়াগুস, ইয়াউক এবং নাসর। তাঁরা মারা গেলে শয়তান মানুষকে বলল: 'তাদের স্মৃতি রক্ষার জন্য মূর্তি বানাও।' প্রথমে শুধু স্মৃতি রক্ষার জন্য মূর্তি বানানো হলো। কিন্তু পরবর্তী প্রজন্ম ভুলে গেল এবং মূর্তির পূজা শুরু করল। এভাবে শিরক শুরু হয়। [সহীহ বুখারী: ৪৯২০]",
      "**নবুয়ত ও দাওয়াতের পদ্ধতি:** যখন শিরক ও পাপাচার চরম পর্যায়ে পৌঁছল, আল্লাহ নূহ (আঃ) কে নবী হিসেবে পাঠালেন। তিনি তখন ৪০ বছর বয়সী ছিলেন। নূহ (আঃ) তাঁর জাতিকে দিন-রাত দাওয়াত দিতে লাগলেন - প্রকাশ্যে এবং গোপনে, দিনে এবং রাতে, ব্যক্তিগতভাবে এবং জনসমাবেশে। কুরআনে নূহ (আঃ) বলেন:",
      "إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا ۝ ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا ۝ ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا",
      "আমি আমার জাতিকে দিন-রাত দাওয়াত দিয়েছি। তারপর আমি তাদের প্রকাশ্যে দাওয়াত দিয়েছি। তারপর আমি তাদের প্রকাশ্যেও বলেছি এবং গোপনেও বলেছি। [সূরা নূহ: ৫, ৮-৯]",
      "তিনি বললেন: 'হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। তোমরা তোমাদের রবের কাছে ক্ষমা চাও। তিনি তোমাদের উপর প্রচুর বৃষ্টি পাঠাবেন, সম্পদ ও সন্তান দিয়ে সাহায্য করবেন।' [সূরা নূহ: ১০-১২]",
      "**জাতির প্রতিক্রিয়া ও ৯৫০ বছর ধৈর্য:** কিন্তু তাঁর জাতি তাঁকে প্রত্যাখ্যান করল। তারা কান বন্ধ করে রাখত, কাপড় দিয়ে মুখ ঢেকে নিত এবং অহংকার করত। তারা বলল:",
      "وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا",
      "তোমরা তোমাদের দেবতাদের ছেড়ো না - ওয়াদ, সুওয়া, ইয়াগুস, ইয়াউক এবং নাসরকে ছেড়ো না। [সূরা নূহ: ২৩]",
      "**নূহ (আঃ) ৯৫০ বছর ধৈর্যের সাথে দাওয়াত দিয়েছেন। কুরআনে বলা হয়েছে:**",
      "وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا",
      "আমি নূহকে তার জাতির কাছে পাঠিয়েছিলাম। সে তাদের মধ্যে পঞ্চাশ কম এক হাজার বছর অবস্থান করেছে। [সূরা আনকাবুত: ১৪]",
      "এই দীর্ঘ সময়ে খুব কম মানুষ ঈমান এনেছে - মাত্র ৮০ জন (কিছু বর্ণনা মতে)। তাঁর তিন ছেলে - সাম, হাম এবং ইয়াফিস - ঈমান এনেছিল। কিন্তু চতুর্থ ছেলে কেনআন এবং স্ত্রী ওয়ালিআহ ছিল কাফির।",
      "**নূহ (আঃ) এর দোয়া ও নৌকা তৈরির আদেশ:** দীর্ঘ সময় দাওয়াত দেওয়ার পর যখন কেউ ঈমান আনল না, নূহ (আঃ) আল্লাহর কাছে দোয়া করলেন:",
      "رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا ۝ إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا",
      "হে আমার রব! পৃথিবীতে কাফিরদের একজন বাসিন্দাকেও রেখো না। যদি তুমি তাদের রেখে দাও তারা তোমার বান্দাদের পথভ্রষ্ট করবে এবং শুধু পাপিষ্ঠ কাফির সন্তান জন্ম দেবে। [সূরা নূহ: ২৬-২৭]",
      "আল্লাহ তাঁর দোয়া কবুল করলেন এবং বললেন:",
      "وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ",
      "আমার তত্ত্বাবধানে এবং আমার ওহী অনুযায়ী নৌকা তৈরি করো। যারা জুলুম করেছে তাদের ব্যাপারে আমার কাছে কিছু বলো না। তারা অবশ্যই ডুবে যাবে। [সূরা হুদ: ৩৭]",
      "নূহ (আঃ) নৌকা তৈরি শুরু করলেন - ৩০০ হাত লম্বা, ৫০ হাত চওড়া এবং ৩০ হাত উঁচু, তিনতলা বিশিষ্ট। কাফিররা তাঁকে দেখে হাসত এবং ঠাট্টা করত। তিনি বললেন: 'তোমরা যদি আমাদের নিয়ে ঠাট্টা করো, আমরাও তোমাদের নিয়ে ঠাট্টা করব।' [সূরা হুদ: ৩৮]",
      "**মহাপ্লাবন ও নৌকায় আরোহণ:** নৌকা তৈরি শেষ হলে একদিন সকালে তন্দুর থেকে পানি উপচে পড়তে লাগল। আকাশ থেকে প্রবল বৃষ্টি শুরু হলো এবং জমিন থেকে ঝর্ণা ফুটতে লাগল:",
      "فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُّنْهَمِرٍ ۝ وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَىٰ أَمْرٍ قَدْ قُدِرَ",
      "অতঃপর আমি আকাশের দরজা খুলে দিলাম প্রবল বৃষ্টির পানি দিয়ে। এবং জমিন থেকে ঝর্ণা প্রবাহিত করলাম। তারপর পানি মিলিত হলো এক নির্ধারিত বিষয়ে। [সূরা কামার: ১১-১২]",
      "নূহ (আঃ) সব মুমিন, তাঁর পরিবার এবং প্রতিটি প্রাণীর এক জোড়া করে নৌকায় তুললেন। নৌকায় ওঠার সময় তিনি বললেন:",
      "بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ إِنَّ رَبِّي لَغَفُورٌ رَّحِيمٌ",
      "আল্লাহর নামে এর চলা এবং থামা। নিশ্চয়ই আমার রব ক্ষমাশীল, দয়ালু। [সূরা হুদ: ৪১]",
      "তাঁর এক ছেলে কেনআন ছিল কাফির। নূহ (আঃ) তাকে ডেকে বললেন: 'হে আমার ছেলে! আমাদের সাথে আরোহণ করো।' কিন্তু সে বলল: 'আমি পাহাড়ে আশ্রয় নেব।' নূহ (আঃ) বললেন: 'আজ আল্লাহর আদেশ থেকে কোনো রক্ষাকারী নেই।' কিন্তু সে শুনল না এবং ঢেউ তাকে ডুবিয়ে দিল। [সূরা হুদ: ৪২-৪৩]",
      "চল্লিশ দিন বৃষ্টি ও ধ্বংস: চল্লিশ দিন এবং চল্লিশ রাত প্রবল বৃষ্টি হলো। পানি এত বেড়ে গেল যে সবচেয়ে উঁচু পাহাড়ও ডুবে গেল। নৌকা পাহাড়ের মতো ঢেউয়ের মধ্যে ভাসছিল। [সূরা হুদ: ৪২] সমস্ত পৃথিবী পানিতে ডুবে গেল। সব কাফির ধ্বংস হলো। শুধু নৌকার মুমিনরা রক্ষা পেল। নূহ (আঃ) তাঁর ছেলের জন্য আল্লাহর কাছে দোয়া করলেন। আল্লাহ বললেন:",
      "يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ",
      "হে নূহ! সে তোমার পরিবারের নয়। সে অসৎকর্মকারী। [সূরা হুদ: ৪৬]",
      "নূহ (আঃ) বুঝলেন যে ঈমান ছাড়া রক্তের সম্পর্ক কোনো কাজে আসে না।",
      "**জুদি পাহাড়ে অবতরণ ও নতুন সূচনা:** বৃষ্টি থামল এবং পানি কমতে শুরু করল। আল্লাহ বললেন:",
      "يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ",
      "হে পৃথিবী! তোমার পানি গিলে ফেলো। হে আকাশ! থেমে যাও। পানি কমে গেল এবং কাজ শেষ হলো। নৌকা জুদি পাহাড়ে থামল। [সূরা হুদ: ৪৪]",
      "নৌকা জুদি পাহাড়ে (তুরস্কের আরারাত পর্বতে) থামল। নূহ (আঃ) এবং মুমিনরা নৌকা থেকে নামলেন এবং আল্লাহর শুকরিয়া আদায় করলেন। তাঁরা নতুন করে জীবন শুরু করলেন। তাঁর তিন ছেলে - সাম, হাম এবং ইয়াফিস - থেকে পৃথিবীতে মানুষ ছড়িয়ে পড়ল। সাম থেকে আরব ও সেমিটিক জাতি, হাম থেকে আফ্রিকান জাতি এবং ইয়াফিস থেকে ইউরোপীয় জাতি এসেছে।",
      "**মৃত্যু:** নূহ (আঃ) মহাপ্লাবনের পর আরও অনেক বছর জীবিত ছিলেন। তিনি মোট ৯৫০ বছর দাওয়াত দিয়েছেন এবং তারপর ইন্তেকাল করেন। তাঁর মোট বয়স হয়েছিল প্রায় ১০৫০ বছর (কিছু বর্ণনা মতে)। তাঁকে মক্কা অথবা মসজিদুল হারামে দাফন করা হয় বলে কথিত আছে। নূহ (আঃ) ছিলেন 'উলুল আজম' (দৃঢ় সংকল্প) পাঁচ নবীর একজন - নূহ, ইব্রাহিম, মূসা, ঈসা এবং মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)।"
    ],
    "moral": "নূহ (আঃ) এর জীবন থেকে শিক্ষা: দাওয়াতে ধৈর্য, আল্লাহর উপর ভরসা এবং তাঁর আদেশ মান্য করা মুক্তির পথ। কাফিররা যত শক্তিশালীই হোক আল্লাহর শাস্তি থেকে রক্ষা পায় না।",
    "source": "সূরা নূহ; সূরা হুদ: ২৫-৪৯; সূরা আরাফ: ৫৯-৬৪; সূরা কামার: ৯-১৭; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"
  },
  {
    "id": "nabi_hud_as",
    "categoryId": "nobider_jiboni",
    "title": "হুদ (আঃ) - আদ জাতির নবী",
    "paragraphs": [
      "হযরত হুদ (আঃ) ছিলেন আদ জাতির নবী। আদ জাতি ছিল অত্যন্ত শক্তিশালী এবং অহংকারী। তারা বিশাল বিশাল অট্টালিকা নির্মাণ করত এবং নিজেদের শক্তিতে গর্বিত ছিল। কিন্তু তারা আল্লাহর ইবাদত ছেড়ে মূর্তিপূজা শুরু করেছিল।",
      "**বংশ ও আদ জাতি:** হুদ (আঃ) এর পূর্ণ নাম ছিল হুদ ইবনে শালিখ ইবনে আরফাখশাদ। তিনি নূহ (আঃ) এর পৌত্র সাম এর বংশধর ছিলেন। তিনি জন্মগ্রহণ করেন আরব উপদ্বীপের দক্ষিণে ইয়েমেনের আহকাফ অঞ্চলে। আদ জাতি ছিল নূহ (আঃ) এর পরবর্তী প্রজন্ম। তারা ছিল লম্বা, শক্তিশালী এবং সুঠাম দেহের অধিকারী। তাদের দেশ ছিল অত্যন্ত উর্বর এবং সমৃদ্ধ। তারা বিশাল বিশাল প্রাসাদ এবং স্তম্ভ নির্মাণ করত। কুরআনে বলা হয়েছে:",
      "أَتَبْنُونَ بِكُلِّ رِيعٍ آيَةً تَعْبَثُونَ",
      "তোমরা কি প্রতিটি উঁচু স্থানে নিদর্শন নির্মাণ করছ খেলাচ্ছলে? [সূরা শুআরা: ১২৮]",
      "**কিন্তু তারা মূর্তিপূজা শুরু করেছিল এবং নিজেদের শক্তিতে অহংকার করত। তারা বলত:**",
      "مَنْ أَشَدُّ مِنَّا قُوَّةً",
      "আমাদের চেয়ে শক্তিশালী কে? [সূরা ফুসসিলাত: ১৫]",
      "**দাওয়াত ও জাতির প্রতিক্রিয়া:** আল্লাহ হুদ (আঃ) কে নবী হিসেবে পাঠালেন। তিনি তাঁর জাতিকে বললেন:",
      "يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۚ أَفَلَا تَتَّقُونَ",
      "হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। তোমরা কি তাকওয়া অবলম্বন করবে না? [সূরা আরাফ: ৬৫]",
      "তিনি তাদের বললেন মূর্তিপূজা ছাড়তে, অহংকার ত্যাগ করতে এবং দুর্বলদের উপর অত্যাচার বন্ধ করতে। কিন্তু আদ জাতি হুদ (আঃ) কে প্রত্যাখ্যান করল। তারা বলল: 'তুমি কি আমাদের পূর্বপুরুষদের দেবতা ছেড়ে শুধু এক আল্লাহর ইবাদত করতে বলছ?' তারা তাঁকে মিথ্যাবাদী বলল। আল্লাহ তাদের সতর্ক করার জন্য বৃষ্টি বন্ধ করে দিলেন। তিন বছর ধরে বৃষ্টি হলো না। ফসল নষ্ট হলো কিন্তু তারা তবুও তওবা করল না।",
      "**ভয়ংকর ঝড় ও ধ্বংস:** আকাশে কালো মেঘ দেখা দিল। আদ জাতি খুশি হলো ভেবে যে বৃষ্টি আসছে। কিন্তু এটা ছিল ধ্বংসের মেঘ। কুরআনে বলা হয়েছে:",
      "فَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَٰذَا عَارِضٌ مُّمْطِرُنَا ۚ بَلْ هُوَ مَا اسْتَعْجَلْتُم بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ",
      "যখন তারা মেঘকে তাদের উপত্যকার দিকে আসতে দেখল, বলল: এই মেঘ আমাদের বৃষ্টি দেবে। বরং এটা তো তাই যা তোমরা তাড়াতাড়ি চেয়েছিলে - এক বায়ু যাতে রয়েছে যন্ত্রণাদায়ক শাস্তি। [সূরা আহকাফ: ২৪]",
      "**ভয়ংকর ঝড় শুরু হলো। প্রচণ্ড বাতাস সব কিছু উড়িয়ে নিয়ে যেতে লাগল। সাত রাত এবং আট দিন এই ঝড় চলল:**",
      "تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا",
      "সব কিছু ধ্বংস করে দিচ্ছে তার রবের আদেশে। [সূরা আহকাফ: ২৫]",
      "মানুষ খেজুর গাছের কাণ্ডের মতো উড়ে যেতে লাগল এবং মাটিতে পড়ে মারা যেতে লাগল। তাদের বিশাল প্রাসাদ ধ্বংস হয়ে গেল। হুদ (আঃ) এবং যারা তাঁর সাথে ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন। সব কাফির ধ্বংস হয়ে গেল।",
      "**মৃত্যু:** হুদ (আঃ) হাদরামাউতে বসবাস করেন এবং সেখানে মানুষকে দাওয়াত দিতে থাকেন। তিনি সেখানেই ইন্তেকাল করেন। তাঁর কবর হাদরামাউতে আছে বলে বিশ্বাস করা হয়। আদ জাতির ধ্বংসাবশেষ এখনও ইয়েমেনের আহকাফ অঞ্চলে পাওয়া যায় - বিশাল বিশাল পাথরের স্তম্ভ এবং ধ্বংসপ্রাপ্ত শহর।"
    ],
    "moral": "হুদ (আঃ) এর জীবন থেকে শিক্ষা: অহংকার এবং শিরক ধ্বংসের কারণ। শক্তি ও সম্পদ আল্লাহর শাস্তি থেকে রক্ষা করতে পারে না।",
    "source": "সূরা আরাফ: ৬৫-৭২; সূরা হুদ: ৫০-৬০; সূরা শুআরা: ১২৩-১৪০; সূরা আহকাফ: ২১-২৬; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_salih_as",
    "categoryId": "nobider_jiboni",
    "title": "সালিহ (আঃ) - সামুদ জাতির নবী",
    "paragraphs": [
      "হযরত সালিহ (আঃ) ছিলেন সামুদ জাতির নবী। সামুদ জাতি পাহাড় কেটে বিশাল বিশাল ঘর তৈরি করত এবং নিজেদের শিল্পকলায় গর্বিত ছিল। কিন্তু তারা আল্লাহর ইবাদত ছেড়ে মূর্তিপূজা শুরু করেছিল।",
      "**বংশ ও সামুদ জাতি:** সালিহ (আঃ) এর পূর্ণ নাম ছিল সালিহ ইবনে উবাইদ ইবনে আসিফ। তিনি সামুদ জাতির মধ্যে জন্মগ্রহণ করেন। সামুদ জাতি ছিল আদ জাতির পরবর্তী প্রজন্ম। তারা বসবাস করত হিজর অঞ্চলে (বর্তমান সৌদি আরবের মাদায়েন সালিহ)। সামুদ জাতি ছিল অত্যন্ত দক্ষ শিল্পী। তারা পাহাড় কেটে সুন্দর সুন্দর ঘর এবং প্রাসাদ তৈরি করত। কুরআনে বলা হয়েছে:",
      "وَتَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا فَارِهِينَ",
      "এবং তোমরা পাহাড় কেটে নিপুণভাবে ঘর তৈরি করছ। [সূরা শুআরা: ১৪৯]",
      "তারা ছিল সমৃদ্ধ এবং শক্তিশালী। কিন্তু তারা আদ জাতির ধ্বংসের শিক্ষা নেয়নি এবং মূর্তিপূজা শুরু করেছিল।",
      "**দাওয়াত ও আল্লাহর উটনী:** সালিহ (আঃ) তাঁর জাতির মধ্যে অত্যন্ত সম্মানিত ছিলেন। আল্লাহ তাঁকে নবী বানালেন। তিনি তাঁর জাতিকে বললেন:",
      "يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ",
      "হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। [সূরা আরাফ: ৭৩]",
      "সামুদ জাতি তাঁকে বলল: 'তুমি যদি সত্যিই নবী হও তাহলে আমাদের মুজিজা দেখাও। এই পাহাড় থেকে একটি উটনী বের করে দাও।' সালিহ (আঃ) আল্লাহর কাছে দোয়া করলেন। আল্লাহর কুদরতে পাহাড় ফেটে একটি বিশাল উটনী বের হলো এবং সাথে সাথে একটি বাচ্চা প্রসব করল। সালিহ (আঃ) তাদের বললেন:",
      "هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ",
      "এই আল্লাহর উটনী তোমাদের জন্য নিদর্শন। তাকে আল্লাহর জমিনে চরতে দাও এবং তাকে কোনো ক্ষতি করো না। [সূরা আরাফ: ৭৩]",
      "এই মুজিজা দেখে কিছু মানুষ ঈমান আনল কিন্তু বেশিরভাগ নেতা কুফরিতে থেকে গেল।",
      "**উটনী হত্যা ও তিন দিনের সতর্কবাণী:** উটনী অনেক দুধ দিত কিন্তু কাফিররা এতে বিরক্ত হলো। নয়জন দুষ্ট নেতা মিলে উটনী হত্যার ষড়যন্ত্র করল। একদিন যখন উটনী পানি পান করতে এলো, কুদার ইবনে সালিফ তরবারি দিয়ে উটনীর পা কেটে দিল এবং তারা উটনীকে হত্যা করল। সালিহ (আঃ) যখন এই খবর শুনলেন, তিনি তাদের বললেন:",
      "تَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ۖ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ",
      "তোমরা তোমাদের ঘরে তিন দিন ভোগ করো। এটি এমন প্রতিশ্রুতি যা মিথ্যা হবে না। [সূরা হুদ: ৬৫]",
      "তিনি বললেন: 'প্রথম দিন তোমাদের চেহারা হলুদ হবে, দ্বিতীয় দিন লাল হবে এবং তৃতীয় দিন কালো হবে। তারপর শাস্তি আসবে।' ঠিক যেমন সালিহ (আঃ) বলেছিলেন তেমনই হলো। তারা বুঝল শাস্তি আসছে কিন্তু তবুও তওবা করল না।",
      "**ভয়ংকর শাস্তি ও ধ্বংস:** চতুর্থ দিন সকালে ভয়ংকর আওয়াজ (সাইহা) এলো। এক প্রচণ্ড শব্দ যা তাদের হৃদয় ফাটিয়ে দিল। কুরআনে বলা হয়েছে:",
      "فَأَخَذَتْهُمُ الصَّيْحَةُ مُصْبِحِينَ",
      "অতঃপর সকালে তাদের পাকড়াও করল সেই মহানাদ। [সূরা হিজর: ৮৩]",
      "একই সাথে ভূমিকম্প হলো। সবাই তাদের ঘরে মৃত অবস্থায় পড়ে রইল। সালিহ (আঃ) এবং যারা ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন। তাঁরা সেখান থেকে চলে গেলেন। সালিহ (আঃ) তাদের লাশের দিকে তাকিয়ে বললেন:",
      "يَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّي وَنَصَحْتُ لَكُمْ وَلَٰكِن لَّا تُحِبُّونَ النَّاصِحِينَ",
      "হে আমার জাতি! আমি তোমাদের কাছে আমার রবের বার্তা পৌঁছে দিয়েছি এবং তোমাদের উপদেশ দিয়েছি। কিন্তু তোমরা উপদেশদাতাদের পছন্দ করো না। [সূরা আরাফ: ৭৯]",
      "**মৃত্যু:** সালিহ (আঃ) মক্কায় চলে যান এবং সেখানে বসবাস করেন। তিনি সেখানে ইন্তেকাল করেন। সামুদ জাতির ধ্বংসাবশেষ এখনও সৌদি আরবের মাদায়েন সালিহ (আল-হিজর) এ দেখা যায় - পাহাড় কাটা বিশাল বিশাল ঘর এবং সমাধি। রাসূল (সাঃ) তাবুক যুদ্ধের সময় এই স্থান দিয়ে যাওয়ার সময় সাহাবীদের বলেছিলেন: 'এখানে থেমো না এবং এখানের পানি পান করো না। এটি শাস্তিপ্রাপ্ত জাতির স্থান।'"
    ],
    "moral": "সালিহ (আঃ) এর জীবন থেকে শিক্ষা: আল্লাহর নিদর্শন দেখার পরও অবাধ্যতা করলে কঠিন শাস্তি আসে। মুজিজা দেখেও যারা ঈমান আনে না তারা ধ্বংস হয়।",
    "source": "সূরা আরাফ: ৭৩-৭৯; সূরা হুদ: ৬১-৬৮; সূরা শুআরা: ১৪১-১৫৯; সূরা হিজর: ৮০-৮৪; সহীহ বুখারী: ৩৩৭৯; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_ibrahim_as",
    "categoryId": "nobider_jiboni",
    "title": "ইব্রাহিম (আঃ) - খলিলুল্লাহ",
    "paragraphs": [
      "হযরত ইব্রাহিম (আঃ) ছিলেন 'খলিলুল্লাহ' (আল্লাহর বন্ধু) এবং 'আবুল আম্বিয়া' (নবীদের পিতা)। তিনি 'উলুল আজম' পাঁচ নবীর একজন। তাঁর জীবন ছিল ত্যাগ, তিতিক্ষা এবং আল্লাহর প্রতি অগাধ বিশ্বাসে পূর্ণ। তিনি মূর্তিপূজার বিরুদ্ধে সংগ্রাম করেছেন, আগুনে নিক্ষিপ্ত হয়েছেন এবং নিজ সন্তানকে কুরবানী করতে প্রস্তুত হয়েছেন।",
      "**বংশ ও শৈশবে সত্য অনুসন্ধান:** ইব্রাহিম (আঃ) এর পূর্ণ নাম ছিল ইব্রাহিম ইবনে তারিখ (আযর)। তিনি জন্মগ্রহণ করেন ইরাকের উর নগরীতে। তাঁর জন্মের সময় নমরুদ ছিল শাসক। নমরুদ স্বপ্ন দেখেছিল যে একটি শিশু তার রাজত্ব ধ্বংস করবে। তাই সে সব নবজাতক ছেলেকে হত্যা করার আদেশ দিল। ইব্রাহিম (আঃ) এর মা তাঁকে গুহায় লুকিয়ে জন্ম দেন এবং গোপনে লালন-পালন করেন। শৈশব থেকেই তিনি চিন্তাশীল ছিলেন। তিনি দেখতেন মানুষ মূর্তি, তারা, চাঁদ এবং সূর্যের পূজা করে। একদিন তিনি তারা দেখে বললেন: 'এটা কি আমার রব?' কিন্তু তারা ডুবে গেল। তারপর চাঁদ এবং সূর্য - সবই ডুবে গেল। তখন তিনি ঘোষণা করলেন:",
      "إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا ۖ وَمَا أَنَا مِنَ الْمُشْرِكِينَ",
      "আমি একনিষ্ঠভাবে তাঁর দিকে মুখ ফিরালাম যিনি আসমান ও জমিন সৃষ্টি করেছেন। আমি মুশরিকদের অন্তর্ভুক্ত নই। [সূরা আনআম: ৭৯]",
      "পিতার সাথে কথোপকথন ও মূর্তি ভাঙা: ইব্রাহিম (আঃ) এর পিতা আযর মূর্তি তৈরি করতেন এবং বিক্রি করতেন। ইব্রাহিম (আঃ) তাঁকে অত্যন্ত নম্রভাবে বললেন: 'হে আমার পিতা! আপনি কেন এমন কিছুর ইবাদত করেন যা শুনে না, দেখে না এবং আপনার কোনো উপকার করে না?' [সূরা মারইয়াম: ৪২] কিন্তু পিতা রাগান্বিত হয়ে বললেন: 'তুমি যদি বিরত না হও তাহলে আমি তোমাকে পাথর মেরে হত্যা করব।' [সূরা মারইয়াম: ৪৬] একদিন জাতির একটি বড় উৎসব ছিল। সবাই শহরের বাইরে গেল। ইব্রাহিম (আঃ) অসুস্থতার অজুহাত দিয়ে থেকে গেলেন। সবাই চলে গেলে তিনি মূর্তি মন্দিরে গিয়ে কুড়াল দিয়ে সব মূর্তি ভেঙে ফেললেন। শুধু সবচেয়ে বড় মূর্তিটি রেখে দিলেন এবং তার গলায় কুড়াল ঝুলিয়ে দিলেন। মানুষ ফিরে এসে রাগে ফেটে পড়ল। তারা ইব্রাহিম (আঃ) কে জিজ্ঞাসা করল: 'তুমি কি আমাদের দেবতাদের সাথে এই কাজ করেছ?' ইব্রাহিম (আঃ) বললেন:",
      "بَلْ فَعَلَهُ كَبِيرُهُمْ هَٰذَا فَاسْأَلُوهُمْ إِن كَانُوا يَنطِقُونَ",
      "বরং এদের সর্দার এই কাজ করেছে। তোমরা এদের জিজ্ঞাসা করো যদি এরা কথা বলতে পারে। [সূরা আম্বিয়া: ৬৩]",
      "তারা বুঝতে পারল মূর্তি কিছুই করতে পারে না কিন্তু অহংকার করে সত্য মানল না।",
      "আগুনে নিক্ষেপ ও মুজিজা: তারা পরাজিত হলো কিন্তু সত্য মানল না। তারা বলল: 'তাকে পুড়িয়ে ফেলো এবং তোমাদের দেবতাদের সাহায্য করো।' [সূরা আম্বিয়া: ৬৮] নমরুদের আদেশে বিশাল আগুন জ্বালানো হলো। এত বড় আগুন যে কাছে যাওয়া যাচ্ছিল না। তারা একটি ম্যানগোনেল (বড় গুলতি) তৈরি করল এবং ইব্রাহিম (আঃ) কে আগুনে ছুঁড়ে মারল। যখন তিনি আগুনের দিকে যাচ্ছিলেন, জিবরাঈল (আঃ) এসে বললেন: 'আপনার কোনো প্রয়োজন আছে?' ইব্রাহিম (আঃ) বললেন: 'আপনার কাছে নয়, আল্লাহর কাছে আছে।' আল্লাহ আদেশ দিলেন:",
      "قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ",
      "হে আগুন! তুমি ইব্রাহিমের জন্য ঠান্ডা এবং নিরাপদ হয়ে যাও। [সূরা আম্বিয়া: ৬৯]",
      "আগুন ঠান্ডা হয়ে গেল। ইব্রাহিম (আঃ) আগুনের মধ্যে বসে আল্লাহর জিকির করছিলেন। কয়েকদিন পর যখন আগুন নিভে গেল, তারা দেখল ইব্রাহিম (আঃ) সুস্থ এবং নিরাপদ বসে আছেন।",
      "নমরুদের সাথে বিতর্ক ও হিজরত: নমরুদ ছিল অত্যাচারী শাসক যে নিজেকে ঈশ্বর দাবি করত। ইব্রাহিম (আঃ) তার কাছে গেলেন এবং বললেন: 'আমার রব তিনি যিনি জীবন দান করেন এবং মৃত্যু দেন।' নমরুদ বলল: 'আমিও জীবন দান করি এবং মৃত্যু দেই।' ইব্রাহিম (আঃ) বললেন: 'আল্লাহ সূর্যকে পূর্ব দিক থেকে উদিত করেন। তুমি একে পশ্চিম দিক থেকে উদিত করো।' [সূরা বাকারা: ২৫৮] নমরুদ হতবাক হয়ে গেল। আল্লাহ ইব্রাহিম (আঃ) কে হিজরত করার আদেশ দিলেন। তিনি তাঁর ভাতিজা লূত (আঃ) এবং স্ত্রী সারা (আঃ) কে নিয়ে ইরাক থেকে ফিলিস্তিন (শাম) এ হিজরত করলেন। পথে মিশরে গেলেন। সেখানে মিশরের শাসক সারা (আঃ) কে নিতে চাইল কিন্তু আল্লাহ তাঁকে রক্ষা করলেন। শাসক হাজেরা (আঃ) নামক একজন দাসীকে উপহার দিল। ইব্রাহিম (আঃ) পরে হাজেরা (আঃ) কে বিবাহ করেন।",
      "**ইসমাঈল (আঃ) এর জন্ম ও মক্কায় রেখে আসা:** হাজেরা (আঃ) থেকে ইসমাঈল (আঃ) জন্ম নেন। ইব্রাহিম (আঃ) তখন ৮৬ বছর বয়সী ছিলেন। কিছুদিন পর আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন হাজেরা এবং শিশু ইসমাঈলকে মক্কায় রেখে আসতে। সেই সময় মক্কা ছিল জনমানবহীন মরুভূমি। ইব্রাহিম (আঃ) তাঁদের রেখে আসার সময় হাজেরা (আঃ) জিজ্ঞাসা করলেন: 'আল্লাহ কি আপনাকে এই আদেশ দিয়েছেন?' ইব্রাহিম (আঃ) বললেন: 'হ্যাঁ।' হাজেরা (আঃ) বললেন: 'তাহলে আল্লাহ আমাদের ধ্বংস করবেন না।' [সহীহ বুখারী: ৩৩৬৪] কিছুদিন পর পানি ও খাবার শেষ হয়ে গেল। হাজেরা (আঃ) পানি খুঁজতে সাফা-মারওয়ার মধ্যে সাতবার দৌড়ালেন। সপ্তমবার ফিরে এসে দেখলেন শিশু ইসমাঈল (আঃ) এর পায়ের কাছে পানি বের হচ্ছে। তিনি 'জম জম' (থামো থামো) বলে পানির চারপাশে বাঁধ দিলেন। এভাবে জমজম কূপের সৃষ্টি হলো।",
      "**কাবা নির্মাণ:** ইসমাঈল (আঃ) বড় হলে আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন কাবা ঘর নির্মাণ করতে। পিতা-পুত্র মিলে কাবা নির্মাণ করলেন। ইব্রাহিম (আঃ) পাথর বহন করতেন এবং ইসমাঈল (আঃ) দেয়াল তৈরি করতেন। তাঁরা দোয়া করতেন:",
      "رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
      "হে আমাদের রব! আমাদের থেকে কবুল করুন। নিশ্চয়ই আপনি সর্বশ্রোতা, সর্বজ্ঞ। [সূরা বাকারা: ১২৭]",
      "হাজরে আসওয়াদ (কালো পাথর) স্থাপনের সময় ইব্রাহিম (আঃ) একটি পাথরের উপর দাঁড়িয়েছিলেন। সেই পাথরে তাঁর পায়ের ছাপ পড়ে গিয়েছিল। এটি 'মাকামে ইব্রাহিম' নামে পরিচিত। কাবা নির্মাণের পর ইব্রাহিম (আঃ) মানুষকে হজের ঘোষণা দিলেন।",
      "স্বপ্নে কুরবানীর আদেশ ও মহান পরীক্ষা: ইসমাঈল (আঃ) যখন কিশোর হলেন, ইব্রাহিম (আঃ) স্বপ্নে দেখলেন তিনি তাঁর প্রিয় পুত্রকে কুরবানী করছেন। নবীদের স্বপ্ন হলো ওহী। তিনি ইসমাঈল (আঃ) কে বললেন: 'হে আমার ছেলে! আমি স্বপ্নে দেখি যে আমি তোমাকে জবাই করছি। তুমি কী মনে করো?' [সূরা সাফফাত: ১০২] ইসমাঈল (আঃ) বললেন: 'হে আমার পিতা! আপনাকে যা আদেশ করা হয়েছে তা করুন। ইনশাআল্লাহ আপনি আমাকে ধৈর্যশীলদের মধ্যে পাবেন।' [সূরা সাফফাত: ১০২] ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে মিনায় নিয়ে গেলেন। পথে শয়তান তিনবার বাধা দিতে চেষ্টা করল। ইব্রাহিম (আঃ) তিনবার শয়তানকে পাথর মারলেন। মিনায় পৌঁছে ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে শুইয়ে দিলেন এবং ছুরি চালালেন। কিন্তু আল্লাহর কুদরতে ছুরি কাটল না। আল্লাহ ডাক দিলেন:",
      "يَا إِبْرَاهِيمُ ۝ قَدْ صَدَّقْتَ الرُّؤْيَا ۚ إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ ۝ إِنَّ هَٰذَا لَهُوَ الْبَلَاءُ الْمُبِينُ ۝ وَفَدَيْنَاهُ بِذِبْحٍ عَظِيمٍ",
      "হে ইব্রাহিম! তুমি স্বপ্ন সত্য করে দেখিয়েছ। আমি এভাবেই সৎকর্মশীলদের প্রতিদান দেই। নিশ্চয়ই এটি ছিল এক স্পষ্ট পরীক্ষা। আমি তাকে মুক্ত করলাম এক মহান কুরবানীর বিনিময়ে। [সূরা সাফফাত: ১০৪-১০৭]",
      "আল্লাহ জান্নাত থেকে একটি দুম্বা পাঠালেন যা ইব্রাহিম (আঃ) কুরবানী করলেন। এই ঘটনার স্মরণে প্রতি বছর কুরবানী করা হয়।",
      "ইসহাক (আঃ) এর জন্ম ও মৃত্যু: সারা (আঃ) এর কোনো সন্তান ছিল না। তিনি বৃদ্ধা হয়ে গিয়েছিলেন। একদিন ফেরেশতারা মানুষের রূপে ইব্রাহিম (আঃ) এর কাছে এলেন। তিনি তাঁদের জন্য ভুনা বাছুর নিয়ে এলেন। কিন্তু তাঁরা খেলেন না। তিনি ভয় পেলেন। তাঁরা বললেন: 'ভয় পাবেন না। আমরা লূত (আঃ) এর জাতিকে ধ্বংস করতে যাচ্ছি।' তাঁরা সারা (আঃ) কে সুসংবাদ দিলেন: 'আমরা তোমাকে ইসহাক এবং ইসহাকের পরে ইয়াকুবের সুসংবাদ দিচ্ছি।' [সূরা হুদ: ৬৯-৭১] সারা (আঃ) বিস্মিত হয়ে বললেন: 'আমি বৃদ্ধা এবং আমার স্বামীও বৃদ্ধ!' ফেরেশতারা বললেন: 'এটা আল্লাহর আদেশ।' এভাবে ইসহাক (আঃ) জন্ম নেন। ইব্রাহিম (আঃ) ১৭৫ বছর বয়সে ইন্তেকাল করেন। তাঁকে হেবরনে (ফিলিস্তিন) দাফন করা হয়। তাঁর দুই ছেলে ইসমাঈল এবং ইসহাক (আঃ) তাঁর জানাযায় উপস্থিত ছিলেন।"
    ],
    "moral": "ইব্রাহিম (আঃ) এর জীবন থেকে শিক্ষা: আল্লাহর প্রতি পূর্ণ আত্মসমর্পণ, ত্যাগ এবং তাওহীদের জন্য সংগ্রাম করা মুমিনের বৈশিষ্ট্য।",
    "source": "সূরা বাকারা: ১২৪-১২৯, ২৫৮; সূরা আনআম: ৭৪-৮৩; সূরা মারইয়াম: ৪১-৫০; সূরা আম্বিয়া: ৫১-৭৩; সূরা সাফফাত: ৮৩-১১৩; সহীহ বুখারী: ৩৩৬৪, ৩৩৭২; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_lut_as",
    "categoryId": "nobider_jiboni",
    "title": "লূত (আঃ) - সদোম ও গোমোরার নবী",
    "paragraphs": [
      "হযরত লূত (আঃ) ছিলেন ইব্রাহিম (আঃ) এর ভাতিজা এবং সদোম ও গোমোরা জাতির নবী। তিনি তাঁর জাতিকে ভয়াবহ পাপ থেকে বিরত থাকতে বলেছিলেন কিন্তু তারা মানেনি। আল্লাহ তাদের ভয়ংকর শাস্তি দিয়েছেন।",
      "**বংশ ও ইব্রাহিম (আঃ) এর সাথে হিজরত:** লূত (আঃ) ছিলেন ইব্রাহিম (আঃ) এর ভাই হারানের ছেলে। তিনি জন্মগ্রহণ করেন ইরাকের উর নগরীতে। যখন ইব্রাহিম (আঃ) নমরুদের অত্যাচার থেকে হিজরত করলেন, লূত (আঃ) তাঁর সাথে ঈমান এনেছিলেন এবং হিজরত করেছিলেন। কুরআনে বলা হয়েছে:",
      "فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي",
      "অতঃপর লূত তাঁর প্রতি ঈমান আনল এবং বলল: আমি আমার রবের দিকে হিজরত করছি। [সূরা আনকাবুত: ২৬]",
      "তাঁরা একসাথে ফিলিস্তিন এবং মিশর ভ্রমণ করেন। পরে আল্লাহ লূত (আঃ) কে নবী হিসেবে সদোম ও গোমোরা (বর্তমান জর্ডান ও ফিলিস্তিনের মৃত সাগর অঞ্চল) এ পাঠান।",
      "**সদোম জাতির ভয়াবহ পাপ:** সদোম ও গোমোরার মানুষ ছিল অত্যন্ত পাপিষ্ঠ। তারা এমন পাপ করত যা পৃথিবীতে আগে কেউ করেনি - সমকামিতা। তারা নারীদের ছেড়ে পুরুষদের সাথে কুকর্ম করত। এছাড়াও তারা রাস্তায় ডাকাতি করত, মুসাফিরদের লুট করত এবং প্রকাশ্যে অশ্লীলতা করত। তারা ছিল অত্যন্ত ধনী কিন্তু নৈতিকভাবে পতিত। কুরআনে লূত (আঃ) তাদের বলেন:",
      "أَتَأْتُونَ الذُّكْرَانَ مِنَ الْعَالَمِينَ ۝ وَتَذَرُونَ مَا خَلَقَ لَكُمْ رَبُّكُم مِّنْ أَزْوَاجِكُم ۚ بَلْ أَنتُمْ قَوْمٌ عَادُونَ",
      "তোমরা কি সৃষ্টির মধ্যে পুরুষদের কাছে যাও? এবং তোমাদের রব তোমাদের জন্য যে স্ত্রীদের সৃষ্টি করেছেন তাদের ছেড়ে দাও? বরং তোমরা সীমালঙ্ঘনকারী জাতি। [সূরা শুআরা: ১৬৫-১৬৬]",
      "**লূত (আঃ) এর দাওয়াত ও জাতির প্রত্যাখ্যান:** লূত (আঃ) তাঁর জাতিকে বারবার সতর্ক করলেন। তিনি বললেন: তোমরা আল্লাহকে ভয় করো এবং এই জঘন্য কাজ থেকে বিরত থাকো। তোমরা এমন কাজ করছ যা তোমাদের আগে কেউ করেনি। কিন্তু তারা শুনল না। বরং তারা বলল:",
      "لَئِن لَّمْ تَنتَهِ يَا لُوطُ لَتَكُونَنَّ مِنَ الْمُخْرَجِينَ",
      "হে লূত! তুমি যদি বিরত না হও তাহলে অবশ্যই বহিষ্কৃতদের অন্তর্ভুক্ত হবে। [সূরা শুআরা: ১৬৭]",
      "তারা লূত (আঃ) কে এবং তাঁর অনুসারীদের শহর থেকে বের করে দিতে চাইল। তারা বলল:",
      "أَخْرِجُوا آلَ لُوطٍ مِّن قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ",
      "লূতের পরিবারকে তোমাদের শহর থেকে বের করে দাও। তারা তো এমন মানুষ যারা পবিত্র থাকতে চায়! [সূরা নামল: ৫৬]",
      "এটি ছিল তাদের ব্যঙ্গ - পবিত্রতাকে তারা দোষ মনে করত!",
      "ফেরেশতাদের আগমন ও জাতির আক্রমণ: একদিন তিনজন ফেরেশতা সুন্দর যুবকের রূপে লূত (আঃ) এর বাড়িতে মেহমান হিসেবে এলেন। তাঁরা ছিলেন জিবরাঈল, মিকাঈল এবং ইসরাফিল (আঃ)। লূত (আঃ) তাঁদের চিনতে পারলেন না। তিনি তাঁদের দেখে চিন্তিত হলেন কারণ তিনি জানতেন তাঁর জাতি কত খারাপ। তিনি মনে মনে ভাবলেন: এটা তো বড় কঠিন দিন! [সূরা হুদ: ৭৭] খবর ছড়িয়ে গেল যে লূত (আঃ) এর বাড়িতে সুন্দর যুবক মেহমান এসেছে। সদোমের লোকেরা দল বেঁধে লূত (আঃ) এর বাড়িতে এলো। তারা দরজা ভাঙতে চাইল। লূত (আঃ) তাদের বললেন:",
      "هَٰؤُلَاءِ بَنَاتِي إِن كُنتُمْ فَاعِلِينَ",
      "এরা আমার কন্যারা (জাতির মেয়েরা) যদি তোমরা বিয়ে করতে চাও। [সূরা হিজর: ৭১]",
      "তিনি তাদের বৈধ পথে যেতে বললেন। কিন্তু তারা বলল: তুমি তো জানো আমাদের তোমার কন্যাদের প্রতি কোনো আগ্রহ নেই। লূত (আঃ) অসহায় হয়ে বললেন:",
      "لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَىٰ رُكْنٍ شَدِيدٍ",
      "আহা! যদি তোমাদের বিরুদ্ধে আমার শক্তি থাকত অথবা কোনো শক্তিশালী আশ্রয় থাকত! [সূরা হুদ: ৮০]",
      "তখন ফেরেশতারা বললেন: হে লূত! আমরা তোমার রবের ফেরেশতা। তারা তোমার কাছে পৌঁছতে পারবে না। [সূরা হুদ: ৮১] জিবরাঈল (আঃ) তাঁর ডানা দিয়ে একবার আঘাত করলেন। সবাই অন্ধ হয়ে গেল এবং দরজা খুঁজে পেল না।",
      "শাস্তির সতর্কবাণী ও হিজরত: ফেরেশতারা লূত (আঃ) কে বললেন: তুমি রাতের শেষ প্রহরে তোমার পরিবার নিয়ে বের হয়ে যাও। তোমাদের কেউ পেছনে তাকাবে না। কিন্তু তোমার স্ত্রী - তার উপর যা আপতিত হবে তা তাদের উপরও আপতিত হবে। নিশ্চয়ই তাদের নির্ধারিত সময় হলো ভোর। [সূরা হিজর: ৬৫-৬৬] লূত (আঃ) এর স্ত্রী ছিল কাফির। সে গোপনে জাতির সাথে যোগসাজশ করত এবং মেহমানদের খবর তাদের জানাত। লূত (আঃ) রাতের অন্ধকারে তাঁর পরিবার নিয়ে শহর ছেড়ে বের হলেন। তাঁর সাথে ছিল তাঁর দুই কন্যা। মাত্র কয়েকজন মুমিন তাঁর সাথে ছিল।",
      "**ভয়াবহ শাস্তি ও ধ্বংস:** ভোর হতেই আল্লাহর শাস্তি নেমে এলো। প্রথমে এলো ভয়ংকর চিৎকার যা তাদের কানের পর্দা ফাটিয়ে দিল। তারপর জিবরাঈল (আঃ) তাঁর ডানা দিয়ে পুরো শহর তুলে নিলেন এবং উল্টে দিলেন। শহরগুলো মাটিতে আছড়ে পড়ল। তারপর আকাশ থেকে পাথর বৃষ্টি হলো - প্রত্যেক পাপীর জন্য চিহ্নিত পাথর। কুরআনে বলা হয়েছে:",
      "فَلَمَّا جَاءَ أَمْرُنَا جَعَلْنَا عَالِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهَا حِجَارَةً مِّن سِجِّيلٍ مَّنضُودٍ ۝ مُّسَوَّمَةً عِندَ رَبِّكَ ۖ وَمَا هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ",
      "অতঃপর যখন আমার আদেশ এলো, আমি শহরের উপরকে নিচে করে দিলাম এবং তার উপর স্তরে স্তরে পোড়া মাটির পাথর বর্ষণ করলাম। যা তোমার রবের কাছে চিহ্নিত ছিল। এবং তা জালিমদের থেকে দূরে নয়। [সূরা হুদ: ৮২-৮৩]",
      "লূত (আঃ) এর স্ত্রী পেছনে তাকিয়েছিল এবং সে-ও ধ্বংস হলো। পুরো জাতি নিশ্চিহ্ন হয়ে গেল। আজও মৃত সাগর অঞ্চলে সেই ধ্বংসের চিহ্ন রয়েছে। সেখানে কোনো প্রাণী বাস করে না এবং পানি এত লবণাক্ত যে কিছুই ডুবে না।",
      "**পরবর্তী জীবন ও শিক্ষা:** লূত (আঃ) এবং তাঁর দুই কন্যা নিরাপদে বেঁচে গেলেন। তাঁরা ফিলিস্তিনে চলে গেলেন এবং সেখানে বসবাস করেন। লূত (আঃ) তাঁর জীবনের বাকি অংশ আল্লাহর ইবাদতে কাটান। তাঁর উম্মতকে তিনি তাওহীদ এবং পবিত্রতার শিক্ষা দিয়ে গেছেন। সদোমের ঘটনা পৃথিবীর জন্য চিরকালের শিক্ষা - যারা আল্লাহর সীমা লঙ্ঘন করে এবং প্রকৃতি বিরোধী পাপে লিপ্ত হয় তাদের পরিণতি ভয়াবহ।"
    ],
    "moral": "লূত (আঃ) এর জাতির ঘটনা থেকে শিক্ষা: নৈতিক অধঃপতন এবং প্রকৃতি বিরোধী পাপ আল্লাহর কঠিন শাস্তি ডেকে আনে। পবিত্রতা এবং আল্লাহর সীমা মেনে চলাই মুক্তির পথ।",
    "source": "সূরা আরাফ: ৮০-৮৪; সূরা হুদ: ৭৭-৮৩; সূরা হিজর: ৫৭-৭৭; সূরা শুআরা: ১৬০-১৭৫; সূরা নামল: ৫৪-৫৮; সূরা আনকাবুত: ২৮-৩৫।"
  },
  {
    "id": "nabi_yusuf_as",
    "categoryId": "nobider_jiboni",
    "title": "ইউসুফ (আঃ) - সবচেয়ে সুন্দর",
    "paragraphs": [
      "হযরত ইউসুফ (আঃ) ছিলেন ইয়াকুব (আঃ) এর পুত্র এবং সবচেয়ে সুন্দর মানুষ। তাঁর জীবন ছিল পরীক্ষা, ধৈর্য এবং বিজয়ে পূর্ণ। কুরআনে তাঁর সম্পূর্ণ জীবনী একটি সূরায় বর্ণিত হয়েছে - সূরা ইউসুফ।",
      "**শৈশবে স্বপ্ন:** ইউসুফ (আঃ) ছোটবেলায় একটি স্বপ্ন দেখলেন। তিনি তাঁর পিতা ইয়াকুব (আঃ) কে বললেন:",
      "يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ",
      "হে আমার পিতা! আমি স্বপ্নে দেখেছি এগারোটি তারা, সূর্য এবং চাঁদ আমাকে সিজদা করছে। [সূরা ইউসুফ: ৪]",
      "ইয়াকুব (আঃ) বুঝলেন এটি একটি বিশেষ স্বপ্ন। তিনি বললেন:",
      "لَا تَقْصُصْ رُؤْيَاكَ عَلَىٰ إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْدًا ۖ إِنَّ الشَّيْطَانَ لِلْإِنسَانِ عَدُوٌّ مُّبِينٌ",
      "তোমার স্বপ্ন তোমার ভাইদের কাছে বলো না, তাহলে তারা তোমার বিরুদ্ধে ষড়যন্ত্র করবে। নিশ্চয়ই শয়তান মানুষের প্রকাশ্য শত্রু। [সূরা ইউসুফ: ৫]",
      "ইয়াকুব (আঃ) জানতেন ইউসুফ (আঃ) নবী হবেন এবং উচ্চ মর্যাদা পাবেন।",
      "**ভাইদের হিংসা ও ষড়যন্ত্র:** ইউসুফ (আঃ) এর এগারো ভাই ছিল এবং একজন সৎ ভাই বিনইয়ামিন। ইয়াকুব (আঃ) ইউসুফ এবং বিনইয়ামিনকে বেশি ভালোবাসতেন কারণ তাঁদের মা রাহেল (আঃ) মারা গিয়েছিলেন এবং তাঁরা ছিল ছোট। বড় ভাইরা এতে হিংসা করত। তারা বলল:",
      "لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰ أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌ إِنَّ أَبَانَا لَفِي ضَلَالٍ مُّبِينٍ",
      "ইউসুফ ও তার ভাই আমাদের পিতার কাছে আমাদের চেয়ে বেশি প্রিয়, অথচ আমরা একটি শক্তিশালী দল। নিশ্চয়ই আমাদের পিতা স্পষ্ট ভুলের মধ্যে আছেন। [সূরা ইউসুফ: ৮]",
      "তারা ষড়যন্ত্র করল। একজন বলল: 'ইউসুফকে হত্যা করো অথবা কোনো দূরের জায়গায় ফেলে দাও। তাহলে তোমাদের পিতার মনোযোগ তোমাদের দিকে আসবে।' [সূরা ইউসুফ: ৯] তাদের মধ্যে একজন (বড় ভাই রূবিল) বলল: 'তাকে হত্যা করো না। যদি কিছু করতেই হয় তাহলে কোনো কূপের গভীরে ফেলে দাও। কোনো কাফেলা তাকে তুলে নেবে।' [সূরা ইউসুফ: ১০]",
      "কূপে ফেলা: ভাইরা পিতার কাছে এসে বলল: 'আপনি ইউসুফকে আমাদের সাথে পাঠান না কেন? আমরা তার শুভাকাঙ্ক্ষী। আগামীকাল তাকে আমাদের সাথে পাঠান, সে খেলবে এবং আনন্দ করবে। আমরা তার হেফাজতকারী।' [সূরা ইউসুফ: ১১-১২] ইয়াকুব (আঃ) চিন্তিত হয়ে বললেন:",
      "إِنِّي لَيَحْزُنُنِي أَن تَذْهَبُوا بِهِ وَأَخَافُ أَن يَأْكُلَهُ الذِّئْبُ وَأَنتُمْ عَنْهُ غَافِلُونَ",
      "আমার কষ্ট হয় তোমরা তাকে নিয়ে যাবে এবং আমি ভয় পাই বাঘে তাকে খেয়ে ফেলবে যখন তোমরা অসাবধান থাকবে। [সূরা ইউসুফ: ১৩]",
      "তারা বলল: 'আমরা এত বড় দল, তবুও যদি বাঘে তাকে খায় তাহলে আমরা তো ক্ষতিগ্রস্ত!' ইয়াকুব (আঃ) অনিচ্ছা সত্ত্বেও ইউসুফ (আঃ) কে পাঠালেন। তারা ইউসুফ (আঃ) কে নিয়ে গেল এবং একটি গভীর কূপে ফেলে দিল। আল্লাহ ইউসুফ (আঃ) কে সান্ত্বনা দিয়ে ওহী পাঠালেন:",
      "لَتُنَبِّئَنَّهُم بِأَمْرِهِمْ هَٰذَا وَهُمْ لَا يَشْعُرُونَ",
      "তুমি অবশ্যই তাদের এই কাজের কথা তাদের জানাবে যখন তারা টের পাবে না। [সূরা ইউসুফ: ১৫]",
      "**মিথ্যা অজুহাত:** সন্ধ্যায় তারা কাঁদতে কাঁদতে পিতার কাছে ফিরল। তারা বলল:",
      "يَا أَبَانَا إِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِندَ مَتَاعِنَا فَأَكَلَهُ الذِّئْبُ ۖ وَمَا أَنتَ بِمُؤْمِنٍ لَّنَا وَلَوْ كُنَّا صَادِقِينَ",
      "হে আমাদের পিতা! আমরা দৌড় প্রতিযোগিতা করতে গিয়েছিলাম এবং ইউসুফকে আমাদের সামগ্রীর কাছে রেখে গিয়েছিলাম। তারপর বাঘ তাকে খেয়ে ফেলেছে। আপনি আমাদের বিশ্বাস করবেন না যদিও আমরা সত্যবাদী। [সূরা ইউসুফ: ১৭]",
      "তারা ইউসুফ (আঃ) এর জামায় ভেড়ার রক্ত লাগিয়ে নিয়ে এসেছিল। ইয়াকুব (আঃ) জামা দেখে বললেন: 'অদ্ভুত বাঘ! জামা ছিঁড়ল না কিন্তু ইউসুফকে খেয়ে ফেলল!' তিনি বুঝলেন এটা মিথ্যা। তিনি বললেন:",
      "بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ",
      "বরং তোমাদের মন তোমাদের একটি কাজ সাজিয়ে দিয়েছে। সুতরাং সুন্দর ধৈর্য! তোমরা যা বর্ণনা করছ সে ব্যাপারে আল্লাহই সাহায্যস্থল। [সূরা ইউসুফ: ১৮]",
      "ইয়াকুব (আঃ) ধৈর্য ধরলেন এবং আল্লাহর কাছে দোয়া করতে লাগলেন।",
      "মিশরে বিক্রি ও আজিজের বাড়িতে: কূপে ইউসুফ (আঃ) আল্লাহর উপর ভরসা করে অপেক্ষা করছিলেন। একটি বাণিজ্য কাফেলা সেখান দিয়ে যাচ্ছিল। তারা পানি তুলতে বালতি ফেলল। ইউসুফ (আঃ) বালতি ধরলেন। তারা খুশি হয়ে বলল: 'সুসংবাদ! এটা তো একটি কিশোর!' তারা ইউসুফ (আঃ) কে পণ্য হিসেবে লুকিয়ে রাখল। [সূরা ইউসুফ: ১৯] তারা মিশরে পৌঁছে ইউসুফ (আঃ) কে দাস হিসেবে বিক্রি করল। মিশরের আজিজ (অর্থমন্ত্রী) কিতফির তাঁকে কিনে নিলেন। তিনি তাঁর স্ত্রী জুলাইখাকে বললেন:",
      "أَكْرِمِي مَثْوَاهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا",
      "এর থাকার ব্যবস্থা ভালো করো। হয়তো সে আমাদের উপকারে আসবে অথবা আমরা তাকে পুত্র হিসেবে গ্রহণ করব। [সূরা ইউসুফ: ২১]",
      "ইউসুফ (আঃ) আজিজের বাড়িতে বড় হতে লাগলেন। আল্লাহ তাঁকে জ্ঞান ও প্রজ্ঞা দান করলেন।",
      "**জুলাইখার ফিতনা ও ইউসুফ (আঃ) এর পবিত্রতা:** ইউসুফ (আঃ) যৌবনে পৌঁছলেন। তিনি ছিলেন অসাধারণ সুন্দর - আল্লাহ তাঁকে অর্ধেক সৌন্দর্য দিয়েছিলেন। জুলাইখা তাঁর প্রতি আকৃষ্ট হলো। একদিন সে সব দরজা বন্ধ করে ইউসুফ (আঃ) কে ডেকে বলল: 'এসো!' ইউসুফ (আঃ) বললেন:",
      "مَعَاذَ اللَّهِ ۖ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ",
      "আল্লাহর আশ্রয়! তিনি আমার মালিক, তিনি আমার থাকার ব্যবস্থা ভালো করেছেন। নিশ্চয়ই জালিমরা সফল হয় না। [সূরা ইউসুফ: ২৩]",
      "জুলাইখা তাঁকে ধরতে গেল। ইউসুফ (আঃ) দরজার দিকে দৌড়ালেন। জুলাইখা পেছন থেকে তাঁর জামা ধরল এবং জামা ছিঁড়ে গেল। দরজায় পৌঁছে দেখলেন আজিজ দাঁড়িয়ে আছেন। জুলাইখা সাথে সাথে মিথ্যা অভিযোগ করল: 'যে তোমার পরিবারের সাথে খারাপ ইচ্ছা করে তার শাস্তি কারাগার অথবা যন্ত্রণাদায়ক শাস্তি ছাড়া কী?' [সূরা ইউসুফ: ২৫] ইউসুফ (আঃ) বললেন: 'সে-ই আমাকে প্রলোভিত করেছে।' [সূরা ইউসুফ: ২৬]",
      "সাক্ষী ও নারীদের ষড়যন্ত্র: জুলাইখার এক আত্মীয় (শিশু অথবা জ্ঞানী ব্যক্তি) বলল: 'যদি জামা সামনে থেকে ছেঁড়া হয় তাহলে সে সত্যবাদী এবং ইউসুফ মিথ্যাবাদী। আর যদি পেছন থেকে ছেঁড়া হয় তাহলে সে মিথ্যাবাদী এবং ইউসুফ সত্যবাদী।' [সূরা ইউসুফ: ২৬-২৭] জামা দেখা গেল পেছন থেকে ছেঁড়া। আজিজ বুঝলেন সত্য কী। তিনি জুলাইখাকে বললেন: 'এটা তোমার ষড়যন্ত্র। নিশ্চয়ই তোমাদের (নারীদের) ষড়যন্ত্র মহা ভয়ংকর!' [সূরা ইউসুফ: ২৮] তিনি ইউসুফ (আঃ) কে বললেন: 'এই বিষয় এড়িয়ে যাও।' এবং জুলাইখাকে বললেন: 'তোমার পাপের জন্য ক্ষমা চাও।' [সূরা ইউসুফ: ২৯]",
      "কিন্তু খবর শহরে ছড়িয়ে গেল। নারীরা বলাবলি করতে লাগল: 'আজিজের স্ত্রী তার দাসকে প্রলোভিত করছে। সে তার প্রেমে পাগল হয়ে গেছে।' [সূরা ইউসুফ: ৩০] জুলাইখা তাদের একটি ভোজসভায় আমন্ত্রণ করল এবং প্রত্যেককে একটি ছুরি ও ফল দিল। তারপর ইউসুফ (আঃ) কে ডাকল। তাঁকে দেখে নারীরা এত মুগ্ধ হলো যে নিজেদের হাত কেটে ফেলল। তারা বলল:",
      "حَاشَ لِلَّهِ مَا هَٰذَا بَشَرًا إِنْ هَٰذَا إِلَّا مَلَكٌ كَرِيمٌ",
      "আল্লাহর পবিত্রতা! এ তো মানুষ নয়, এ তো এক সম্মানিত ফেরেশতা! [সূরা ইউসুফ: ৩১]",
      "জুলাইখা বলল: 'এই সেই ব্যক্তি যার জন্য তোমরা আমাকে তিরস্কার করছিলে। আমি তাকে প্রলোভিত করেছি কিন্তু সে বিরত থেকেছে। যদি সে আমার আদেশ না মানে তাহলে অবশ্যই কারাগারে যাবে।' [সূরা ইউসুফ: ৩২]",
      "**কারাগারে যাওয়া:** ইউসুফ (আঃ) আল্লাহর কাছে দোয়া করলেন:",
      "رَبِّ السِّجْنُ أَحَبُّ إِلَيَّ مِمَّا يَدْعُونَنِي إِلَيْهِ ۖ وَإِلَّا تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُن مِّنَ الْجَاهِلِينَ",
      "হে আমার রব! তারা আমাকে যার দিকে ডাকছে তার চেয়ে কারাগার আমার কাছে বেশি প্রিয়। যদি আপনি তাদের ষড়যন্ত্র আমার থেকে দূর না করেন তাহলে আমি তাদের দিকে ঝুঁকে পড়ব এবং মূর্খদের অন্তর্ভুক্ত হব। [সূরা ইউসুফ: ৩৩]",
      "আল্লাহ তাঁর দোয়া কবুল করলেন এবং নারীদের ষড়যন্ত্র থেকে রক্ষা করলেন। কিন্তু আজিজ এবং তার পরিবার সমাজের চাপে ইউসুফ (আঃ) কে কারাগারে পাঠাল - যদিও তারা জানত তিনি নির্দোষ। [সূরা ইউসুফ: ৩৫] এভাবে ইউসুফ (আঃ) পাপ থেকে বাঁচার জন্য কারাগার বেছে নিলেন।",
      "কারাগারে দাওয়াত ও স্বপ্নের ব্যাখ্যা: কারাগারে ইউসুফ (আঃ) মানুষকে তাওহীদের দাওয়াত দিতে লাগলেন। তাঁর সাথে দুইজন যুবক কারাগারে এলো - একজন বাদশাহর সাকি এবং অন্যজন রাঁধুনি। তারা উভয়ে স্বপ্ন দেখল। সাকি দেখল সে আঙুর নিংড়ে রস তৈরি করছে এবং রাঁধুনি দেখল তার মাথায় রুটি আছে এবং পাখি তা খাচ্ছে। তারা ইউসুফ (আঃ) কে জিজ্ঞাসা করল: 'এর ব্যাখ্যা কী? আমরা আপনাকে সৎকর্মশীলদের মধ্যে দেখছি।' [সূরা ইউসুফ: ৩৬] ইউসুফ (আঃ) প্রথমে তাদের তাওহীদের দাওয়াত দিলেন। তিনি বললেন:",
      "يَا صَاحِبَيِ السِّجْنِ أَأَرْبَابٌ مُّتَفَرِّقُونَ خَيْرٌ أَمِ اللَّهُ الْوَاحِدُ الْقَهَّارُ",
      "হে আমার কারাগারের সাথীরা! বিভিন্ন রব ভালো নাকি এক মহাপরাক্রমশালী আল্লাহ? [সূরা ইউসুফ: ৩৯]",
      "তারপর তিনি স্বপ্নের ব্যাখ্যা দিলেন: 'তোমাদের একজন (সাকি) তার মালিককে মদ পান করাবে এবং অন্যজনকে (রাঁধুনি) শূলে চড়ানো হবে এবং পাখি তার মাথা খাবে।' [সূরা ইউসুফ: ৪১] ইউসুফ (আঃ) সাকিকে বললেন: 'তুমি যখন মুক্তি পাবে তখন তোমার মালিকের কাছে আমার কথা বলো।' কিন্তু শয়তান সাকিকে ভুলিয়ে দিল এবং সে ইউসুফ (আঃ) এর কথা ভুলে গেল। ইউসুফ (আঃ) আরও কয়েক বছর কারাগারে রইলেন। [সূরা ইউসুফ: ৪২]",
      "বাদশাহর স্বপ্ন ও ইউসুফ (আঃ) এর ব্যাখ্যা: কয়েক বছর পর মিশরের বাদশাহ একটি স্বপ্ন দেখলেন। তিনি দেখলেন সাতটি মোটা গরু এবং সাতটি শীর্ণ গরু তাদের খেয়ে ফেলছে। এবং সাতটি সবুজ শীষ এবং সাতটি শুকনো শীষ। তিনি তাঁর পণ্ডিতদের জিজ্ঞাসা করলেন। তারা বলল: 'এটা তো এলোমেলো স্বপ্ন। আমরা স্বপ্নের ব্যাখ্যা জানি না।' [সূরা ইউসুফ: ৪৩-৪৪] তখন সাকি ইউসুফ (আঃ) এর কথা মনে করল। সে বলল: 'আমি আপনাদের এর ব্যাখ্যা জানাব। আমাকে কারাগারে পাঠান।' সে কারাগারে গিয়ে ইউসুফ (আঃ) কে স্বপ্ন বলল। ইউসুফ (আঃ) বললেন:",
      "تَزْرَعُونَ سَبْعَ سِنِينَ دَأَبًا فَمَا حَصَدتُّمْ فَذَرُوهُ فِي سُنبُلِهِ إِلَّا قَلِيلًا مِّمَّا تَأْكُلُونَ ۝ ثُمَّ يَأْتِي مِن بَعْدِ ذَٰلِكَ سَبْعٌ شِدَادٌ يَأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ إِلَّا قَلِيلًا مِّمَّا تُحْصِنُونَ ۝ ثُمَّ يَأْتِي مِن بَعْدِ ذَٰلِكَ عَامٌ فِيهِ يُغَاثُ النَّاسُ وَفِيهِ يَعْصِرُونَ",
      "তোমরা সাত বছর নিয়মিত চাষ করবে। তোমরা যা কাটবে তা শীষসহ রেখে দেবে শুধু যা খাবে তা ছাড়া। তারপর আসবে সাত বছর কঠিন দুর্ভিক্ষ যা তোমরা সঞ্চয় করেছ তা খেয়ে ফেলবে শুধু যা সংরক্ষণ করবে তা ছাড়া। তারপর আসবে এক বছর যাতে মানুষ বৃষ্টি পাবে এবং ফসল নিংড়াবে। [সূরা ইউসুফ: ৪৭-৪৯]",
      "বাদশাহ এই ব্যাখ্যা শুনে মুগ্ধ হলেন এবং বললেন: 'তাকে আমার কাছে নিয়ে এসো।'",
      "**নির্দোষিতা প্রমাণ ও মুক্তি:** যখন দূত ইউসুফ (আঃ) কে ডাকতে এলো, তিনি বললেন:",
      "ارْجِعْ إِلَىٰ رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ اللَّاتِي قَطَّعْنَ أَيْدِيَهُنَّ ۚ إِنَّ رَبِّي بِكَيْدِهِنَّ عَلِيمٌ",
      "তুমি তোমার মালিকের কাছে ফিরে যাও এবং তাকে জিজ্ঞাসা করো সেই নারীদের ব্যাপার কী যারা তাদের হাত কেটেছিল। নিশ্চয়ই আমার রব তাদের ষড়যন্ত্র সম্পর্কে জানেন। [সূরা ইউসুফ: ৫০]",
      "ইউসুফ (আঃ) চাইলেন তাঁর নির্দোষিতা প্রমাণিত হোক। বাদশাহ নারীদের ডেকে জিজ্ঞাসা করলেন: 'তোমরা যখন ইউসুফকে প্রলোভিত করেছিলে তখন কী হয়েছিল?' তারা বলল:",
      "حَاشَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوءٍ",
      "আল্লাহর পবিত্রতা! আমরা তার কোনো দোষ জানি না। [সূরা ইউসুফ: ৫১]",
      "**জুলাইখা সত্য স্বীকার করল:**",
      "الْآنَ حَصْحَصَ الْحَقُّ أَنَا رَاوَدتُّهُ عَن نَّفْسِهِ وَإِنَّهُ لَمِنَ الصَّادِقِينَ",
      "এখন সত্য প্রকাশ হলো। আমিই তাকে প্রলোভিত করেছিলাম এবং সে অবশ্যই সত্যবাদীদের অন্তর্ভুক্ত। [সূরা ইউসুফ: ৫১]",
      "ইউসুফ (আঃ) বললেন: 'এটা এজন্য যাতে সে (আজিজ) জানে যে আমি তার অনুপস্থিতিতে বিশ্বাসঘাতকতা করিনি এবং আল্লাহ বিশ্বাসঘাতকদের ষড়যন্ত্র সফল করেন না।' [সূরা ইউসুফ: ৫২]",
      "মিশরের মন্ত্রী হওয়া: বাদশাহ ইউসুফ (আঃ) কে ডেকে বললেন: 'আজ থেকে তুমি আমাদের কাছে মর্যাদাবান এবং বিশ্বস্ত।' [সূরা ইউসুফ: ৫৪] ইউসুফ (আঃ) বললেন:",
      "اجْعَلْنِي عَلَىٰ خَزَائِنِ الْأَرْضِ ۖ إِنِّي حَفِيظٌ عَلِيمٌ",
      "আমাকে দেশের ভাণ্ডারের দায়িত্ব দিন। আমি হেফাজতকারী, জ্ঞানী। [সূরা ইউসুফ: ৫৫]",
      "বাদশাহ তাঁকে মিশরের অর্থমন্ত্রী বানালেন। ইউসুফ (আঃ) সাত বছরের সমৃদ্ধির সময় খাদ্য সংরক্ষণ করলেন। তারপর দুর্ভিক্ষ শুরু হলো। শুধু মিশরেই নয়, আশেপাশের সব দেশে দুর্ভিক্ষ হলো। কিন্তু মিশরে খাদ্য ছিল। মানুষ সব দেশ থেকে মিশরে খাদ্য কিনতে আসত। ইউসুফ (আঃ) ন্যায়পরায়ণতার সাথে খাদ্য বিতরণ করতেন।",
      "ভাইদের আগমন ও পরীক্ষা: দুর্ভিক্ষ কেনআনেও (ফিলিস্তিন) পৌঁছল। ইয়াকুব (আঃ) তাঁর ছেলেদের মিশরে খাদ্য কিনতে পাঠালেন। শুধু বিনইয়ামিনকে রেখে দিলেন। দশ ভাই মিশরে এলো এবং ইউসুফ (আঃ) এর কাছে খাদ্য চাইতে গেল। ইউসুফ (আঃ) তাদের চিনতে পারলেন কিন্তু তারা তাঁকে চিনতে পারল না। তিনি তাদের খাদ্য দিলেন এবং জিজ্ঞাসা করলেন: 'তোমাদের আরও ভাই আছে?' তারা বলল: 'হ্যাঁ, একজন ছোট ভাই আছে এবং একজন ছিল যে হারিয়ে গেছে।' ইউসুফ (আঃ) বললেন: 'পরবার তোমাদের ছোট ভাইকে নিয়ে এসো। না হলে তোমাদের খাদ্য দেব না।' [সূরা ইউসুফ: ৫৯-৬০] তিনি গোপনে তাদের মূল্য তাদের মালপত্রে ফিরিয়ে দিলেন যাতে তারা আবার আসে।",
      "বিনইয়ামিনকে রেখে দেওয়া: ভাইরা ফিরে গিয়ে পিতাকে বলল। ইয়াকুব (আঃ) প্রথমে রাজি হলেন না। কিন্তু তারা কসম খেয়ে বলল যে তারা বিনইয়ামিনকে রক্ষা করবে। ইয়াকুব (আঃ) বললেন: 'আমি আল্লাহর উপর ভরসা করছি।' [সূরা ইউসুফ: ৬৬-৬৭] তারা বিনইয়ামিনকে নিয়ে মিশরে গেল। ইউসুফ (আঃ) বিনইয়ামিনকে আলাদা ডেকে বললেন: 'আমি তোমার ভাই ইউসুফ। দুঃখ করো না।' [সূরা ইউসুফ: ৬৯] তারপর তিনি একটি পরিকল্পনা করলেন। তিনি বাদশাহর পানপাত্র বিনইয়ামিনের মালপত্রে রেখে দিলেন। তারা যখন ফিরছিল তখন ঘোষণা করা হলো: 'বাদশাহর পানপাত্র হারিয়ে গেছে। যে ফিরিয়ে দেবে তাকে এক উটবোঝা খাদ্য দেওয়া হবে।' [সূরা ইউসুফ: ৭২] তল্লাশি করে বিনইয়ামিনের মালপত্রে পাওয়া গেল। আইন অনুযায়ী চোরকে দাস বানানো হতো। ভাইরা বলল: 'এর আগে তার ভাইও (ইউসুফ) চুরি করেছিল।' [সূরা ইউসুফ: ৭৭] ইউসুফ (আঃ) মনে মনে কষ্ট পেলেন কিন্তু কিছু বললেন না। বিনইয়ামিন মিশরে থেকে গেল।",
      "**সত্য প্রকাশ ও পুনর্মিলন:** ভাইরা পিতার কাছে ফিরে গেল। ইয়াকুব (আঃ) অত্যন্ত দুঃখিত হলেন। তিনি এত কাঁদলেন যে তাঁর চোখ সাদা হয়ে গেল (অন্ধ হয়ে গেলেন)। তিনি বললেন:",
      "يَا أَسَفَىٰ عَلَىٰ يُوسُفَ",
      "হায়! ইউসুফের জন্য আমার কত দুঃখ! [সূরা ইউসুফ: ৮৪]",
      "তিনি বললেন: 'তোমরা আবার যাও এবং ইউসুফ ও তার ভাইকে খুঁজো। আল্লাহর রহমত থেকে নিরাশ হয়ো না।' [সূরা ইউসুফ: ৮৭] ভাইরা আবার মিশরে গেল। তারা ইউসুফ (আঃ) এর কাছে এসে বলল: 'আমাদের ও আমাদের পরিবারে দুর্ভিক্ষ এসেছে। আমরা সামান্য মূল্য নিয়ে এসেছি। আমাদের দান করুন। আল্লাহ দানশীলদের প্রতিদান দেন।' [সূরা ইউসুফ: ৮৮] ইউসুফ (আঃ) বললেন:",
      "هَلْ عَلِمْتُم مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ إِذْ أَنتُمْ جَاهِلُونَ",
      "তোমরা কি জানো তোমরা ইউসুফ ও তার ভাইয়ের সাথে কী করেছিলে যখন তোমরা মূর্খ ছিলে? [সূরা ইউসুফ: ৮৯]",
      "তারা চমকে উঠে বলল: 'আপনি কি সত্যিই ইউসুফ?' তিনি বললেন:",
      "أَنَا يُوسُفُ وَهَٰذَا أَخِي ۖ قَدْ مَنَّ اللَّهُ عَلَيْنَا",
      "আমি ইউসুফ এবং এ আমার ভাই। আল্লাহ আমাদের প্রতি অনুগ্রহ করেছেন। [সূরা ইউসুফ: ৯০]",
      "ভাইরা লজ্জিত হয়ে বলল: 'আল্লাহর কসম! আল্লাহ আপনাকে আমাদের উপর শ্রেষ্ঠত্ব দিয়েছেন এবং আমরা অবশ্যই পাপী ছিলাম।' [সূরা ইউসুফ: ৯১] ইউসুফ (আঃ) বললেন:",
      "لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ ۖ يَغْفِرُ اللَّهُ لَكُمْ ۖ وَهُوَ أَرْحَمُ الرَّاحِمِينَ",
      "আজ তোমাদের বিরুদ্ধে কোনো অভিযোগ নেই। আল্লাহ তোমাদের ক্ষমা করুন। তিনি সবচেয়ে দয়ালু। [সূরা ইউসুফ: ৯২]",
      "স্বপ্ন পূর্ণ হওয়া ও শিক্ষা: ইউসুফ (আঃ) তাঁর জামা পাঠালেন এবং বললেন: 'এটা আমার পিতার মুখে রাখবে, তাঁর দৃষ্টি ফিরে আসবে।' [সূরা ইউসুফ: ৯৩] জামা পৌঁছার আগেই ইয়াকুব (আঃ) ইউসুফের ঘ্রাণ পেলেন এবং বললেন: 'আমি ইউসুফের ঘ্রাণ পাচ্ছি।' [সূরা ইউসুফ: ৯৪] জামা তাঁর মুখে রাখা হলো এবং তিনি দেখতে পেলেন। পুরো পরিবার মিশরে চলে এলো। ইউসুফ (আঃ) তাঁর পিতা-মাতাকে সিংহাসনে বসালেন। তাঁর পিতা, মাতা এবং এগারো ভাই তাঁকে সম্মানে সিজদা করল (সেই সময় সম্মানসূচক সিজদা জায়েজ ছিল)। ইউসুফ (আঃ) বললেন:",
      "يَا أَبَتِ هَٰذَا تَأْوِيلُ رُؤْيَايَ مِن قَبْلُ قَدْ جَعَلَهَا رَبِّي حَقًّا",
      "হে আমার পিতা! এই আমার আগের স্বপ্নের ব্যাখ্যা। আমার রব একে সত্যে পরিণত করেছেন। [সূরা ইউসুফ: ১০০]",
      "**তিনি আল্লাহর শুকরিয়া আদায় করে দোয়া করলেন:**",
      "رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
      "হে আমার রব! আপনি আমাকে রাজত্ব দিয়েছেন এবং স্বপ্নের ব্যাখ্যা শিখিয়েছেন। হে আসমান ও জমিনের সৃষ্টিকর্তা! আপনি দুনিয়া ও আখিরাতে আমার অভিভাবক। আমাকে মুসলিম হিসেবে মৃত্যু দিন এবং সৎকর্মশীলদের সাথে মিলিত করুন। [সূরা ইউসুফ: ১০১]",
      "ইউসুফ (আঃ) মিশরে ১১০ বছর বয়সে ইন্তেকাল করেন। পরে তাঁর লাশ ফিলিস্তিনে নিয়ে যাওয়া হয় এবং তাঁর পিতা-মাতার পাশে দাফন করা হয়।"
    ],
    "moral": "ইউসুফ (আঃ) এর জীবন থেকে শিক্ষা: ধৈর্য, পবিত্রতা এবং আল্লাহর উপর ভরসা মানুষকে সব পরীক্ষা থেকে উত্তীর্ণ করে এবং উচ্চ মর্যাদায় পৌঁছায়। ক্ষমা করা এবং সুন্দর আচরণ করা নবীদের বৈশিষ্ট্য।",
    "source": "সূরা ইউসুফ: ১-১১১; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"
  },
  {
    "id": "nabi_ismail_as",
    "categoryId": "nobider_jiboni",
    "title": "ইসমাঈল (আঃ) - কুরবানীর নবী",
    "paragraphs": [
      "হযরত ইসমাঈল (আঃ) ছিলেন ইব্রাহিম (আঃ) এর জ্যেষ্ঠ পুত্র এবং হাজেরা (আঃ) এর গর্ভজাত সন্তান। তিনি ছিলেন আরব জাতির পিতা এবং রাসূল (সাঃ) এর পূর্বপুরুষ। তাঁর জীবনের সবচেয়ে বড় ঘটনা ছিল কুরবানীর জন্য প্রস্তুত হওয়া।",
      "**জন্ম ও মক্কায় রেখে আসা:** ইব্রাহিম (আঃ) দীর্ঘদিন সন্তানহীন ছিলেন। তাঁর স্ত্রী সারা (আঃ) তাঁকে হাজেরা (আঃ) কে বিবাহ করতে বললেন। হাজেরা (আঃ) থেকে ইসমাঈল (আঃ) জন্ম নেন। ইব্রাহিম (আঃ) তখন ৮৬ বছর বয়সী ছিলেন। কিছুদিন পর আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন শিশু ইসমাঈল এবং হাজেরা (আঃ) কে মক্কায় রেখে আসতে। সেই সময় মক্কা ছিল জনমানবহীন মরুভূমি - কোনো পানি, গাছপালা বা মানুষ ছিল না। ইব্রাহিম (আঃ) তাঁদের রেখে যাওয়ার সময় হাজেরা (আঃ) জিজ্ঞাসা করলেন: 'আল্লাহ কি আপনাকে এই আদেশ দিয়েছেন?' ইব্রাহিম (আঃ) বললেন: 'হ্যাঁ।' হাজেরা (আঃ) বললেন: 'তাহলে আল্লাহ আমাদের ধ্বংস করবেন না।' [সহীহ বুখারী: ৩৩৬৪]",
      "**জমজম কূপের সৃষ্টি:** কিছুদিন পর পানি ও খাবার শেষ হয়ে গেল। শিশু ইসমাঈল (আঃ) তৃষ্ণায় কাঁদতে লাগলেন। হাজেরা (আঃ) পানি খুঁজতে সাফা পাহাড়ে উঠলেন কিন্তু কিছু দেখতে পেলেন না। তারপর মারওয়া পাহাড়ে দৌড়ে গেলেন। এভাবে সাত বার সাফা-মারওয়ার মধ্যে দৌড়ালেন। সপ্তমবার মারওয়া থেকে ফিরে এসে দেখলেন শিশু ইসমাঈল (আঃ) এর পায়ের কাছে পানি বের হচ্ছে। তিনি 'জম জম' (থামো থামো) বলে পানির চারপাশে বাঁধ দিলেন। এভাবে জমজম কূপের সৃষ্টি হলো। রাসূল (সাঃ) বলেছেন: 'আল্লাহ হাজেরার প্রতি রহম করুন। যদি তিনি পানিকে না থামাতেন তাহলে জমজম একটি প্রবাহমান নদী হতো।' [সহীহ বুখারী: ৩৩৬৪]",
      "**জুরহুম গোত্রের আগমন ও বড় হওয়া:** জমজম কূপের কারণে পাখি সেখানে আসতে শুরু করল। ইয়েমেন থেকে জুরহুম গোত্র যাচ্ছিল। তারা পাখি দেখে বুঝল এখানে পানি আছে। তারা এসে হাজেরা (আঃ) এর কাছে অনুমতি চাইল বসবাস করার। হাজেরা (আঃ) অনুমতি দিলেন তবে শর্ত দিলেন যে পানির মালিকানা তাঁদের থাকবে। এভাবে মক্কায় বসতি শুরু হলো। ইসমাঈল (আঃ) জুরহুম গোত্রের মধ্যে বড় হলেন এবং তাদের ভাষা (আরবি) শিখলেন। তিনি ছিলেন অত্যন্ত সুন্দর চরিত্রের এবং তীরন্দাজিতে দক্ষ। জুরহুম গোত্র তাঁকে অত্যন্ত ভালোবাসত।",
      "**কুরবানীর মহান পরীক্ষা:** ইসমাঈল (আঃ) যখন কিশোর হলেন (১৩ বছর বয়সে), ইব্রাহিম (আঃ) স্বপ্নে দেখলেন তিনি তাঁর প্রিয় পুত্রকে কুরবানী করছেন। নবীদের স্বপ্ন হলো ওহী। তিনি ইসমাঈল (আঃ) কে বললেন:",
      "يَا بُنَيَّ إِنِّي أَرَىٰ فِي الْمَنَامِ أَنِّي أَذْبَحُكَ فَانظُرْ مَاذَا تَرَىٰ",
      "হে আমার ছেলে! আমি স্বপ্নে দেখি যে আমি তোমাকে জবাই করছি। তুমি কী মনে করো? [সূরা সাফফাত: ১০২]",
      "ইসমাঈল (আঃ) এক মুহূর্তও দ্বিধা করলেন না। তিনি বললেন:",
      "يَا أَبَتِ افْعَلْ مَا تُؤْمَرُ ۖ سَتَجِدُنِي إِن شَاءَ اللَّهُ مِنَ الصَّابِرِينَ",
      "হে আমার পিতা! আপনাকে যা আদেশ করা হয়েছে তা করুন। ইনশাআল্লাহ আপনি আমাকে ধৈর্যশীলদের মধ্যে পাবেন। [সূরা সাফফাত: ১০২]",
      "এই উত্তরে ইসমাঈল (আঃ) এর পূর্ণ আত্মসমর্পণ প্রকাশ পায়। একজন কিশোর তাঁর জীবন দিতে প্রস্তুত শুধুমাত্র আল্লাহর আদেশ পালনের জন্য।",
      "**মিনায় কুরবানীর প্রস্তুতি ও শয়তানের বাধা:** ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে মিনায় নিয়ে গেলেন। পথে তিনটি স্থানে শয়তান এসে বাধা দিতে চেষ্টা করল। প্রথমবার শয়তান ইব্রাহিম (আঃ) কে বলল: 'এটা শয়তানের কুমন্ত্রণা। তুমি তোমার পুত্রকে হত্যা করছ?' ইব্রাহিম (আঃ) সাতটি পাথর মেরে তাকে তাড়ালেন। দ্বিতীয়বার শয়তান ইসমাঈল (আঃ) কে বলল: 'তোমার পিতা তোমাকে হত্যা করতে যাচ্ছেন!' ইসমাঈল (আঃ) ও সাতটি পাথর মেরে তাকে তাড়ালেন। তৃতীয়বার শয়তান হাজেরা (আঃ) কে বলল: 'তোমার স্বামী তোমার সন্তানকে হত্যা করতে যাচ্ছে!' হাজেরা (আঃ) ও সাতটি পাথর মেরে তাকে তাড়ালেন। এই তিনটি স্থানই এখন জামারাত (শয়তানকে পাথর মারার স্থান) নামে পরিচিত এবং হজের অন্যতম রুকন।",
      "**আল্লাহর মুজিজা ও দুম্বা কুরবানী:** মিনায় পৌঁছে ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে শুইয়ে দিলেন। ইসমাঈল (আঃ) বললেন: 'হে আমার পিতা! আমার হাত-পা বেঁধে নিন যাতে আমি ছটফট না করি। আপনার কাপড় গুটিয়ে নিন যাতে আমার রক্ত না লাগে। ছুরি ভালো করে ধার দিয়ে নিন যাতে আমার কষ্ট কম হয়। আমার মাকে আমার সালাম দিবেন।' ইব্রাহিম (আঃ) কাঁদতে কাঁদতে ছুরি চালালেন। কিন্তু আল্লাহর কুদরতে ছুরি কাটল না। আল্লাহ ডাক দিলেন:",
      "يَا إِبْرَاهِيمُ ۝ قَدْ صَدَّقْتَ الرُّؤْيَا ۚ إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ ۝ إِنَّ هَٰذَا لَهُوَ الْبَلَاءُ الْمُبِينُ ۝ وَفَدَيْنَاهُ بِذِبْحٍ عَظِيمٍ",
      "হে ইব্রাহিম! তুমি স্বপ্ন সত্য করে দেখিয়েছ। আমি এভাবেই সৎকর্মশীলদের প্রতিদান দেই। নিশ্চয়ই এটি ছিল এক স্পষ্ট পরীক্ষা। আমি তাকে মুক্ত করলাম এক মহান কুরবানীর বিনিময়ে। [সূরা সাফফাত: ১০৪-১০৭]",
      "আল্লাহ জান্নাত থেকে একটি বড় দুম্বা পাঠালেন যা ইব্রাহিম (আঃ) কুরবানী করলেন। এই ঘটনার স্মরণে প্রতি বছর ঈদুল আযহায় কুরবানী করা হয়।",
      "**কাবা নির্মাণ ও দায়িত্ব:** ইসমাঈল (আঃ) বড় হলে আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন কাবা ঘর নির্মাণ করতে। পিতা-পুত্র মিলে কাবা নির্মাণ করলেন। ইব্রাহিম (আঃ) পাথর বহন করতেন এবং ইসমাঈল (আঃ) দেয়াল তৈরি করতেন। তাঁরা দোয়া করতেন:",
      "رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
      "হে আমাদের রব! আমাদের থেকে কবুল করুন। নিশ্চয়ই আপনি সর্বশ্রোতা, সর্বজ্ঞ। [সূরা বাকারা: ১২৭]",
      "কাবা নির্মাণের পর ইসমাঈল (আঃ) কে কাবার তত্ত্বাবধানের দায়িত্ব দেওয়া হয়। তিনি জমজম কূপের দেখাশোনা করতেন এবং হাজীদের সেবা করতেন।",
      "**বিবাহ ও সন্তান:** ইসমাঈল (আঃ) জুরহুম গোত্রের এক মেয়েকে বিবাহ করেন। তাঁর বারোজন ছেলে হয় যারা আরব উপদ্বীপে ছড়িয়ে পড়ে এবং বারোটি গোত্রের জন্ম দেয়। তাঁর বংশধরদের মধ্যে সবচেয়ে বিখ্যাত হলেন কুরাইশ গোত্র এবং তাদের মধ্য থেকে আসেন শেষ নবী মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)। ইসমাঈল (আঃ) আরবি ভাষা প্রচার করেন এবং তাঁর বংশধররা আরব জাতি হিসেবে পরিচিত হয়।",
      "**নবুয়ত ও দাওয়াত:** ইসমাঈল (আঃ) নবী ছিলেন। তিনি তাঁর পরিবার এবং আশেপাশের মানুষকে তাওহীদের দাওয়াত দিতেন। কুরআনে তাঁর প্রশংসা করে বলা হয়েছে:",
      "وَاذْكُرْ فِي الْكِتَابِ إِسْمَاعِيلَ ۚ إِنَّهُ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُولًا نَّبِيًّا ۝ وَكَانَ يَأْمُرُ أَهْلَهُ بِالصَّلَاةِ وَالزَّكَاةِ وَكَانَ عِندَ رَبِّهِ مَرْضِيًّا",
      "এই কিতাবে ইসমাঈলের কথা স্মরণ করুন। নিশ্চয়ই তিনি ছিলেন প্রতিশ্রুতি পালনকারী এবং তিনি ছিলেন রাসূল, নবী। তিনি তাঁর পরিবারকে নামাজ ও যাকাতের আদেশ দিতেন এবং তিনি ছিলেন তাঁর রবের কাছে সন্তুষ্টিপ্রাপ্ত। [সূরা মারইয়াম: ৫৪-৫৫]",
      "**মৃত্যু ও দাফন:** ইসমাঈল (আঃ) ১৩৭ বছর বয়সে মক্কায় ইন্তেকাল করেন। তাঁকে কাবার হাতিমে (হিজরে ইসমাঈল) তাঁর মা হাজেরা (আঃ) এর পাশে দাফন করা হয়। তাঁর জীবন ছিল আত্মসমর্পণ, ধৈর্য এবং আল্লাহর আনুগত্যের উজ্জ্বল দৃষ্টান্ত। তিনি ছিলেন আরব জাতির পিতা এবং শেষ নবীর পূর্বপুরুষ।"
    ],
    "moral": "ইসমাঈল (আঃ) এর জীবন থেকে শিক্ষা: পূর্ণ আত্মসমর্পণ, পিতা-মাতার আনুগত্য এবং আল্লাহর আদেশ পালনে কোনো দ্বিধা না করা মুমিনের বৈশিষ্ট্য। কুরবানী শুধু পশু নয়, নিজের ইচ্ছাকে আল্লাহর জন্য উৎসর্গ করা।",
    "source": "সূরা সাফফাত: ১০০-১১৩; সূরা বাকারা: ১২৫-১২৯; সূরা মারইয়াম: ৫৪-৫৫; সহীহ বুখারী: ৩৩৬৪; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_ishaq_as",
    "categoryId": "nobider_jiboni",
    "title": "ইসহাক (আঃ) - প্রতিশ্রুত পুত্র",
    "paragraphs": [
      "হযরত ইসহাক (আঃ) ছিলেন ইব্রাহিম (আঃ) এর দ্বিতীয় পুত্র এবং সারা (আঃ) এর গর্ভজাত সন্তান। তিনি ছিলেন বনী ইসরাঈলের পিতা এবং অনেক নবীর পূর্বপুরুষ। আল্লাহ তাঁকে নবুয়ত দান করেছিলেন এবং তিনি ছিলেন ধৈর্যশীল ও আল্লাহভীরু।",
      "**জন্মের সুসংবাদ ও মুজিজা:** ইব্রাহিম (আঃ) এবং সারা (আঃ) দীর্ঘদিন সন্তানহীন ছিলেন। সারা (আঃ) বৃদ্ধা হয়ে গিয়েছিলেন এবং ইব্রাহিম (আঃ) ও বৃদ্ধ। একদিন তিনজন ফেরেশতা মানুষের রূপে ইব্রাহিম (আঃ) এর কাছে এলেন। তাঁরা ছিলেন জিবরাঈল, মিকাঈল এবং ইসরাফিল (আঃ)। ইব্রাহিম (আঃ) তাঁদের চিনতে পারলেন না এবং মেহমানদারি করতে একটি ভুনা বাছুর নিয়ে এলেন। কিন্তু তাঁরা খেলেন না। ইব্রাহিম (আঃ) ভয় পেলেন। তাঁরা বললেন: 'ভয় পাবেন না। আমরা লূত (আঃ) এর জাতির কাছে পাঠানো হয়েছি তাদের ধ্বংস করতে।' সারা (আঃ) দাঁড়িয়ে শুনছিলেন। ফেরেশতারা তাঁকে সুসংবাদ দিলেন:",
      "فَبَشَّرْنَاهَا بِإِسْحَاقَ وَمِن وَرَاءِ إِسْحَاقَ يَعْقُوبَ",
      "আমরা তাঁকে ইসহাকের সুসংবাদ দিলাম এবং ইসহাকের পরে ইয়াকুবের। [সূরা হুদ: ৭১]",
      "সারা (আঃ) অবাক হয়ে বললেন: 'আমি কীভাবে সন্তান জন্ম দেব? আমি তো বৃদ্ধা এবং আমার স্বামীও বৃদ্ধ!' ফেরেশতারা বললেন:",
      "أَتَعْجَبِينَ مِنْ أَمْرِ اللَّهِ ۖ رَحْمَتُ اللَّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ ۚ إِنَّهُ حَمِيدٌ مَّجِيدٌ",
      "আপনি কি আল্লাহর কাজে বিস্মিত হচ্ছেন? হে পরিবারের লোকেরা! আল্লাহর রহমত ও বরকত আপনাদের উপর। নিশ্চয়ই তিনি প্রশংসিত, মহিমান্বিত। [সূরা হুদ: ৭৩]",
      "**জন্ম ও শৈশব:** আল্লাহর ইচ্ছায় সারা (আঃ) গর্ভবতী হলেন এবং ইসহাক (আঃ) জন্ম নিলেন। এটা ছিল একটি মহা মুজিজা - একজন বৃদ্ধা মহিলা এবং বৃদ্ধ পুরুষের ঘরে সন্তান! ইব্রাহিম (আঃ) তখন ১০০ বছর বয়সী ছিলেন। ইসহাক (আঃ) জন্মের সময় তাঁর বড় ভাই ইসমাঈল (আঃ) ১৪ বছর বয়সী ছিলেন। ইসহাক (আঃ) ফিলিস্তিনে (কেনআন) বড় হলেন। তিনি পিতা ইব্রাহিম (আঃ) এর কাছ থেকে তাওহীদ এবং আল্লাহর ইবাদত শিখলেন।",
      "**বিবাহ ও সন্তান:** ইসহাক (আঃ) চল্লিশ বছর বয়সে রিবকা (রিফকা) কে বিবাহ করেন। তিনি ছিলেন ইব্রাহিম (আঃ) এর ভাই নাহোরের নাতনি। রিবকা দীর্ঘদিন সন্তানহীন ছিলেন। ইসহাক (আঃ) আল্লাহর কাছে দোয়া করলেন এবং আল্লাহ তাঁর দোয়া কবুল করলেন। রিবকা যমজ দুই পুত্র সন্তান জন্ম দিলেন - এসাউ (আল-ঈস) এবং ইয়াকুব (আঃ)। এসাউ প্রথমে জন্ম নিলেন এবং ইয়াকুব (আঃ) তাঁর পরে। ইয়াকুব (আঃ) কে আল্লাহ নবুয়ত দান করলেন এবং তিনি বনী ইসরাঈলের পিতা হলেন।",
      "**নবুয়ত ও দাওয়াত:** ইসহাক (আঃ) নবী ছিলেন। তিনি তাঁর পরিবার এবং কেনআনের মানুষদের তাওহীদের দাওয়াত দিতেন। তিনি পিতা ইব্রাহিম (আঃ) এর পথ অনুসরণ করতেন এবং মূর্তিপূজার বিরুদ্ধে ছিলেন। কুরআনে আল্লাহ তাঁর প্রশংসা করে বলেছেন:",
      "وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا",
      "আমি তাঁকে (ইব্রাহিমকে) দান করলাম ইসহাক ও ইয়াকুব। প্রত্যেককে আমি হিদায়াত দিয়েছি। [সূরা আনআম: ৮৪]",
      "আল্লাহ আরও বলেছেন:",
      "وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ أُولِي الْأَيْدِي وَالْأَبْصَارِ",
      "স্মরণ করুন আমার বান্দা ইব্রাহিম, ইসহাক ও ইয়াকুবকে যারা ছিলেন শক্তিশালী এবং দূরদর্শী। [সূরা সোয়াদ: ৪৫]",
      "**পিতার মৃত্যু ও উত্তরাধিকার:** ইব্রাহিম (আঃ) ১৭৫ বছর বয়সে ইন্তেকাল করেন। ইসহাক (আঃ) এবং ইসমাঈল (আঃ) মিলে তাঁদের পিতাকে হেব্রনে (আল-খলিল) মাকপেলার গুহায় দাফন করেন। ইব্রাহিম (আঃ) এর মৃত্যুর পর ইসহাক (আঃ) কেনআনে থেকে যান এবং তাওহীদের দাওয়াত চালিয়ে যান। তিনি ছিলেন ধৈর্যশীল এবং আল্লাহর উপর পূর্ণ ভরসাকারী।",
      "**পরীক্ষা ও ধৈর্য:** ইসহাক (আঃ) এর জীবনে অনেক পরীক্ষা এসেছিল। তাঁর মা সারা (আঃ) মারা গিয়েছিলেন যখন তিনি যুবক ছিলেন। তাঁর স্ত্রী দীর্ঘদিন সন্তানহীন ছিলেন। তাঁর দুই পুত্রের মধ্যে মতবিরোধ ছিল। কিন্তু তিনি সব পরীক্ষায় ধৈর্য ধরেছিলেন এবং আল্লাহর উপর ভরসা করেছিলেন। তিনি কখনো আল্লাহর আদেশ অমান্য করেননি।",
      "**বংশধর ও নবীগণ:** ইসহাক (আঃ) এর পুত্র ইয়াকুব (আঃ) থেকে বনী ইসরাঈল জাতির জন্ম হয়। ইয়াকুব (আঃ) এর বারো পুত্র ছিল যাদের থেকে বনী ইসরাঈলের বারো গোত্র সৃষ্টি হয়। এই বংশ থেকে অনেক নবী এসেছেন - ইউসুফ, মূসা, হারুন, দাউদ, সুলাইমান, ইয়াহইয়া, ঈসা (আলাইহিমুস সালাম) সহ অনেকে। কুরআনে আল্লাহ বলেছেন:",
      "وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ نَافِلَةً ۖ وَكُلًّا جَعَلْنَا صَالِحِينَ ۝ وَجَعَلْنَاهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا",
      "আমি তাঁকে দান করলাম ইসহাক এবং অতিরিক্ত হিসেবে ইয়াকুব। প্রত্যেককে আমি সৎকর্মশীল বানালাম। আমি তাঁদের নেতা বানালাম যারা আমার আদেশে মানুষকে পথ দেখায়। [সূরা আম্বিয়া: ৭২-৭৩]",
      "**মৃত্যু ও দাফন:** ইসহাক (আঃ) ১৮০ বছর বয়সে ইন্তেকাল করেন। তাঁর দুই পুত্র এসাউ এবং ইয়াকুব (আঃ) তাঁকে হেব্রনে মাকপেলার গুহায় তাঁর পিতা-মাতার পাশে দাফন করেন। তাঁর জীবন ছিল ধৈর্য, তাওহীদ এবং আল্লাহর আনুগত্যে পূর্ণ। তিনি ছিলেন আল্লাহর প্রিয় বান্দা এবং সৎকর্মশীল নবী।"
    ],
    "moral": "ইসহাক (আঃ) এর জীবন থেকে শিক্ষা: আল্লাহর ওয়াদা সত্য এবং তিনি অসম্ভবকে সম্ভব করতে পারেন। ধৈর্য ও দোয়ার মাধ্যমে আল্লাহর রহমত লাভ করা যায়। সৎ বংশধর রেখে যাওয়া মুমিনের জন্য সদকায়ে জারিয়া।",
    "source": "সূরা হুদ: ৬৯-৭৩; সূরা আনআম: ৮৪; সূরা সোয়াদ: ৪৫-৪৭; সূরা আম্বিয়া: ৭২-৭৩; তাওরাত (আদি পুস্তক); তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_yaqub_as",
    "categoryId": "nobider_jiboni",
    "title": "ইয়াকুব (আঃ) - ইসরাঈল",
    "paragraphs": [
      "হযরত ইয়াকুব (আঃ) ছিলেন ইসহাক (আঃ) এর পুত্র এবং ইব্রাহিম (আঃ) এর নাতি। তাঁর উপনাম ছিল 'ইসরাঈল' যার অর্থ 'আল্লাহর বান্দা'। তাঁর বংশধররা বনী ইসরাঈল নামে পরিচিত। তিনি ছিলেন ধৈর্যশীল নবী এবং তাঁর জীবন ছিল পরীক্ষা ও ধৈর্যে পূর্ণ।",
      "**জন্ম ও শৈশব:** ইয়াকুব (আঃ) এবং তাঁর যমজ ভাই এসাউ একসাথে জন্ম নিয়েছিলেন। এসাউ প্রথমে জন্ম নেন এবং ইয়াকুব (আঃ) তাঁর পরে। ইয়াকুব (আঃ) ছিলেন শান্ত, ধার্মিক এবং ইবাদতগুজার। এসাউ ছিলেন শিকারী এবং পার্থিব জীবনে বেশি আগ্রহী। পিতা ইসহাক (আঃ) এসাউকে বেশি ভালোবাসতেন কারণ তিনি শিকার করে আনতেন। কিন্তু মা রিবকা ইয়াকুব (আঃ) কে বেশি ভালোবাসতেন কারণ তিনি ছিলেন ধার্মিক।",
      "**নবুয়ত লাভ:** আল্লাহ ইয়াকুব (আঃ) কে নবুয়ত দান করলেন। তিনি তাঁর পরিবার এবং কেনআনের মানুষদের তাওহীদের দাওয়াত দিতেন। কুরআনে আল্লাহ তাঁর প্রশংসা করে বলেছেন:",
      "وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا",
      "আমি তাঁকে দান করলাম ইসহাক ও ইয়াকুব। প্রত্যেককে আমি হিদায়াত দিয়েছি। [সূরা আনআম: ৮৪]",
      "**বারো পুত্র ও বনী ইসরাঈল:** ইয়াকুব (আঃ) এর বারো পুত্র ছিল। তাঁদের নাম: রূবিল, শিমিয়োন, লেবি, ইয়াহুদা, দান, নাফতালি, গাদ, আশের, ইসাখার, জাবুলুন, ইউসুফ এবং বিনইয়ামিন। এই বারো পুত্র থেকে বনী ইসরাঈলের বারো গোত্র সৃষ্টি হয়। তাঁর সবচেয়ে প্রিয় পুত্র ছিলেন ইউসুফ (আঃ) এবং বিনইয়ামিন কারণ তাঁদের মা রাহেল (আঃ) মারা গিয়েছিলেন।",
      "**ইউসুফ (আঃ) হারানোর মহাপরীক্ষা:** ইয়াকুব (আঃ) এর জীবনের সবচেয়ে বড় পরীক্ষা ছিল প্রিয় পুত্র ইউসুফ (আঃ) কে হারানো। ইউসুফ (আঃ) এর ভাইরা হিংসার বশবর্তী হয়ে তাঁকে কূপে ফেলে দেয় এবং পিতাকে মিথ্যা বলে যে বাঘ তাঁকে খেয়ে ফেলেছে। ইয়াকুব (আঃ) বুঝতে পারলেন এটা মিথ্যা কিন্তু তিনি ধৈর্য ধরলেন। তিনি বললেন:",
      "بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ",
      "বরং তোমাদের মন তোমাদের একটি কাজ সাজিয়ে দিয়েছে। সুতরাং সুন্দর ধৈর্য! তোমরা যা বর্ণনা করছ সে ব্যাপারে আল্লাহই সাহায্যস্থল। [সূরা ইউসুফ: ১৮]",
      "এই আয়াতে 'সবরুন জামিল' (সুন্দর ধৈর্য) শব্দটি ইয়াকুব (আঃ) এর মুখ থেকে বের হয়েছিল। তিনি কাঁদলেন কিন্তু অভিযোগ করলেন না। তিনি দুঃখ করলেন কিন্তু আল্লাহর ফয়সালায় রাজি থাকলেন।",
      "**দীর্ঘ বিরহ ও অন্ধত্ব:** ইউসুফ (আঃ) কে হারানোর পর ইয়াকুব (আঃ) প্রতিদিন কাঁদতেন। বছরের পর বছর কেটে গেল কিন্তু ইউসুফ (আঃ) এর কোনো খবর নেই। ইয়াকুব (আঃ) এত কাঁদলেন যে তাঁর চোখ সাদা হয়ে গেল এবং তিনি অন্ধ হয়ে গেলেন। পুত্ররা বলল: 'আপনি কি ইউসুফের কথা ভুলবেন না? আপনি নিজেকে ধ্বংস করে ফেলছেন!' ইয়াকুব (আঃ) বললেন:",
      "إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ",
      "আমি আমার দুঃখ ও বেদনা শুধু আল্লাহর কাছেই পেশ করি। আমি আল্লাহর কাছ থেকে এমন কিছু জানি যা তোমরা জানো না। [সূরা ইউসুফ: ৮৬]",
      "তিনি আল্লাহর কাছে আশা রাখতেন যে একদিন ইউসুফ (আঃ) ফিরে আসবেন। তিনি বললেন:",
      "يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِن يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ",
      "হে আমার পুত্রগণ! তোমরা যাও এবং ইউসুফ ও তার ভাইকে খুঁজো। আল্লাহর রহমত থেকে নিরাশ হয়ো না। নিশ্চয়ই কাফির সম্প্রদায় ছাড়া কেউ আল্লাহর রহমত থেকে নিরাশ হয় না। [সূরা ইউসুফ: ৮৭]",
      "**পুনর্মিলন ও দৃষ্টি ফিরে পাওয়া:** অবশেষে আল্লাহ ইয়াকুব (আঃ) এর ধৈর্যের পুরস্কার দিলেন। ইউসুফ (আঃ) মিশরের মন্ত্রী হয়েছিলেন এবং তিনি তাঁর ভাইদের চিনতে পারলেন। তিনি তাঁর জামা পাঠালেন এবং বললেন এটা পিতার মুখে রাখতে। জামা পৌঁছার আগেই ইয়াকুব (আঃ) ইউসুফ (আঃ) এর ঘ্রাণ পেলেন এবং বললেন:",
      "إِنِّي لَأَجِدُ رِيحَ يُوسُفَ ۖ لَوْلَا أَن تُفَنِّدُونِ",
      "আমি ইউসুফের ঘ্রাণ পাচ্ছি, যদি তোমরা আমাকে বুড়ো বলে মনে না করো। [সূরা ইউসুফ: ৯৪]",
      "জামা তাঁর মুখে রাখা হলো এবং তাঁর দৃষ্টি ফিরে এলো। তিনি দেখতে পেলেন! তারপর পুরো পরিবার মিশরে গেল এবং ইউসুফ (আঃ) এর সাথে মিলিত হলো। ইয়াকুব (আঃ), তাঁর স্ত্রী এবং এগারো পুত্র সবাই ইউসুফ (আঃ) কে সম্মানে সিজদা করলেন (সেই সময় সম্মানসূচক সিজদা জায়েজ ছিল)।",
      "**মিশরে জীবন ও মৃত্যু:** ইয়াকুব (আঃ) মিশরে তাঁর প্রিয় পুত্র ইউসুফ (আঃ) এর সাথে শান্তিতে বসবাস করলেন। তিনি সেখানে ১৭ বছর কাটালেন। মৃত্যুর সময় তিনি তাঁর পুত্রদের ডেকে বললেন:",
      "يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَىٰ لَكُمُ الدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ",
      "হে আমার পুত্রগণ! নিশ্চয়ই আল্লাহ তোমাদের জন্য এই দীন মনোনীত করেছেন। সুতরাং তোমরা মুসলিম না হয়ে মৃত্যুবরণ করো না। [সূরা বাকারা: ১৩২]",
      "তিনি তাঁর পুত্রদের তাওহীদ ও ইসলামের উপর অটল থাকার উপদেশ দিলেন। ইয়াকুব (আঃ) ১৪৭ বছর বয়সে মিশরে ইন্তেকাল করেন। তাঁর ইচ্ছা অনুযায়ী তাঁর লাশ কেনআনে (ফিলিস্তিন) নিয়ে যাওয়া হয় এবং হেব্রনে মাকপেলার গুহায় তাঁর পিতা-মাতা ও দাদার পাশে দাফন করা হয়।"
    ],
    "moral": "ইয়াকুব (আঃ) এর জীবন থেকে শিক্ষা: সুন্দর ধৈর্য (সবরুন জামিল) হলো অভিযোগ না করে আল্লাহর ফয়সালায় রাজি থাকা। আল্লাহর রহমত থেকে কখনো নিরাশ হওয়া যায় না। ধৈর্যের শেষে আল্লাহ অবশ্যই পুরস্কার দেন।",
    "source": "সূরা ইউসুফ: ১-১১১; সূরা বাকারা: ১৩২-১৩৩; সূরা আনআম: ৮৪; তাওরাত (আদি পুস্তক); তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_shuaib_as",
    "categoryId": "nobider_jiboni",
    "title": "শুআইব (আঃ) - খতিবুল আম্বিয়া",
    "paragraphs": [
      "হযরত শুআইব (আঃ) ছিলেন মাদইয়ান জাতির নবী। তাঁকে 'খতিবুল আম্বিয়া' (নবীদের বক্তা) বলা হতো কারণ তিনি ছিলেন অত্যন্ত বাগ্মী এবং সুন্দর ভাষায় দাওয়াত দিতেন। তিনি ছিলেন ইব্রাহিম (আঃ) এর বংশধর এবং মূসা (আঃ) এর শ্বশুর।",
      "**মাদইয়ান জাতি ও তাদের পাপ:** মাদইয়ান ছিল আরব উপদ্বীপের উত্তর-পশ্চিমে লোহিত সাগরের কাছে একটি শহর। এই জাতির মানুষ ব্যবসা-বাণিজ্যে দক্ষ ছিল কিন্তু তারা তিনটি বড় পাপে লিপ্ত ছিল। প্রথমত, তারা মূর্তিপূজা করত এবং 'আইকা' নামক একটি বৃক্ষের পূজা করত। দ্বিতীয়ত, তারা ওজনে ও মাপে কম দিত - যখন কিনত তখন পূর্ণ মাপ চাইত কিন্তু যখন বিক্রি করত তখন কম দিত। তৃতীয়ত, তারা রাস্তায় বসে মানুষকে ডাকাতি করত এবং ভয় দেখাত।",
      "**শুআইব (আঃ) এর দাওয়াত:** আল্লাহ শুআইব (আঃ) কে তাদের কাছে নবী বানিয়ে পাঠালেন। তিনি তাদের বললেন:",
      "يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ",
      "হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। [সূরা আরাফ: ৮৫]",
      "তিনি তাদের তিনটি বিষয়ে সতর্ক করলেন। প্রথমত, তাওহীদ - এক আল্লাহর ইবাদত করতে এবং মূর্তিপূজা ছাড়তে। দ্বিতীয়ত, সততা - ওজনে ও মাপে পূর্ণ দিতে। তৃতীয়ত, ন্যায়বিচার - মানুষের সাথে প্রতারণা না করতে। তিনি বললেন:",
      "وَيَا قَوْمِ أَوْفُوا الْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِ ۖ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ",
      "হে আমার জাতি! মাপ ও ওজন ন্যায্যভাবে পূর্ণ করো। মানুষকে তাদের জিনিসপত্র কম দিয়ো না এবং পৃথিবীতে বিপর্যয় সৃষ্টি করো না। [সূরা হুদ: ৮৫]",
      "তিনি তাদের বুঝালেন যে সৎভাবে অল্প উপার্জন করা প্রতারণা করে বেশি উপার্জনের চেয়ে উত্তম। তিনি বললেন:",
      "بَقِيَّتُ اللَّهِ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ ۚ وَمَا أَنَا عَلَيْكُم بِحَفِيظٍ",
      "আল্লাহর দেওয়া বাকি অংশ তোমাদের জন্য উত্তম, যদি তোমরা মুমিন হও। আমি তোমাদের উপর তত্ত্বাবধায়ক নই। [সূরা হুদ: ৮৬]",
      "**জাতির প্রত্যাখ্যান ও হুমকি:** মাদইয়ান জাতির নেতারা শুআইব (আঃ) কে প্রত্যাখ্যান করল। তারা বলল: 'হে শুআইব! তোমার নামাজ কি তোমাকে এই শিখিয়েছে যে আমরা আমাদের পূর্বপুরুষদের দেবতা ছেড়ে দেব এবং আমাদের সম্পদ নিয়ে যা ইচ্ছা তা করব না?' তারা তাঁকে বলল: 'তুমি তো আমাদের মধ্যে দুর্বল। তোমার পরিবার না থাকলে আমরা তোমাকে পাথর মেরে হত্যা করতাম।' শুআইব (আঃ) বললেন:",
      "يَا قَوْمِ أَعَشِيرَتِي أَعَزُّ عَلَيْكُم مِّنَ اللَّهِ",
      "হে আমার জাতি! আমার পরিবার কি তোমাদের কাছে আল্লাহর চেয়ে বেশি সম্মানিত? [সূরা হুদ: ৯২]",
      "তারা শুআইব (আঃ) এবং যারা তাঁর সাথে ঈমান এনেছিল তাদের বহিষ্কার করার হুমকি দিল। তারা বলল: 'হে শুআইব! আমরা তোমাকে এবং তোমার সাথে যারা ঈমান এনেছে তাদের আমাদের শহর থেকে বের করে দেব, অথবা তোমরা আমাদের ধর্মে ফিরে আসবে।' শুআইব (আঃ) বললেন: 'যদিও আমরা অপছন্দ করি?'",
      "**শুআইব (আঃ) এর দোয়া ও সতর্কবাণী:** শুআইব (আঃ) তাদের সতর্ক করলেন যে আল্লাহর শাস্তি আসবে। তিনি বললেন: 'হে আমার জাতি! তোমরা তোমাদের অবস্থানে কাজ করতে থাকো, আমিও কাজ করছি। শীঘ্রই তোমরা জানতে পারবে কার উপর লাঞ্ছনাদায়ক শাস্তি আসে এবং কে মিথ্যাবাদী। অপেক্ষা করো, আমিও তোমাদের সাথে অপেক্ষা করছি।' তিনি আল্লাহর কাছে দোয়া করলেন:",
      "رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
      "হে আমাদের রব! আমাদের ও আমাদের জাতির মধ্যে সত্যের ভিত্তিতে ফয়সালা করে দিন। আপনি সর্বোত্তম ফয়সালাকারী। [সূরা আরাফ: ৮৯]",
      "**ভয়ংকর শাস্তি ও ধ্বংস:** মাদইয়ান জাতি শুআইব (আঃ) কে প্রত্যাখ্যান করতে থাকল। অবশেষে আল্লাহর শাস্তি এলো। প্রথমে সাত দিন ধরে প্রচণ্ড গরম শুরু হলো। মানুষ ঘরে থাকতে পারছিল না। তারা শহরের বাইরে একটি মেঘের নিচে ছায়া খুঁজতে গেল। কিন্তু সেই মেঘ ছিল শাস্তির মেঘ। কুরআনে বলা হয়েছে:",
      "فَأَخَذَهُمْ عَذَابُ يَوْمِ الظُّلَّةِ ۚ إِنَّهُ كَانَ عَذَابَ يَوْمٍ عَظِيمٍ",
      "অতঃপর তাদের পাকড়াও করল মেঘের দিনের শাস্তি। নিশ্চয়ই এটা ছিল এক মহাদিনের শাস্তি। [সূরা শুআরা: ১৮৯]",
      "সেই মেঘ থেকে আগুনের বৃষ্টি নামল এবং প্রচণ্ড শব্দ হলো। একই সাথে ভূমিকম্প হলো। সব কাফির ধ্বংস হয়ে গেল। তারা তাদের ঘরে মৃত অবস্থায় পড়ে রইল যেন তারা কখনো সেখানে বাস করেনি। শুআইব (আঃ) এবং যারা ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন।",
      "**মূসা (আঃ) এর সাথে সাক্ষাৎ:** শুআইব (আঃ) এর জীবনের আরেকটি গুরুত্বপূর্ণ ঘটনা হলো মূসা (আঃ) এর সাথে সাক্ষাৎ। মূসা (আঃ) মিশর থেকে পালিয়ে মাদইয়ানে এসেছিলেন। তিনি একটি কূপের কাছে শুআইব (আঃ) এর দুই কন্যাকে সাহায্য করলেন। শুআইব (আঃ) মূসা (আঃ) কে তাঁর বাড়িতে ডাকলেন এবং তাঁকে আশ্রয় দিলেন। তিনি মূসা (আঃ) এর সততা ও শক্তি দেখে মুগ্ধ হলেন এবং তাঁর এক কন্যাকে মূসা (আঃ) এর সাথে বিবাহ দিলেন। মূসা (আঃ) আট থেকে দশ বছর শুআইব (আঃ) এর কাছে থেকে পশু চরালেন এবং তাঁর কাছ থেকে অনেক কিছু শিখলেন।",
      "**মৃত্যু ও উত্তরাধিকার:** শুআইব (আঃ) দীর্ঘ জীবন পেয়েছিলেন। তিনি মাদইয়ানে ইন্তেকাল করেন। তাঁর জীবন ছিল সততা, ন্যায়বিচার এবং আল্লাহর দাওয়াতে পূর্ণ। তিনি ছিলেন বাগ্মী নবী এবং তাঁর দাওয়াতের পদ্ধতি ছিল অত্যন্ত কার্যকর। তাঁর কন্যা মূসা (আঃ) এর স্ত্রী হয়েছিলেন এবং এভাবে তিনি মূসা (আঃ) এর শ্বশুর হওয়ার সম্মান পেয়েছিলেন।"
    ],
    "moral": "শুআইব (আঃ) এর জীবন থেকে শিক্ষা: ব্যবসায়ে সততা ও ন্যায়বিচার ইসলামের মূল শিক্ষা। ওজনে ও মাপে কম দেওয়া হারাম এবং বড় পাপ। সুন্দর ভাষায় দাওয়াত দেওয়া নবীদের পদ্ধতি।",
    "source": "সূরা আরাফ: ৮৫-৯৩; সূরা হুদ: ৮৪-৯৫; সূরা শুআরা: ১৭৬-১৯১; সূরা আনকাবুত: ৩৬-৩৭; সূরা কাসাস: ২২-২৮; তাফসীরে ইবনে কাসীর।"
  }
]