[
  {
    "id": "nabi_muhammad_saw",
    "categoryId": "nobider_jiboni",
    "title": "মুহাম্মাদ (সাঃ) - শেষ নবী ও রাসূল",
    "paragraphs": [
      "হযরত মুহাম্মাদ (সাঃ) ছিলেন আল্লাহর শেষ নবী ও রাসূল। তিনি ৫৭০ খ্রিস্টাব্দে মক্কায় জন্মগ্রহণ করেন। পিতা আবদুল্লাহ, মাতা আমিনা। জন্মের পূর্বেই পিতা এবং ছয় বছর বয়সে মাতা ইন্তেকাল করেন।",
      "**শৈশব ও যৌবন:** দাদা আবদুল মুত্তালিব ও চাচা আবু তালিবের তত্ত্বাবধানে বড় হন। মক্কার লোকেরা তাঁকে 'আল-আমীন' (বিশ্বস্ত) ও 'আস-সাদিক' (সত্যবাদী) বলত। ২৫ বছর বয়সে খাদিজা (রাঃ)-কে বিবাহ করেন।",
      "**নবুয়ত লাভ:** ৪০ বছর বয়সে (৬১০ খ্রিস্টাব্দ) হেরা গুহায় প্রথম ওহী নাজিল হয়। সূরা আলাকের প্রথম পাঁচ আয়াত: **'পড়ো তোমার রবের নামে।'** এভাবে নবুয়ত লাভ করেন।",
      "**মক্কী জীবন (১৩ বছর):** প্রথম তিন বছর গোপনে, পরে প্রকাশ্যে দাওয়াত। কুরাইশদের কঠোর নির্যাতন। দশম বছরে চাচা আবু তালিব ও খাদিজা (রাঃ) মারা যান।",
      "**ইসরা ও মিরাজ:** নবুয়তের দশম বছরে এক রাতে মক্কা থেকে জেরুজালেম এবং সাত আসমান পর্যন্ত ভ্রমণ। পাঁচ ওয়াক্ত নামাজ ফরজ হয়।",
      "**হিজরত:** ৬২২ খ্রিস্টাব্দে মদীনায় হিজরত। মসজিদে নববী নির্মাণ এবং ইসলামী রাষ্ট্র প্রতিষ্ঠা।",
      "**মাদানী জীবন (১০ বছর):** বদর, উহুদ, খন্দক, খায়বার সহ অনেক যুদ্ধ। ৮ হিজরিতে মক্কা বিজয়। ১০ হিজরিতে বিদায় হজ্জ ও ঐতিহাসিক ভাষণ।",
      "**ইন্তেকাল:** ১২ রবিউল আউয়াল, ১১ হিজরি (৬৩২ খ্রিস্টাব্দ) মদীনায় ইন্তেকাল। বয়স ৬৩ বছর। মসজিদে নববীতে দাফন।"
    ],
    "moral": "মুহাম্মাদ (সাঃ) সর্বশ্রেষ্ঠ মানব ও সর্বশেষ নবী। তাঁর জীবন অনুসরণ করাই জান্নাতের পথ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "nabi_ibrahim_as",
    "categoryId": "nobider_jiboni",
    "title": "ইব্রাহীম (আঃ) - খলীলুল্লাহ",
    "paragraphs": [
      "হযরত ইব্রাহীম (আঃ) ছিলেন 'খলীলুল্লাহ' (আল্লাহর বন্ধু)। ইরাকের উর নগরীতে জন্ম। পিতা আযর মূর্তি নির্মাতা। সেই যুগে রাজা নমরুদ নিজেকে খোদা দাবি করত।",
      "**তাওহীদের সন্ধান:** শৈশব থেকেই সত্যের সন্ধানী। তারা, চাঁদ, সূর্য দেখে বুঝলেন এগুলো সৃষ্টি, স্রষ্টা নয়।",
      "**মূর্তি ভাঙা:** মেলার সময় মন্দিরে গিয়ে সব মূর্তি ভেঙে ফেললেন। কুঠার বড় মূর্তির কাঁধে রেখে দিলেন। এভাবে প্রমাণ করলেন মূর্তিরা অসহায়।",
      "**আগুনে নিক্ষেপ:** নমরুদ তাঁকে আগুনে পুড়িয়ে মারার সিদ্ধান্ত নিল। আল্লাহ আগুনকে নির্দেশ দিলেন: **'হে আগুন! ইব্রাহীমের জন্য শীতল ও নিরাপদ হয়ে যাও।'** তিনি অক্ষত বেরিয়ে এলেন।",
      "**হিজরত:** আল্লাহর নির্দেশে ফিলিস্তিনে হিজরত। স্ত্রী সারা ও হাজেরা (আঃ)। ৮৬ বছর বয়সে ইসমাঈল (আঃ) জন্ম।",
      "**মক্কায় রেখে আসা:** আল্লাহর নির্দেশে শিশু ইসমাঈল ও হাজেরাকে মক্কার মরুভূমিতে রেখে আসেন। আল্লাহ যমযম কূপ সৃষ্টি করলেন।",
      "**কুরবানীর পরীক্ষা:** স্বপ্নে দেখলেন ইসমাঈলকে কুরবানী করছেন। ইসমাঈল (আঃ) বললেন: **'আপনাকে যা আদেশ করা হয়েছে তা পালন করুন।'** আল্লাহ জান্নাত থেকে দুম্বা পাঠালেন।",
      "**কাবা নির্মাণ:** ইসমাঈল (আঃ) সহ কাবা ঘর নির্মাণ করেন। হাজরে আসওয়াদ স্থাপন। হজ্জের ঘোষণা দেন।",
      "**ইন্তেকাল:** ১৭৫ বছর বয়সে ফিলিস্তিনের হেবরনে ইন্তেকাল। 'মাকবারাতুল খলীল' এ দাফন।"
    ],
    "moral": "ইব্রাহীম (আঃ) তাওহীদের জন্য সব ত্যাগ করেছেন। আল্লাহর উপর পূর্ণ ভরসা ও আদেশ পালনে দৃঢ়তা তাঁর শিক্ষা।",
    "source": "সূরা আনআম, আম্বিয়া, সাফফাত; সহীহ বুখারী।"
  },
  {
    "id": "nabi_musa_as",
    "categoryId": "nobider_jiboni",
    "title": "মূসা (আঃ) - কালীমুল্লাহ",
    "paragraphs": [
      "হযরত মূসা (আঃ) ছিলেন 'কালীমুল্লাহ' (আল্লাহর সাথে কথা বলেছেন যিনি)। মিসরে ফিরআউনের যুগে জন্ম। ফিরআউন স্বপ্নে দেখল বনী ইসরাঈলের এক শিশু তার রাজত্ব শেষ করবে। তাই সব নবজাতক ছেলে শিশুকে হত্যা করার আদেশ দিল।",
      "**শৈশব:** মা তাঁকে একটি সিন্দুকে রেখে নীল নদে ভাসিয়ে দিলেন। আল্লাহর ইচ্ছায় সিন্দুক ফিরআউনের প্রাসাদে পৌঁছল। ফিরআউনের স্ত্রী আসিয়া (আঃ) তাঁকে পালন করতে চাইলেন। মূসা (আঃ) কোনো ধাত্রীর দুধ পান করছিলেন না। তাঁর বোন খবর দিল যে একজন মহিলা আছে যে দুধ পান করাতে পারবে। এভাবে মূসা (আঃ) নিজ মায়ের কাছে ফিরে এলেন।",
      "**যুবক জীবন:** একদিন এক মিসরীয় ও ইসরাঈলীর মধ্যে ঝগড়া দেখে মূসা (আঃ) ইসরাঈলীকে সাহায্য করতে গেলেন। ভুলবশত মিসরীয় মারা গেল। ফিরআউন তাঁকে হত্যা করতে চাইল। মূসা (আঃ) মাদইয়ান (মিদিয়ান) এ পালিয়ে গেলেন।",
      "**মাদইয়ানে:** সেখানে শুআইব (আঃ) এর দুই কন্যাকে সাহায্য করলেন। শুআইব (আঃ) তাঁকে আট/দশ বছর কাজ করার শর্তে একটি কন্যাকে বিয়ে দিলেন। মূসা (আঃ) দশ বছর কাজ করলেন।",
      "**নবুয়ত লাভ:** মিসরে ফেরার পথে তূর পাহাড়ে আগুন দেখলেন। কাছে গেলে আল্লাহ তাঁকে ডাকলেন: **'আমিই তোমার রব। তোমার জুতা খুলে ফেলো। তুমি পবিত্র উপত্যকা তুওয়ায় আছ।'** [সূরা তাহা: ১২]। আল্লাহ তাঁকে নবুয়ত দিলেন এবং ফিরআউনের কাছে যেতে বললেন।",
      "**মুজিজা:** আল্লাহ তাঁকে দুটি মুজিজা দিলেন: লাঠি সাপে পরিণত হওয়া এবং হাত উজ্জ্বল হওয়া। ভাই হারূন (আঃ)-কে সাহায্যকারী বানালেন।",
      "**ফিরআউনের কাছে:** ফিরআউনকে এক আল্লাহর ইবাদতের দাওয়াত দিলেন। ফিরআউন অহংকার করল এবং বলল: **'আমিই তোমাদের সর্বোচ্চ রব।'** যাদুকররা প্রতিযোগিতায় হারল এবং ঈমান আনল। ফিরআউন তাদের হত্যা করল।",
      "**লোহিত সাগর পার:** আল্লাহর নির্দেশে বনী ইসরাঈল নিয়ে মিসর ছাড়লেন। ফিরআউন পিছু নিল। লোহিত সাগরে পৌঁছে মূসা (আঃ) লাঠি দিয়ে আঘাত করলেন। সাগর দ্বিখণ্ডিত হয়ে রাস্তা হলো। তারা পার হলেন। ফিরআউন প্রবেশ করলে পানি মিলে গেল এবং সে ডুবে মরল।",
      "**তূর পাহাড়ে:** আল্লাহ মূসা (আঃ)-কে তূর পাহাড়ে ডাকলেন এবং তাওরাত কিতাব দিলেন। চল্লিশ দিন সেখানে থাকলেন। এই সময় সামেরী বনী ইসরাঈলকে বাছুর পূজা করতে প্ররোচিত করল। ফিরে এসে মূসা (আঃ) ক্রুদ্ধ হলেন এবং তাদের তওবা করালেন।",
      "**ইন্তেকাল:** দীর্ঘ জীবন বনী ইসরাঈলকে হেদায়েতের চেষ্টা করলেন। ১২০ বছর বয়সে সিনাই উপদ্বীপে ইন্তেকাল করেন।"
    ],
    "moral": "মূসা (আঃ) ধৈর্য, সাহস ও আল্লাহর উপর ভরসার আদর্শ। জালিমের বিরুদ্ধে সত্যের জন্য লড়াই করা তাঁর শিক্ষা।",
    "source": "সূরা তাহা, কাসাস, শুআরা; সহীহ বুখারী।"
  }
]
