[
  {
    "id": "nabi_adam_as",
    "categoryId": "nobider_jiboni",
    "title": "আদম (আঃ) - প্রথম মানব ও প্রথম নবী",
    "paragraphs": [
      "হযরত আদম (আঃ) ছিলেন প্রথম মানব এবং প্রথম নবী। আল্লাহ তা'আলা তাঁকে নিজ হাতে সৃষ্টি করেছেন এবং তাঁর মধ্যে রূহ ফুঁকে দিয়েছেন। তাঁর সৃষ্টির মাধ্যমে পৃথিবীতে মানব জাতির সূচনা হয়।",
      "**সৃষ্টির পূর্বে ফেরেশতাদের সাথে আলোচনা:** আল্লাহ যখন ফেরেশতাদের জানালেন যে তিনি পৃথিবীতে খলিফা (প্রতিনিধি) সৃষ্টি করবেন, তখন ফেরেশতারা বললেন: **'আপনি কি এমন কাউকে সৃষ্টি করবেন যে সেখানে ফাসাদ করবে এবং রক্তপাত ঘটাবে? অথচ আমরা আপনার প্রশংসা ও পবিত্রতা ঘোষণা করছি।'** আল্লাহ বললেন: **'আমি যা জানি তোমরা তা জানো না।'** [সূরা বাকারা: ৩০]। ফেরেশতারা মানুষের ভবিষ্যৎ সম্পর্কে জানতেন না, কিন্তু আল্লাহ জানতেন যে মানুষের মধ্যে নবী, রাসূল, শহীদ এবং সৎকর্মশীল বান্দা থাকবে।",
      "**মাটি থেকে সৃষ্টি:** আল্লাহ তা'আলা পৃথিবীর বিভিন্ন স্থান থেকে মাটি সংগ্রহ করলেন - লাল, সাদা, কালো, নরম, শক্ত - বিভিন্ন ধরনের। এজন্য মানুষের রং ও স্বভাব বিভিন্ন হয়। এই মাটি দিয়ে আদম (আঃ) এর দেহ তৈরি করা হলো। প্রথমে মাটি, তারপর কাদা, তারপর শুকনো ঠনঠনে মাটি। চল্লিশ দিন এই দেহ পড়ে রইল। ইবলিস এসে দেখল এবং ভাবল: এটা ফাঁপা, দুর্বল। আমি এর উপর প্রভাব বিস্তার করতে পারব।",
      "**রূহ ফুঁকে দেওয়া:** আল্লাহ আদম (আঃ) এর দেহে রূহ ফুঁকে দিলেন। রূহ প্রথমে মাথায় প্রবেশ করল। চোখ খুলে গেল, চারদিক দেখতে পেলেন। নাকে প্রবেশ করলে হাঁচি এলো। আদম (আঃ) বললেন: **'আলহামদুলিল্লাহ'** (সমস্ত প্রশংসা আল্লাহর জন্য)। আল্লাহ বললেন: **'ইয়ারহামুকাল্লাহ'** (আল্লাহ তোমার প্রতি রহম করুন)। এভাবে প্রথম কথা ছিল আল্লাহর প্রশংসা। রূহ যখন পেটে পৌঁছল, ক্ষুধা অনুভব করলেন। পায়ে পৌঁছার আগেই উঠে দাঁড়াতে চাইলেন। এজন্য আল্লাহ বলেন: **'মানুষ সৃষ্টি করা হয়েছে তাড়াহুড়া করার জন্য।'** [সূরা আম্বিয়া: ৩৭]",
      "**ফেরেশতাদের সিজদা:** আদম (আঃ) সম্পূর্ণ হওয়ার পর আল্লাহ সকল ফেরেশতাকে আদেশ দিলেন: **'আদমকে সিজদা করো।'** এটি ছিল সম্মানসূচক সিজদা, ইবাদতের সিজদা নয়। সকল ফেরেশতা সিজদা করলেন। কিন্তু ইবলিস অস্বীকার করল। সে ছিল জিন জাতির, ফেরেশতাদের সাথে ইবাদত করত। আল্লাহ জিজ্ঞাসা করলেন: **'কিসে তোমাকে বাধা দিল?'** ইবলিস বলল: **'আমি তার চেয়ে উত্তম। আপনি আমাকে আগুন থেকে সৃষ্টি করেছেন আর তাকে মাটি থেকে।'** [সূরা আরাফ: ১২]। এটি ছিল প্রথম অহংকার এবং প্রথম পাপ। আল্লাহ তাকে বললেন: **'নেমে যাও এখান থেকে। এখানে অহংকার করার অধিকার তোমার নেই।'** [সূরা আরাফ: ১৩]",
      "**জ্ঞান শিক্ষা দেওয়া:** আল্লাহ আদম (আঃ)-কে সকল জিনিসের নাম শিখিয়ে দিলেন। তারপর ফেরেশতাদের বললেন: **'এগুলোর নাম বলো যদি তোমরা সত্যবাদী হও।'** ফেরেশতারা বললেন: **'সুবহানাকা! আপনি আমাদের যা শিখিয়েছেন তা ছাড়া আমাদের কোনো জ্ঞান নেই।'** তারপর আল্লাহ আদম (আঃ)-কে বললেন: **'তুমি তাদের নাম বলে দাও।'** আদম (আঃ) সব নাম বললেন। আল্লাহ ফেরেশতাদের বললেন: **'আমি কি তোমাদের বলিনি যে আমি আসমান ও জমিনের গায়েব জানি?'** [সূরা বাকারা: ৩১-৩৩]। এভাবে প্রমাণিত হলো মানুষের শ্রেষ্ঠত্ব - জ্ঞান অর্জনের ক্ষমতা।",
      "**হাওয়া (আঃ) এর সৃষ্টি:** আদম (আঃ) জান্নাতে একা ছিলেন। একদিন ঘুম থেকে উঠে দেখলেন পাশে এক নারী বসে আছেন। আল্লাহ আদমের বাম পাঁজরের হাড় থেকে হাওয়া (আঃ)-কে সৃষ্টি করেছেন। আদম (আঃ) জিজ্ঞাসা করলেন: **'তুমি কে?'** হাওয়া (আঃ) বললেন: **'আমি নারী।'** আদম (আঃ): **'কেন সৃষ্টি করা হয়েছে?'** হাওয়া (আঃ): **'যাতে তুমি আমার কাছে শান্তি পাও।'** [সহীহ বুখারী]। ফেরেশতারা জিজ্ঞাসা করলেন: **'এর নাম কী?'** আদম (আঃ) বললেন: **'হাওয়া।'** কারণ তিনি জীবিত (হাই) থেকে সৃষ্টি হয়েছেন।",
      "**জান্নাতে জীবন:** আল্লাহ আদম ও হাওয়াকে জান্নাতে বসবাস করতে দিলেন। বললেন: **'তোমরা দুজন জান্নাতে বসবাস করো এবং যেখান থেকে ইচ্ছা খাও। কিন্তু এই গাছের কাছে যেও না, তাহলে জালিমদের অন্তর্ভুক্ত হবে।'** [সূরা বাকারা: ৩৫]। কোন গাছ ছিল তা নিয়ে মতভেদ আছে - কেউ বলেন গম, কেউ বলেন আঙুর, কেউ বলেন ডুমুর। মূল বিষয় হলো আল্লাহর নিষেধাজ্ঞা। জান্নাতে তাঁরা সুখে শান্তিতে ছিলেন। কোনো কষ্ট, ক্ষুধা, তৃষ্ণা, গরম, ঠান্ডা ছিল না।",
      "**শয়তানের ধোঁকা:** ইবলিস (শয়তান) তাদের জান্নাত থেকে বের করার সুযোগ খুঁজছিল। সে তাদের কাছে এসে বলল: **'তোমাদের রব কি এই গাছ থেকে নিষেধ করেছেন শুধু এজন্য যে তোমরা ফেরেশতা হয়ে যাবে অথবা চিরকাল থাকবে?'** সে কসম খেয়ে বলল: **'আমি তোমাদের শুভাকাঙ্ক্ষী।'** [সূরা আরাফ: ২০-২১]। শয়তান তাদের বোঝাল যে এই গাছের ফল খেলে তারা অমর হবে এবং ফেরেশতাদের মতো হবে। আদম ও হাওয়া (আঃ) ভুলে গেলেন এবং সেই গাছের ফল খেয়ে ফেললেন। সাথে সাথে তাঁদের লজ্জাস্থান খুলে গেল। তাঁরা জান্নাতের পাতা দিয়ে নিজেদের ঢাকতে লাগলেন।",
      "**তওবা ও ক্ষমা:** আল্লাহ ডাকলেন: **'আমি কি তোমাদের এই গাছ থেকে নিষেধ করিনি?'** তাঁরা বুঝতে পারলেন ভুল হয়েছে। সাথে সাথে তওবা করলেন: **'হে আমাদের রব! আমরা নিজেদের উপর জুলুম করেছি। যদি আপনি আমাদের ক্ষমা না করেন এবং রহম না করেন তাহলে আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব।'** [সূরা আরাফ: ২৩]। আল্লাহ তাঁদের তওবা কবুল করলেন। কিন্তু বললেন: **'তোমরা সবাই নেমে যাও। তোমরা একে অপরের শত্রু। পৃথিবীতে তোমাদের জন্য নির্দিষ্ট সময় পর্যন্ত বসবাস ও ভোগ করার ব্যবস্থা আছে।'** [সূরা বাকারা: ৩৬]",
      "**পৃথিবীতে অবতরণ:** আদম (আঃ) ভারতের সিলন (শ্রীলংকা) এ এবং হাওয়া (আঃ) জেদ্দায় অবতরণ করেন। দীর্ঘদিন পর আরাফাতের ময়দানে তাঁদের পুনর্মিলন হয়। এজন্য স্থানটির নাম 'আরাফাত' (পরিচয়)। তাঁরা পৃথিবীতে জীবন শুরু করলেন। চাষাবাদ, খাদ্য সংগ্রহ, বাসস্থান নির্মাণ - সব শিখলেন। আল্লাহ তাঁদের শিখিয়ে দিলেন। আদম (আঃ) ছিলেন প্রথম নবী। তিনি তাঁর সন্তানদের এক আল্লাহর ইবাদত শেখাতেন।",
      "**সন্তান-সন্ততি:** হাওয়া (আঃ) থেকে অনেক সন্তান জন্ম নেয়। প্রতিবার যমজ - একজন ছেলে ও একজন মেয়ে। প্রথম যমজ ছিল কাবিল (কেইন) ও তার বোন। দ্বিতীয় যমজ ছিল হাবিল (আবেল) ও তার বোন। সেই সময় নিয়ম ছিল এক যমজের ছেলে অন্য যমজের মেয়েকে বিয়ে করবে। কিন্তু কাবিলের সাথে যে বোন জন্মেছিল সে ছিল সুন্দরী। কাবিল তাকে নিজেই বিয়ে করতে চাইল। আদম (আঃ) বললেন: এটা হারাম। কিন্তু কাবিল মানল না।",
      "**প্রথম কুরবানী ও হত্যা:** আদম (আঃ) বললেন: তোমরা উভয়ে কুরবানী করো। যার কুরবানী কবুল হবে সে-ই সুন্দরী মেয়েটিকে বিয়ে করবে। হাবিল ছিল রাখাল। সে তার সবচেয়ে ভালো ভেড়া কুরবানী দিল। কাবিল ছিল কৃষক। সে খারাপ ফসল কুরবানী দিল। আকাশ থেকে আগুন এসে হাবিলের কুরবানী গ্রহণ করল। কাবিলের কুরবানী পড়ে রইল। কাবিল রাগে জ্বলে উঠল। বলল: **'আমি তোমাকে হত্যা করব।'** হাবিল বলল: **'আল্লাহ মুত্তাকীদের কুরবানী কবুল করেন। তুমি যদি আমাকে হত্যা করতে হাত বাড়াও, আমি তোমাকে হত্যা করতে হাত বাড়াব না। আমি আল্লাহকে ভয় করি।'** [সূরা মায়িদা: ২৭-২৮]। কিন্তু কাবিল শুনল না। সে হাবিলকে পাথর দিয়ে মাথায় আঘাত করে হত্যা করল। এটি ছিল পৃথিবীর প্রথম হত্যাকাণ্ড।",
      "**লাশ কবর দেওয়া:** হাবিলের লাশ পড়ে রইল। কাবিল বুঝতে পারল না কী করবে। আল্লাহ একটি কাক পাঠালেন। কাকটি মাটি খুঁড়ে অন্য একটি মৃত কাক কবর দিল। কাবিল বলল: **'হায়! আমি কি এই কাকের মতোও হতে পারলাম না যে আমার ভাইয়ের লাশ কবর দিতে পারি?'** [সূরা মায়িদা: ৩১]। সে মাটি খুঁড়ে হাবিলকে কবর দিল। এভাবে মানুষ কবর দেওয়া শিখল।",
      "**আদম (আঃ) এর শোক:** আদম (আঃ) যখন জানলেন, অত্যন্ত দুঃখিত হলেন। একজন ছেলে মারা গেছে, অন্যজন খুনি হয়ে গেছে। তিনি আল্লাহর কাছে কাঁদলেন। আল্লাহ তাঁকে সান্ত্বনা দিলেন এবং আরেক ছেলে দান করলেন - শীস (আঃ)। শীস (আঃ) ছিলেন নেককার এবং পরবর্তীতে নবী হয়েছিলেন। আদম (আঃ) তাঁকে সব জ্ঞান শিখিয়ে দিলেন।",
      "**দীর্ঘ জীবন ও ইন্তেকাল:** আদম (আঃ) ৯৬০ বছর (মতান্তরে ১০০০ বছর) জীবিত ছিলেন। তিনি তাঁর সন্তান-সন্ততিদের তাওহীদ, নামাজ, এবং সৎকর্মের শিক্ষা দিয়েছেন। মৃত্যুর সময় ফেরেশতারা এসেছিলেন। তাঁর সন্তানরা কাঁদছিল। ফেরেশতারা বললেন: **'এটাই মৃত্যু। তোমাদের সবাইকে এই পথ অতিক্রম করতে হবে।'** আদম (আঃ) ইন্তেকাল করলেন। ফেরেশতারা তাঁকে গোসল দিলেন, কাফন পরালেন, জানাযা পড়লেন এবং কবর দিলেন। এভাবে মানুষ জানাযার নিয়ম শিখল। তাঁকে মক্কার কাছে 'গারে আবু কুবাইস' এ দাফন করা হয় বলে কথিত আছে।",
      "**শিক্ষা ও মর্যাদা:** আদম (আঃ) থেকে আমরা শিখি: (১) মানুষ আল্লাহর শ্রেষ্ঠ সৃষ্টি, (২) জ্ঞান মানুষের শ্রেষ্ঠত্বের কারণ, (৩) শয়তান চিরশত্রু - তার ধোঁকা থেকে সাবধান, (৪) ভুল হলে সাথে সাথে তওবা করতে হয়, (৫) আল্লাহ ক্ষমাশীল - তিনি তওবা কবুল করেন, (৬) হিংসা ও অহংকার মহাপাপ, (৭) পরিবার ও সন্তানদের দ্বীন শেখানো পিতার দায়িত্ব। আদম (আঃ) হলেন সমস্ত মানব জাতির পিতা এবং প্রথম নবী। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন।"
    ],
    "moral": "আদম (আঃ) এর জীবন থেকে শিক্ষা: মানুষ আল্লাহর খলিফা, জ্ঞানের অধিকারী এবং শয়তানের শত্রু। ভুল হলে তওবা করা এবং আল্লাহর আনুগত্যে ফিরে আসাই মুক্তির পথ।",
    "source": "সূরা বাকারা: ৩০-৩৯; সূরা আরাফ: ১১-২৫; সূরা মায়িদা: ২৭-৩১; সহীহ বুখারী; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_idris_as",
    "categoryId": "nobider_jiboni",
    "title": "ইদরিস (আঃ) - সত্যবাদী নবী",
    "paragraphs": [
      "হযরত ইদরিস (আঃ) ছিলেন আদম (আঃ) এর পরে তৃতীয় নবী এবং শীস (আঃ) এর পৌত্র। তিনি ছিলেন অত্যন্ত সত্যবাদী এবং ধৈর্যশীল। আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেছেন।",
      "**বংশ ও জন্ম:** ইদরিস (আঃ) এর পূর্ণ নাম ছিল ইদরিস ইবনে ইয়ারিদ ইবনে মাহলাইল। তিনি আদম (আঃ) এর পঞ্চম অথবা ষষ্ঠ বংশধর ছিলেন। তাঁর জন্ম হয়েছিল আদম (আঃ) এর ইন্তেকালের পরে। তিনি জন্মগ্রহণ করেন বাবেল (বর্তমান ইরাক) অঞ্চলে।",
      "**নাম 'ইদরিস' এর অর্থ:** 'ইদরিস' শব্দটি এসেছে 'দারাসা' থেকে যার অর্থ অধ্যয়ন করা। তাঁকে এই নাম দেওয়া হয়েছিল কারণ তিনি অত্যধিক ইলম অর্জন করতেন এবং আল্লাহর কিতাব গভীরভাবে অধ্যয়ন করতেন। তিনি ছিলেন জ্ঞানী এবং প্রজ্ঞাবান।",
      "**কুরআনে প্রশংসা:** আল্লাহ তায়ালা কুরআনে ইদরিস (আঃ) এর প্রশংসা করে বলেন:",
      "وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ ۚ إِنَّهُ كَانَ صِدِّيقًا نَّبِيًّا",
      "এই কিতাবে ইদরিসের কথা স্মরণ করুন। নিশ্চয়ই তিনি ছিলেন সত্যবাদী, নবী। [সূরা মারইয়াম: ৫৬]",
      "وَرَفَعْنَاهُ مَكَانًا عَلِيًّا",
      "এবং আমি তাঁকে উচ্চ মর্যাদায় উন্নীত করেছি। [সূরা মারইয়াম: ৫৭]",
      "**নবুয়ত ও দাওয়াত:** ইদরিস (আঃ) নবুয়ত প্রাপ্ত হন যখন মানুষ আল্লাহর পথ থেকে বিচ্যুত হতে শুরু করেছিল। তিনি মানুষকে এক আল্লাহর ইবাদতের দিকে ডাকতেন এবং শিরক থেকে বিরত থাকতে বলতেন। তিনি মানুষকে সততা, ন্যায়পরায়ণতা এবং সৎকর্মের শিক্ষা দিতেন।",
      "**প্রথম লেখক:** ইদরিস (আঃ) ছিলেন প্রথম মানুষ যিনি কলম দিয়ে লিখতেন। তিনি জ্ঞান-বিজ্ঞান লিখে রাখতেন যাতে পরবর্তী প্রজন্ম তা থেকে উপকৃত হতে পারে। তিনি জ্যোতির্বিদ্যা, গণিত এবং চিকিৎসা বিজ্ঞান সম্পর্কে জ্ঞান রাখতেন।",
      "**সেলাই শিল্প:** ইদরিস (আঃ) প্রথম সুই-সুতা দিয়ে কাপড় সেলাই করা শিখিয়েছিলেন। এর আগে মানুষ পশুর চামড়া বা পাতা দিয়ে শরীর ঢাকত। তিনি মানুষকে কাপড় বুনতে এবং সেলাই করতে শেখান।",
      "**ইবাদত ও তাকওয়া:** ইদরিস (আঃ) ছিলেন অত্যন্ত ইবাদতগুজার। তিনি দিনে রোজা রাখতেন এবং রাতে নামাজ পড়তেন। তাঁর জীবন ছিল সাদাসিধা এবং দুনিয়াবিমুখ। তিনি সবসময় আল্লাহর জিকিরে মশগুল থাকতেন।",
      "**উচ্চ মর্যাদায় উন্নীত:** আল্লাহ তায়ালা ইদরিস (আঃ) কে উচ্চ মর্যাদায় উন্নীত করেছেন। অনেক মুফাসসির বলেন যে আল্লাহ তাঁকে জীবিত অবস্থায় আসমানে উঠিয়ে নিয়েছেন। তিনি চতুর্থ আকাশে আছেন বলে হাদিসে উল্লেখ আছে।",
      "মিরাজের রাতে রাসূল (সাঃ) চতুর্থ আকাশে ইদরিস (আঃ) এর সাথে সাক্ষাত করেন। ইদরিস (আঃ) তাঁকে স্বাগত জানান এবং বলেন: 'মারহাবা বিন নাবিয়্যিস সালিহ ওয়াল আখিস সালিহ' (স্বাগতম সৎ নবী ও সৎ ভাই)। [সহীহ বুখারী: ৩৪৩০]",
      "**মৃত্যু নাকি জীবিত:** ইদরিস (আঃ) এর মৃত্যু সম্পর্কে মতভেদ আছে। কেউ বলেন তিনি মারা গেছেন এবং তাঁর রূহ চতুর্থ আকাশে। কেউ বলেন তিনি ঈসা (আঃ) এর মতো জীবিত অবস্থায় আসমানে উঠিয়ে নেওয়া হয়েছে। আল্লাহই ভালো জানেন।",
      "**উম্মত ও অনুসারী:** ইদরিস (আঃ) এর দাওয়াতে অনেক মানুষ ঈমান আনে এবং তাঁর অনুসরণ করে। তিনি তাঁর উম্মতকে তাওহীদ, নামাজ, রোজা এবং সৎকর্মের শিক্ষা দেন। তাঁর সময়ে মানুষ সততা এবং ন্যায়পরায়ণতার সাথে জীবন যাপন করত।",
      "**জীবনকাল:** ইদরিস (আঃ) প্রায় ৩৬৫ বছর পৃথিবীতে ছিলেন (কিছু বর্ণনা মতে)। তারপর আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেন। তাঁর জীবন ছিল ইবাদত, জ্ঞান এবং দাওয়াতে পূর্ণ।",
      "**শিক্ষা ও মর্যাদা:** ইদরিস (আঃ) থেকে আমরা শিখি: (১) সত্যবাদিতা সর্বোচ্চ গুণ, (২) জ্ঞান অর্জন করা এবং তা লিখে রাখা গুরুত্বপূর্ণ, (৩) ইবাদত ও তাকওয়ায় জীবন কাটানো, (৪) মানুষকে কল্যাণকর জ্ঞান শেখানো, (৫) দুনিয়াবিমুখ হয়ে আখিরাতমুখী হওয়া। ইদরিস (আঃ) ছিলেন সত্যবাদী নবী এবং উচ্চ মর্যাদার অধিকারী।"
    ],
    "moral": "ইদরিস (আঃ) এর জীবন থেকে শিক্ষা: সত্যবাদিতা, জ্ঞান অর্জন এবং ইবাদতে নিমগ্ন থাকা মানুষকে উচ্চ মর্যাদায় পৌঁছে দেয়।",
    "source": "সূরা মারইয়াম: ৫৬-৫৭; সহীহ বুখারী: ৩৪৩০; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"
  }
]