[
  {
    "id": "ibrahim-as-agni-porikha",
    "categoryId": "nobider_jibon_theke",
    "title": "ইব্রাহীম (আঃ)-এর আগুনে নিক্ষেপ ও আল্লাহর কুদরত",
    "summary": "",
    "paragraphs": [
      "হযরত ইব্রাহীম (আঃ) যখন তাঁর কওমকে এক আল্লাহর ইবাদতের দিকে ডাকলেন এবং তাদের মূর্তিগুলোকে ভেঙে দিলেন, তখন কওমের লোকেরা তাঁর প্রতি ক্ষিপ্ত হলো। তৎকালীন শাসক নমরুদ তাঁকে শাস্তি দেওয়ার সিদ্ধান্ত নিল।",
      "তারা বিশাল এক অগ্নিকুণ্ড তৈরি করল এবং ইব্রাহীম (আঃ)-কে তাতে নিক্ষেপ করার আয়োজন করল। ইব্রাহীম (আঃ)-কে যখন আগুনের দিকে নিয়ে যাওয়া হচ্ছিল, তখন তিনি কেবল আল্লাহর ওপরই ভরসা রাখছিলেন।",
      "ইব্রাহীম (আঃ)-কে অগ্নিকুণ্ডে নিক্ষেপ করার পর আল্লাহ তা'আলা আগুনকে নির্দেশ দিলেন: ",
      "قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ",
      "অর্থাৎ, আমি বললাম, 'হে আগুন! তুমি ইব্রাহীমের জন্য শীতল ও নিরাপদ হয়ে যাও।' [সূরা আল-আম্বিয়া: ৬৯]",
      "আল্লাহর নির্দেশে সেই লেলিহান আগুন মুহূর্তেই শান্ত ও শীতল হয়ে গেল। ইব্রাহীম (আঃ) আগুনের ভেতরে দীর্ঘ সময় অবস্থান করলেন, কিন্তু তাঁর সামান্যতম ক্ষতিও হলো না।",
      "ইবনে আব্বাস (রাঃ) থেকে বর্ণিত, ইব্রাহীম (আঃ)-কে যখন আগুনে নিক্ষেপ করা হচ্ছিল, তখন তিনি বললেন: ",
      "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
      "অর্থাৎ, আল্লাহই আমাদের জন্য যথেষ্ট, আর তিনি কতই না উত্তম কর্মবিধায়ক। [সহীহ বুখারী, কিতাবুত তাফসীর; সূরা আলে ইমরান: ১৭৩ এর অংশ]",
      "আল্লাহর কুদরতে তিনি অক্ষত অবস্থায় আগুন থেকে বেরিয়ে এলেন। এই অলৌকিক ঘটনা কওমের বহু লোককে হতবাক করে দিলেও, তাদের বেশিরভাগই অহংকারের কারণে ঈমান আনেনি। এই ঘটনা ইব্রাহীম (আঃ)-এর আল্লাহর প্রতি চূড়ান্ত আস্থা ও ভরসার প্রমাণ।"
    ],
    "moral": "যখন বান্দা সম্পূর্ণরূপে আল্লাহর ওপর ভরসা করে, তখন জাগতিক কোনো শক্তিই তার ক্ষতি করতে পারে না। আল্লাহ তাঁর প্রিয় বান্দাদের জন্য বিপদকে রহমতে পরিণত করে দেন।",
    "source": "সূরা আল-আম্বিয়া: ৫৬-৭০; সহীহ বুখারী।"
  },
  {
    "id": "luqman-as-putro-upodesh",
    "categoryId": "nobider_jibon_theke",
    "title": "লুকমান (আঃ)-এর পুত্রকে দেওয়া মূল্যবান উপদেশাবলী",
    "summary": "",
    "paragraphs": [
      "হযরত লুকমান (আঃ) ছিলেন একজন জ্ঞানী ও নেককার ব্যক্তি, মতান্তরে নবী। আল্লাহ তাঁকে প্রজ্ঞা বা হিকমত দান করেছিলেন। তিনি তাঁর পুত্রকে যে উপদেশগুলো দিয়েছিলেন, তা কুরআনুল কারীমে বর্ণিত হয়েছে।",
      "তিনি তাঁর পুত্রকে প্রথম যে উপদেশটি দিলেন, তা হলো: ",
      "يَا بُنَيَّ لَا تُشْرِكْ بِاللَّهِ ۖ إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ",
      "অর্থাৎ, হে আমার প্রিয় পুত্র! আল্লাহর সাথে কাউকে শরীক করো না। নিশ্চয়ই শির্ক বা অংশীদার স্থাপন করা এক মহাঅন্যায়। [সূরা লুকমান: ১৩]",
      "দ্বিতীয়ত, তিনি তাকে নামায প্রতিষ্ঠা করতে, সৎকাজে আদেশ করতে এবং অসৎকাজ থেকে নিষেধ করতে বললেন: ",
      "يَا بُنَيَّ أَقِمِ الصَّلَاةَ وَأْمُرْ بِالْمَعْرُوفِ وَانْهَ عَنِ الْمُنكَرِ وَاصْبِرْ عَلَىٰ مَا أَصَابَكَ ۖ إِنَّ ذَٰلِكَ مِنْ عَزْمِ الْأُمُورِ",
      "অর্থাৎ, হে আমার প্রিয় পুত্র! তুমি সালাত প্রতিষ্ঠা করো, সৎকাজের আদেশ করো এবং অসৎকাজে নিষেধ করো, আর তোমার উপর যে বিপদ আসে তাতে ধৈর্য ধারণ করো। নিশ্চয়ই এগুলো দৃঢ় সংকল্পের কাজ। [সূরা লুকমান: ১৭]",
      "তৃতীয়ত, তিনি তাকে অহংকার থেকে দূরে থাকার উপদেশ দিলেন: ",
      "وَلَا تُصَعِّرْ خَدَّكَ لِلنَّاسِ وَلَا تَمْشِ فِي الْأَرْضِ مَرَحًا ۖ إِنَّ اللَّهَ لَا يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ",
      "অর্থাৎ, তুমি মানুষের দিক থেকে মুখ ফিরিয়ে নিয়ো না এবং পৃথিবীতে অহংকারের সাথে চলাফেরা করো না। নিশ্চয়ই আল্লাহ কোনো অহংকারী দাম্ভিককে পছন্দ করেন না। [সূরা লুকমান: ১৮]",
      "এই উপদেশগুলো লুকমান (আঃ)-এর গভীর প্রজ্ঞা ও তাঁর সন্তানের প্রতি তাঁর ভালোবাসার প্রতিফলন ছিল।"
    ],
    "moral": "ঈমান ও আমলের ক্ষেত্রে শির্কমুক্ত তাওহীদ হলো প্রধান ভিত্তি। জীবনের প্রতিটি পদক্ষেপে আল্লাহর আদেশ পালন, ধৈর্যের সঙ্গে বিপদ মোকাবিলা করা এবং বিনয়ী হওয়া নেককার মানুষের বৈশিষ্ট্য।",
    "source": "সূরা লুকমান: ১২-১৯; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "shuaib-as-maup-jokh",
    "categoryId": "nobider_jibon_theke",
    "title": "শুআইব (আঃ)-এর কওমের ওজনে কারচুপি",
    "paragraphs": [
      "হযরত শুআইব (আঃ)-কে মাদইয়ানবাসীদের কাছে নবী হিসেবে প্রেরণ করা হয়েছিল। এই কওমের মানুষেরা ব্যবসা-বাণিজ্যে ওজনে ও মাপে চরম কারচুপি করত। তারা আল্লাহর ইবাদত ছেড়ে দিয়েছিল এবং মানুষের অধিকার নষ্ট করত।",
      "শুআইব (আঃ) তাদের কাছে এসে আল্লাহর একত্বের দাওয়াত দিলেন এবং তাদের অসৎ ব্যবসায়িক কাজ থেকে বিরত থাকতে বললেন,",
      "يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۖ وَلَا تَنقُصُوا الْمِكْيَالَ وَالْمِيزَانَ",
      "অর্থাৎ, হে আমার কওম! তোমরা আল্লাহর ইবাদত করো, তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। আর তোমরা মাপ ও ওজনে কম দিও না। [সূরা হূদ: ৮৪]",
      "**তিনি তাদের সতর্ক করে বললেন:** ",
      "إِنِّي أَرَاكُم بِخَيْرٍ وَإِنِّي أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ مُّحِيطٍ",
      "অর্থাৎ, আমি তোমাদেরকে প্রাচুর্যের মধ্যে দেখতে পাচ্ছি, কিন্তু আমি তোমাদের জন্য এক বেষ্টনকারী দিনের শাস্তির আশঙ্কা করি। [সূরা হূদ: ৮৪]",
      "**কিন্তু কওমের লোকেরা তাঁর কথা শুনল না। তারা দাম্ভিকতার সাথে উত্তর দিল:** ",
      "قَالُوا يَا شُعَيْبُ أَصَلَاتُكَ تَأْمُرُكَ أَن نَّتْرُكَ مَا يَعْبُدُ آبَاؤُنَا أَوْ أَن نَّفْعَلَ فِي أَمْوَالِنَا مَا نَشَاءُ",
      "অর্থাৎ, তারা বলল, হে শুআইব! তোমার নামায কি তোমাকে এই নির্দেশ দেয় যে, আমরা আমাদের পিতৃপুরুষদের উপাস্যদের পরিত্যাগ করি অথবা আমরা আমাদের ধন-সম্পদের ব্যাপারে যা ইচ্ছা তা করতে না পারি? [সূরা হূদ: ৮৭]",
      "যখন তারা ঈমান আনতে অস্বীকার করল এবং তাদের অন্যায় কাজ থেকে বিরত হলো না, তখন আল্লাহ তাদের ওপর কঠিন আযাব দিলেন। এক বিকট শব্দ ও ভূমিকম্পে তারা নিজ নিজ ঘরে উপুড় হয়ে মরে রইল। এভাবেই আল্লাহ তাদের ধ্বংস করে শুআইব (আঃ)-কে রক্ষা করলেন।"
    ],
    "moral": "আল্লাহর ইবাদত এবং মানুষের সাথে লেনদেনে সততা, উভয়ই ঈমানের অপরিহার্য অংশ। সামাজিক ন্যায়বিচার নষ্ট করলে এবং ওয়াদা ভঙ্গ করলে আল্লাহর পক্ষ থেকে কঠিন শাস্তি আসা অনিবার্য।",
    "source": "সূরা হূদ: ৮৪-৯৫; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "salih-as-ut-o-azab",
    "categoryId": "nobider_jibon_theke",
    "title": "সালেহ (আঃ)-এর উটনী ও সামুদ জাতির ধ্বংস",
    "summary": "",
    "paragraphs": [
      "হযরত সালেহ (আঃ)-কে সামুদ জাতির কাছে নবী হিসেবে পাঠানো হয়েছিল। এই জাতিও ছিল 'আদ জাতির মতো শক্তিশালী এবং পাহাড় কেটে ঘর বানাতে পারদর্শী। তারা আল্লাহর নিদর্শন দেখতে চাইল।",
      "সালেহ (আঃ)-এর কাছে তারা একটি বিশেষ পাহাড় থেকে জীবন্ত উটনী বের করে দিতে চাইল। আল্লাহ তাদের দাবি অনুযায়ী অলৌকিকভাবে একটি বিশাল উটনী পাহাড়ের পাথর চিরে বের করে দিলেন। আল্লাহ নির্দেশ দিলেন,",
      "هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ وَلَا تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ",
      "অর্থাৎ, এই হলো আল্লাহর উটনী, তোমাদের জন্য এক নিদর্শন। সুতরাং তোমরা তাকে আল্লাহর জমিনে চড়ে খেতে দাও এবং তাকে কোনো কষ্ট দিও না, দিলে তোমাদের ওপর যন্ত্রণাদায়ক শাস্তি আসবে। [সূরা আল-আ'রাফ: ৭৩]",
      "উটনীটি এক দিন পুরো জনপদের পানি পান করত এবং পরের দিন লোকেরা পানি পান করত। এই অলৌকিক উটনীটি তাদের জন্য আল্লাহর পক্ষ থেকে এক স্পষ্ট পরীক্ষা ছিল।",
      "কিন্তু সামুদ জাতির নেতারা অহংকারী ছিল। তারা এই নিদর্শন অস্বীকার করল এবং উটনীটিকে হত্যা করার চক্রান্ত করল। তাদের সবচেয়ে পাপিষ্ঠ ব্যক্তি উটনীটিকে হত্যা করল।",
      "উটনীটিকে হত্যার পর তারা সালেহ (আঃ)-কে চ্যালেঞ্জ করে বলল:,",
      "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ۖ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ",
      "অর্থাৎ, অতঃপর তারা উটনীটিকে হত্যা করল। তখন সালেহ বললেন, 'তোমরা তোমাদের ঘরে আরও তিন দিন ভোগ করে নাও। এটি এমন এক ওয়াদা যা মিথ্যা হবে না।' [সূরা হূদ: ৬৫]",
      "তৃতীয় দিনের শেষে সামুদ জাতির ওপর আল্লাহর কঠিন আযাব এলো। এক বিকট শব্দ ও ভূমিকম্পে তারা সবাই ধ্বংস হয়ে গেল। সালেহ (আঃ) এবং যারা তাঁর প্রতি ঈমান এনেছিল, তারা রক্ষা পেল।"
    ],
    "moral": "আল্লাহর নিদর্শনকে অস্বীকার করা এবং তাঁর পাঠানো দূতদের মিথ্যা প্রতিপন্ন করা চরম ধ্বংস ডেকে আনে। আল্লাহর পরীক্ষা হলো বান্দার ধৈর্য ও আনুগত্য যাচাই করার মাধ্যম।",
    "source": "সূরা আল-আ'রাফ: ৭৩-৭৯; সূরা হূদ: ৬১-৬৮।"
  },
  {
    "id": "muhammad-rasulullah-as-me'raj",
    "categoryId": "nobider_jibon_theke",
    "title": "মুহাম্মাদ (সাঃ)-এর মি'রাজ (ঊর্ধ্বগমন) ও সালাতের বিধান",
    "summary": "",
    "paragraphs": [
      "নবুওয়াতের দশম বছরে মহানবী হযরত মুহাম্মাদ (সাঃ)-এর জীবনে এক ঐতিহাসিক ঘটনা ঘটে, যা মি'রাজ বা ঊর্ধ্বারোহণ নামে পরিচিত। এই রাতে তিনি প্রথমে মক্কা থেকে বুরাক নামক বাহনে করে জেরুজালেমের বায়তুল মুকাদ্দাস পর্যন্ত ভ্রমণ করেন (ইসরা)। সেখানে তিনি পূর্ববর্তী সকল নবীর ইমামতি করেন।",
      "এরপর তিনি সেখান থেকে অলৌকিকভাবে সপ্ত আকাশ ভেদ করে আল্লাহর সান্নিধ্যে যান (মি'রাজ)। প্রথম, দ্বিতীয়, তৃতীয়সহ প্রতিটি আকাশে তিনি পূর্ববর্তী নবীদের সাথে সাক্ষাৎ করেন।",
      "বায়তুল মামুর (ফেরেশতাদের ইবাদতের কেন্দ্র) পার হয়ে তিনি 'সিদরাতুল মুনতাহা' (চূড়ান্ত সীমা) পর্যন্ত পৌঁছালেন। সেখানে তাঁর জন্য জান্নাত ও জাহান্নামের দৃশ্য উন্মোচিত হয়।",
      "এই সর্বোচ্চ অবস্থানে আল্লাহর সাথে তাঁর সরাসরি কথোপকথন হয়। সেখানে আল্লাহ তাঁর উম্মতের জন্য সবচেয়ে বড় উপহারটি প্রদান করেন— যা হলো পাঁচ ওয়াক্ত নামাযের (সালাত) বিধান।",
      "প্রথমত, ৫০ ওয়াক্ত নামাযের নির্দেশ দেওয়া হয়। এরপর মূসা (আঃ)-এর পরামর্শে রাসূল (সাঃ) আল্লাহর কাছে বারবার সহজ করার আবেদন জানাতে থাকেন। প্রতিবারই রাসূল (সাঃ) আল্লাহর কাছে ফিরে গিয়ে বললেন,",
      "يَا رَبِّ، خَفِّفْ عَنْ أُمَّتِي",
      "অর্থাৎ, হে আমার রব! আমার উম্মতের জন্য সহজ করে দিন। [সহীহ মুসলিম, কিতাবুল ঈমান]",
      "অবশেষে তা পাঁচ ওয়াক্তে স্থির হয়। তখন আল্লাহ ঘোষণা করলেন: ",
      "هُنَّ خَمْسٌ وَهُنَّ خَمْسُونَ، لَا يُبَدَّلُ الْقَوْلُ لَدَيَّ",
      "অর্থাৎ, এই হলো পাঁচ (ওয়াক্ত) এবং এটাই পঞ্চাশ (ওয়াক্তের প্রতিদান); আমার কাছে কথার কোনো পরিবর্তন হয় না। [সহীহ বুখারী, কিতাবুল সালাত]",
      "পাঁচ ওয়াক্ত নামায পড়লেই ৫০ ওয়াক্তের সাওয়াব পাওয়ার ব্যবস্থা হলো। মি'রাজ থেকে ফিরে এসে রাসূল (সাঃ) উম্মতকে এই মহিমান্বিত নামাযের বিধান সম্পর্কে অবহিত করেন।"
    ],
    "moral": "নামায হলো ইসলামের সবচেয়ে গুরুত্বপূর্ণ স্তম্ভ এবং আল্লাহর সাথে বান্দার সরাসরি যোগাযোগের মাধ্যম। এর মাধ্যমে আল্লাহ তাঁর বান্দাদের প্রতি তাঁর রহমত ও ভালোবাসার প্রমাণ দিয়েছেন।",
    "source": "সহীহ বুখারী, কিতাবুল সালাত; সহীহ মুসলিম, কিতাবুল ঈমান; সূরা ইসরা: ১।"
  },
  {
    "id": "daud-as-jalut-mukabila",
    "categoryId": "nobider_jibon_theke",
    "title": "দাউদ (আঃ)-এর জালুতকে হত্যা ও রাজত্ব লাভ",
    "paragraphs": [
      "তালুতের নেতৃত্বে বনী ইসরাঈল যখন জালুত (গোলিয়াত)-এর বিশাল সেনাবাহিনীর বিরুদ্ধে যুদ্ধ করছিল, তখন জালুতের শক্তি দেখে সবাই ভীত ছিল। কারণ জালুত ছিল প্রচণ্ড শক্তিশালী ও বিশাল দেহের অধিকারী। কেউ তাকে মোকাবিলা করার সাহস পাচ্ছিল না।",
      "হযরত দাউদ (আঃ) তখন ছিলেন একজন যুবক মাত্র। তিনি জালুতের চ্যালেঞ্জ গ্রহণ করলেন এবং তাকে একাই মোকাবিলা করতে গেলেন।",
      "**জালুত দাউদ (আঃ)-কে দেখে হেসে উঠল এবং বলল:** ",
      "আমি তোমাকে আমার কুকুরদের খাওয়াবো, তুমি আমার সাথে যুদ্ধ করতে এসেছো!",
      "**কিন্তু দাউদ (আঃ) আল্লাহর ওপর পূর্ণ ভরসা রেখে জবাব দিলেন:** ",
      "তুমি এসেছো ঢাল-তলোয়ার নিয়ে, আর আমি এসেছি আমার প্রভু, আসমান ও জমিনের রব, তোমার ও তোমার কওমের রব আল্লাহর নামে।",
      "দাউদ (আঃ) তাঁর হাতে থাকা গুলতি (স্লিং শট) থেকে পাথর নিক্ষেপ করলেন। আল্লাহর কুদরতে সেই পাথর সোজা গিয়ে জালুতের কপালে আঘাত হানল এবং জালুত মাটিতে লুটিয়ে পড়ল।",
      "**আল্লাহর নির্দেশে দাউদ (আঃ) জালুতকে হত্যা করলেন। আল্লাহ এই ঘটনার বর্ণনা দিয়ে বলেন:** ",
      "فَهَزَمُوهُم بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاءُ",
      "অর্থাৎ, অতঃপর তারা আল্লাহর অনুমতিক্রমে তাদেরকে পরাজিত করল এবং দাউদ জালুতকে হত্যা করল। আর আল্লাহ দাউদকে রাজত্ব ও হিকমত (প্রজ্ঞা) দান করলেন এবং তাঁকে যা ইচ্ছা শিক্ষা দিলেন। [সূরা বাকারা: ২৫১]",
      "এই বিজয়ের পর আল্লাহ দাউদ (আঃ)-কে নবী ও শাসক হিসেবে অধিষ্ঠিত করলেন।"
    ],
    "moral": "সত্যের সামনে মিথ্যার শক্তি যতই বড় হোক না কেন, আল্লাহর সাহায্য থাকলে তা এক দুর্বলতম ব্যক্তির হাতেও পরাজিত হতে পারে। ঈমান ও সাহসই বিজয়ের মূল চাবিকাঠি।",
    "source": "সূরা বাকারা: ২৪৯-২৫১; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "sulaiman-as-hudhud",
    "categoryId": "nobider_jibon_theke",
    "title": "সুলায়মান (আঃ)-এর হুদহুদ পাখি ও সাবা রাজ্যের রাণী",
    "paragraphs": [
      "হযরত সুলায়মান (আঃ)-এর সেনাবাহিনীতে মানুষ, জ্বিন এবং বিভিন্ন প্রকার পশুপাখি ছিল। একবার তিনি তাঁর সৈন্যদের সমাবেশ পরিদর্শনে গিয়ে দেখলেন, হুদহুদ (উপদেষ্টা পাখি) অনুপস্থিত।",
      "**তিনি হুদহুদকে না দেখে অত্যন্ত ক্রুদ্ধ হলেন এবং বললেন:** ",
      "مَا لِيَ لَا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ * لَأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لَأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُّبِينٍ",
      "অর্থাৎ, আমার কী হলো যে, আমি হুদহুদকে দেখছি না? নাকি সে অনুপস্থিতদের অন্তর্ভুক্ত? আমি অবশ্যই তাকে কঠিন শাস্তি দেব অথবা তাকে জবাই করব, না হয় সে আমার কাছে তার অনুপস্থিতির স্পষ্ট প্রমাণ নিয়ে আসবে। [সূরা নামল: ২০-২১]",
      "**কিছুক্ষণ পর হুদহুদ ফিরে এসে সুলায়মান (আঃ)-এর কাছে এক গুরুত্বপূর্ণ সংবাদ দিল:** ",
      "أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِن سَبَإٍ بِنَبَإٍ يَقِينٍ * إِنِّي وَجَدتُّ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِن كُلِّ شَيْءٍ وَلَهَا عَرْشٌ عَظِيمٌ * وَجَدتُّهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِن دُونِ اللَّهِ",
      "অর্থাৎ, আমি এমন বিষয় সম্পর্কে জেনেছি, যা আপনি জানেন না, আর আমি সাবা (শেবা) থেকে আপনার জন্য এক নিশ্চিত খবর নিয়ে এসেছি। আমি এক নারীকে দেখলাম, যে তাদের ওপর রাজত্ব করছে এবং তাকে সব কিছু দেওয়া হয়েছে, আর তার রয়েছে এক বিশাল সিংহাসন। আমি তাকে ও তার কওমকে দেখলাম, তারা আল্লাহর পরিবর্তে সূর্যকে সিজদা করছে। [সূরা নামল: ২২-২৪]",
      "সুলায়মান (আঃ) তখন তাকে সাবা-এর রাণী বিলকিসের কাছে একটি পত্র নিয়ে যেতে বললেন এবং দেখতে বললেন, রাণী কী উত্তর দেন। এই ঘটনার মাধ্যমেই পরবর্তীতে রাণী বিলকিস ঈমান আনেন এবং সুলায়মান (আঃ)-এর অনুগত হন।"
    ],
    "moral": "একজন আদর্শ শাসকের উচিত তার প্রজাদের খোঁজ-খবর রাখা। আল্লাহর নিয়ামত শুধু ক্ষমতা নয়, বরং সত্যের প্রচার ও মানুষকে অন্ধকার থেকে আলোর পথে নিয়ে আসার মাধ্যমও বটে।",
    "source": "সূরা নামল: ২০-৪৪।"
  },
  {
    "id": "nuh-as-putro-kanan",
    "categoryId": "nobider_jibon_theke",
    "title": "নূহ (আঃ)-এর পুত্র কানানের পরিণতি ও আল্লাহর ফয়সালা",
    "paragraphs": [
      "মহাপ্লাবনের সময় হযরত নূহ (আঃ)-এর অবাধ্য পুত্র কানান নৌকায় উঠতে অস্বীকার করেছিল। নূহ (আঃ) তাকে শেষ মুহূর্তেও ডেকেছিলেন:",
      "يَا بُنَيَّ ارْكَب مَّعَنَا وَلَا تَكُن مَّعَ الْكَافِرِينَ",
      "অর্থাৎ, হে আমার প্রিয় পুত্র! আমাদের সাথে নৌকায় আরোহণ করো এবং কাফিরদের সঙ্গী হয়ো না। [সূরা হূদ: ৪২]",
      "**কিন্তু পুত্র অহংকারবশত উত্তর দিল:** ",
      "قَالَ سَآوِي إِلَىٰ جَبَلٍ يَعْصِمُنِي مِنَ الْمَاءِ",
      "অর্থাৎ, সে বলল, আমি কোনো পাহাড়ের উপর আশ্রয় নেব, যা আমাকে পানি থেকে রক্ষা করবে। [সূরা হূদ: ৪৩]",
      "কিছুক্ষণের মধ্যেই বিশাল ঢেউ এসে পিতা ও পুত্রের মাঝে আড়াল সৃষ্টি করল এবং কানান ডুবে গেল। নূহ (আঃ) তখন তাঁর পুত্রের জন্য আল্লাহর কাছে আবেদন করলেন,",
      "رَبِّ إِنَّ ابْنِي مِنْ أَهْلِي وَإِنَّ وَعْدَكَ الْحَقُّ وَأَنتَ أَحْكَمُ الْحَاكِمِينَ",
      "অর্থাৎ, হে আমার রব! আমার পুত্র আমার পরিবারের অন্তর্ভুক্ত। আর আপনার ওয়াদা তো সত্য, আর আপনিই তো শ্রেষ্ঠ বিচারক। [সূরা হূদ: ৪৫]",
      "**আল্লাহ তখন তাঁকে জবাব দিলেন:** ",
      "قَالَ يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ فَلَا تَسْأَلْنِ مَا لَيْسَ لَكَ بِهِ عِلْمٌ ۖ إِنِّي أَعِظُكَ أَن تَكُونَ مِنَ الْجَاهِلِينَ",
      "অর্থাৎ, তিনি বললেন, 'হে নূহ! সে তোমার পরিবারের অন্তর্ভুক্ত নয়। নিশ্চয়ই সে অসৎ কর্মশীল। সুতরাং যে বিষয়ে তোমার জ্ঞান নেই, সে বিষয়ে আমাকে প্রশ্ন করো না। আমি তোমাকে উপদেশ দিচ্ছি, তুমি যেন অজ্ঞদের অন্তর্ভুক্ত না হও।' [সূরা হূদ: ৪৬]",
      "নূহ (আঃ) তাঁর ভুল বুঝতে পেরে আল্লাহর কাছে দ্রুত ক্ষমা প্রার্থনা করলেন। এই ঘটনা প্রমাণ করে যে, ঈমানহীনতার কারণে রক্ত সম্পর্কও আল্লাহর কাছে মূল্যহীন।"
    ],
    "moral": "ঈমান ও আনুগত্যই আল্লাহর কাছে সম্পর্কের মাপকাঠি। আল্লাহর আদেশের বিরুদ্ধে গিয়ে আবেগের বশে কোনো প্রশ্ন করা উচিত নয়। আল্লাহর ফয়সালা সকল মানবিক অনুভূতির ঊর্ধ্বে।",
    "source": "সূরা হূদ: ৪২-৪৭।"
  },
  {
    "id": "ibrahim-as-hijrot-o-dawa",
    "categoryId": "nobider_jibon_theke",
    "title": "ইব্রাহীম (আঃ)-এর দেশত্যাগ ও আল্লাহর আশ্রয়",
    "paragraphs": [
      "নমরুদের অগ্নিপরীক্ষা থেকে রক্ষা পাওয়ার পরও যখন কওমের লোকেরা ঈমান আনল না, তখন ইব্রাহীম (আঃ) হতাশ হলেন না। তিনি তাঁর জন্মভূমি ত্যাগ করে আল্লাহর পথে হিজরত করার সিদ্ধান্ত নিলেন।",
      "**তিনি তাঁর কাওমকে উদ্দেশ্য করে বললেন:** ",
      "إِنِّي ذَاهِبٌ إِلَىٰ رَبِّي سَيَهْدِينِ",
      "অর্থাৎ, আমি আমার রবের দিকে চললাম, তিনি অবশ্যই আমাকে পথ দেখাবেন। [সূরা আস-সাফফাত: ৯৯]",
      "তিনি তাঁর স্ত্রী সারা, ভাতিজা লূত (আঃ) এবং যারা তাঁর ওপর ঈমান এনেছিলেন, তাদের নিয়ে হিজরত করলেন। জীবনের এই কঠিন মুহূর্তে তিনি কেবল আল্লাহর ওপরই ভরসা রাখলেন।",
      "দীর্ঘ পথ পাড়ি দিয়ে তিনি অবশেষে পবিত্র ভূমিতে (শাম বা সিরিয়া অঞ্চলে) পৌঁছালেন। এই হিজরতের ফলে আল্লাহ তাঁকে বহু নেয়ামত দান করলেন।",
      "**আল্লাহ তাঁর এই ত্যাগ ও হিজরতের প্রতিদানস্বরূপ তাঁকে পুরস্কৃত করলেন:** ",
      "وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ وَجَعَلْنَا فِي ذُرِّيَّتِهِ النُّبُوَّةَ وَالْكِتَابَ وَآتَيْنَاهُ أَجْرَهُ فِي الدُّنْيَا ۖ وَإِنَّهُ فِي الْآخِرَةِ لَمِنَ الصَّالِحِينَ",
      "অর্থাৎ, আর আমরা তাঁকে দান করলাম ইসহাক ও ইয়াকুবকে এবং তাঁর বংশধরদের মধ্যে নবুয়ত ও কিতাব রাখলাম। আর আমরা তাঁকে দুনিয়াতে তাঁর প্রতিদান দিলাম। নিশ্চয়ই সে আখিরাতেও সৎকর্মশীলদের অন্তর্ভুক্ত থাকবে। [সূরা আনকাবুত: ২৭]",
      "আল্লাহ তাঁকে ভবিষ্যতের সকল নবীর উৎস বানিয়ে দিলেন। এই হিজরত প্রমাণ করে যে, আল্লাহর পথে ত্যাগ স্বীকার করলে তার প্রতিদান অনেক বড় হয়।"
    ],
    "moral": "তাওহীদ বা একত্ববাদ যখন বিপদের কারণ হয়, তখন আল্লাহর সন্তুষ্টির জন্য নিজের প্রিয় জন্মভূমি ত্যাগ করাও ঈমানের অংশ। আল্লাহর পথে ত্যাগই পৃথিবীতে মর্যাদা ও আখেরাতে সফলতার কারণ।",
    "source": "সূরা আস-সাফফাত: ৯৯-১০০; সূরা আনকাবুত: ২৬-২৭।"
  },
  {
    "id": "yusuf-as-misor-shashon",
    "categoryId": "nobider_jibon_theke",
    "title": "ইউসুফ (আঃ)-এর কারাগার থেকে মিসরের শাসনভার লাভ",
    "paragraphs": [
      "হযরত ইউসুফ (আঃ)-এর জীবনের একটি দীর্ঘ অংশ কেটেছিল কঠিন পরীক্ষার মধ্যে—ভাইদের চক্রান্ত, কূপে নিক্ষিপ্ত হওয়া, এবং অবশেষে একটি মিথ্যা অভিযোগে কারাগারে নিক্ষিপ্ত হওয়া।",
      "কারাগারে তিনি একজন সৎ ও জ্ঞানী ব্যক্তি হিসেবে পরিচিত ছিলেন। সেখানকার বন্দীদের স্বপ্নের ব্যাখ্যা দিয়ে তিনি সুপরিচিত হয়ে ওঠেন। এরপর যখন মিসরের বাদশাহ এক অদ্ভুত স্বপ্ন দেখলেন, তখন ইউসুফ (আঃ)-এর স্বপ্নের ব্যাখ্যার কথা মনে পড়ল।",
      "ইউসুফ (আঃ) বাদশাহর স্বপ্নের সঠিক ব্যাখ্যা দিলেন, যা ছিল আগামী সাত বছর দুর্ভিক্ষ ও সাত বছর প্রাচুর্যের পূর্বাভাস। এতে বাদশাহ সন্তুষ্ট হলেন এবং তাঁকে কারাগার থেকে মুক্তি দিতে চাইলেন।",
      "**কিন্তু ইউসুফ (আঃ) নির্দোষ প্রমাণিত না হওয়া পর্যন্ত মুক্তি নিতে অস্বীকার করলেন এবং বললেন:** ",
      "ارجِعْ إِلَىٰ رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ اللَّاتِي قَطَّعْنَ أَيْدِيَهُنَّ ۚ إِنَّ رَبِّي بِكَيْدِهِنَّ عَلِيمٌ",
      "অর্থাৎ, আপনি আপনার মনিবের কাছে ফিরে যান এবং তাকে জিজ্ঞাসা করুন, যে নারীরা হাত কেটেছিল তাদের ব্যাপার কী? নিশ্চয়ই আমার রব তাদের চক্রান্ত সম্পর্কে অবগত। [সূরা ইউসুফ: ৫০]",
      "**নিজের পবিত্রতা প্রমাণের পর ইউসুফ (আঃ) বাদশাহর কাছে এমন এক গুরুত্বপূর্ণ পদের জন্য আবেদন করলেন:** ",
      "اجْعَلْنِي عَلَىٰ خَزَائِنِ الْأَرْضِ ۖ إِنِّي حَفِيظٌ عَلِيمٌ",
      "অর্থাৎ, আমাকে দেশের ধনভাণ্ডারের ওপর নিযুক্ত করুন; আমি তো বিশ্বস্ত রক্ষক ও জ্ঞানবান। [সূরা ইউসুফ: ৫৫]",
      "বাদশাহ তাঁকে মিসরের অর্থ ও খাদ্যভাণ্ডারের দায়িত্ব অর্পণ করলেন। ইউসুফ (আঃ) অত্যন্ত দক্ষতার সাথে দুর্ভিক্ষ মোকাবেলা করলেন এবং পরবর্তীতে তাঁর ভাই ও পিতাকে মিসরে নিয়ে এলেন। এভাবেই আল্লাহ তাঁকে এক মহৎ মর্যাদা দান করলেন।"
    ],
    "moral": "আল্লাহর সাহায্য সব সময়ই সৎ ও ধৈর্যশীল বান্দাদের জন্য আসে। চরম বিপদের মধ্যেও পবিত্রতা, জ্ঞান ও দক্ষতার মাধ্যমে সফলতা অর্জন করা যায়।",
    "source": "সূরা ইউসুফ: ৪৩-৫৬।"
  },
  {
    "id": "zakariya-as-yahya-er-agomon",
    "categoryId": "nobider_jibon_theke",
    "title": "যাকারিয়া (আঃ)-এর নীরবতার দিনগুলো এবং ইয়াহইয়া (আঃ)-এর আগমন",
    "paragraphs": [
      "হযরত যাকারিয়া (আঃ) যখন বার্ধক্যে আল্লাহর কাছে সন্তানের জন্য প্রার্থনা করলেন এবং আল্লাহ তাঁকে ইয়াহইয়া (আঃ)-এর সুসংবাদ দিলেন, তখন তিনি এই অলৌকিক ঘটনার একটি নিদর্শন চাইলেন।",
      "**আল্লাহ তাঁকে বললেন:** ",
      "قَالَ آيَتُكَ أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَ لَيَالٍ سَوِيًّا",
      "অর্থাৎ, তিনি বললেন, 'তোমার জন্য নিদর্শন হলো, তুমি সুস্থ থাকা সত্ত্বেও তিন রাত মানুষের সাথে কথা বলতে পারবে না।' [সূরা মারইয়াম: ১০]",
      "এই সময়ের মধ্যে যাকারিয়া (আঃ) মানুষের সাথে কথা বলতে পারতেন না, কেবল ইশারায় ভাব বিনিময় করতেন। এই নীরবতা ছিল আল্লাহর কুদরতের এক দৃশ্যমান প্রমাণ এবং ভবিষ্যতের নবীর আগমনের প্রস্তুতি।",
      "**এই সময় তিনি মসজিদে তাঁর কক্ষের বাইরে এসে জনগণকে ইবাদতের জন্য ইশারা করলেন:** ",
      "فَخَرَجَ عَلَىٰ قَوْمِهِ مِنَ الْمِحْرَابِ فَأَوْحَىٰ إِلَيْهِمْ أَن سَبِّحُوا بُكْرَةً وَعَشِيًّا",
      "অর্থাৎ, অতঃপর তিনি তাঁর কক্ষ থেকে বের হয়ে কওমের কাছে এলেন এবং ইশারা করে জানালেন যে, তোমরা সকাল-সন্ধ্যায় আল্লাহর পবিত্রতা ও মহিমা ঘোষণা করো। [সূরা মারইয়াম: ১১]",
      "নির্ধারিত সময়ের পর আল্লাহ তাঁর স্ত্রীকে গর্ভধারণের ক্ষমতা দিলেন এবং সময়মতো ইয়াহইয়া (আঃ) জন্মগ্রহণ করলেন। আল্লাহ ইয়াহইয়া (আঃ)-কে বিশেষভাবে বেছে নিলেন এবং বললেন,",
      "يَا يَحْيَىٰ خُذِ الْكِتَابَ بِقُوَّةٍ ۖ وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا",
      "অর্থাৎ, হে ইয়াহইয়া! তুমি কিতাবকে দৃঢ়ভাবে ধারণ করো। আর আমরা শৈশবেই তাঁকে প্রজ্ঞা (নবুয়ত) দান করেছিলাম। [সূরা মারইয়াম: ১২]",
      "আল্লাহর ওয়াদা এভাবেই অলৌকিকভাবে পূর্ণ হয়েছিল।"
    ],
    "moral": "আল্লাহ যখন কাউকে কিছু দান করার সিদ্ধান্ত নেন, তখন কোনো প্রতিবন্ধকতাই বাধা হতে পারে না। ধৈর্যের পর আল্লাহর দেওয়া নিদর্শনগুলোর প্রতি কৃতজ্ঞতা প্রকাশ করা মুমিনের কর্তব্য।",
    "source": "সূরা মারইয়াম: ৭-১৫।"
  },
  {
    "id": "musa-as-shishuber-mukti",
    "categoryId": "nobider_jibon_theke",
    "title": "মূসা (আঃ)-এর জন্ম ও ফেরাউনের ঘরে প্রতিপালন",
    "paragraphs": [
      "ফেরাউন বনী ইসরাঈলের পুরুষ শিশুদের হত্যা করার নির্দেশ দিয়েছিল। এই কঠিন সময়ে হযরত মূসা (আঃ)-এর জন্ম হলো। মূসা (আঃ)-এর মা সন্তানের জীবনের ভয়ে চিন্তিত ছিলেন।",
      "**আল্লাহ তাঁর মাকে ওহীর মাধ্যমে নির্দেশ দিলেন:** ",
      "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
      "অর্থাৎ, আমরা মূসার মায়ের কাছে ওহী পাঠালাম যে, তুমি তাকে দুধ পান করাও; আর যখন তুমি তার সম্পর্কে কোনো আশঙ্কা করবে, তখন তাকে নদীতে (নীলনদে) ফেলে দিও। ভয় করো না এবং দুঃখও করো না। নিশ্চয়ই আমরা তাকে তোমার কাছে ফিরিয়ে আনব এবং তাকে রাসূলদের অন্তর্ভুক্ত করব। [সূরা কাসাস: ৭]",
      "মূসা (আঃ)-এর মা আল্লাহর আদেশের ওপর ভরসা করে শিশুপুত্রকে একটি সিন্দুকে ভরে নীলনদে ভাসিয়ে দিলেন। আল্লাহর কুদরতে সেই সিন্দুক ভেসে গিয়ে সরাসরি ফেরাউনের প্রাসাদের কাছে পৌঁছাল।",
      "ফেরাউনের স্ত্রী আসিয়া সেই সিন্দুকটি তুলে নিয়ে শিশু মূসা (আঃ)-কে দেখে মুগ্ধ হলেন। ফেরাউন শিশুটিকে মারতে চাইলেও আসিয়া অনুরোধ করলেন,",
      "قَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا",
      "অর্থাৎ, ফেরাউনের স্ত্রী বললেন, 'এ শিশু আমার এবং তোমার চোখের শীতলতা। একে হত্যা করো না; হয়তো এ আমাদের উপকার করবে অথবা আমরা তাকে পুত্ররূপে গ্রহণ করব।' [সূরা কাসাস: ৯]",
      "এভাবেই আল্লাহ মূসা (আঃ)-কে সেই শত্রুর ঘরেই নিরাপদে প্রতিপালিত হওয়ার ব্যবস্থা করলেন, যে তাঁকে হত্যা করতে চেয়েছিল।"
    ],
    "moral": "আল্লাহর কুদরত ও পরিকল্পনা মানুষের সকল চক্রান্তকে ব্যর্থ করে দেয়। যখন বান্দা সম্পূর্ণভাবে আল্লাহর ওপর ভরসা করে, তখন আল্লাহ তাঁর জন্য এমন পথ তৈরি করেন যা কেউ কল্পনাও করতে পারে না।",
    "source": "সূরা কাসাস: ৪-১০।"
  },
  {
    "id": "isa-as-akash-gomon",
    "categoryId": "nobider_jibon_theke",
    "title": "ঈসা (আঃ)-এর হত্যাচেষ্টা ও আল্লাহর কাছে তুলে নেওয়া",
    "paragraphs": [
      "হযরত ঈসা (আঃ) যখন আল্লাহর নির্দেশে দাওয়াত দিতে লাগলেন, তখন বনী ইসরাঈলের একদল লোক তাঁর ওপর ঈমান আনল, কিন্তু ইহুদিরা তাঁকে মিথ্যা প্রতিপন্ন করল এবং তাঁকে হত্যা করার চক্রান্ত করল।",
      "তারা রাতের আঁধারে ঈসা (আঃ)-কে ঘিরে ফেলল এবং তাঁকে পাকড়াও করতে চাইল। আল্লাহ তাদের চক্রান্তকে ব্যর্থ করে দিলেন এবং এক অলৌকিক ঘটনা ঘটালেন।",
      "আল্লাহ ইহুদিদের চোখে বিভ্রম সৃষ্টি করলেন এবং ঈসা (আঃ)-এর এক অনুসারীর (মতান্তরে ঈসা (আঃ)-এর শত্রু) চেহারা ঈসা (আঃ)-এর মতো করে দিলেন। তারা সেই ব্যক্তিকে ঈসা (আঃ) মনে করে তাকে শূলবিদ্ধ বা ক্রুশবিদ্ধ করল।",
      "**আল্লাহ তা'আলা কুরআনুল কারীমে এই চক্রান্ত সম্পর্কে বলেন:** ",
      "وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِن شُبِّهَ لَهُمْ",
      "অর্থাৎ, আর তাদের (ইহুদিদের) উক্তি: 'আমরা মারইয়ামের পুত্র, আল্লাহর রাসূল মসীহ ঈসাকে হত্যা করেছি।' অথচ তারা তাকে হত্যাও করেনি, শূলবিদ্ধও করেনি, বরং তাদের জন্য (অন্য একজন) সাদৃশ্যপূর্ণ হয়ে গিয়েছিল। [সূরা নিসা: ১৫৭]",
      "ইহুদিরা বিশ্বাস করত যে তারা ঈসা (আঃ)-কে হত্যা করেছে, কিন্তু প্রকৃতপক্ষে আল্লাহ তাঁকে হত্যা হওয়ার আগেই সশরীরে তাঁর কাছে তুলে নিলেন,",
      "بَل رَّفَعَهُ اللَّهُ إِلَيْهِ ۚ وَكَانَ اللَّهُ عَزِيزًا حَكِيمًا",
      "অর্থাৎ, বরং আল্লাহ তাঁকে নিজের দিকে উঠিয়ে নিয়েছেন। আর আল্লাহ হলেন পরাক্রমশালী, প্রজ্ঞাময়। [সূরা নিসা: ১৫৮]",
      "তিনি কিয়ামতের আগে আবার পৃথিবীতে ফিরে আসবেন।"
    ],
    "moral": "আল্লাহর পরিকল্পনা মানবীয় সকল চক্রান্তের ঊর্ধ্বে। মুমিনের জীবন ও মৃত্যু সম্পূর্ণরূপে আল্লাহর হাতে। তিনি তাঁর প্রিয় বান্দাদেরকে শত্রুর ষড়যন্ত্র থেকে অলৌকিকভাবে রক্ষা করেন।",
    "source": "সূরা নিসা: ১৫৭-১৫৮; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "muhammad-rasulullah-as-filer-ghotona",
    "categoryId": "nobider_jibon_theke",
    "title": "মুহাম্মাদ (সাঃ)-এর জন্ম: আবরাহার হস্তীবাহিনী বা 'আসহাবুল ফীল'-এর ঘটনা",
    "paragraphs": [
      "হযরত মুহাম্মাদ (সাঃ)-এর জন্মের বছরকে 'আমুল ফীল' বা হস্তীর বছর বলা হয়। এই বছর ইয়েমেনের শাসক আবরাহা মক্কার পবিত্র কাবা ঘর ধ্বংস করার জন্য এক বিশাল সেনাবাহিনী নিয়ে অগ্রসর হয়। আবরাহার বাহিনীতে অনেকগুলো হাতি ছিল, যা আরববাসীদের কাছে ছিল এক অভূতপূর্ব দৃশ্য।",
      "আবরাহা যখন মক্কার কাছাকাছি পৌঁছাল, তখন মক্কার লোকেরা তার বিশাল বাহিনীর ভয়ে ভীত হয়ে পড়ল। মক্কার তৎকালীন নেতা এবং রাসূল (সাঃ)-এর দাদা আব্দুল মুত্তালিব আবরাহার সাথে দেখা করতে গেলেন। আবরাহা জিজ্ঞেস করল:",
      "আপনি কি কাবার নিরাপত্তা নিয়ে কথা বলতে এসেছেন?",
      "**আব্দুল মুত্তালিব জবাব দিলেন:** ",
      "আমি কাবার নিরাপত্তার জন্য আসিনি। আমি এসেছি আমার উটগুলো ফেরত নেওয়ার জন্য, যা আপনার সৈন্যরা নিয়ে গেছে। আমি উটগুলোর রব, আর কাবার একজন রব আছেন, তিনি নিজেই তার ঘরের রক্ষা করবেন।",
      "আব্দুল মুত্তালিবের এই কথা আবরাহা গুরুত্ব দিল না এবং কাবা ধ্বংসের জন্য সৈন্যদের প্রস্তুত হতে আদেশ দিল। যখন আবরাহা তার সবচেয়ে বড় হাতিটিকে নিয়ে কাবা অভিমুখে যাত্রা শুরু করতে চাইল, তখন হাতিটি আল্লাহর নির্দেশে বসে পড়ল এবং নড়তে চাইল না। অন্য দিকগুলোতে যাওয়ার চেষ্টা করলে হাতিটি দৌড়াতে প্রস্তুত ছিল, কিন্তু কাবামুখী হলেই সে বসে পড়ত।",
      "ঠিক তখনই আল্লাহ তা'আলা আকাশ থেকে ঝাঁকে ঝাঁকে আবাবিল পাখি (ছোট পাখি) পাঠালেন। প্রতিটি পাখির ঠোঁটে ও দু'পায়ে ছিল একটি করে ছোট কঙ্কর বা পাথর। পাখিগুলো আল্লাহর নির্দেশে সেই কঙ্করগুলো আবরাহার সেনাবাহিনীর ওপর নিক্ষেপ করতে লাগল।",
      "**আল্লাহ এই ঘটনা সম্পর্কে বললেন:** ",
      "وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ * تَرْمِيهِم بِحِجَارَةٍ مِّن سِجِّيلٍ * فَجَعَلَهُمْ كَعَصْفٍ مَّأْكُولٍ",
      "অর্থাৎ, আর তাদের ওপর ঝাঁকে ঝাঁকে পাখি পাঠালেন। যারা তাদের ওপর কঙ্কর মাটির পাথর নিক্ষেপ করছিল। অতঃপর তিনি তাদেরকে ভক্ষিত ভুসির মতো করে দিলেন। [সূরা ফীল: ৩-৫]",
      "কঙ্করগুলো সৈন্যদের শরীরে লাগার সাথে সাথেই তাদের শরীর গলে যেতে শুরু করল এবং আবরাহার বিশাল বাহিনী ধ্বংস হয়ে গেল। এভাবেই আল্লাহ কাবা ঘর রক্ষা করলেন। এই অলৌকিক ঘটনার কিছুদিন পরই রাসূল (সাঃ) জন্মগ্রহণ করেন।"
    ],
    "moral": "আল্লাহর ঘর ও তাঁর দ্বীনের শত্রুরা যত শক্তিশালীই হোক না কেন, আল্লাহর কুদরত তাদের ধ্বংস করার জন্য যথেষ্ট। আল্লাহ তাঁর মনোনীত স্থান ও বান্দাকে রক্ষা করেন।",
    "source": "সূরা ফীল: ১-৫; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "daud-as-jabal-tasbih-bistarito",
    "categoryId": "nobider_jibon_theke",
    "title": "দাউদ (আঃ)-এর মধুর কণ্ঠস্বর ও প্রকৃতির আনুগত্য",
    "paragraphs": [
      "হযরত দাউদ (আঃ) ছিলেন একাধারে নবী, রাজা এবং আল্লাহর ইবাদতকারী। আল্লাহ তাঁকে এমন এক অলৌকিক ক্ষমতা দিয়েছিলেন যে, যখন তিনি আল্লাহর প্রশংসায় যবুর কিতাব থেকে তেলাওয়াত করতেন, তখন তাঁর কণ্ঠস্বর এক অসাধারণ মাধুর্য লাভ করত।",
      "তাঁর সেই সুমধুর তেলাওয়াত শোনার জন্য পাহাড়, পাখি এবং অন্যান্য জীবজন্তু এসে জমায়েত হতো। আল্লাহ দাউদ (আঃ)-কে সম্মানিত করে বললেন,",
      "وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا فَضْلًا ۖ يَا جِبَالُ أَوِّبِي مَعَهُ وَالطَّيْرَ ۖ وَأَلَنَّا لَهُ الْحَدِيدَ",
      "অর্থাৎ, আর অবশ্যই আমরা দাউদকে আমাদের পক্ষ থেকে অনুগ্রহ দান করেছিলাম। (বলেছিলাম) হে পাহাড়সমূহ! তোমরা দাউদের সাথে বারবার আমার পবিত্রতা ও মহিমা ঘোষণা করো এবং পাখিরাও। আর আমরা তার জন্য লোহাকে নরম করে দিয়েছিলাম। [সূরা সাবা: ১০]",
      "পাহাড় ও পাখি তাঁর সাথে সাথে আল্লাহর তাসবীহ বা পবিত্রতা ঘোষণা করত। এই দৃশ্য ছিল মুমিনদের জন্য এক গভীর নিদর্শন।",
      "এছাড়াও আল্লাহ তাঁকে লোহা নরম করার ক্ষমতা দিয়েছিলেন, যা ছিল তাঁর জন্য জীবিকা অর্জনের মাধ্যম। তিনি এই ক্ষমতা ব্যবহার করে যুদ্ধের জন্য নিখুঁত এবং মজবুত বর্ম তৈরি করতেন। এই বর্ম তৈরির মাধ্যমে তিনি তাঁর সময়ের যুদ্ধ কৌশলে নতুনত্ব এনেছিলেন।",
      "**দাউদ (আঃ) সেই লৌহবর্ম তৈরি করে তা মজবুতভাবে বুনতে আল্লাহ তাঁকে নির্দেশ দিলেন:** ",
      "وَقَدِّرْ فِي السَّرْدِ وَاعْمَلُوا صَالِحًا ۖ إِنِّي بِمَا تَعْمَلُونَ بَصِيرٌ",
      "অর্থাৎ, আর বর্মের গাঁথুনিতে পরিমিত রাখবে এবং তোমরা সৎকাজ করো। নিশ্চয়ই আমি তোমাদের কার্যকলাপ দেখি। [সূরা সাবা: ১১]",
      "আল্লাহর দেওয়া এই অলৌকিক শক্তি ব্যবহার করেও দাউদ (আঃ) কখনো অহংকারী হননি, বরং তিনি তাঁর সময়ের শ্রেষ্ঠ ইবাদতকারীদের একজন ছিলেন এবং তাঁর রোজগার ছিল হালাল। তাঁর সুমধুর কণ্ঠস্বর আল্লাহর মহিমা প্রচারের এক মাধ্যম ছিল।"
    ],
    "moral": "আল্লাহর দেওয়া নিয়ামত বা প্রতিভা ইবাদত ও হালাল জীবিকা অর্জনের মাধ্যমে ব্যবহার করা উচিত। সৃষ্টিকুলের সকলেই আল্লাহর ইবাদতে রত, এমনকি জড়বস্তুও।",
    "source": "সূরা সাবা: ১০-১১; সহীহ বুখারী, কিতাবুল আম্বিয়া।"
  },
  {
    "id": "isa-as-mavida",
    "categoryId": "nobider_jibon_theke",
    "title": "ঈসা (আঃ)-এর জন্য আকাশ থেকে খাদ্যভর্তি দস্তরখান (মা-ইদাহ)",
    "paragraphs": [
      "হযরত ঈসা (আঃ) যখন আল্লাহর নির্দেশে বনী ইসরাঈলের কাছে দাওয়াত দিচ্ছিলেন এবং অলৌকিক মু'জিযা দেখাচ্ছিলেন, তখন তাঁর হাওয়ারী বা শিষ্যেরা একসময় তাঁর কাছে এমন এক নিদর্শন চাইল যা তাদের ঈমানকে আরও সুদৃঢ় করবে।",
      "তারা চাইল, আল্লাহ যেন আকাশ থেকে খাবার ভর্তি একটি দস্তরখান (খাবারের টেবিল) নাযিল করেন। হাওয়ারীরা ঈসা (আঃ)-এর কাছে অনুরোধ করে বললেন,",
      "يَا عِيسَى ابْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ",
      "অর্থাৎ, হে মারইয়াম-পুত্র ঈসা! আপনার রব কি পারেন আমাদের জন্য আকাশ থেকে খাদ্যভর্তি দস্তরখান নাযিল করতে? [সূরা মা-ইদাহ: ১১২]",
      "**ঈসা (আঃ) তাদের এই চাওয়া শুনে বললেন:** ",
      "তোমরা আল্লাহকে ভয় করো, যদি তোমরা মুমিন হয়ে থাকো।",
      "কিন্তু হাওয়ারীরা জোর দিয়ে বললেন যে, তারা এটা চায় যেন তারা নিজেরা তা থেকে আহার করতে পারে, তাদের অন্তর প্রশান্ত হয় এবং তারা যেন নিশ্চিত হতে পারে যে ঈসা (আঃ) তাদের কাছে সত্যই বলেছেন।",
      "**ঈসা (আঃ) তখন আল্লাহর কাছে দোয়া করলেন:** ",
      "اللَّهُمَّ رَبَّنَا أَنزِلْ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ ۖ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ",
      "অর্থাৎ, হে আল্লাহ, আমাদের রব! আমাদের জন্য আকাশ থেকে খাদ্যভর্তি দস্তরখান নাযিল করুন, যা আমাদের এবং আমাদের পূর্ববর্তী ও পরবর্তী সকলের জন্য উৎসব হবে এবং আপনার পক্ষ থেকে এক নিদর্শন হবে। আর আমাদের রিযিক দান করুন, আর আপনিই তো শ্রেষ্ঠ রিযিকদাতা। [সূরা মা-ইদাহ: ১১৪]",
      "আল্লাহ তাদের দোয়া কবুল করলেন এবং সতর্ক করে দিলেন যে, এরপরও যারা কুফরী করবে, তাদের এমন শাস্তি দেওয়া হবে যা বিশ্বের কাউকে দেওয়া হয়নি। এরপর আকাশ থেকে সেই খাদ্যভর্তি দস্তরখান নাযিল হলো, যা থেকে সকলে তৃপ্তিসহকারে আহার করলেন।"
    ],
    "moral": "আল্লাহর কুদরত সকল মানুষের চাহিদা ও সন্দেহ দূর করার জন্য যথেষ্ট। আল্লাহর কাছে অলৌকিক কিছু চাওয়ার আগে মুমিনের উচিত আল্লাহর প্রতি পূর্ণ আস্থা রাখা।",
    "source": "সূরা মা-ইদাহ: ১১২-১১৫।"
  },
  {
    "id": "shuaib-as-dhirjyo-o-faysala",
    "categoryId": "nobider_jibon_theke",
    "title": "শুআইব (আঃ)-এর দীর্ঘ দাওয়াত ও কওমের চূড়ান্ত ধ্বংস",
    "paragraphs": [
      "হযরত শুআইব (আঃ) তাঁর কওম মাদইয়ানবাসীদের কাছে আল্লাহর একত্ববাদের দাওয়াত দেন। এই কওমের মানুষেরা মূর্তি পূজার পাশাপাশি ওজনে ও মাপে চরম কারচুপি করে জনগণের অধিকার নষ্ট করত। তারা শুআইব (আঃ)-কে দেখে উপহাস করত এবং তাঁকে দুর্বল মনে করত।",
      "**শুআইব (আঃ) তাদের কাছে দীর্ঘ সময় ধরে দাওয়াত দিতে থাকলেন এবং তাদের অসৎ কাজ থেকে বিরত থাকতে বললেন:** ",
      "হে আমার কওম! তোমরা আল্লাহর ইবাদত করো, তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। আর তোমরা মাপ ও ওজনে কম দিও না। আমি তোমাদের মঙ্গলের মধ্যে দেখতে পাচ্ছি, কিন্তু আমি তোমাদের জন্য এক বেষ্টনকারী দিনের শাস্তির আশঙ্কা করি।",
      "কিন্তু মাদইয়ানবাসীরা তাদের নবীর কথা শুনল না। তারা দাম্ভিকতার সাথে শুআইব (আঃ)-কে বলল যে, তারা তাদের ধন-সম্পদের বিষয়ে যা ইচ্ছা তাই করবে, এতে তাঁর কিছু বলার নেই। তারা তাঁকে হুমকি দিয়ে বলল:",
      "হে শুআইব! তোমার নামায কি তোমাকে এই নির্দেশ দেয় যে, আমরা আমাদের পিতৃপুরুষদের উপাস্যদের পরিত্যাগ করি? আর যদি তুমি বিরত না হও, তবে আমরা তোমাকে এবং যারা তোমার প্রতি ঈমান এনেছে, তাদের অবশ্যই পাথর মেরে হত্যা করব।",
      "**শুআইব (আঃ) তখন বললেন:** ",
      "হে আমার কওম! তোমরা কি আমার বংশের কারণে আমাকে ভয় করছো, অথচ আল্লাহর আদেশকে তোমরা পেছনে ফেলে দিচ্ছো? তোমরা যা করছো, নিশ্চয়ই আমার রব তা বেষ্টন করে রেখেছেন।",
      "যখন তাদের সীমালঙ্ঘন চরমে পৌঁছাল, তখন আল্লাহ তা'আলা তাদের ওপর আযাব নাযিল করার সিদ্ধান্ত নিলেন। একসময় আল্লাহ তাদের ওপর প্রচণ্ড গরম এবং এরপর এক বিকট শব্দ ও ভূমিকম্প দিলেন।",
      "সেই বিকট শব্দের কারণে কাফিররা ভীত হয়ে নিজ নিজ ঘরে উপুড় হয়ে মরে রইল। আল্লাহ সেই জনপদকে সম্পূর্ণরূপে ধ্বংস করে দিলেন। একমাত্র হযরত শুআইব (আঃ) এবং যারা তাঁর ওপর ঈমান এনেছিলেন, তারা আল্লাহর রহমতে রক্ষা পেলেন।"
    ],
    "moral": "সামাজিক দুর্নীতি, যেমন ওজনে কারচুপি ও মানুষের অধিকার নষ্ট করা—আল্লাহর ইবাদতের পাশাপাশি এগুলোও গুরুতর অপরাধ। একজন দাঈ-কে সকল প্রকার হুমকির মুখেও আল্লাহর পথে অবিচল থাকতে হয়।",
    "source": "সূরা হূদ: ৮৪-৯৫; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "muhammad-rasulullah-as-khan-dakhe",
    "categoryId": "nobider_jibon_theke",
    "title": "রাসূল (সাঃ)-এর খাবার থেকে বিষের প্রভাব ও ক্ষমা",
    "paragraphs": [
      "খায়বারের যুদ্ধের পর এক ইহুদি নারী রাসূল (সাঃ)-কে পরীক্ষা করার জন্য একটি বিষ মেশানো ভেড়ার মাংস হাদিয়া হিসেবে পাঠায়। বিষ মেশানো সত্ত্বেও, রাসূল (সাঃ) ও তাঁর সাহাবীগণ সেই মাংস খেতে শুরু করেন।",
      "রাসূল (সাঃ) মাংসের একটি টুকরা মুখে দেওয়ার সাথে সাথেই তাঁর মনে হলো যে মাংসটি বিষাক্ত। তিনি সাথে সাথেই তা ফেলে দিলেন এবং সাহাবীদের বললেন:",
      "তোমরা কেউ এই মাংস খেয়ো না, এই মাংসে বিষ মেশানো হয়েছে!",
      "কিন্তু তাঁর একজন সাহাবী (বিশর ইবনে বারা) ততক্ষণে কিছুটা মাংস গিলে ফেলেছিলেন। বিষের প্রভাবে তিনি সেখানেই শাহাদাৎ বরণ করলেন। রাসূল (সাঃ)-এর অলৌকিক ক্ষমতা ও আল্লাহর বিশেষ নিরাপত্তার কারণে বিষ তাঁর শরীরে মারাত্মক প্রভাব ফেলতে পারেনি, যদিও এর প্রভাব তাঁর ইন্তেকাল পর্যন্ত পরিলক্ষিত হয়েছিল।",
      "**এরপর সেই ইহুদি নারীকে ধরে আনা হলো এবং রাসূল (সাঃ) তাকে জিজ্ঞেস করলেন:** ",
      "তুমি কেন এই কাজ করেছো?",
      "**নারীটি জবাব দিল:** ",
      "আমি আপনাকে পরীক্ষা করতে চেয়েছিলাম। যদি আপনি সত্যিই আল্লাহর নবী হন, তবে আল্লাহ আপনাকে রক্ষা করবেন। আর যদি আপনি শুধু একজন রাজা হন, তবে আমরা আপনার কাছ থেকে মুক্তি পাবো।",
      "এই ঘটনার পর সাহাবীগণ চাইলেন যে সেই নারীকে শাস্তি দেওয়া হোক। কিন্তু রাসূল (সাঃ) যিনি ছিলেন রহমাতুল্লিল আলামীন (জগতের জন্য রহমত), তিনি সেই নারীকে ক্ষমা করে দিলেন। তবে, বিশর ইবনে বারা (রাঃ)-এর শাহাদাতের কারণে কিসাস হিসেবে নারীর শাস্তি হয়েছিল বলেও অন্য বর্ণনায় পাওয়া যায়।",
      "এই ঘটনা প্রমাণ করে যে, আল্লাহ তাঁর রাসূলকে অলৌকিকভাবে রক্ষা করেছিলেন, কিন্তু তাঁর দয়ার কারণে তিনি তাঁর শত্রুকেও ক্ষমা করে দিতে পারতেন।"
    ],
    "moral": "আল্লাহ তাঁর নবীদেরকে শত্রুর চক্রান্ত থেকে রক্ষা করেন। একজন আদর্শ নেতার উচিত ব্যক্তিগত প্রতিশোধের পরিবর্তে ক্ষমা ও দূরদর্শিতার পথ অবলম্বন করা।",
    "source": "সহীহ বুখারী, কিতাবুল মাগাজী (খায়বার যুদ্ধ); সুনান আবূ দাউদ।"
  }
]