[
  {
    "id": "nabi_adam_as",
    "categoryId": "nobider_jiboni",
    "title": "আদম (আঃ) - প্রথম মানব ও প্রথম নবী",
    "paragraphs": [
      "হযরত আদম (আঃ) ছিলেন প্রথম মানব এবং প্রথম নবী। আল্লাহ তা'আলা তাঁকে নিজ হাতে সৃষ্টি করেছেন এবং তাঁর মধ্যে রূহ ফুঁকে দিয়েছেন। তাঁর সৃষ্টির মাধ্যমে পৃথিবীতে মানব জাতির সূচনা হয়।",
      "**সৃষ্টির পূর্বে ফেরেশতাদের সাথে আলোচনা:** আল্লাহ যখন ফেরেশতাদের জানালেন যে তিনি পৃথিবীতে খলিফা (প্রতিনিধি) সৃষ্টি করবেন, তখন ফেরেশতারা বললেন: **'আপনি কি এমন কাউকে সৃষ্টি করবেন যে সেখানে ফাসাদ করবে এবং রক্তপাত ঘটাবে? অথচ আমরা আপনার প্রশংসা ও পবিত্রতা ঘোষণা করছি।'** আল্লাহ বললেন: **'আমি যা জানি তোমরা তা জানো না।'** [সূরা বাকারা: ৩০]। ফেরেশতারা মানুষের ভবিষ্যৎ সম্পর্কে জানতেন না, কিন্তু আল্লাহ জানতেন যে মানুষের মধ্যে নবী, রাসূল, শহীদ এবং সৎকর্মশীল বান্দা থাকবে।",
      "**মাটি থেকে সৃষ্টি:** আল্লাহ তা'আলা পৃথিবীর বিভিন্ন স্থান থেকে মাটি সংগ্রহ করলেন - লাল, সাদা, কালো, নরম, শক্ত - বিভিন্ন ধরনের। এজন্য মানুষের রং ও স্বভাব বিভিন্ন হয়। এই মাটি দিয়ে আদম (আঃ) এর দেহ তৈরি করা হলো। প্রথমে মাটি, তারপর কাদা, তারপর শুকনো ঠনঠনে মাটি। চল্লিশ দিন এই দেহ পড়ে রইল। ইবলিস এসে দেখল এবং ভাবল: এটা ফাঁপা, দুর্বল। আমি এর উপর প্রভাব বিস্তার করতে পারব।",
      "**রূহ ফুঁকে দেওয়া:** আল্লাহ আদম (আঃ) এর দেহে রূহ ফুঁকে দিলেন। রূহ প্রথমে মাথায় প্রবেশ করল। চোখ খুলে গেল, চারদিক দেখতে পেলেন। নাকে প্রবেশ করলে হাঁচি এলো। আদম (আঃ) বললেন: **'আলহামদুলিল্লাহ'** (সমস্ত প্রশংসা আল্লাহর জন্য)। আল্লাহ বললেন: **'ইয়ারহামুকাল্লাহ'** (আল্লাহ তোমার প্রতি রহম করুন)। এভাবে প্রথম কথা ছিল আল্লাহর প্রশংসা। রূহ যখন পেটে পৌঁছল, ক্ষুধা অনুভব করলেন। পায়ে পৌঁছার আগেই উঠে দাঁড়াতে চাইলেন। এজন্য আল্লাহ বলেন: **'মানুষ সৃষ্টি করা হয়েছে তাড়াহুড়া করার জন্য।'** [সূরা আম্বিয়া: ৩৭]",
      "**ফেরেশতাদের সিজদা:** আদম (আঃ) সম্পূর্ণ হওয়ার পর আল্লাহ সকল ফেরেশতাকে আদেশ দিলেন: **'আদমকে সিজদা করো।'** এটি ছিল সম্মানসূচক সিজদা, ইবাদতের সিজদা নয়। সকল ফেরেশতা সিজদা করলেন। কিন্তু ইবলিস অস্বীকার করল। সে ছিল জিন জাতির, ফেরেশতাদের সাথে ইবাদত করত। আল্লাহ জিজ্ঞাসা করলেন: **'কিসে তোমাকে বাধা দিল?'** ইবলিস বলল: **'আমি তার চেয়ে উত্তম। আপনি আমাকে আগুন থেকে সৃষ্টি করেছেন আর তাকে মাটি থেকে।'** [সূরা আরাফ: ১২]। এটি ছিল প্রথম অহংকার এবং প্রথম পাপ। আল্লাহ তাকে বললেন: **'নেমে যাও এখান থেকে। এখানে অহংকার করার অধিকার তোমার নেই।'** [সূরা আরাফ: ১৩]",
      "**জ্ঞান শিক্ষা দেওয়া:** আল্লাহ আদম (আঃ)-কে সকল জিনিসের নাম শিখিয়ে দিলেন। তারপর ফেরেশতাদের বললেন: **'এগুলোর নাম বলো যদি তোমরা সত্যবাদী হও।'** ফেরেশতারা বললেন: **'সুবহানাকা! আপনি আমাদের যা শিখিয়েছেন তা ছাড়া আমাদের কোনো জ্ঞান নেই।'** তারপর আল্লাহ আদম (আঃ)-কে বললেন: **'তুমি তাদের নাম বলে দাও।'** আদম (আঃ) সব নাম বললেন। আল্লাহ ফেরেশতাদের বললেন: **'আমি কি তোমাদের বলিনি যে আমি আসমান ও জমিনের গায়েব জানি?'** [সূরা বাকারা: ৩১-৩৩]। এভাবে প্রমাণিত হলো মানুষের শ্রেষ্ঠত্ব - জ্ঞান অর্জনের ক্ষমতা।",
      "**হাওয়া (আঃ) এর সৃষ্টি:** আদম (আঃ) জান্নাতে একা ছিলেন। একদিন ঘুম থেকে উঠে দেখলেন পাশে এক নারী বসে আছেন। আল্লাহ আদমের বাম পাঁজরের হাড় থেকে হাওয়া (আঃ)-কে সৃষ্টি করেছেন। আদম (আঃ) জিজ্ঞাসা করলেন: **'তুমি কে?'** হাওয়া (আঃ) বললেন: **'আমি নারী।'** আদম (আঃ): **'কেন সৃষ্টি করা হয়েছে?'** হাওয়া (আঃ): **'যাতে তুমি আমার কাছে শান্তি পাও।'** [সহীহ বুখারী]। ফেরেশতারা জিজ্ঞাসা করলেন: **'এর নাম কী?'** আদম (আঃ) বললেন: **'হাওয়া।'** কারণ তিনি জীবিত (হাই) থেকে সৃষ্টি হয়েছেন।",
      "**জান্নাতে জীবন:** আল্লাহ আদম ও হাওয়াকে জান্নাতে বসবাস করতে দিলেন। বললেন: **'তোমরা দুজন জান্নাতে বসবাস করো এবং যেখান থেকে ইচ্ছা খাও। কিন্তু এই গাছের কাছে যেও না, তাহলে জালিমদের অন্তর্ভুক্ত হবে।'** [সূরা বাকারা: ৩৫]। কোন গাছ ছিল তা নিয়ে মতভেদ আছে - কেউ বলেন গম, কেউ বলেন আঙুর, কেউ বলেন ডুমুর। মূল বিষয় হলো আল্লাহর নিষেধাজ্ঞা। জান্নাতে তাঁরা সুখে শান্তিতে ছিলেন। কোনো কষ্ট, ক্ষুধা, তৃষ্ণা, গরম, ঠান্ডা ছিল না।",
      "**শয়তানের ধোঁকা:** ইবলিস (শয়তান) তাদের জান্নাত থেকে বের করার সুযোগ খুঁজছিল। সে তাদের কাছে এসে বলল: **'তোমাদের রব কি এই গাছ থেকে নিষেধ করেছেন শুধু এজন্য যে তোমরা ফেরেশতা হয়ে যাবে অথবা চিরকাল থাকবে?'** সে কসম খেয়ে বলল: **'আমি তোমাদের শুভাকাঙ্ক্ষী।'** [সূরা আরাফ: ২০-২১]। শয়তান তাদের বোঝাল যে এই গাছের ফল খেলে তারা অমর হবে এবং ফেরেশতাদের মতো হবে। আদম ও হাওয়া (আঃ) ভুলে গেলেন এবং সেই গাছের ফল খেয়ে ফেললেন। সাথে সাথে তাঁদের লজ্জাস্থান খুলে গেল। তাঁরা জান্নাতের পাতা দিয়ে নিজেদের ঢাকতে লাগলেন।",
      "**তওবা ও ক্ষমা:** আল্লাহ ডাকলেন: **'আমি কি তোমাদের এই গাছ থেকে নিষেধ করিনি?'** তাঁরা বুঝতে পারলেন ভুল হয়েছে। সাথে সাথে তওবা করলেন: **'হে আমাদের রব! আমরা নিজেদের উপর জুলুম করেছি। যদি আপনি আমাদের ক্ষমা না করেন এবং রহম না করেন তাহলে আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব।'** [সূরা আরাফ: ২৩]। আল্লাহ তাঁদের তওবা কবুল করলেন। কিন্তু বললেন: **'তোমরা সবাই নেমে যাও। তোমরা একে অপরের শত্রু। পৃথিবীতে তোমাদের জন্য নির্দিষ্ট সময় পর্যন্ত বসবাস ও ভোগ করার ব্যবস্থা আছে।'** [সূরা বাকারা: ৩৬]",
      "**পৃথিবীতে অবতরণ:** আদম (আঃ) ভারতের সিলন (শ্রীলংকা) এ এবং হাওয়া (আঃ) জেদ্দায় অবতরণ করেন। দীর্ঘদিন পর আরাফাতের ময়দানে তাঁদের পুনর্মিলন হয়। এজন্য স্থানটির নাম 'আরাফাত' (পরিচয়)। তাঁরা পৃথিবীতে জীবন শুরু করলেন। চাষাবাদ, খাদ্য সংগ্রহ, বাসস্থান নির্মাণ - সব শিখলেন। আল্লাহ তাঁদের শিখিয়ে দিলেন। আদম (আঃ) ছিলেন প্রথম নবী। তিনি তাঁর সন্তানদের এক আল্লাহর ইবাদত শেখাতেন।",
      "**সন্তান-সন্ততি:** হাওয়া (আঃ) থেকে অনেক সন্তান জন্ম নেয়। প্রতিবার যমজ - একজন ছেলে ও একজন মেয়ে। প্রথম যমজ ছিল কাবিল (কেইন) ও তার বোন। দ্বিতীয় যমজ ছিল হাবিল (আবেল) ও তার বোন। সেই সময় নিয়ম ছিল এক যমজের ছেলে অন্য যমজের মেয়েকে বিয়ে করবে। কিন্তু কাবিলের সাথে যে বোন জন্মেছিল সে ছিল সুন্দরী। কাবিল তাকে নিজেই বিয়ে করতে চাইল। আদম (আঃ) বললেন: এটা হারাম। কিন্তু কাবিল মানল না।",
      "**প্রথম কুরবানী ও হত্যা:** আদম (আঃ) বললেন: তোমরা উভয়ে কুরবানী করো। যার কুরবানী কবুল হবে সে-ই সুন্দরী মেয়েটিকে বিয়ে করবে। হাবিল ছিল রাখাল। সে তার সবচেয়ে ভালো ভেড়া কুরবানী দিল। কাবিল ছিল কৃষক। সে খারাপ ফসল কুরবানী দিল। আকাশ থেকে আগুন এসে হাবিলের কুরবানী গ্রহণ করল। কাবিলের কুরবানী পড়ে রইল। কাবিল রাগে জ্বলে উঠল। বলল: **'আমি তোমাকে হত্যা করব।'** হাবিল বলল: **'আল্লাহ মুত্তাকীদের কুরবানী কবুল করেন। তুমি যদি আমাকে হত্যা করতে হাত বাড়াও, আমি তোমাকে হত্যা করতে হাত বাড়াব না। আমি আল্লাহকে ভয় করি।'** [সূরা মায়িদা: ২৭-২৮]। কিন্তু কাবিল শুনল না। সে হাবিলকে পাথর দিয়ে মাথায় আঘাত করে হত্যা করল। এটি ছিল পৃথিবীর প্রথম হত্যাকাণ্ড।",
      "**লাশ কবর দেওয়া:** হাবিলের লাশ পড়ে রইল। কাবিল বুঝতে পারল না কী করবে। আল্লাহ একটি কাক পাঠালেন। কাকটি মাটি খুঁড়ে অন্য একটি মৃত কাক কবর দিল। কাবিল বলল: **'হায়! আমি কি এই কাকের মতোও হতে পারলাম না যে আমার ভাইয়ের লাশ কবর দিতে পারি?'** [সূরা মায়িদা: ৩১]। সে মাটি খুঁড়ে হাবিলকে কবর দিল। এভাবে মানুষ কবর দেওয়া শিখল।",
      "**আদম (আঃ) এর শোক:** আদম (আঃ) যখন জানলেন, অত্যন্ত দুঃখিত হলেন। একজন ছেলে মারা গেছে, অন্যজন খুনি হয়ে গেছে। তিনি আল্লাহর কাছে কাঁদলেন। আল্লাহ তাঁকে সান্ত্বনা দিলেন এবং আরেক ছেলে দান করলেন - শীস (আঃ)। শীস (আঃ) ছিলেন নেককার এবং পরবর্তীতে নবী হয়েছিলেন। আদম (আঃ) তাঁকে সব জ্ঞান শিখিয়ে দিলেন।",
      "**দীর্ঘ জীবন ও ইন্তেকাল:** আদম (আঃ) ৯৬০ বছর (মতান্তরে ১০০০ বছর) জীবিত ছিলেন। তিনি তাঁর সন্তান-সন্ততিদের তাওহীদ, নামাজ, এবং সৎকর্মের শিক্ষা দিয়েছেন। মৃত্যুর সময় ফেরেশতারা এসেছিলেন। তাঁর সন্তানরা কাঁদছিল। ফেরেশতারা বললেন: **'এটাই মৃত্যু। তোমাদের সবাইকে এই পথ অতিক্রম করতে হবে।'** আদম (আঃ) ইন্তেকাল করলেন। ফেরেশতারা তাঁকে গোসল দিলেন, কাফন পরালেন, জানাযা পড়লেন এবং কবর দিলেন। এভাবে মানুষ জানাযার নিয়ম শিখল। তাঁকে মক্কার কাছে 'গারে আবু কুবাইস' এ দাফন করা হয় বলে কথিত আছে।"
    ],
    "moral": "আদম (আঃ) এর জীবন থেকে শিক্ষা: মানুষ আল্লাহর খলিফা, জ্ঞানের অধিকারী এবং শয়তানের শত্রু। ভুল হলে তওবা করা এবং আল্লাহর আনুগত্যে ফিরে আসাই মুক্তির পথ।",
    "source": "সূরা বাকারা: ৩০-৩৯; সূরা আরাফ: ১১-২৫; সূরা মায়িদা: ২৭-৩১; সহীহ বুখারী; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_idris_as",
    "categoryId": "nobider_jiboni",
    "title": "ইদরিস (আঃ) - সত্যবাদী নবী",
    "paragraphs": [
      "হযরত ইদরিস (আঃ) ছিলেন আদম (আঃ) এর পরে তৃতীয় নবী এবং শীস (আঃ) এর পৌত্র। তিনি ছিলেন অত্যন্ত সত্যবাদী এবং ধৈর্যশীল। আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেছেন।",
      "**বংশ ও জন্ম:** ইদরিস (আঃ) এর পূর্ণ নাম ছিল ইদরিস ইবনে ইয়ারিদ ইবনে মাহলাইল। তিনি আদম (আঃ) এর পঞ্চম অথবা ষষ্ঠ বংশধর ছিলেন। তাঁর জন্ম হয়েছিল আদম (আঃ) এর ইন্তেকালের পরে। তিনি জন্মগ্রহণ করেন বাবেল (বর্তমান ইরাক) অঞ্চলে।",
      "**নাম 'ইদরিস' এর অর্থ:** 'ইদরিস' শব্দটি এসেছে 'দারাসা' থেকে যার অর্থ অধ্যয়ন করা। তাঁকে এই নাম দেওয়া হয়েছিল কারণ তিনি অত্যধিক ইলম অর্জন করতেন এবং আল্লাহর কিতাব গভীরভাবে অধ্যয়ন করতেন। তিনি ছিলেন জ্ঞানী এবং প্রজ্ঞাবান।",
      "**কুরআনে প্রশংসা:** আল্লাহ তায়ালা কুরআনে ইদরিস (আঃ) এর প্রশংসা করে বলেন:",
      "وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ ۚ إِنَّهُ كَانَ صِدِّيقًا نَّبِيًّا",
      "এই কিতাবে ইদরিসের কথা স্মরণ করুন। নিশ্চয়ই তিনি ছিলেন সত্যবাদী, নবী। [সূরা মারইয়াম: ৫৬]",
      "وَرَفَعْنَاهُ مَكَانًا عَلِيًّا",
      "এবং আমি তাঁকে উচ্চ মর্যাদায় উন্নীত করেছি। [সূরা মারইয়াম: ৫৭]",
      "**নবুয়ত ও দাওয়াত:** ইদরিস (আঃ) নবুয়ত প্রাপ্ত হন যখন মানুষ আল্লাহর পথ থেকে বিচ্যুত হতে শুরু করেছিল। তিনি মানুষকে এক আল্লাহর ইবাদতের দিকে ডাকতেন এবং শিরক থেকে বিরত থাকতে বলতেন। তিনি মানুষকে সততা, ন্যায়পরায়ণতা এবং সৎকর্মের শিক্ষা দিতেন।",
      "**প্রথম লেখক:** ইদরিস (আঃ) ছিলেন প্রথম মানুষ যিনি কলম দিয়ে লিখতেন। তিনি জ্ঞান-বিজ্ঞান লিখে রাখতেন যাতে পরবর্তী প্রজন্ম তা থেকে উপকৃত হতে পারে। তিনি জ্যোতির্বিদ্যা, গণিত এবং চিকিৎসা বিজ্ঞান সম্পর্কে জ্ঞান রাখতেন।",
      "**সেলাই শিল্প:** ইদরিস (আঃ) প্রথম সুই-সুতা দিয়ে কাপড় সেলাই করা শিখিয়েছিলেন। এর আগে মানুষ পশুর চামড়া বা পাতা দিয়ে শরীর ঢাকত। তিনি মানুষকে কাপড় বুনতে এবং সেলাই করতে শেখান।",
      "**ইবাদত ও তাকওয়া:** ইদরিস (আঃ) ছিলেন অত্যন্ত ইবাদতগুজার। তিনি দিনে রোজা রাখতেন এবং রাতে নামাজ পড়তেন। তাঁর জীবন ছিল সাদাসিধা এবং দুনিয়াবিমুখ। তিনি সবসময় আল্লাহর জিকিরে মশগুল থাকতেন।",
      "**উচ্চ মর্যাদায় উন্নীত:** আল্লাহ তায়ালা ইদরিস (আঃ) কে উচ্চ মর্যাদায় উন্নীত করেছেন। অনেক মুফাসসির বলেন যে আল্লাহ তাঁকে জীবিত অবস্থায় আসমানে উঠিয়ে নিয়েছেন। তিনি চতুর্থ আকাশে আছেন বলে হাদিসে উল্লেখ আছে।",
      "মিরাজের রাতে রাসূল (সাঃ) চতুর্থ আকাশে ইদরিস (আঃ) এর সাথে সাক্ষাত করেন। ইদরিস (আঃ) তাঁকে স্বাগত জানান এবং বলেন: 'মারহাবা বিন নাবিয়্যিস সালিহ ওয়াল আখিস সালিহ' (স্বাগতম সৎ নবী ও সৎ ভাই)। [সহীহ বুখারী: ৩৪৩০]",
      "**মৃত্যু নাকি জীবিত:** ইদরিস (আঃ) এর মৃত্যু সম্পর্কে মতভেদ আছে। কেউ বলেন তিনি মারা গেছেন এবং তাঁর রূহ চতুর্থ আকাশে। কেউ বলেন তিনি ঈসা (আঃ) এর মতো জীবিত অবস্থায় আসমানে উঠিয়ে নেওয়া হয়েছে। আল্লাহই ভালো জানেন।",
      "**উম্মত ও অনুসারী:** ইদরিস (আঃ) এর দাওয়াতে অনেক মানুষ ঈমান আনে এবং তাঁর অনুসরণ করে। তিনি তাঁর উম্মতকে তাওহীদ, নামাজ, রোজা এবং সৎকর্মের শিক্ষা দেন। তাঁর সময়ে মানুষ সততা এবং ন্যায়পরায়ণতার সাথে জীবন যাপন করত।",
      "**জীবনকাল:** ইদরিস (আঃ) প্রায় ৩৬৫ বছর পৃথিবীতে ছিলেন (কিছু বর্ণনা মতে)। তারপর আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেন। তাঁর জীবন ছিল ইবাদত, জ্ঞান এবং দাওয়াতে পূর্ণ।"
    ],
    "moral": "ইদরিস (আঃ) এর জীবন থেকে শিক্ষা: সত্যবাদিতা, জ্ঞান অর্জন এবং ইবাদতে নিমগ্ন থাকা মানুষকে উচ্চ মর্যাদায় পৌঁছে দেয়।",
    "source": "সূরা মারইয়াম: ৫৬-৫৭; সহীহ বুখারী: ৩৪৩০; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"
  },
  {
    "id": "nabi_nuh_as",
    "categoryId": "nobider_jiboni",
    "title": "নূহ (আঃ) - মহাপ্লাবনের নবী",
    "paragraphs": [
      "হযরত নূহ (আঃ) ছিলেন আদম (আঃ) এর দশম বংশধর এবং মহাপ্লাবনের নবী। তিনি ৯৫০ বছর তাঁর জাতিকে দাওয়াত দিয়েছেন কিন্তু খুব কম মানুষ ঈমান এনেছে। আল্লাহ তাঁর দোয়ায় কাফিরদের ধ্বংস করেন এবং মুমিনদের রক্ষা করেন। তিনি 'উলুল আজম' পাঁচ নবীর একজন।",
      "**বংশ ও শিরকের সূচনা:** নূহ (আঃ) এর পূর্ণ নাম ছিল নূহ ইবনে লামাক ইবনে মাতুশালাহ। তিনি আদম (আঃ) এর দশম বংশধর এবং ইদরিস (আঃ) এর পৌত্র ছিলেন। তিনি জন্মগ্রহণ করেন ইরাক অঞ্চলে। তাঁর জন্মের সময় পৃথিবীতে শিরক ও পাপাচার ব্যাপক হয়ে গিয়েছিল। আদম (আঃ) এর সময়ে পাঁচজন নেককার মানুষ ছিলেন - ওয়াদ, সুওয়া, ইয়াগুস, ইয়াউক এবং নাসর। তাঁরা মারা গেলে শয়তান মানুষকে বলল: 'তাদের স্মৃতি রক্ষার জন্য মূর্তি বানাও।' প্রথমে শুধু স্মৃতি রক্ষার জন্য মূর্তি বানানো হলো। কিন্তু পরবর্তী প্রজন্ম ভুলে গেল এবং মূর্তির পূজা শুরু করল। এভাবে শিরক শুরু হয়। [সহীহ বুখারী: ৪৯২০]",
      "**নবুয়ত ও দাওয়াতের পদ্ধতি:** যখন শিরক ও পাপাচার চরম পর্যায়ে পৌঁছল, আল্লাহ নূহ (আঃ) কে নবী হিসেবে পাঠালেন। তিনি তখন ৪০ বছর বয়সী ছিলেন। নূহ (আঃ) তাঁর জাতিকে দিন-রাত দাওয়াত দিতে লাগলেন - প্রকাশ্যে এবং গোপনে, দিনে এবং রাতে, ব্যক্তিগতভাবে এবং জনসমাবেশে। কুরআনে নূহ (আঃ) বলেন:\n\nإِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا ۝ ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا ۝ ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا\n\nআমি আমার জাতিকে দিন-রাত দাওয়াত দিয়েছি। তারপর আমি তাদের প্রকাশ্যে দাওয়াত দিয়েছি। তারপর আমি তাদের প্রকাশ্যেও বলেছি এবং গোপনেও বলেছি। [সূরা নূহ: ৫, ৮-৯]\n\nতিনি বললেন: 'হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। তোমরা তোমাদের রবের কাছে ক্ষমা চাও। তিনি তোমাদের উপর প্রচুর বৃষ্টি পাঠাবেন, সম্পদ ও সন্তান দিয়ে সাহায্য করবেন।' [সূরা নূহ: ১০-১২]",
      "**জাতির প্রতিক্রিয়া ও ৯৫০ বছর ধৈর্য:** কিন্তু তাঁর জাতি তাঁকে প্রত্যাখ্যান করল। তারা কান বন্ধ করে রাখত, কাপড় দিয়ে মুখ ঢেকে নিত এবং অহংকার করত। তারা বলল:\n\nوَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا\n\nতোমরা তোমাদের দেবতাদের ছেড়ো না - ওয়াদ, সুওয়া, ইয়াগুস, ইয়াউক এবং নাসরকে ছেড়ো না। [সূরা নূহ: ২৩]\n\nনূহ (আঃ) ৯৫০ বছর ধৈর্যের সাথে দাওয়াত দিয়েছেন। কুরআনে বলা হয়েছে:\n\nوَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا\n\nআমি নূহকে তার জাতির কাছে পাঠিয়েছিলাম। সে তাদের মধ্যে পঞ্চাশ কম এক হাজার বছর অবস্থান করেছে। [সূরা আনকাবুত: ১৪]\n\nএই দীর্ঘ সময়ে খুব কম মানুষ ঈমান এনেছে - মাত্র ৮০ জন (কিছু বর্ণনা মতে)। তাঁর তিন ছেলে - সাম, হাম এবং ইয়াফিস - ঈমান এনেছিল। কিন্তু চতুর্থ ছেলে কেনআন এবং স্ত্রী ওয়ালিআহ ছিল কাফির।",
      "**নূহ (আঃ) এর দোয়া ও নৌকা তৈরির আদেশ:** দীর্ঘ সময় দাওয়াত দেওয়ার পর যখন কেউ ঈমান আনল না, নূহ (আঃ) আল্লাহর কাছে দোয়া করলেন:\n\nرَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا ۝ إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا\n\nহে আমার রব! পৃথিবীতে কাফিরদের একজন বাসিন্দাকেও রেখো না। যদি তুমি তাদের রেখে দাও তারা তোমার বান্দাদের পথভ্রষ্ট করবে এবং শুধু পাপিষ্ঠ কাফির সন্তান জন্ম দেবে। [সূরা নূহ: ২৬-২৭]\n\nআল্লাহ তাঁর দোয়া কবুল করলেন এবং বললেন:\n\nوَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ\n\nআমার তত্ত্বাবধানে এবং আমার ওহী অনুযায়ী নৌকা তৈরি করো। যারা জুলুম করেছে তাদের ব্যাপারে আমার কাছে কিছু বলো না। তারা অবশ্যই ডুবে যাবে। [সূরা হুদ: ৩৭]\n\nনূহ (আঃ) নৌকা তৈরি শুরু করলেন - ৩০০ হাত লম্বা, ৫০ হাত চওড়া এবং ৩০ হাত উঁচু, তিনতলা বিশিষ্ট। কাফিররা তাঁকে দেখে হাসত এবং ঠাট্টা করত। তিনি বললেন: 'তোমরা যদি আমাদের নিয়ে ঠাট্টা করো, আমরাও তোমাদের নিয়ে ঠাট্টা করব।' [সূরা হুদ: ৩৮]",
      "**মহাপ্লাবন ও নৌকায় আরোহণ:** নৌকা তৈরি শেষ হলে একদিন সকালে তন্দুর থেকে পানি উপচে পড়তে লাগল। আকাশ থেকে প্রবল বৃষ্টি শুরু হলো এবং জমিন থেকে ঝর্ণা ফুটতে লাগল:\n\nفَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُّنْهَمِرٍ ۝ وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَىٰ أَمْرٍ قَدْ قُدِرَ\n\nঅতঃপর আমি আকাশের দরজা খুলে দিলাম প্রবল বৃষ্টির পানি দিয়ে। এবং জমিন থেকে ঝর্ণা প্রবাহিত করলাম। তারপর পানি মিলিত হলো এক নির্ধারিত বিষয়ে। [সূরা কামার: ১১-১২]\n\nনূহ (আঃ) সব মুমিন, তাঁর পরিবার এবং প্রতিটি প্রাণীর এক জোড়া করে নৌকায় তুললেন। নৌকায় ওঠার সময় তিনি বললেন:\n\nبِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ إِنَّ رَبِّي لَغَفُورٌ رَّحِيمٌ\n\nআল্লাহর নামে এর চলা এবং থামা। নিশ্চয়ই আমার রব ক্ষমাশীল, দয়ালু। [সূরা হুদ: ৪১]\n\nতাঁর এক ছেলে কেনআন ছিল কাফির। নূহ (আঃ) তাকে ডেকে বললেন: 'হে আমার ছেলে! আমাদের সাথে আরোহণ করো।' কিন্তু সে বলল: 'আমি পাহাড়ে আশ্রয় নেব।' নূহ (আঃ) বললেন: 'আজ আল্লাহর আদেশ থেকে কোনো রক্ষাকারী নেই।' কিন্তু সে শুনল না এবং ঢেউ তাকে ডুবিয়ে দিল। [সূরা হুদ: ৪২-৪৩]",
      "**চল্লিশ দিন বৃষ্টি ও ধ্বংস:** চল্লিশ দিন এবং চল্লিশ রাত প্রবল বৃষ্টি হলো। পানি এত বেড়ে গেল যে সবচেয়ে উঁচু পাহাড়ও ডুবে গেল। নৌকা পাহাড়ের মতো ঢেউয়ের মধ্যে ভাসছিল। [সূরা হুদ: ৪২] সমস্ত পৃথিবী পানিতে ডুবে গেল। সব কাফির ধ্বংস হলো। শুধু নৌকার মুমিনরা রক্ষা পেল। নূহ (আঃ) তাঁর ছেলের জন্য আল্লাহর কাছে দোয়া করলেন। আল্লাহ বললেন:\n\nيَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ\n\nহে নূহ! সে তোমার পরিবারের নয়। সে অসৎকর্মকারী। [সূরা হুদ: ৪৬]\n\nনূহ (আঃ) বুঝলেন যে ঈমান ছাড়া রক্তের সম্পর্ক কোনো কাজে আসে না।",
      "**জুদি পাহাড়ে অবতরণ ও নতুন সূচনা:** বৃষ্টি থামল এবং পানি কমতে শুরু করল। আল্লাহ বললেন:\n\nيَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ\n\nহে পৃথিবী! তোমার পানি গিলে ফেলো। হে আকাশ! থেমে যাও। পানি কমে গেল এবং কাজ শেষ হলো। নৌকা জুদি পাহাড়ে থামল। [সূরা হুদ: ৪৪]\n\nনৌকা জুদি পাহাড়ে (তুরস্কের আরারাত পর্বতে) থামল। নূহ (আঃ) এবং মুমিনরা নৌকা থেকে নামলেন এবং আল্লাহর শুকরিয়া আদায় করলেন। তাঁরা নতুন করে জীবন শুরু করলেন। তাঁর তিন ছেলে - সাম, হাম এবং ইয়াফিস - থেকে পৃথিবীতে মানুষ ছড়িয়ে পড়ল। সাম থেকে আরব ও সেমিটিক জাতি, হাম থেকে আফ্রিকান জাতি এবং ইয়াফিস থেকে ইউরোপীয় জাতি এসেছে।",
      "**মৃত্যু:** নূহ (আঃ) মহাপ্লাবনের পর আরও অনেক বছর জীবিত ছিলেন। তিনি মোট ৯৫০ বছর দাওয়াত দিয়েছেন এবং তারপর ইন্তেকাল করেন। তাঁর মোট বয়স হয়েছিল প্রায় ১০৫০ বছর (কিছু বর্ণনা মতে)। তাঁকে মক্কা অথবা মসজিদুল হারামে দাফন করা হয় বলে কথিত আছে। নূহ (আঃ) ছিলেন 'উলুল আজম' (দৃঢ় সংকল্প) পাঁচ নবীর একজন - নূহ, ইব্রাহিম, মূসা, ঈসা এবং মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)।"
    ],
    "moral": "নূহ (আঃ) এর জীবন থেকে শিক্ষা: দাওয়াতে ধৈর্য, আল্লাহর উপর ভরসা এবং তাঁর আদেশ মান্য করা মুক্তির পথ। কাফিররা যত শক্তিশালীই হোক আল্লাহর শাস্তি থেকে রক্ষা পায় না।",
    "source": "সূরা নূহ; সূরা হুদ: ২৫-৪৯; সূরা আরাফ: ৫৯-৬৪; সূরা কামার: ৯-১৭; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"
  },
  {
    "id": "nabi_hud_as",
    "categoryId": "nobider_jiboni",
    "title": "হুদ (আঃ) - আদ জাতির নবী",
    "paragraphs": [
      "হযরত হুদ (আঃ) ছিলেন আদ জাতির নবী। আদ জাতি ছিল অত্যন্ত শক্তিশালী এবং অহংকারী। তারা বিশাল বিশাল অট্টালিকা নির্মাণ করত এবং নিজেদের শক্তিতে গর্বিত ছিল। কিন্তু তারা আল্লাহর ইবাদত ছেড়ে মূর্তিপূজা শুরু করেছিল।",
      "**বংশ ও আদ জাতি:** হুদ (আঃ) এর পূর্ণ নাম ছিল হুদ ইবনে শালিখ ইবনে আরফাখশাদ। তিনি নূহ (আঃ) এর পৌত্র সাম এর বংশধর ছিলেন। তিনি জন্মগ্রহণ করেন আরব উপদ্বীপের দক্ষিণে ইয়েমেনের আহকাফ অঞ্চলে। আদ জাতি ছিল নূহ (আঃ) এর পরবর্তী প্রজন্ম। তারা ছিল লম্বা, শক্তিশালী এবং সুঠাম দেহের অধিকারী। তাদের দেশ ছিল অত্যন্ত উর্বর এবং সমৃদ্ধ। তারা বিশাল বিশাল প্রাসাদ এবং স্তম্ভ নির্মাণ করত। কুরআনে বলা হয়েছে:\n\nأَتَبْنُونَ بِكُلِّ رِيعٍ آيَةً تَعْبَثُونَ\n\nতোমরা কি প্রতিটি উঁচু স্থানে নিদর্শন নির্মাণ করছ খেলাচ্ছলে? [সূরা শুআরা: ১২৮]\n\nকিন্তু তারা মূর্তিপূজা শুরু করেছিল এবং নিজেদের শক্তিতে অহংকার করত। তারা বলত:\n\nمَنْ أَشَدُّ مِنَّا قُوَّةً\n\nআমাদের চেয়ে শক্তিশালী কে? [সূরা ফুসসিলাত: ১৫]",
      "**দাওয়াত ও জাতির প্রতিক্রিয়া:** আল্লাহ হুদ (আঃ) কে নবী হিসেবে পাঠালেন। তিনি তাঁর জাতিকে বললেন:\n\nيَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۚ أَفَلَا تَتَّقُونَ\n\nহে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। তোমরা কি তাকওয়া অবলম্বন করবে না? [সূরা আরাফ: ৬৫]\n\nতিনি তাদের বললেন মূর্তিপূজা ছাড়তে, অহংকার ত্যাগ করতে এবং দুর্বলদের উপর অত্যাচার বন্ধ করতে। কিন্তু আদ জাতি হুদ (আঃ) কে প্রত্যাখ্যান করল। তারা বলল: 'তুমি কি আমাদের পূর্বপুরুষদের দেবতা ছেড়ে শুধু এক আল্লাহর ইবাদত করতে বলছ?' তারা তাঁকে মিথ্যাবাদী বলল। আল্লাহ তাদের সতর্ক করার জন্য বৃষ্টি বন্ধ করে দিলেন। তিন বছর ধরে বৃষ্টি হলো না। ফসল নষ্ট হলো কিন্তু তারা তবুও তওবা করল না।",
      "**ভয়ংকর ঝড় ও ধ্বংস:** আকাশে কালো মেঘ দেখা দিল। আদ জাতি খুশি হলো ভেবে যে বৃষ্টি আসছে। কিন্তু এটা ছিল ধ্বংসের মেঘ। কুরআনে বলা হয়েছে:\n\nفَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَٰذَا عَارِضٌ مُّمْطِرُنَا ۚ بَلْ هُوَ مَا اسْتَعْجَلْتُم بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ\n\nযখন তারা মেঘকে তাদের উপত্যকার দিকে আসতে দেখল, বলল: এই মেঘ আমাদের বৃষ্টি দেবে। বরং এটা তো তাই যা তোমরা তাড়াতাড়ি চেয়েছিলে - এক বায়ু যাতে রয়েছে যন্ত্রণাদায়ক শাস্তি। [সূরা আহকাফ: ২৪]\n\nভয়ংকর ঝড় শুরু হলো। প্রচণ্ড বাতাস সব কিছু উড়িয়ে নিয়ে যেতে লাগল। সাত রাত এবং আট দিন এই ঝড় চলল:\n\nتُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا\n\nসব কিছু ধ্বংস করে দিচ্ছে তার রবের আদেশে। [সূরা আহকাফ: ২৫]\n\nমানুষ খেজুর গাছের কাণ্ডের মতো উড়ে যেতে লাগল এবং মাটিতে পড়ে মারা যেতে লাগল। তাদের বিশাল প্রাসাদ ধ্বংস হয়ে গেল। হুদ (আঃ) এবং যারা তাঁর সাথে ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন। সব কাফির ধ্বংস হয়ে গেল।",
      "**মৃত্যু:** হুদ (আঃ) হাদরামাউতে বসবাস করেন এবং সেখানে মানুষকে দাওয়াত দিতে থাকেন। তিনি সেখানেই ইন্তেকাল করেন। তাঁর কবর হাদরামাউতে আছে বলে বিশ্বাস করা হয়। আদ জাতির ধ্বংসাবশেষ এখনও ইয়েমেনের আহকাফ অঞ্চলে পাওয়া যায় - বিশাল বিশাল পাথরের স্তম্ভ এবং ধ্বংসপ্রাপ্ত শহর।"
    ],
    "moral": "হুদ (আঃ) এর জীবন থেকে শিক্ষা: অহংকার এবং শিরক ধ্বংসের কারণ। শক্তি ও সম্পদ আল্লাহর শাস্তি থেকে রক্ষা করতে পারে না।",
    "source": "সূরা আরাফ: ৬৫-৭২; সূরা হুদ: ৫০-৬০; সূরা শুআরা: ১২৩-১৪০; সূরা আহকাফ: ২১-২৬; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "nabi_salih_as",
    "categoryId": "nobider_jiboni",
    "title": "সালিহ (আঃ) - সামুদ জাতির নবী",
    "paragraphs": [
      "হযরত সালিহ (আঃ) ছিলেন সামুদ জাতির নবী। সামুদ জাতি পাহাড় কেটে বিশাল বিশাল ঘর তৈরি করত এবং নিজেদের শিল্পকলায় গর্বিত ছিল। কিন্তু তারা আল্লাহর ইবাদত ছেড়ে মূর্তিপূজা শুরু করেছিল।",
      "**বংশ ও সামুদ জাতি:** সালিহ (আঃ) এর পূর্ণ নাম ছিল সালিহ ইবনে উবাইদ ইবনে আসিফ। তিনি সামুদ জাতির মধ্যে জন্মগ্রহণ করেন। সামুদ জাতি ছিল আদ জাতির পরবর্তী প্রজন্ম। তারা বসবাস করত হিজর অঞ্চলে (বর্তমান সৌদি আরবের মাদায়েন সালিহ)। সামুদ জাতি ছিল অত্যন্ত দক্ষ শিল্পী। তারা পাহাড় কেটে সুন্দর সুন্দর ঘর এবং প্রাসাদ তৈরি করত। কুরআনে বলা হয়েছে:\n\nوَتَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا فَارِهِينَ\n\nএবং তোমরা পাহাড় কেটে নিপুণভাবে ঘর তৈরি করছ। [সূরা শুআরা: ১৪৯]\n\nতারা ছিল সমৃদ্ধ এবং শক্তিশালী। কিন্তু তারা আদ জাতির ধ্বংসের শিক্ষা নেয়নি এবং মূর্তিপূজা শুরু করেছিল।",
      "**দাওয়াত ও আল্লাহর উটনী:** সালিহ (আঃ) তাঁর জাতির মধ্যে অত্যন্ত সম্মানিত ছিলেন। আল্লাহ তাঁকে নবী বানালেন। তিনি তাঁর জাতিকে বললেন:\n\nيَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ\n\nহে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। [সূরা আরাফ: ৭৩]\n\nসামুদ জাতি তাঁকে বলল: 'তুমি যদি সত্যিই নবী হও তাহলে আমাদের মুজিজা দেখাও। এই পাহাড় থেকে একটি উটনী বের করে দাও।' সালিহ (আঃ) আল্লাহর কাছে দোয়া করলেন। আল্লাহর কুদরতে পাহাড় ফেটে একটি বিশাল উটনী বের হলো এবং সাথে সাথে একটি বাচ্চা প্রসব করল। সালিহ (আঃ) তাদের বললেন:\n\nهَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ\n\nএই আল্লাহর উটনী তোমাদের জন্য নিদর্শন। তাকে আল্লাহর জমিনে চরতে দাও এবং তাকে কোনো ক্ষতি করো না। [সূরা আরাফ: ৭৩]\n\nএই মুজিজা দেখে কিছু মানুষ ঈমান আনল কিন্তু বেশিরভাগ নেতা কুফরিতে থেকে গেল।",
      "**উটনী হত্যা ও তিন দিনের সতর্কবাণী:** উটনী অনেক দুধ দিত কিন্তু কাফিররা এতে বিরক্ত হলো। নয়জন দুষ্ট নেতা মিলে উটনী হত্যার ষড়যন্ত্র করল। একদিন যখন উটনী পানি পান করতে এলো, কুদার ইবনে সালিফ তরবারি দিয়ে উটনীর পা কেটে দিল এবং তারা উটনীকে হত্যা করল। সালিহ (আঃ) যখন এই খবর শুনলেন, তিনি তাদের বললেন:\n\nتَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ۖ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ\n\nতোমরা তোমাদের ঘরে তিন দিন ভোগ করো। এটি এমন প্রতিশ্রুতি যা মিথ্যা হবে না। [সূরা হুদ: ৬৫]\n\nতিনি বললেন: 'প্রথম দিন তোমাদের চেহারা হলুদ হবে, দ্বিতীয় দিন লাল হবে এবং তৃতীয় দিন কালো হবে। তারপর শাস্তি আসবে।' ঠিক যেমন সালিহ (আঃ) বলেছিলেন তেমনই হলো। তারা বুঝল শাস্তি আসছে কিন্তু তবুও তওবা করল না।",
      "**ভয়ংকর শাস্তি ও ধ্বংস:** চতুর্থ দিন সকালে ভয়ংকর আওয়াজ (সাইহা) এলো। এক প্রচণ্ড শব্দ যা তাদের হৃদয় ফাটিয়ে দিল। কুরআনে বলা হয়েছে:\n\nفَأَخَذَتْهُمُ الصَّيْحَةُ مُصْبِحِينَ\n\nঅতঃপর সকালে তাদের পাকড়াও করল সেই মহানাদ। [সূরা হিজর: ৮৩]\n\nএকই সাথে ভূমিকম্প হলো। সবাই তাদের ঘরে মৃত অবস্থায় পড়ে রইল। সালিহ (আঃ) এবং যারা ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন। তাঁরা সেখান থেকে চলে গেলেন। সালিহ (আঃ) তাদের লাশের দিকে তাকিয়ে বললেন:\n\nيَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّي وَنَصَحْتُ لَكُمْ وَلَٰكِن لَّا تُحِبُّونَ النَّاصِحِينَ\n\nহে আমার জাতি! আমি তোমাদের কাছে আমার রবের বার্তা পৌঁছে দিয়েছি এবং তোমাদের উপদেশ দিয়েছি। কিন্তু তোমরা উপদেশদাতাদের পছন্দ করো না। [সূরা আরাফ: ৭৯]",
      "**মৃত্যু:** সালিহ (আঃ) মক্কায় চলে যান এবং সেখানে বসবাস করেন। তিনি সেখানে ইন্তেকাল করেন। সামুদ জাতির ধ্বংসাবশেষ এখনও সৌদি আরবের মাদায়েন সালিহ (আল-হিজর) এ দেখা যায় - পাহাড় কাটা বিশাল বিশাল ঘর এবং সমাধি। রাসূল (সাঃ) তাবুক যুদ্ধের সময় এই স্থান দিয়ে যাওয়ার সময় সাহাবীদের বলেছিলেন: 'এখানে থেমো না এবং এখানের পানি পান করো না। এটি শাস্তিপ্রাপ্ত জাতির স্থান।'"
    ],
    "moral": "সালিহ (আঃ) এর জীবন থেকে শিক্ষা: আল্লাহর নিদর্শন দেখার পরও অবাধ্যতা করলে কঠিন শাস্তি আসে। মুজিজা দেখেও যারা ঈমান আনে না তারা ধ্বংস হয়।",
    "source": "সূরা আরাফ: ৭৩-৭৯; সূরা হুদ: ৬১-৬৮; সূরা শুআরা: ১৪১-১৫৯; সূরা হিজর: ৮০-৮৪; সহীহ বুখারী: ৩৩৭৯; তাফসীরে ইবনে কাসীর।"
  }
]