[{"id":"nabi_adam_as","categoryId":"nobider_jiboni","title":"আদম (আঃ) - প্রথম মানব ও প্রথম নবী","paragraphs":["হযরত আদম (আঃ) ছিলেন প্রথম মানব এবং প্রথম নবী। আল্লাহ তা'আলা তাঁকে নিজ হাতে সৃষ্টি করেছেন এবং তাঁর মধ্যে রূহ ফুঁকে দিয়েছেন। তাঁর সৃষ্টির মাধ্যমে পৃথিবীতে মানব জাতির সূচনা হয়।","সৃষ্টির পূর্বে ফেরেশতাদের সাথে আলোচনা ও মাটি থেকে সৃষ্টি: আল্লাহ যখন ফেরেশতাদের জানালেন যে তিনি পৃথিবীতে খলিফা (প্রতিনিধি) সৃষ্টি করবেন, তখন ফেরেশতারা বললেন,","أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ","অর্থ: আপনি কি এমন কাউকে সৃষ্টি করবেন যে সেখানে ফাসাদ করবে এবং রক্তপাত ঘটাবে? অথচ আমরা আপনার প্রশংসা ও পবিত্রতা ঘোষণা করছি। [সূরা বাকারা: ৩০]","আল্লাহ বললেন, 'আমি যা জানি তোমরা তা জানো না।' ফেরেশতারা মানুষের ভবিষ্যৎ সম্পর্কে জানতেন না, কিন্তু আল্লাহ জানতেন যে মানুষের মধ্যে নবী, রাসূল, শহীদ এবং সৎকর্মশীল বান্দা থাকবে। আল্লাহ তা'আলা পৃথিবীর বিভিন্ন স্থান থেকে মাটি সংগ্রহ করলেন - লাল, সাদা, কালো, নরম, শক্ত - বিভিন্ন ধরনের। এজন্য মানুষের রং ও স্বভাব বিভিন্ন হয়। এই মাটি দিয়ে আদম (আঃ) এর দেহ তৈরি করা হলো। প্রথমে মাটি, তারপর কাদা, তারপর শুকনো ঠনঠনে মাটি। চল্লিশ দিন এই দেহ পড়ে রইল। ইবলিস এসে দেখল এবং ভাবল: এটা ফাঁপা, দুর্বল। আমি এর উপর প্রভাব বিস্তার করতে পারব।","**রূহ ফুঁকে দেওয়া ও ফেরেশতাদের সিজদা:** আল্লাহ আদম (আঃ) এর দেহে রূহ ফুঁকে দিলেন। রূহ প্রথমে মাথায় প্রবেশ করল। চোখ খুলে গেল, চারদিক দেখতে পেলেন। নাকে প্রবেশ করলে হাঁচি এলো। আদম (আঃ) বললেন, 'আলহামদুলিল্লাহ' (সমস্ত প্রশংসা আল্লাহর জন্য)। আল্লাহ বললেন, 'ইয়ারহামুকাল্লাহ' (আল্লাহ তোমার প্রতি রহম করুন)। এভাবে প্রথম কথা ছিল আল্লাহর প্রশংসা। রূহ যখন পেটে পৌঁছল, ক্ষুধা অনুভব করলেন। পায়ে পৌঁছার আগেই উঠে দাঁড়াতে চাইলেন। এজন্য আল্লাহ বলেন,","خُلِقَ الْإِنسَانُ مِنْ عَجَلٍ","অর্থ: মানুষ সৃষ্টি করা হয়েছে তাড়াহুড়া করার জন্য। [সূরা আম্বিয়া: ৩৭]","আদম (আঃ) সম্পূর্ণ হওয়ার পর আল্লাহ সকল ফেরেশতাকে আদেশ দিলেন: 'আদমকে সিজদা করো।' এটি ছিল সম্মানসূচক সিজদা, ইবাদতের সিজদা নয়। সকল ফেরেশতা সিজদা করলেন। কিন্তু ইবলিস অস্বীকার করল। সে ছিল জিন জাতির, ফেরেশতাদের সাথে ইবাদত করত। আল্লাহ জিজ্ঞাসা করলেন: 'কিসে তোমাকে বাধা দিল?' ইবলিস বলল,","أَنَا خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ","অর্থ: আমি তার চেয়ে উত্তম। আপনি আমাকে আগুন থেকে সৃষ্টি করেছেন আর তাকে মাটি থেকে। [সূরা আরাফ: ১২]","এটি ছিল প্রথম অহংকার এবং প্রথম পাপ। আল্লাহ তাকে জান্নাত থেকে বের করে দিলেন।","**জ্ঞান শিক্ষা ও হাওয়া (আঃ) এর সৃষ্টি:** আল্লাহ আদম (আঃ)-কে সকল জিনিসের নাম শিখিয়ে দিলেন। তারপর ফেরেশতাদের বললেন, 'এগুলোর নাম বলো যদি তোমরা সত্যবাদী হও।' ফেরেশতারা বললেন,","سُبْحَانَكَ لَا عِلْمَ لَنَا إِلَّا مَا عَلَّمْتَنَا","অর্থ: সুবহানাকা! আপনি আমাদের যা শিখিয়েছেন তা ছাড়া আমাদের কোনো জ্ঞান নেই। [সূরা বাকারা: ৩২]","তারপর আল্লাহ আদম (আঃ)-কে বললেন, 'তুমি তাদের নাম বলে দাও।' আদম (আঃ) সব নাম বললেন। এভাবে প্রমাণিত হলো মানুষের শ্রেষ্ঠত্ব - জ্ঞান অর্জনের ক্ষমতা। আদম (আঃ) জান্নাতে একা ছিলেন। একদিন ঘুম থেকে উঠে দেখলেন পাশে এক নারী বসে আছেন। আল্লাহ আদমের বাম পাঁজরের হাড় থেকে হাওয়া (আঃ)-কে সৃষ্টি করেছেন। আদম (আঃ) জিজ্ঞাসা করলেন: 'তুমি কে?' হাওয়া (আঃ) বললেন, 'আমি নারী।' আদম (আঃ): 'কেন সৃষ্টি করা হয়েছে?' হাওয়া (আঃ): 'যাতে তুমি আমার কাছে শান্তি পাও।' [সহীহ বুখারী] ফেরেশতারা জিজ্ঞাসা করলেন: 'এর নাম কী?' আদম (আঃ) বললেন, 'হাওয়া।' কারণ তিনি জীবিত (হাই) থেকে সৃষ্টি হয়েছেন।","**জান্নাতে জীবন ও শয়তানের ধোঁকা:** আল্লাহ আদম ও হাওয়াকে জান্নাতে বসবাস করতে দিলেন। বললেন,","وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَٰذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ","অর্থ: তোমরা দুজন জান্নাতে বসবাস করো এবং যেখান থেকে ইচ্ছা খাও। কিন্তু এই গাছের কাছে যেও না, তাহলে জালিমদের অন্তর্ভুক্ত হবে। [সূরা বাকারা: ৩৫]","অর্থ: কোন গাছ ছিল তা নিয়ে মতভেদ আছে - কেউ বলেন গম, কেউ বলেন আঙুর, কেউ বলেন ডুমুর। মূল বিষয় হলো আল্লাহর নিষেধাজ্ঞা। জান্নাতে তাঁরা সুখে শান্তিতে ছিলেন। কোনো কষ্ট, ক্ষুধা, তৃষ্ণা, গরম, ঠান্ডা ছিল না। ইবলিস (শয়তান) তাদের জান্নাত থেকে বের করার সুযোগ খুঁজছিল। সে তাদের কাছে এসে বলল, 'তোমাদের রব কি এই গাছ থেকে নিষেধ করেছেন শুধু এজন্য যে তোমরা ফেরেশতা হয়ে যাবে অথবা চিরকাল থাকবে?' সে কসম খেয়ে বলল, 'আমি তোমাদের শুভাকাঙ্ক্ষী।' [সূরা আরাফ: ২০-২১] শয়তান তাদের বোঝাল যে এই গাছের ফল খেলে তারা অমর হবে এবং ফেরেশতাদের মতো হবে। আদম ও হাওয়া (আঃ) ভুলে গেলেন এবং সেই গাছের ফল খেয়ে ফেললেন। সাথে সাথে তাঁদের লজ্জাস্থান খুলে গেল। তাঁরা জান্নাতের পাতা দিয়ে নিজেদের ঢাকতে লাগলেন।","**তওবা, ক্ষমা ও পৃথিবীতে অবতরণ: আল্লাহ ডাকলেন:** 'আমি কি তোমাদের এই গাছ থেকে নিষেধ করিনি?' তাঁরা বুঝতে পারলেন ভুল হয়েছে। সাথে সাথে তওবা করলেন:","رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ","অর্থ: হে আমাদের রব! আমরা নিজেদের উপর জুলুম করেছি। যদি আপনি আমাদের ক্ষমা না করেন এবং রহম না করেন তাহলে আমরা ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হব। [সূরা আরাফ: ২৩]","অর্থ: আল্লাহ তাঁদের তওবা কবুল করলেন। কিন্তু বললেন, 'তোমরা সবাই নেমে যাও। তোমরা একে অপরের শত্রু। পৃথিবীতে তোমাদের জন্য নির্দিষ্ট সময় পর্যন্ত বসবাস ও ভোগ করার ব্যবস্থা আছে।' [সূরা বাকারা: ৩৬] আদম (আঃ) ভারতের সিলন (শ্রীলংকা) এ এবং হাওয়া (আঃ) জেদ্দায় অবতরণ করেন। দীর্ঘদিন পর আরাফাতের ময়দানে তাঁদের পুনর্মিলন হয়। এজন্য স্থানটির নাম 'আরাফাত' (পরিচয়)। তাঁরা পৃথিবীতে জীবন শুরু করলেন। চাষাবাদ, খাদ্য সংগ্রহ, বাসস্থান নির্মাণ - সব শিখলেন। আল্লাহ তাঁদের শিখিয়ে দিলেন। আদম (আঃ) ছিলেন প্রথম নবী। তিনি তাঁর সন্তানদের এক আল্লাহর ইবাদত শেখাতেন।","**সন্তান-সন্ততি ও প্রথম কুরবানী:** হাওয়া (আঃ) থেকে অনেক সন্তান জন্ম নেয়। প্রতিবার যমজ - একজন ছেলে ও একজন মেয়ে। প্রথম যমজ ছিল কাবিল (কেইন) ও তার বোন। দ্বিতীয় যমজ ছিল হাবিল (আবেল) ও তার বোন। সেই সময় নিয়ম ছিল এক যমজের ছেলে অন্য যমজের মেয়েকে বিয়ে করবে। কিন্তু কাবিলের সাথে যে বোন জন্মেছিল সে ছিল সুন্দরী। কাবিল তাকে নিজেই বিয়ে করতে চাইল। আদম (আঃ) বললেন, এটা হারাম। কিন্তু কাবিল মানল না। আদম (আঃ) বললেন, তোমরা উভয়ে কুরবানী করো। যার কুরবানী কবুল হবে সে-ই সুন্দরী মেয়েটিকে বিয়ে করবে। হাবিল ছিল রাখাল। সে তার সবচেয়ে ভালো ভেড়া কুরবানী দিল। কাবিল ছিল কৃষক। সে খারাপ ফসল কুরবানী দিল। আকাশ থেকে আগুন এসে হাবিলের কুরবানী গ্রহণ করল। কাবিলের কুরবানী পড়ে রইল।","**প্রথম হত্যাকাণ্ড ও লাশ কবর দেওয়া:** কাবিল রাগে জ্বলে উঠল। বলল, 'আমি তোমাকে হত্যা করব।' হাবিল বলল,","لَئِن بَسَطتَ إِلَيَّ يَدَكَ لِتَقْتُلَنِي مَا أَنَا بِبَاسِطٍ يَدِيَ إِلَيْكَ لِأَقْتُلَكَ ۖ إِنِّي أَخَافُ اللَّهَ رَبَّ الْعَالَمِينَ","অর্থ: তুমি যদি আমাকে হত্যা করতে হাত বাড়াও, আমি তোমাকে হত্যা করতে হাত বাড়াব না। আমি আল্লাহকে ভয় করি। [সূরা মায়িদা: ২৮]","কিন্তু কাবিল শুনল না। সে হাবিলকে পাথর দিয়ে মাথায় আঘাত করে হত্যা করল। এটি ছিল পৃথিবীর প্রথম হত্যাকাণ্ড। হাবিলের লাশ পড়ে রইল। কাবিল বুঝতে পারল না কী করবে। আল্লাহ একটি কাক পাঠালেন। কাকটি মাটি খুঁড়ে অন্য একটি মৃত কাক কবর দিল। কাবিল বলল,","يَا وَيْلَتَىٰ أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي","অর্থ: হায়! আমি কি এই কাকের মতোও হতে পারলাম না যে আমার ভাইয়ের লাশ কবর দিতে পারি? [সূরা মায়িদা: ৩১]","সে মাটি খুঁড়ে হাবিলকে কবর দিল। এভাবে মানুষ কবর দেওয়া শিখল। আদম (আঃ) যখন জানলেন, অত্যন্ত দুঃখিত হলেন। একজন ছেলে মারা গেছে, অন্যজন খুনি হয়ে গেছে। তিনি আল্লাহর কাছে কাঁদলেন। আল্লাহ তাঁকে সান্ত্বনা দিলেন এবং আরেক ছেলে দান করলেন - শীস (আঃ)। শীস (আঃ) ছিলেন নেককার এবং পরবর্তীতে নবী হয়েছিলেন। আদম (আঃ) তাঁকে সব জ্ঞান শিখিয়ে দিলেন।","**দীর্ঘ জীবন ও ইন্তেকাল:** আদম (আঃ) ৯৬০ বছর (মতান্তরে ১০০০ বছর) জীবিত ছিলেন। তিনি তাঁর সন্তান-সন্ততিদের তাওহীদ, নামাজ, এবং সৎকর্মের শিক্ষা দিয়েছেন। মৃত্যুর সময় ফেরেশতারা এসেছিলেন। তাঁর সন্তানরা কাঁদছিল। ফেরেশতারা বললেন, 'এটাই মৃত্যু। তোমাদের সবাইকে এই পথ অতিক্রম করতে হবে।' আদম (আঃ) ইন্তেকাল করলেন। ফেরেশতারা তাঁকে গোসল দিলেন, কাফন পরালেন, জানাযা পড়লেন এবং কবর দিলেন। এভাবে মানুষ জানাযার নিয়ম শিখল। তাঁকে মক্কার কাছে 'গারে আবু কুবাইস' এ দাফন করা হয় বলে কথিত আছে।"],"source":"সূরা বাকারা: ৩০-৩৯; সূরা আরাফ: ১১-২৫; সূরা মায়িদা: ২৭-৩১; সহীহ বুখারী; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_idris_as","categoryId":"nobider_jiboni","title":"ইদরিস (আঃ) - সত্যবাদী নবী","paragraphs":["হযরত ইদরিস (আঃ) ছিলেন আদম (আঃ) এর পরে তৃতীয় নবী এবং শীস (আঃ) এর পৌত্র। তিনি ছিলেন অত্যন্ত সত্যবাদী এবং ধৈর্যশীল। আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেছেন। তিনি ছিলেন প্রথম মানুষ যিনি কলম দিয়ে লিখতেন এবং সেলাই শিল্প শিখিয়েছিলেন।","**বংশ ও জন্ম:** ইদরিস (আঃ) এর পূর্ণ নাম ছিল ইদরিস ইবনে ইয়ারিদ ইবনে মাহলাইল। তিনি আদম (আঃ) এর পঞ্চম অথবা ষষ্ঠ বংশধর ছিলেন। তাঁর পিতা ইয়ারিদ এবং তাঁর দাদা মাহলাইল ছিলেন নেককার মানুষ। ইদরিস (আঃ) জন্মগ্রহণ করেন আদম (আঃ) এর ইন্তেকালের পরে বাবেল (বর্তমান ইরাক) অঞ্চলে। তাঁর জন্মের সময় মানুষ এখনও তাওহীদের উপর ছিল কিন্তু ধীরে ধীরে বিচ্যুতি শুরু হচ্ছিল।","**নাম 'ইদরিস' এর অর্থ ও কুরআনে প্রশংসা:** 'ইদরিস' শব্দটি এসেছে 'দারাসা' (دَرَسَ) থেকে যার অর্থ অধ্যয়ন করা, পাঠ করা। তাঁকে এই নাম দেওয়া হয়েছিল কারণ তিনি অত্যধিক ইলম অর্জন করতেন এবং আল্লাহর কিতাব গভীরভাবে অধ্যয়ন করতেন। তিনি ছিলেন জ্ঞানী এবং প্রজ্ঞাবান। আল্লাহ তায়ালা কুরআনে ইদরিস (আঃ) এর প্রশংসা করে বলেন,","وَاذْكُرْ فِي الْكِتَابِ إِدْرِيسَ ۚ إِنَّهُ كَانَ صِدِّيقًا نَّبِيًّا","অর্থ: এই কিতাবে ইদরিসের কথা স্মরণ করুন। নিশ্চয়ই তিনি ছিলেন সত্যবাদী, নবী। [সূরা মারইয়াম: ৫৬]","وَرَفَعْنَاهُ مَكَانًا عَلِيًّا","অর্থ: এবং আমি তাঁকে উচ্চ মর্যাদায় উন্নীত করেছি। [সূরা মারইয়াম: ৫৭]","'সিদ্দিক' শব্দটি অত্যন্ত গুরুত্বপূর্ণ। এর অর্থ হলো যিনি সর্বদা সত্য বলেন এবং সত্যের উপর অটল থাকেন। নবীদের পরে সিদ্দিকদের মর্যাদা সবচেয়ে উঁচু।","**নবুয়ত ও দাওয়াত:** ইদরিস (আঃ) নবুয়ত প্রাপ্ত হন যখন মানুষ আল্লাহর পথ থেকে বিচ্যুত হতে শুরু করেছিল। তিনি মানুষকে এক আল্লাহর ইবাদতের দিকে ডাকতেন এবং শিরক থেকে বিরত থাকতে বলতেন। তিনি মানুষকে সততা, ন্যায়পরায়ণতা এবং সৎকর্মের শিক্ষা দিতেন। তিনি বলতেন: 'আল্লাহ তোমাদের সৃষ্টি করেছেন এবং তিনিই তোমাদের রিযিক দেন। তাঁর ইবাদত করো এবং তাঁর শুকরিয়া আদায় করো।' তাঁর দাওয়াতে অনেক মানুষ ঈমান আনে এবং তাঁর অনুসরণ করে। তিনি তাঁর উম্মতকে তাওহীদ, নামাজ, রোজা এবং সৎকর্মের শিক্ষা দেন।","**প্রথম লেখক ও জ্ঞান-বিজ্ঞান:** ইদরিস (আঃ) ছিলেন প্রথম মানুষ যিনি কলম দিয়ে লিখতেন। আল্লাহ তাঁকে লেখার জ্ঞান দান করেছিলেন। তিনি জ্ঞান-বিজ্ঞান লিখে রাখতেন যাতে পরবর্তী প্রজন্ম তা থেকে উপকৃত হতে পারে। তিনি বিভিন্ন বিষয়ে জ্ঞান রাখতেন:\n\n১. জ্যোতির্বিদ্যা: তিনি তারা, গ্রহ এবং আকাশের গতিবিধি সম্পর্কে জ্ঞান রাখতেন। তিনি মানুষকে শিখিয়েছিলেন কিভাবে তারা দেখে দিক নির্ণয় করতে হয় এবং সময় হিসাব করতে হয়।\n\n২. গণিত: তিনি হিসাব-নিকাশ এবং গণনা পদ্ধতি শিখিয়েছিলেন। তিনি মানুষকে শিখিয়েছিলেন কিভাবে সম্পদ হিসাব করতে হয় এবং লেনদেন করতে হয়।\n\n৩. চিকিৎসা বিজ্ঞান: তিনি রোগ-ব্যাধি এবং তার চিকিৎসা সম্পর্কে জ্ঞান রাখতেন। তিনি মানুষকে ভেষজ ঔষধ এবং চিকিৎসা পদ্ধতি শিখিয়েছিলেন।\n\n৪. দর্শন ও প্রজ্ঞা: তিনি জীবনের গভীর বিষয় নিয়ে চিন্তা করতেন এবং মানুষকে প্রজ্ঞার কথা শিখিয়েছিলেন।","**সেলাই শিল্প ও পোশাক:** ইদরিস (আঃ) প্রথম সুই-সুতা দিয়ে কাপড় সেলাই করা শিখিয়েছিলেন। এর আগে মানুষ পশুর চামড়া বা পাতা দিয়ে শরীর ঢাকত। তিনি মানুষকে কাপড় বুনতে এবং সেলাই করতে শেখান। তিনি বিভিন্ন ধরনের পোশাক তৈরি করার পদ্ধতি শিখিয়েছিলেন। এটি ছিল মানব সভ্যতার একটি বড় অগ্রগতি। মানুষ এখন সুন্দর এবং পরিচ্ছন্ন পোশাক পরতে শুরু করল।","**ইবাদত ও তাকওয়া:** ইদরিস (আঃ) ছিলেন অত্যন্ত ইবাদতগুজার। তিনি দিনে রোজা রাখতেন এবং রাতে নামাজ পড়তেন। তাঁর জীবন ছিল সাদাসিধা এবং দুনিয়াবিমুখ। তিনি সবসময় আল্লাহর জিকিরে মশগুল থাকতেন। তিনি খুব কম খেতেন এবং খুব কম ঘুমাতেন। তাঁর সময়ের বেশিরভাগ অংশ কাটত ইবাদত, জ্ঞান অর্জন এবং মানুষকে দাওয়াত দেওয়ার মধ্যে। তিনি ছিলেন অত্যন্ত বিনয়ী এবং নম্র। তিনি গরিব-দুঃখীদের সাহায্য করতেন এবং মানুষের সেবা করতেন।","**উচ্চ মর্যাদায় উন্নীত:** আল্লাহ তায়ালা ইদরিস (আঃ) কে উচ্চ মর্যাদায় উন্নীত করেছেন। 'মাকানান আলিয়্যা' (উচ্চ স্থান) এর ব্যাখ্যা নিয়ে মুফাসসিরদের মধ্যে মতভেদ আছে:\n\n১. চতুর্থ আকাশে: অনেক মুফাসসির বলেন যে আল্লাহ তাঁকে জীবিত অবস্থায় আসমানে উঠিয়ে নিয়েছেন। তিনি চতুর্থ আকাশে আছেন। মিরাজের রাতে রাসূল (সাঃ) চতুর্থ আকাশে ইদরিস (আঃ) এর সাথে সাক্ষাত করেন। ইদরিস (আঃ) তাঁকে স্বাগত জানান এবং বলেন, 'মারহাবা বিন নাবিয়্যিস সালিহ ওয়াল আখিস সালিহ' (স্বাগতম সৎ নবী ও সৎ ভাই)। [সহীহ বুখারী: ৩৪৩০]\n\n২. জান্নাতে: কেউ বলেন তিনি জান্নাতে আছেন জীবিত অবস্থায়, ঈসা (আঃ) এর মতো।\n\n৩. উচ্চ মর্যাদা: কেউ বলেন এর অর্থ হলো আল্লাহ তাঁকে নবীদের মধ্যে উচ্চ মর্যাদা দান করেছেন।","**মৃত্যু নাকি জীবিত:** ইদরিস (আঃ) এর মৃত্যু সম্পর্কে মতভেদ আছে:\n\n১. জীবিত উত্থান: অনেক আলেম বলেন তিনি ঈসা (আঃ) এর মতো জীবিত অবস্থায় আসমানে উঠিয়ে নেওয়া হয়েছে এবং এখনও জীবিত আছেন। তিনি মৃত্যুর স্বাদ গ্রহণ করেননি।\n\n২. মৃত্যুর পর উত্থান: কেউ বলেন তিনি মারা গেছেন এবং তাঁর রূহ চতুর্থ আকাশে আছে।\n\n৩. পৃথিবীতে মৃত্যু: কেউ বলেন তিনি পৃথিবীতেই মারা গেছেন এবং 'উচ্চ মর্যাদা' বলতে তাঁর আধ্যাত্মিক মর্যাদা বোঝানো হয়েছে।\n\nসবচেয়ে শক্তিশালী মত হলো তিনি জীবিত অবস্থায় আসমানে উঠিয়ে নেওয়া হয়েছেন। আল্লাহই ভালো জানেন।","**জীবনকাল ও উত্তরাধিকার:** ইদরিস (আঃ) প্রায় ৩৬৫ বছর পৃথিবীতে ছিলেন (কিছু বর্ণনা মতে)। তারপর আল্লাহ তাঁকে উচ্চ মর্যাদায় উন্নীত করেন। তাঁর জীবন ছিল ইবাদত, জ্ঞান এবং দাওয়াতে পূর্ণ। তিনি তাঁর উম্মতকে অনেক কিছু শিখিয়ে গেছেন - লেখা, সেলাই, জ্ঞান-বিজ্ঞান এবং সর্বোপরি তাওহীদ। তাঁর পরে তাঁর সন্তানরা এবং অনুসারীরা তাঁর শিক্ষা ছড়িয়ে দেন। তাঁর বংশ থেকে পরবর্তীতে নূহ (আঃ) আসেন।"],"source":"**সূরা মারইয়াম: ৫৬-৫৭; সহীহ বুখারী:** ৩৪৩০; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"},{"id":"nabi_nuh_as","categoryId":"nobider_jiboni","title":"নূহ (আঃ) - মহাপ্লাবনের নবী","paragraphs":["হযরত নূহ (আঃ) ছিলেন আদম (আঃ) এর দশম বংশধর এবং মহাপ্লাবনের নবী। তিনি ৯৫০ বছর তাঁর জাতিকে দাওয়াত দিয়েছেন কিন্তু খুব কম মানুষ ঈমান এনেছে। আল্লাহ তাঁর দোয়ায় কাফিরদের ধ্বংস করেন এবং মুমিনদের রক্ষা করেন। তিনি 'উলুল আজম' পাঁচ নবীর একজন।","**বংশ ও শিরকের সূচনা:** নূহ (আঃ) এর পূর্ণ নাম ছিল নূহ ইবনে লামাক ইবনে মাতুশালাহ। তিনি আদম (আঃ) এর দশম বংশধর এবং ইদরিস (আঃ) এর পৌত্র ছিলেন। তিনি জন্মগ্রহণ করেন ইরাক অঞ্চলে। তাঁর জন্মের সময় পৃথিবীতে শিরক ও পাপাচার ব্যাপক হয়ে গিয়েছিল। আদম (আঃ) এর সময়ে পাঁচজন নেককার মানুষ ছিলেন - ওয়াদ, সুওয়া, ইয়াগুস, ইয়াউক এবং নাসর। তাঁরা মারা গেলে শয়তান মানুষকে বলল, 'তাদের স্মৃতি রক্ষার জন্য মূর্তি বানাও।' প্রথমে শুধু স্মৃতি রক্ষার জন্য মূর্তি বানানো হলো। কিন্তু পরবর্তী প্রজন্ম ভুলে গেল এবং মূর্তির পূজা শুরু করল। এভাবে শিরক শুরু হয়। [সহীহ বুখারী: ৪৯২০]","**নবুয়ত ও দাওয়াতের পদ্ধতি:** যখন শিরক ও পাপাচার চরম পর্যায়ে পৌঁছল, আল্লাহ নূহ (আঃ) কে নবী হিসেবে পাঠালেন। তিনি তখন ৪০ বছর বয়সী ছিলেন। নূহ (আঃ) তাঁর জাতিকে দিন-রাত দাওয়াত দিতে লাগলেন - প্রকাশ্যে এবং গোপনে, দিনে এবং রাতে, ব্যক্তিগতভাবে এবং জনসমাবেশে। কুরআনে নূহ (আঃ) বলেন,","إِنِّي دَعَوْتُ قَوْمِي لَيْلًا وَنَهَارًا ۝ ثُمَّ إِنِّي دَعَوْتُهُمْ جِهَارًا ۝ ثُمَّ إِنِّي أَعْلَنتُ لَهُمْ وَأَسْرَرْتُ لَهُمْ إِسْرَارًا","অর্থ: আমি আমার জাতিকে দিন-রাত দাওয়াত দিয়েছি। তারপর আমি তাদের প্রকাশ্যে দাওয়াত দিয়েছি। তারপর আমি তাদের প্রকাশ্যেও বলেছি এবং গোপনেও বলেছি। [সূরা নূহ: ৫, ৮-৯]","অর্থ: তিনি বললেন, 'হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। তোমরা তোমাদের রবের কাছে ক্ষমা চাও। তিনি তোমাদের উপর প্রচুর বৃষ্টি পাঠাবেন, সম্পদ ও সন্তান দিয়ে সাহায্য করবেন।' [সূরা নূহ: ১০-১২]","**জাতির প্রতিক্রিয়া ও ৯৫০ বছর ধৈর্য:** কিন্তু তাঁর জাতি তাঁকে প্রত্যাখ্যান করল। তারা কান বন্ধ করে রাখত, কাপড় দিয়ে মুখ ঢেকে নিত এবং অহংকার করত। তারা বলল,","وَقَالُوا لَا تَذَرُنَّ آلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَلَا سُوَاعًا وَلَا يَغُوثَ وَيَعُوقَ وَنَسْرًا","অর্থ: তোমরা তোমাদের দেবতাদের ছেড়ো না - ওয়াদ, সুওয়া, ইয়াগুস, ইয়াউক এবং নাসরকে ছেড়ো না। [সূরা নূহ: ২৩]","নূহ (আঃ) ৯৫০ বছর ধৈর্যের সাথে দাওয়াত দিয়েছেন। কুরআনে বলা হয়েছে:","وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِ فَلَبِثَ فِيهِمْ أَلْفَ سَنَةٍ إِلَّا خَمْسِينَ عَامًا","অর্থ: আমি নূহকে তার জাতির কাছে পাঠিয়েছিলাম। সে তাদের মধ্যে পঞ্চাশ কম এক হাজার বছর অবস্থান করেছে। [সূরা আনকাবুত: ১৪]","এই দীর্ঘ সময়ে খুব কম মানুষ ঈমান এনেছে - মাত্র ৮০ জন (কিছু বর্ণনা মতে)। তাঁর তিন ছেলে - সাম, হাম এবং ইয়াফিস - ঈমান এনেছিল। কিন্তু চতুর্থ ছেলে কেনআন এবং স্ত্রী ওয়ালিআহ ছিল কাফির।","**নূহ (আঃ) এর দোয়া ও নৌকা তৈরির আদেশ:** দীর্ঘ সময় দাওয়াত দেওয়ার পর যখন কেউ ঈমান আনল না, নূহ (আঃ) আল্লাহর কাছে দোয়া করলেন:","رَّبِّ لَا تَذَرْ عَلَى الْأَرْضِ مِنَ الْكَافِرِينَ دَيَّارًا ۝ إِنَّكَ إِن تَذَرْهُمْ يُضِلُّوا عِبَادَكَ وَلَا يَلِدُوا إِلَّا فَاجِرًا كَفَّارًا","অর্থ: হে আমার রব! পৃথিবীতে কাফিরদের একজন বাসিন্দাকেও রেখো না। যদি তুমি তাদের রেখে দাও তারা তোমার বান্দাদের পথভ্রষ্ট করবে এবং শুধু পাপিষ্ঠ কাফির সন্তান জন্ম দেবে। [সূরা নূহ: ২৬-২৭]","আল্লাহ তাঁর দোয়া কবুল করলেন এবং বললেন,","وَاصْنَعِ الْفُلْكَ بِأَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِي فِي الَّذِينَ ظَلَمُوا ۚ إِنَّهُم مُّغْرَقُونَ","অর্থ: আমার তত্ত্বাবধানে এবং আমার ওহী অনুযায়ী নৌকা তৈরি করো। যারা জুলুম করেছে তাদের ব্যাপারে আমার কাছে কিছু বলো না। তারা অবশ্যই ডুবে যাবে। [সূরা হুদ: ৩৭]","অর্থ: নূহ (আঃ) নৌকা তৈরি শুরু করলেন - ৩০০ হাত লম্বা, ৫০ হাত চওড়া এবং ৩০ হাত উঁচু, তিনতলা বিশিষ্ট। কাফিররা তাঁকে দেখে হাসত এবং ঠাট্টা করত। তিনি বললেন, 'তোমরা যদি আমাদের নিয়ে ঠাট্টা করো, আমরাও তোমাদের নিয়ে ঠাট্টা করব।' [সূরা হুদ: ৩৮]","**মহাপ্লাবন ও নৌকায় আরোহণ:** নৌকা তৈরি শেষ হলে একদিন সকালে তন্দুর থেকে পানি উপচে পড়তে লাগল। আকাশ থেকে প্রবল বৃষ্টি শুরু হলো এবং জমিন থেকে ঝর্ণা ফুটতে লাগল:","فَفَتَحْنَا أَبْوَابَ السَّمَاءِ بِمَاءٍ مُّنْهَمِرٍ ۝ وَفَجَّرْنَا الْأَرْضَ عُيُونًا فَالْتَقَى الْمَاءُ عَلَىٰ أَمْرٍ قَدْ قُدِرَ","অর্থ: অতঃপর আমি আকাশের দরজা খুলে দিলাম প্রবল বৃষ্টির পানি দিয়ে। এবং জমিন থেকে ঝর্ণা প্রবাহিত করলাম। তারপর পানি মিলিত হলো এক নির্ধারিত বিষয়ে। [সূরা কামার: ১১-১২]","নূহ (আঃ) সব মুমিন, তাঁর পরিবার এবং প্রতিটি প্রাণীর এক জোড়া করে নৌকায় তুললেন। নৌকায় ওঠার সময় তিনি বললেন,","بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا ۚ إِنَّ رَبِّي لَغَفُورٌ رَّحِيمٌ","অর্থ: আল্লাহর নামে এর চলা এবং থামা। নিশ্চয়ই আমার রব ক্ষমাশীল, দয়ালু। [সূরা হুদ: ৪১]","অর্থ: তাঁর এক ছেলে কেনআন ছিল কাফির। নূহ (আঃ) তাকে ডেকে বললেন, 'হে আমার ছেলে! আমাদের সাথে আরোহণ করো।' কিন্তু সে বলল, 'আমি পাহাড়ে আশ্রয় নেব।' নূহ (আঃ) বললেন, 'আজ আল্লাহর আদেশ থেকে কোনো রক্ষাকারী নেই।' কিন্তু সে শুনল না এবং ঢেউ তাকে ডুবিয়ে দিল। [সূরা হুদ: ৪২-৪৩]","অর্থ: চল্লিশ দিন বৃষ্টি ও ধ্বংস: চল্লিশ দিন এবং চল্লিশ রাত প্রবল বৃষ্টি হলো। পানি এত বেড়ে গেল যে সবচেয়ে উঁচু পাহাড়ও ডুবে গেল। নৌকা পাহাড়ের মতো ঢেউয়ের মধ্যে ভাসছিল। [সূরা হুদ: ৪২] সমস্ত পৃথিবী পানিতে ডুবে গেল। সব কাফির ধ্বংস হলো। শুধু নৌকার মুমিনরা রক্ষা পেল। নূহ (আঃ) তাঁর ছেলের জন্য আল্লাহর কাছে দোয়া করলেন। আল্লাহ বললেন,","يَا نُوحُ إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ","অর্থ: হে নূহ! সে তোমার পরিবারের নয়। সে অসৎকর্মকারী। [সূরা হুদ: ৪৬]","নূহ (আঃ) বুঝলেন যে ঈমান ছাড়া রক্তের সম্পর্ক কোনো কাজে আসে না।","**জুদি পাহাড়ে অবতরণ ও নতুন সূচনা:** বৃষ্টি থামল এবং পানি কমতে শুরু করল। আল্লাহ বললেন,","يَا أَرْضُ ابْلَعِي مَاءَكِ وَيَا سَمَاءُ أَقْلِعِي وَغِيضَ الْمَاءُ وَقُضِيَ الْأَمْرُ وَاسْتَوَتْ عَلَى الْجُودِيِّ","অর্থ: হে পৃথিবী! তোমার পানি গিলে ফেলো। হে আকাশ! থেমে যাও। পানি কমে গেল এবং কাজ শেষ হলো। নৌকা জুদি পাহাড়ে থামল। [সূরা হুদ: ৪৪]","নৌকা জুদি পাহাড়ে (তুরস্কের আরারাত পর্বতে) থামল। নূহ (আঃ) এবং মুমিনরা নৌকা থেকে নামলেন এবং আল্লাহর শুকরিয়া আদায় করলেন। তাঁরা নতুন করে জীবন শুরু করলেন। তাঁর তিন ছেলে - সাম, হাম এবং ইয়াফিস - থেকে পৃথিবীতে মানুষ ছড়িয়ে পড়ল। সাম থেকে আরব ও সেমিটিক জাতি, হাম থেকে আফ্রিকান জাতি এবং ইয়াফিস থেকে ইউরোপীয় জাতি এসেছে।","**মৃত্যু:** নূহ (আঃ) মহাপ্লাবনের পর আরও অনেক বছর জীবিত ছিলেন। তিনি মোট ৯৫০ বছর দাওয়াত দিয়েছেন এবং তারপর ইন্তেকাল করেন। তাঁর মোট বয়স হয়েছিল প্রায় ১০৫০ বছর (কিছু বর্ণনা মতে)। তাঁকে মক্কা অথবা মসজিদুল হারামে দাফন করা হয় বলে কথিত আছে। নূহ (আঃ) ছিলেন 'উলুল আজম' (দৃঢ় সংকল্প) পাঁচ নবীর একজন - নূহ, ইব্রাহিম, মূসা, ঈসা এবং মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)।"],"source":"**সূরা নূহ; সূরা হুদ: ২৫-৪৯; সূরা আরাফ:** ৫৯-৬৪; সূরা কামার: ৯-১৭; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"},{"id":"nabi_hud_as","categoryId":"nobider_jiboni","title":"হুদ (আঃ) - আদ জাতির নবী","paragraphs":["হযরত হুদ (আঃ) ছিলেন আদ জাতির নবী। আদ জাতি ছিল অত্যন্ত শক্তিশালী এবং অহংকারী। তারা বিশাল বিশাল অট্টালিকা নির্মাণ করত এবং নিজেদের শক্তিতে গর্বিত ছিল। কিন্তু তারা আল্লাহর ইবাদত ছেড়ে মূর্তিপূজা শুরু করেছিল।","**বংশ ও আদ জাতি:** হুদ (আঃ) এর পূর্ণ নাম ছিল হুদ ইবনে শালিখ ইবনে আরফাখশাদ। তিনি নূহ (আঃ) এর পৌত্র সাম এর বংশধর ছিলেন। তিনি জন্মগ্রহণ করেন আরব উপদ্বীপের দক্ষিণে ইয়েমেনের আহকাফ অঞ্চলে। আদ জাতি ছিল নূহ (আঃ) এর পরবর্তী প্রজন্ম। তারা ছিল লম্বা, শক্তিশালী এবং সুঠাম দেহের অধিকারী। তাদের দেশ ছিল অত্যন্ত উর্বর এবং সমৃদ্ধ। তারা বিশাল বিশাল প্রাসাদ এবং স্তম্ভ নির্মাণ করত। কুরআনে বলা হয়েছে:","أَتَبْنُونَ بِكُلِّ رِيعٍ آيَةً تَعْبَثُونَ","অর্থ: তোমরা কি প্রতিটি উঁচু স্থানে নিদর্শন নির্মাণ করছ খেলাচ্ছলে? [সূরা শুআরা: ১২৮]","কিন্তু তারা মূর্তিপূজা শুরু করেছিল এবং নিজেদের শক্তিতে অহংকার করত। তারা বলত:","مَنْ أَشَدُّ مِنَّا قُوَّةً","অর্থ: আমাদের চেয়ে শক্তিশালী কে? [সূরা ফুসসিলাত: ১৫]","**দাওয়াত ও জাতির প্রতিক্রিয়া:** আল্লাহ হুদ (আঃ) কে নবী হিসেবে পাঠালেন। তিনি তাঁর জাতিকে বললেন,","يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ ۚ أَفَلَا تَتَّقُونَ","অর্থ: হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। তোমরা কি তাকওয়া অবলম্বন করবে না? [সূরা আরাফ: ৬৫]","তিনি তাদের বললেন মূর্তিপূজা ছাড়তে, অহংকার ত্যাগ করতে এবং দুর্বলদের উপর অত্যাচার বন্ধ করতে। কিন্তু আদ জাতি হুদ (আঃ) কে প্রত্যাখ্যান করল। তারা বলল, 'তুমি কি আমাদের পূর্বপুরুষদের দেবতা ছেড়ে শুধু এক আল্লাহর ইবাদত করতে বলছ?' তারা তাঁকে মিথ্যাবাদী বলল। আল্লাহ তাদের সতর্ক করার জন্য বৃষ্টি বন্ধ করে দিলেন। তিন বছর ধরে বৃষ্টি হলো না। ফসল নষ্ট হলো কিন্তু তারা তবুও তওবা করল না।","**ভয়ংকর ঝড় ও ধ্বংস:** আকাশে কালো মেঘ দেখা দিল। আদ জাতি খুশি হলো ভেবে যে বৃষ্টি আসছে। কিন্তু এটা ছিল ধ্বংসের মেঘ। কুরআনে বলা হয়েছে:","فَلَمَّا رَأَوْهُ عَارِضًا مُّسْتَقْبِلَ أَوْدِيَتِهِمْ قَالُوا هَٰذَا عَارِضٌ مُّمْطِرُنَا ۚ بَلْ هُوَ مَا اسْتَعْجَلْتُم بِهِ ۖ رِيحٌ فِيهَا عَذَابٌ أَلِيمٌ","অর্থ: যখন তারা মেঘকে তাদের উপত্যকার দিকে আসতে দেখল, বলল, এই মেঘ আমাদের বৃষ্টি দেবে। বরং এটা তো তাই যা তোমরা তাড়াতাড়ি চেয়েছিলে - এক বায়ু যাতে রয়েছে যন্ত্রণাদায়ক শাস্তি। [সূরা আহকাফ: ২৪]","ভয়ংকর ঝড় শুরু হলো। প্রচণ্ড বাতাস সব কিছু উড়িয়ে নিয়ে যেতে লাগল। সাত রাত এবং আট দিন এই ঝড় চলল:","تُدَمِّرُ كُلَّ شَيْءٍ بِأَمْرِ رَبِّهَا","অর্থ: সব কিছু ধ্বংস করে দিচ্ছে তার রবের আদেশে। [সূরা আহকাফ: ২৫]","মানুষ খেজুর গাছের কাণ্ডের মতো উড়ে যেতে লাগল এবং মাটিতে পড়ে মারা যেতে লাগল। তাদের বিশাল প্রাসাদ ধ্বংস হয়ে গেল। হুদ (আঃ) এবং যারা তাঁর সাথে ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন। সব কাফির ধ্বংস হয়ে গেল।","**মৃত্যু:** হুদ (আঃ) হাদরামাউতে বসবাস করেন এবং সেখানে মানুষকে দাওয়াত দিতে থাকেন। তিনি সেখানেই ইন্তেকাল করেন। তাঁর কবর হাদরামাউতে আছে বলে বিশ্বাস করা হয়। আদ জাতির ধ্বংসাবশেষ এখনও ইয়েমেনের আহকাফ অঞ্চলে পাওয়া যায় - বিশাল বিশাল পাথরের স্তম্ভ এবং ধ্বংসপ্রাপ্ত শহর।"],"source":"**সূরা আরাফ: ৬৫-৭২; সূরা হুদ: ৫০-৬০; সূরা শুআরা:** ১২৩-১৪০; সূরা আহকাফ: ২১-২৬; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_salih_as","categoryId":"nobider_jiboni","title":"সালিহ (আঃ) - সামুদ জাতির নবী","paragraphs":["হযরত সালিহ (আঃ) ছিলেন সামুদ জাতির নবী। সামুদ জাতি পাহাড় কেটে বিশাল বিশাল ঘর তৈরি করত এবং নিজেদের শিল্পকলায় গর্বিত ছিল। কিন্তু তারা আল্লাহর ইবাদত ছেড়ে মূর্তিপূজা শুরু করেছিল।","**বংশ ও সামুদ জাতি:** সালিহ (আঃ) এর পূর্ণ নাম ছিল সালিহ ইবনে উবাইদ ইবনে আসিফ। তিনি সামুদ জাতির মধ্যে জন্মগ্রহণ করেন। সামুদ জাতি ছিল আদ জাতির পরবর্তী প্রজন্ম। তারা বসবাস করত হিজর অঞ্চলে (বর্তমান সৌদি আরবের মাদায়েন সালিহ)। সামুদ জাতি ছিল অত্যন্ত দক্ষ শিল্পী। তারা পাহাড় কেটে সুন্দর সুন্দর ঘর এবং প্রাসাদ তৈরি করত। কুরআনে বলা হয়েছে:","وَتَنْحِتُونَ مِنَ الْجِبَالِ بُيُوتًا فَارِهِينَ","অর্থ: এবং তোমরা পাহাড় কেটে নিপুণভাবে ঘর তৈরি করছ। [সূরা শুআরা: ১৪৯]","তারা ছিল সমৃদ্ধ এবং শক্তিশালী। কিন্তু তারা আদ জাতির ধ্বংসের শিক্ষা নেয়নি এবং মূর্তিপূজা শুরু করেছিল।","**দাওয়াত ও আল্লাহর উটনী:** সালিহ (আঃ) তাঁর জাতির মধ্যে অত্যন্ত সম্মানিত ছিলেন। আল্লাহ তাঁকে নবী বানালেন। তিনি তাঁর জাতিকে বললেন,","يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ","অর্থ: হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। [সূরা আরাফ: ৭৩]","সামুদ জাতি তাঁকে বলল, 'তুমি যদি সত্যিই নবী হও তাহলে আমাদের মুজিজা দেখাও। এই পাহাড় থেকে একটি উটনী বের করে দাও।' সালিহ (আঃ) আল্লাহর কাছে দোয়া করলেন। আল্লাহর কুদরতে পাহাড় ফেটে একটি বিশাল উটনী বের হলো এবং সাথে সাথে একটি বাচ্চা প্রসব করল। সালিহ (আঃ) তাদের বললেন,","هَٰذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً ۖ فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ ۖ وَلَا تَمَسُّوهَا بِسُوءٍ","অর্থ: এই আল্লাহর উটনী তোমাদের জন্য নিদর্শন। তাকে আল্লাহর জমিনে চরতে দাও এবং তাকে কোনো ক্ষতি করো না। [সূরা আরাফ: ৭৩]","এই মুজিজা দেখে কিছু মানুষ ঈমান আনল কিন্তু বেশিরভাগ নেতা কুফরিতে থেকে গেল।","**উটনী হত্যা ও তিন দিনের সতর্কবাণী:** উটনী অনেক দুধ দিত কিন্তু কাফিররা এতে বিরক্ত হলো। নয়জন দুষ্ট নেতা মিলে উটনী হত্যার ষড়যন্ত্র করল। একদিন যখন উটনী পানি পান করতে এলো, কুদার ইবনে সালিফ তরবারি দিয়ে উটনীর পা কেটে দিল এবং তারা উটনীকে হত্যা করল। সালিহ (আঃ) যখন এই খবর শুনলেন, তিনি তাদের বললেন,","تَمَتَّعُوا فِي دَارِكُمْ ثَلَاثَةَ أَيَّامٍ ۖ ذَٰلِكَ وَعْدٌ غَيْرُ مَكْذُوبٍ","অর্থ: তোমরা তোমাদের ঘরে তিন দিন ভোগ করো। এটি এমন প্রতিশ্রুতি যা মিথ্যা হবে না। [সূরা হুদ: ৬৫]","তিনি বললেন, 'প্রথম দিন তোমাদের চেহারা হলুদ হবে, দ্বিতীয় দিন লাল হবে এবং তৃতীয় দিন কালো হবে। তারপর শাস্তি আসবে।' ঠিক যেমন সালিহ (আঃ) বলেছিলেন তেমনই হলো। তারা বুঝল শাস্তি আসছে কিন্তু তবুও তওবা করল না।","**ভয়ংকর শাস্তি ও ধ্বংস:** চতুর্থ দিন সকালে ভয়ংকর আওয়াজ (সাইহা) এলো। এক প্রচণ্ড শব্দ যা তাদের হৃদয় ফাটিয়ে দিল। কুরআনে বলা হয়েছে:","فَأَخَذَتْهُمُ الصَّيْحَةُ مُصْبِحِينَ","অর্থ: অতঃপর সকালে তাদের পাকড়াও করল সেই মহানাদ। [সূরা হিজর: ৮৩]","একই সাথে ভূমিকম্প হলো। সবাই তাদের ঘরে মৃত অবস্থায় পড়ে রইল। সালিহ (আঃ) এবং যারা ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন। তাঁরা সেখান থেকে চলে গেলেন। সালিহ (আঃ) তাদের লাশের দিকে তাকিয়ে বললেন,","يَا قَوْمِ لَقَدْ أَبْلَغْتُكُمْ رِسَالَةَ رَبِّي وَنَصَحْتُ لَكُمْ وَلَٰكِن لَّا تُحِبُّونَ النَّاصِحِينَ","অর্থ: হে আমার জাতি! আমি তোমাদের কাছে আমার রবের বার্তা পৌঁছে দিয়েছি এবং তোমাদের উপদেশ দিয়েছি। কিন্তু তোমরা উপদেশদাতাদের পছন্দ করো না। [সূরা আরাফ: ৭৯]","**মৃত্যু:** সালিহ (আঃ) মক্কায় চলে যান এবং সেখানে বসবাস করেন। তিনি সেখানে ইন্তেকাল করেন। সামুদ জাতির ধ্বংসাবশেষ এখনও সৌদি আরবের মাদায়েন সালিহ (আল-হিজর) এ দেখা যায় - পাহাড় কাটা বিশাল বিশাল ঘর এবং সমাধি। রাসূল (সাঃ) তাবুক যুদ্ধের সময় এই স্থান দিয়ে যাওয়ার সময় সাহাবীদের বলেছিলেন: 'এখানে থেমো না এবং এখানের পানি পান করো না। এটি শাস্তিপ্রাপ্ত জাতির স্থান।'"],"source":"**সূরা আরাফ: ৭৩-৭৯; সূরা হুদ: ৬১-৬৮; সূরা শুআরা:** ১৪১-১৫৯; সূরা হিজর: ৮০-৮৪; সহীহ বুখারী: ৩৩৭৯; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_ibrahim_as","categoryId":"nobider_jiboni","title":"ইব্রাহিম (আঃ) - খলিলুল্লাহ","paragraphs":["হযরত ইব্রাহিম (আঃ) ছিলেন 'খলিলুল্লাহ' (আল্লাহর বন্ধু) এবং 'আবুল আম্বিয়া' (নবীদের পিতা)। তিনি 'উলুল আজম' পাঁচ নবীর একজন। তাঁর জীবন ছিল ত্যাগ, তিতিক্ষা এবং আল্লাহর প্রতি অগাধ বিশ্বাসে পূর্ণ। তিনি মূর্তিপূজার বিরুদ্ধে সংগ্রাম করেছেন, আগুনে নিক্ষিপ্ত হয়েছেন এবং নিজ সন্তানকে কুরবানী করতে প্রস্তুত হয়েছেন।","**বংশ ও শৈশবে সত্য অনুসন্ধান:** ইব্রাহিম (আঃ) এর পূর্ণ নাম ছিল ইব্রাহিম ইবনে তারিখ (আযর)। তিনি জন্মগ্রহণ করেন ইরাকের উর নগরীতে। তাঁর জন্মের সময় নমরুদ ছিল শাসক। নমরুদ স্বপ্ন দেখেছিল যে একটি শিশু তার রাজত্ব ধ্বংস করবে। তাই সে সব নবজাতক ছেলেকে হত্যা করার আদেশ দিল। ইব্রাহিম (আঃ) এর মা তাঁকে গুহায় লুকিয়ে জন্ম দেন এবং গোপনে লালন-পালন করেন। শৈশব থেকেই তিনি চিন্তাশীল ছিলেন। তিনি দেখতেন মানুষ মূর্তি, তারা, চাঁদ এবং সূর্যের পূজা করে। একদিন তিনি তারা দেখে বললেন, 'এটা কি আমার রব?' কিন্তু তারা ডুবে গেল। তারপর চাঁদ এবং সূর্য - সবই ডুবে গেল। তখন তিনি ঘোষণা করলেন:","إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا ۖ وَمَا أَنَا مِنَ الْمُشْرِكِينَ","অর্থ: আমি একনিষ্ঠভাবে তাঁর দিকে মুখ ফিরালাম যিনি আসমান ও জমিন সৃষ্টি করেছেন। আমি মুশরিকদের অন্তর্ভুক্ত নই। [সূরা আনআম: ৭৯]","অর্থ: পিতার সাথে কথোপকথন ও মূর্তি ভাঙা: ইব্রাহিম (আঃ) এর পিতা আযর মূর্তি তৈরি করতেন এবং বিক্রি করতেন। ইব্রাহিম (আঃ) তাঁকে অত্যন্ত নম্রভাবে বললেন, 'হে আমার পিতা! আপনি কেন এমন কিছুর ইবাদত করেন যা শুনে না, দেখে না এবং আপনার কোনো উপকার করে না?' [সূরা মারইয়াম: ৪২] কিন্তু পিতা রাগান্বিত হয়ে বললেন, 'তুমি যদি বিরত না হও তাহলে আমি তোমাকে পাথর মেরে হত্যা করব।' [সূরা মারইয়াম: ৪৬] একদিন জাতির একটি বড় উৎসব ছিল। সবাই শহরের বাইরে গেল। ইব্রাহিম (আঃ) অসুস্থতার অজুহাত দিয়ে থেকে গেলেন। সবাই চলে গেলে তিনি মূর্তি মন্দিরে গিয়ে কুড়াল দিয়ে সব মূর্তি ভেঙে ফেললেন। শুধু সবচেয়ে বড় মূর্তিটি রেখে দিলেন এবং তার গলায় কুড়াল ঝুলিয়ে দিলেন। মানুষ ফিরে এসে রাগে ফেটে পড়ল। তারা ইব্রাহিম (আঃ) কে জিজ্ঞাসা করল: 'তুমি কি আমাদের দেবতাদের সাথে এই কাজ করেছ?' ইব্রাহিম (আঃ) বললেন,","بَلْ فَعَلَهُ كَبِيرُهُمْ هَٰذَا فَاسْأَلُوهُمْ إِن كَانُوا يَنطِقُونَ","অর্থ: বরং এদের সর্দার এই কাজ করেছে। তোমরা এদের জিজ্ঞাসা করো যদি এরা কথা বলতে পারে। [সূরা আম্বিয়া: ৬৩]","তারা বুঝতে পারল মূর্তি কিছুই করতে পারে না কিন্তু অহংকার করে সত্য মানল না।","অর্থ: আগুনে নিক্ষেপ ও মুজিজা: তারা পরাজিত হলো কিন্তু সত্য মানল না। তারা বলল, 'তাকে পুড়িয়ে ফেলো এবং তোমাদের দেবতাদের সাহায্য করো।' [সূরা আম্বিয়া: ৬৮] নমরুদের আদেশে বিশাল আগুন জ্বালানো হলো। এত বড় আগুন যে কাছে যাওয়া যাচ্ছিল না। তারা একটি ম্যানগোনেল (বড় গুলতি) তৈরি করল এবং ইব্রাহিম (আঃ) কে আগুনে ছুঁড়ে মারল। যখন তিনি আগুনের দিকে যাচ্ছিলেন, জিবরাঈল (আঃ) এসে বললেন, 'আপনার কোনো প্রয়োজন আছে?' ইব্রাহিম (আঃ) বললেন, 'আপনার কাছে নয়, আল্লাহর কাছে আছে।' আল্লাহ আদেশ দিলেন:","قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ","অর্থ: হে আগুন! তুমি ইব্রাহিমের জন্য ঠান্ডা এবং নিরাপদ হয়ে যাও। [সূরা আম্বিয়া: ৬৯]","আগুন ঠান্ডা হয়ে গেল। ইব্রাহিম (আঃ) আগুনের মধ্যে বসে আল্লাহর জিকির করছিলেন। কয়েকদিন পর যখন আগুন নিভে গেল, তারা দেখল ইব্রাহিম (আঃ) সুস্থ এবং নিরাপদ বসে আছেন।","অর্থ: নমরুদের সাথে বিতর্ক ও হিজরত: নমরুদ ছিল অত্যাচারী শাসক যে নিজেকে ঈশ্বর দাবি করত। ইব্রাহিম (আঃ) তার কাছে গেলেন এবং বললেন, 'আমার রব তিনি যিনি জীবন দান করেন এবং মৃত্যু দেন।' নমরুদ বলল, 'আমিও জীবন দান করি এবং মৃত্যু দেই।' ইব্রাহিম (আঃ) বললেন, 'আল্লাহ সূর্যকে পূর্ব দিক থেকে উদিত করেন। তুমি একে পশ্চিম দিক থেকে উদিত করো।' [সূরা বাকারা: ২৫৮] নমরুদ হতবাক হয়ে গেল। আল্লাহ ইব্রাহিম (আঃ) কে হিজরত করার আদেশ দিলেন। তিনি তাঁর ভাতিজা লূত (আঃ) এবং স্ত্রী সারা (আঃ) কে নিয়ে ইরাক থেকে ফিলিস্তিন (শাম) এ হিজরত করলেন। পথে মিশরে গেলেন। সেখানে মিশরের শাসক সারা (আঃ) কে নিতে চাইল কিন্তু আল্লাহ তাঁকে রক্ষা করলেন। শাসক হাজেরা (আঃ) নামক একজন দাসীকে উপহার দিল। ইব্রাহিম (আঃ) পরে হাজেরা (আঃ) কে বিবাহ করেন।","**ইসমাঈল (আঃ) এর জন্ম ও মক্কায় রেখে আসা:** হাজেরা (আঃ) থেকে ইসমাঈল (আঃ) জন্ম নেন। ইব্রাহিম (আঃ) তখন ৮৬ বছর বয়সী ছিলেন। কিছুদিন পর আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন হাজেরা এবং শিশু ইসমাঈলকে মক্কায় রেখে আসতে। সেই সময় মক্কা ছিল জনমানবহীন মরুভূমি। ইব্রাহিম (আঃ) তাঁদের রেখে আসার সময় হাজেরা (আঃ) জিজ্ঞাসা করলেন: 'আল্লাহ কি আপনাকে এই আদেশ দিয়েছেন?' ইব্রাহিম (আঃ) বললেন, 'হ্যাঁ।' হাজেরা (আঃ) বললেন, 'তাহলে আল্লাহ আমাদের ধ্বংস করবেন না।' [সহীহ বুখারী: ৩৩৬৪] কিছুদিন পর পানি ও খাবার শেষ হয়ে গেল। হাজেরা (আঃ) পানি খুঁজতে সাফা-মারওয়ার মধ্যে সাতবার দৌড়ালেন। সপ্তমবার ফিরে এসে দেখলেন শিশু ইসমাঈল (আঃ) এর পায়ের কাছে পানি বের হচ্ছে। তিনি 'জম জম' (থামো থামো) বলে পানির চারপাশে বাঁধ দিলেন। এভাবে জমজম কূপের সৃষ্টি হলো।","**কাবা নির্মাণ:** ইসমাঈল (আঃ) বড় হলে আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন কাবা ঘর নির্মাণ করতে। পিতা-পুত্র মিলে কাবা নির্মাণ করলেন। ইব্রাহিম (আঃ) পাথর বহন করতেন এবং ইসমাঈল (আঃ) দেয়াল তৈরি করতেন। তাঁরা দোয়া করতেন:","رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ","অর্থ: হে আমাদের রব! আমাদের থেকে কবুল করুন। নিশ্চয়ই আপনি সর্বশ্রোতা, সর্বজ্ঞ। [সূরা বাকারা: ১২৭]","হাজরে আসওয়াদ (কালো পাথর) স্থাপনের সময় ইব্রাহিম (আঃ) একটি পাথরের উপর দাঁড়িয়েছিলেন। সেই পাথরে তাঁর পায়ের ছাপ পড়ে গিয়েছিল। এটি 'মাকামে ইব্রাহিম' নামে পরিচিত। কাবা নির্মাণের পর ইব্রাহিম (আঃ) মানুষকে হজের ঘোষণা দিলেন।","অর্থ: স্বপ্নে কুরবানীর আদেশ ও মহান পরীক্ষা: ইসমাঈল (আঃ) যখন কিশোর হলেন, ইব্রাহিম (আঃ) স্বপ্নে দেখলেন তিনি তাঁর প্রিয় পুত্রকে কুরবানী করছেন। নবীদের স্বপ্ন হলো ওহী। তিনি ইসমাঈল (আঃ) কে বললেন, 'হে আমার ছেলে! আমি স্বপ্নে দেখি যে আমি তোমাকে জবাই করছি। তুমি কী মনে করো?' [সূরা সাফফাত: ১০২] ইসমাঈল (আঃ) বললেন, 'হে আমার পিতা! আপনাকে যা আদেশ করা হয়েছে তা করুন। ইনশাআল্লাহ আপনি আমাকে ধৈর্যশীলদের মধ্যে পাবেন।' [সূরা সাফফাত: ১০২] ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে মিনায় নিয়ে গেলেন। পথে শয়তান তিনবার বাধা দিতে চেষ্টা করল। ইব্রাহিম (আঃ) তিনবার শয়তানকে পাথর মারলেন। মিনায় পৌঁছে ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে শুইয়ে দিলেন এবং ছুরি চালালেন। কিন্তু আল্লাহর কুদরতে ছুরি কাটল না। আল্লাহ ডাক দিলেন:","يَا إِبْرَاهِيمُ ۝ قَدْ صَدَّقْتَ الرُّؤْيَا ۚ إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ ۝ إِنَّ هَٰذَا لَهُوَ الْبَلَاءُ الْمُبِينُ ۝ وَفَدَيْنَاهُ بِذِبْحٍ عَظِيمٍ","অর্থ: হে ইব্রাহিম! তুমি স্বপ্ন সত্য করে দেখিয়েছ। আমি এভাবেই সৎকর্মশীলদের প্রতিদান দেই। নিশ্চয়ই এটি ছিল এক স্পষ্ট পরীক্ষা। আমি তাকে মুক্ত করলাম এক মহান কুরবানীর বিনিময়ে। [সূরা সাফফাত: ১০৪-১০৭]","আল্লাহ জান্নাত থেকে একটি দুম্বা পাঠালেন যা ইব্রাহিম (আঃ) কুরবানী করলেন। এই ঘটনার স্মরণে প্রতি বছর কুরবানী করা হয়।","অর্থ: ইসহাক (আঃ) এর জন্ম ও মৃত্যু: সারা (আঃ) এর কোনো সন্তান ছিল না। তিনি বৃদ্ধা হয়ে গিয়েছিলেন। একদিন ফেরেশতারা মানুষের রূপে ইব্রাহিম (আঃ) এর কাছে এলেন। তিনি তাঁদের জন্য ভুনা বাছুর নিয়ে এলেন। কিন্তু তাঁরা খেলেন না। তিনি ভয় পেলেন। তাঁরা বললেন, 'ভয় পাবেন না। আমরা লূত (আঃ) এর জাতিকে ধ্বংস করতে যাচ্ছি।' তাঁরা সারা (আঃ) কে সুসংবাদ দিলেন: 'আমরা তোমাকে ইসহাক এবং ইসহাকের পরে ইয়াকুবের সুসংবাদ দিচ্ছি।' [সূরা হুদ: ৬৯-৭১] সারা (আঃ) বিস্মিত হয়ে বললেন, 'আমি বৃদ্ধা এবং আমার স্বামীও বৃদ্ধ!' ফেরেশতারা বললেন, 'এটা আল্লাহর আদেশ।' এভাবে ইসহাক (আঃ) জন্ম নেন। ইব্রাহিম (আঃ) ১৭৫ বছর বয়সে ইন্তেকাল করেন। তাঁকে হেবরনে (ফিলিস্তিন) দাফন করা হয়। তাঁর দুই ছেলে ইসমাঈল এবং ইসহাক (আঃ) তাঁর জানাযায় উপস্থিত ছিলেন।"],"source":"**সূরা বাকারা: ১২৪-১২৯, ২৫৮; সূরা আনআম:** ৭৪-৮৩; সূরা মারইয়াম: ৪১-৫০; সূরা আম্বিয়া: ৫১-৭৩; সূরা সাফফাত: ৮৩-১১৩; সহীহ বুখারী: ৩৩৬৪, ৩৩৭২; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_lut_as","categoryId":"nobider_jiboni","title":"লূত (আঃ) - সদোম ও গোমোরার নবী","paragraphs":["হযরত লূত (আঃ) ছিলেন ইব্রাহিম (আঃ) এর ভাতিজা এবং সদোম ও গোমোরা জাতির নবী। তিনি তাঁর জাতিকে ভয়াবহ পাপ থেকে বিরত থাকতে বলেছিলেন কিন্তু তারা মানেনি। আল্লাহ তাদের ভয়ংকর শাস্তি দিয়েছেন।","**বংশ ও ইব্রাহিম (আঃ) এর সাথে হিজরত:** লূত (আঃ) ছিলেন ইব্রাহিম (আঃ) এর ভাই হারানের ছেলে। তিনি জন্মগ্রহণ করেন ইরাকের উর নগরীতে। যখন ইব্রাহিম (আঃ) নমরুদের অত্যাচার থেকে হিজরত করলেন, লূত (আঃ) তাঁর সাথে ঈমান এনেছিলেন এবং হিজরত করেছিলেন। কুরআনে বলা হয়েছে:","فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي مُهَاجِرٌ إِلَىٰ رَبِّي","অর্থ: অতঃপর লূত তাঁর প্রতি ঈমান আনল এবং বলল, আমি আমার রবের দিকে হিজরত করছি। [সূরা আনকাবুত: ২৬]","তাঁরা একসাথে ফিলিস্তিন এবং মিশর ভ্রমণ করেন। পরে আল্লাহ লূত (আঃ) কে নবী হিসেবে সদোম ও গোমোরা (বর্তমান জর্ডান ও ফিলিস্তিনের মৃত সাগর অঞ্চল) এ পাঠান।","**সদোম জাতির ভয়াবহ পাপ:** সদোম ও গোমোরার মানুষ ছিল অত্যন্ত পাপিষ্ঠ। তারা এমন পাপ করত যা পৃথিবীতে আগে কেউ করেনি - সমকামিতা। তারা নারীদের ছেড়ে পুরুষদের সাথে কুকর্ম করত। এছাড়াও তারা রাস্তায় ডাকাতি করত, মুসাফিরদের লুট করত এবং প্রকাশ্যে অশ্লীলতা করত। তারা ছিল অত্যন্ত ধনী কিন্তু নৈতিকভাবে পতিত। কুরআনে লূত (আঃ) তাদের বলেন,","أَتَأْتُونَ الذُّكْرَانَ مِنَ الْعَالَمِينَ ۝ وَتَذَرُونَ مَا خَلَقَ لَكُمْ رَبُّكُم مِّنْ أَزْوَاجِكُم ۚ بَلْ أَنتُمْ قَوْمٌ عَادُونَ","অর্থ: তোমরা কি সৃষ্টির মধ্যে পুরুষদের কাছে যাও? এবং তোমাদের রব তোমাদের জন্য যে স্ত্রীদের সৃষ্টি করেছেন তাদের ছেড়ে দাও? বরং তোমরা সীমালঙ্ঘনকারী জাতি। [সূরা শুআরা: ১৬৫-১৬৬]","**লূত (আঃ) এর দাওয়াত ও জাতির প্রত্যাখ্যান:** লূত (আঃ) তাঁর জাতিকে বারবার সতর্ক করলেন। তিনি বললেন, তোমরা আল্লাহকে ভয় করো এবং এই জঘন্য কাজ থেকে বিরত থাকো। তোমরা এমন কাজ করছ যা তোমাদের আগে কেউ করেনি। কিন্তু তারা শুনল না। বরং তারা বলল,","لَئِن لَّمْ تَنتَهِ يَا لُوطُ لَتَكُونَنَّ مِنَ الْمُخْرَجِينَ","অর্থ: হে লূত! তুমি যদি বিরত না হও তাহলে অবশ্যই বহিষ্কৃতদের অন্তর্ভুক্ত হবে। [সূরা শুআরা: ১৬৭]","তারা লূত (আঃ) কে এবং তাঁর অনুসারীদের শহর থেকে বের করে দিতে চাইল। তারা বলল,","أَخْرِجُوا آلَ لُوطٍ مِّن قَرْيَتِكُمْ ۖ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ","অর্থ: লূতের পরিবারকে তোমাদের শহর থেকে বের করে দাও। তারা তো এমন মানুষ যারা পবিত্র থাকতে চায়! [সূরা নামল: ৫৬]","এটি ছিল তাদের ব্যঙ্গ - পবিত্রতাকে তারা দোষ মনে করত!","অর্থ: ফেরেশতাদের আগমন ও জাতির আক্রমণ: একদিন তিনজন ফেরেশতা সুন্দর যুবকের রূপে লূত (আঃ) এর বাড়িতে মেহমান হিসেবে এলেন। তাঁরা ছিলেন জিবরাঈল, মিকাঈল এবং ইসরাফিল (আঃ)। লূত (আঃ) তাঁদের চিনতে পারলেন না। তিনি তাঁদের দেখে চিন্তিত হলেন কারণ তিনি জানতেন তাঁর জাতি কত খারাপ। তিনি মনে মনে ভাবলেন, এটা তো বড় কঠিন দিন! [সূরা হুদ: ৭৭] খবর ছড়িয়ে গেল যে লূত (আঃ) এর বাড়িতে সুন্দর যুবক মেহমান এসেছে। সদোমের লোকেরা দল বেঁধে লূত (আঃ) এর বাড়িতে এলো। তারা দরজা ভাঙতে চাইল। লূত (আঃ) তাদের বললেন,","هَٰؤُلَاءِ بَنَاتِي إِن كُنتُمْ فَاعِلِينَ","অর্থ: এরা আমার কন্যারা (জাতির মেয়েরা) যদি তোমরা বিয়ে করতে চাও। [সূরা হিজর: ৭১]","তিনি তাদের বৈধ পথে যেতে বললেন। কিন্তু তারা বলল, তুমি তো জানো আমাদের তোমার কন্যাদের প্রতি কোনো আগ্রহ নেই। লূত (আঃ) অসহায় হয়ে বললেন,","لَوْ أَنَّ لِي بِكُمْ قُوَّةً أَوْ آوِي إِلَىٰ رُكْنٍ شَدِيدٍ","অর্থ: আহা! যদি তোমাদের বিরুদ্ধে আমার শক্তি থাকত অথবা কোনো শক্তিশালী আশ্রয় থাকত! [সূরা হুদ: ৮০]","অর্থ: তখন ফেরেশতারা বললেন, হে লূত! আমরা তোমার রবের ফেরেশতা। তারা তোমার কাছে পৌঁছতে পারবে না। [সূরা হুদ: ৮১] জিবরাঈল (আঃ) তাঁর ডানা দিয়ে একবার আঘাত করলেন। সবাই অন্ধ হয়ে গেল এবং দরজা খুঁজে পেল না।","অর্থ: শাস্তির সতর্কবাণী ও হিজরত: ফেরেশতারা লূত (আঃ) কে বললেন, তুমি রাতের শেষ প্রহরে তোমার পরিবার নিয়ে বের হয়ে যাও। তোমাদের কেউ পেছনে তাকাবে না। কিন্তু তোমার স্ত্রী - তার উপর যা আপতিত হবে তা তাদের উপরও আপতিত হবে। নিশ্চয়ই তাদের নির্ধারিত সময় হলো ভোর। [সূরা হিজর: ৬৫-৬৬] লূত (আঃ) এর স্ত্রী ছিল কাফির। সে গোপনে জাতির সাথে যোগসাজশ করত এবং মেহমানদের খবর তাদের জানাত। লূত (আঃ) রাতের অন্ধকারে তাঁর পরিবার নিয়ে শহর ছেড়ে বের হলেন। তাঁর সাথে ছিল তাঁর দুই কন্যা। মাত্র কয়েকজন মুমিন তাঁর সাথে ছিল।","**ভয়াবহ শাস্তি ও ধ্বংস:** ভোর হতেই আল্লাহর শাস্তি নেমে এলো। প্রথমে এলো ভয়ংকর চিৎকার যা তাদের কানের পর্দা ফাটিয়ে দিল। তারপর জিবরাঈল (আঃ) তাঁর ডানা দিয়ে পুরো শহর তুলে নিলেন এবং উল্টে দিলেন। শহরগুলো মাটিতে আছড়ে পড়ল। তারপর আকাশ থেকে পাথর বৃষ্টি হলো - প্রত্যেক পাপীর জন্য চিহ্নিত পাথর। কুরআনে বলা হয়েছে:","فَلَمَّا جَاءَ أَمْرُنَا جَعَلْنَا عَالِيَهَا سَافِلَهَا وَأَمْطَرْنَا عَلَيْهَا حِجَارَةً مِّن سِجِّيلٍ مَّنضُودٍ ۝ مُّسَوَّمَةً عِندَ رَبِّكَ ۖ وَمَا هِيَ مِنَ الظَّالِمِينَ بِبَعِيدٍ","অর্থ: অতঃপর যখন আমার আদেশ এলো, আমি শহরের উপরকে নিচে করে দিলাম এবং তার উপর স্তরে স্তরে পোড়া মাটির পাথর বর্ষণ করলাম। যা তোমার রবের কাছে চিহ্নিত ছিল। এবং তা জালিমদের থেকে দূরে নয়। [সূরা হুদ: ৮২-৮৩]","লূত (আঃ) এর স্ত্রী পেছনে তাকিয়েছিল এবং সে-ও ধ্বংস হলো। পুরো জাতি নিশ্চিহ্ন হয়ে গেল। আজও মৃত সাগর অঞ্চলে সেই ধ্বংসের চিহ্ন রয়েছে। সেখানে কোনো প্রাণী বাস করে না এবং পানি এত লবণাক্ত যে কিছুই ডুবে না।","**পরবর্তী জীবন ও শিক্ষা:** লূত (আঃ) এবং তাঁর দুই কন্যা নিরাপদে বেঁচে গেলেন। তাঁরা ফিলিস্তিনে চলে গেলেন এবং সেখানে বসবাস করেন। লূত (আঃ) তাঁর জীবনের বাকি অংশ আল্লাহর ইবাদতে কাটান। তাঁর উম্মতকে তিনি তাওহীদ এবং পবিত্রতার শিক্ষা দিয়ে গেছেন। সদোমের ঘটনা পৃথিবীর জন্য চিরকালের শিক্ষা - যারা আল্লাহর সীমা লঙ্ঘন করে এবং প্রকৃতি বিরোধী পাপে লিপ্ত হয় তাদের পরিণতি ভয়াবহ।"],"source":"**সূরা আরাফ: ৮০-৮৪; সূরা হুদ: ৭৭-৮৩; সূরা হিজর:** ৫৭-৭৭; সূরা শুআরা: ১৬০-১৭৫; সূরা নামল: ৫৪-৫৮; সূরা আনকাবুত: ২৮-৩৫।"},{"id":"nabi_yusuf_as","categoryId":"nobider_jiboni","title":"ইউসুফ (আঃ) - সবচেয়ে সুন্দর","paragraphs":["হযরত ইউসুফ (আঃ) ছিলেন ইয়াকুব (আঃ) এর পুত্র এবং সবচেয়ে সুন্দর মানুষ। তাঁর জীবন ছিল পরীক্ষা, ধৈর্য এবং বিজয়ে পূর্ণ। কুরআনে তাঁর সম্পূর্ণ জীবনী একটি সূরায় বর্ণিত হয়েছে - সূরা ইউসুফ।","**শৈশবে স্বপ্ন:** ইউসুফ (আঃ) ছোটবেলায় একটি স্বপ্ন দেখলেন। তিনি তাঁর পিতা ইয়াকুব (আঃ) কে বললেন,","يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ","অর্থ: হে আমার পিতা! আমি স্বপ্নে দেখেছি এগারোটি তারা, সূর্য এবং চাঁদ আমাকে সিজদা করছে। [সূরা ইউসুফ: ৪]","ইয়াকুব (আঃ) বুঝলেন এটি একটি বিশেষ স্বপ্ন। তিনি বললেন,","لَا تَقْصُصْ رُؤْيَاكَ عَلَىٰ إِخْوَتِكَ فَيَكِيدُوا لَكَ كَيْدًا ۖ إِنَّ الشَّيْطَانَ لِلْإِنسَانِ عَدُوٌّ مُّبِينٌ","অর্থ: তোমার স্বপ্ন তোমার ভাইদের কাছে বলো না, তাহলে তারা তোমার বিরুদ্ধে ষড়যন্ত্র করবে। নিশ্চয়ই শয়তান মানুষের প্রকাশ্য শত্রু। [সূরা ইউসুফ: ৫]","ইয়াকুব (আঃ) জানতেন ইউসুফ (আঃ) নবী হবেন এবং উচ্চ মর্যাদা পাবেন।","**ভাইদের হিংসা ও ষড়যন্ত্র:** ইউসুফ (আঃ) এর এগারো ভাই ছিল এবং একজন সৎ ভাই বিনইয়ামিন। ইয়াকুব (আঃ) ইউসুফ এবং বিনইয়ামিনকে বেশি ভালোবাসতেন কারণ তাঁদের মা রাহেল (আঃ) মারা গিয়েছিলেন এবং তাঁরা ছিল ছোট। বড় ভাইরা এতে হিংসা করত। তারা বলল,","لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰ أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌ إِنَّ أَبَانَا لَفِي ضَلَالٍ مُّبِينٍ","অর্থ: ইউসুফ ও তার ভাই আমাদের পিতার কাছে আমাদের চেয়ে বেশি প্রিয়, অথচ আমরা একটি শক্তিশালী দল। নিশ্চয়ই আমাদের পিতা স্পষ্ট ভুলের মধ্যে আছেন। [সূরা ইউসুফ: ৮]","অর্থ: তারা ষড়যন্ত্র করল। একজন বলল, 'ইউসুফকে হত্যা করো অথবা কোনো দূরের জায়গায় ফেলে দাও। তাহলে তোমাদের পিতার মনোযোগ তোমাদের দিকে আসবে।' [সূরা ইউসুফ: ৯] তাদের মধ্যে একজন (বড় ভাই রূবিল) বলল, 'তাকে হত্যা করো না। যদি কিছু করতেই হয় তাহলে কোনো কূপের গভীরে ফেলে দাও। কোনো কাফেলা তাকে তুলে নেবে।' [সূরা ইউসুফ: ১০]","অর্থ: কূপে ফেলা: ভাইরা পিতার কাছে এসে বলল, 'আপনি ইউসুফকে আমাদের সাথে পাঠান না কেন? আমরা তার শুভাকাঙ্ক্ষী। আগামীকাল তাকে আমাদের সাথে পাঠান, সে খেলবে এবং আনন্দ করবে। আমরা তার হেফাজতকারী।' [সূরা ইউসুফ: ১১-১২] ইয়াকুব (আঃ) চিন্তিত হয়ে বললেন,","إِنِّي لَيَحْزُنُنِي أَن تَذْهَبُوا بِهِ وَأَخَافُ أَن يَأْكُلَهُ الذِّئْبُ وَأَنتُمْ عَنْهُ غَافِلُونَ","অর্থ: আমার কষ্ট হয় তোমরা তাকে নিয়ে যাবে এবং আমি ভয় পাই বাঘে তাকে খেয়ে ফেলবে যখন তোমরা অসাবধান থাকবে। [সূরা ইউসুফ: ১৩]","তারা বলল, 'আমরা এত বড় দল, তবুও যদি বাঘে তাকে খায় তাহলে আমরা তো ক্ষতিগ্রস্ত!' ইয়াকুব (আঃ) অনিচ্ছা সত্ত্বেও ইউসুফ (আঃ) কে পাঠালেন। তারা ইউসুফ (আঃ) কে নিয়ে গেল এবং একটি গভীর কূপে ফেলে দিল। আল্লাহ ইউসুফ (আঃ) কে সান্ত্বনা দিয়ে ওহী পাঠালেন:","لَتُنَبِّئَنَّهُم بِأَمْرِهِمْ هَٰذَا وَهُمْ لَا يَشْعُرُونَ","অর্থ: তুমি অবশ্যই তাদের এই কাজের কথা তাদের জানাবে যখন তারা টের পাবে না। [সূরা ইউসুফ: ১৫]","**মিথ্যা অজুহাত:** সন্ধ্যায় তারা কাঁদতে কাঁদতে পিতার কাছে ফিরল। তারা বলল,","يَا أَبَانَا إِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِندَ مَتَاعِنَا فَأَكَلَهُ الذِّئْبُ ۖ وَمَا أَنتَ بِمُؤْمِنٍ لَّنَا وَلَوْ كُنَّا صَادِقِينَ","অর্থ: হে আমাদের পিতা! আমরা দৌড় প্রতিযোগিতা করতে গিয়েছিলাম এবং ইউসুফকে আমাদের সামগ্রীর কাছে রেখে গিয়েছিলাম। তারপর বাঘ তাকে খেয়ে ফেলেছে। আপনি আমাদের বিশ্বাস করবেন না যদিও আমরা সত্যবাদী। [সূরা ইউসুফ: ১৭]","তারা ইউসুফ (আঃ) এর জামায় ভেড়ার রক্ত লাগিয়ে নিয়ে এসেছিল। ইয়াকুব (আঃ) জামা দেখে বললেন, 'অদ্ভুত বাঘ! জামা ছিঁড়ল না কিন্তু ইউসুফকে খেয়ে ফেলল!' তিনি বুঝলেন এটা মিথ্যা। তিনি বললেন,","بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ","অর্থ: বরং তোমাদের মন তোমাদের একটি কাজ সাজিয়ে দিয়েছে। সুতরাং সুন্দর ধৈর্য! তোমরা যা বর্ণনা করছ সে ব্যাপারে আল্লাহই সাহায্যস্থল। [সূরা ইউসুফ: ১৮]","ইয়াকুব (আঃ) ধৈর্য ধরলেন এবং আল্লাহর কাছে দোয়া করতে লাগলেন।","অর্থ: মিশরে বিক্রি ও আজিজের বাড়িতে: কূপে ইউসুফ (আঃ) আল্লাহর উপর ভরসা করে অপেক্ষা করছিলেন। একটি বাণিজ্য কাফেলা সেখান দিয়ে যাচ্ছিল। তারা পানি তুলতে বালতি ফেলল। ইউসুফ (আঃ) বালতি ধরলেন। তারা খুশি হয়ে বলল, 'সুসংবাদ! এটা তো একটি কিশোর!' তারা ইউসুফ (আঃ) কে পণ্য হিসেবে লুকিয়ে রাখল। [সূরা ইউসুফ: ১৯] তারা মিশরে পৌঁছে ইউসুফ (আঃ) কে দাস হিসেবে বিক্রি করল। মিশরের আজিজ (অর্থমন্ত্রী) কিতফির তাঁকে কিনে নিলেন। তিনি তাঁর স্ত্রী জুলাইখাকে বললেন,","أَكْرِمِي مَثْوَاهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا","অর্থ: এর থাকার ব্যবস্থা ভালো করো। হয়তো সে আমাদের উপকারে আসবে অথবা আমরা তাকে পুত্র হিসেবে গ্রহণ করব। [সূরা ইউসুফ: ২১]","ইউসুফ (আঃ) আজিজের বাড়িতে বড় হতে লাগলেন। আল্লাহ তাঁকে জ্ঞান ও প্রজ্ঞা দান করলেন।","**জুলাইখার ফিতনা ও ইউসুফ (আঃ) এর পবিত্রতা:** ইউসুফ (আঃ) যৌবনে পৌঁছলেন। তিনি ছিলেন অসাধারণ সুন্দর - আল্লাহ তাঁকে অর্ধেক সৌন্দর্য দিয়েছিলেন। জুলাইখা তাঁর প্রতি আকৃষ্ট হলো। একদিন সে সব দরজা বন্ধ করে ইউসুফ (আঃ) কে ডেকে বলল, 'এসো!' ইউসুফ (আঃ) বললেন,","مَعَاذَ اللَّهِ ۖ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ ۖ إِنَّهُ لَا يُفْلِحُ الظَّالِمُونَ","অর্থ: আল্লাহর আশ্রয়! তিনি আমার মালিক, তিনি আমার থাকার ব্যবস্থা ভালো করেছেন। নিশ্চয়ই জালিমরা সফল হয় না। [সূরা ইউসুফ: ২৩]","অর্থ: জুলাইখা তাঁকে ধরতে গেল। ইউসুফ (আঃ) দরজার দিকে দৌড়ালেন। জুলাইখা পেছন থেকে তাঁর জামা ধরল এবং জামা ছিঁড়ে গেল। দরজায় পৌঁছে দেখলেন আজিজ দাঁড়িয়ে আছেন। জুলাইখা সাথে সাথে মিথ্যা অভিযোগ করল: 'যে তোমার পরিবারের সাথে খারাপ ইচ্ছা করে তার শাস্তি কারাগার অথবা যন্ত্রণাদায়ক শাস্তি ছাড়া কী?' [সূরা ইউসুফ: ২৫] ইউসুফ (আঃ) বললেন, 'সে-ই আমাকে প্রলোভিত করেছে।' [সূরা ইউসুফ: ২৬]","অর্থ: সাক্ষী ও নারীদের ষড়যন্ত্র: জুলাইখার এক আত্মীয় (শিশু অথবা জ্ঞানী ব্যক্তি) বলল, 'যদি জামা সামনে থেকে ছেঁড়া হয় তাহলে সে সত্যবাদী এবং ইউসুফ মিথ্যাবাদী। আর যদি পেছন থেকে ছেঁড়া হয় তাহলে সে মিথ্যাবাদী এবং ইউসুফ সত্যবাদী।' [সূরা ইউসুফ: ২৬-২৭] জামা দেখা গেল পেছন থেকে ছেঁড়া। আজিজ বুঝলেন সত্য কী। তিনি জুলাইখাকে বললেন, 'এটা তোমার ষড়যন্ত্র। নিশ্চয়ই তোমাদের (নারীদের) ষড়যন্ত্র মহা ভয়ংকর!' [সূরা ইউসুফ: ২৮] তিনি ইউসুফ (আঃ) কে বললেন, 'এই বিষয় এড়িয়ে যাও।' এবং জুলাইখাকে বললেন, 'তোমার পাপের জন্য ক্ষমা চাও।' [সূরা ইউসুফ: ২৯]","অর্থ: কিন্তু খবর শহরে ছড়িয়ে গেল। নারীরা বলাবলি করতে লাগল: 'আজিজের স্ত্রী তার দাসকে প্রলোভিত করছে। সে তার প্রেমে পাগল হয়ে গেছে।' [সূরা ইউসুফ: ৩০] জুলাইখা তাদের একটি ভোজসভায় আমন্ত্রণ করল এবং প্রত্যেককে একটি ছুরি ও ফল দিল। তারপর ইউসুফ (আঃ) কে ডাকল। তাঁকে দেখে নারীরা এত মুগ্ধ হলো যে নিজেদের হাত কেটে ফেলল। তারা বলল,","حَاشَ لِلَّهِ مَا هَٰذَا بَشَرًا إِنْ هَٰذَا إِلَّا مَلَكٌ كَرِيمٌ","অর্থ: আল্লাহর পবিত্রতা! এ তো মানুষ নয়, এ তো এক সম্মানিত ফেরেশতা! [সূরা ইউসুফ: ৩১]","অর্থ: জুলাইখা বলল, 'এই সেই ব্যক্তি যার জন্য তোমরা আমাকে তিরস্কার করছিলে। আমি তাকে প্রলোভিত করেছি কিন্তু সে বিরত থেকেছে। যদি সে আমার আদেশ না মানে তাহলে অবশ্যই কারাগারে যাবে।' [সূরা ইউসুফ: ৩২]","**কারাগারে যাওয়া:** ইউসুফ (আঃ) আল্লাহর কাছে দোয়া করলেন:","رَبِّ السِّجْنُ أَحَبُّ إِلَيَّ مِمَّا يَدْعُونَنِي إِلَيْهِ ۖ وَإِلَّا تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُن مِّنَ الْجَاهِلِينَ","অর্থ: হে আমার রব! তারা আমাকে যার দিকে ডাকছে তার চেয়ে কারাগার আমার কাছে বেশি প্রিয়। যদি আপনি তাদের ষড়যন্ত্র আমার থেকে দূর না করেন তাহলে আমি তাদের দিকে ঝুঁকে পড়ব এবং মূর্খদের অন্তর্ভুক্ত হব। [সূরা ইউসুফ: ৩৩]","অর্থ: আল্লাহ তাঁর দোয়া কবুল করলেন এবং নারীদের ষড়যন্ত্র থেকে রক্ষা করলেন। কিন্তু আজিজ এবং তার পরিবার সমাজের চাপে ইউসুফ (আঃ) কে কারাগারে পাঠাল - যদিও তারা জানত তিনি নির্দোষ। [সূরা ইউসুফ: ৩৫] এভাবে ইউসুফ (আঃ) পাপ থেকে বাঁচার জন্য কারাগার বেছে নিলেন।","অর্থ: কারাগারে দাওয়াত ও স্বপ্নের ব্যাখ্যা: কারাগারে ইউসুফ (আঃ) মানুষকে তাওহীদের দাওয়াত দিতে লাগলেন। তাঁর সাথে দুইজন যুবক কারাগারে এলো - একজন বাদশাহর সাকি এবং অন্যজন রাঁধুনি। তারা উভয়ে স্বপ্ন দেখল। সাকি দেখল সে আঙুর নিংড়ে রস তৈরি করছে এবং রাঁধুনি দেখল তার মাথায় রুটি আছে এবং পাখি তা খাচ্ছে। তারা ইউসুফ (আঃ) কে জিজ্ঞাসা করল: 'এর ব্যাখ্যা কী? আমরা আপনাকে সৎকর্মশীলদের মধ্যে দেখছি।' [সূরা ইউসুফ: ৩৬] ইউসুফ (আঃ) প্রথমে তাদের তাওহীদের দাওয়াত দিলেন। তিনি বললেন,","يَا صَاحِبَيِ السِّجْنِ أَأَرْبَابٌ مُّتَفَرِّقُونَ خَيْرٌ أَمِ اللَّهُ الْوَاحِدُ الْقَهَّارُ","অর্থ: হে আমার কারাগারের সাথীরা! বিভিন্ন রব ভালো নাকি এক মহাপরাক্রমশালী আল্লাহ? [সূরা ইউসুফ: ৩৯]","অর্থ: তারপর তিনি স্বপ্নের ব্যাখ্যা দিলেন: 'তোমাদের একজন (সাকি) তার মালিককে মদ পান করাবে এবং অন্যজনকে (রাঁধুনি) শূলে চড়ানো হবে এবং পাখি তার মাথা খাবে।' [সূরা ইউসুফ: ৪১] ইউসুফ (আঃ) সাকিকে বললেন, 'তুমি যখন মুক্তি পাবে তখন তোমার মালিকের কাছে আমার কথা বলো।' কিন্তু শয়তান সাকিকে ভুলিয়ে দিল এবং সে ইউসুফ (আঃ) এর কথা ভুলে গেল। ইউসুফ (আঃ) আরও কয়েক বছর কারাগারে রইলেন। [সূরা ইউসুফ: ৪২]","অর্থ: বাদশাহর স্বপ্ন ও ইউসুফ (আঃ) এর ব্যাখ্যা: কয়েক বছর পর মিশরের বাদশাহ একটি স্বপ্ন দেখলেন। তিনি দেখলেন সাতটি মোটা গরু এবং সাতটি শীর্ণ গরু তাদের খেয়ে ফেলছে। এবং সাতটি সবুজ শীষ এবং সাতটি শুকনো শীষ। তিনি তাঁর পণ্ডিতদের জিজ্ঞাসা করলেন। তারা বলল, 'এটা তো এলোমেলো স্বপ্ন। আমরা স্বপ্নের ব্যাখ্যা জানি না।' [সূরা ইউসুফ: ৪৩-৪৪] তখন সাকি ইউসুফ (আঃ) এর কথা মনে করল। সে বলল, 'আমি আপনাদের এর ব্যাখ্যা জানাব। আমাকে কারাগারে পাঠান।' সে কারাগারে গিয়ে ইউসুফ (আঃ) কে স্বপ্ন বলল। ইউসুফ (আঃ) বললেন,","تَزْرَعُونَ سَبْعَ سِنِينَ دَأَبًا فَمَا حَصَدتُّمْ فَذَرُوهُ فِي سُنبُلِهِ إِلَّا قَلِيلًا مِّمَّا تَأْكُلُونَ ۝ ثُمَّ يَأْتِي مِن بَعْدِ ذَٰلِكَ سَبْعٌ شِدَادٌ يَأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ إِلَّا قَلِيلًا مِّمَّا تُحْصِنُونَ ۝ ثُمَّ يَأْتِي مِن بَعْدِ ذَٰلِكَ عَامٌ فِيهِ يُغَاثُ النَّاسُ وَفِيهِ يَعْصِرُونَ","অর্থ: তোমরা সাত বছর নিয়মিত চাষ করবে। তোমরা যা কাটবে তা শীষসহ রেখে দেবে শুধু যা খাবে তা ছাড়া। তারপর আসবে সাত বছর কঠিন দুর্ভিক্ষ যা তোমরা সঞ্চয় করেছ তা খেয়ে ফেলবে শুধু যা সংরক্ষণ করবে তা ছাড়া। তারপর আসবে এক বছর যাতে মানুষ বৃষ্টি পাবে এবং ফসল নিংড়াবে। [সূরা ইউসুফ: ৪৭-৪৯]","বাদশাহ এই ব্যাখ্যা শুনে মুগ্ধ হলেন এবং বললেন, 'তাকে আমার কাছে নিয়ে এসো।'","নির্দোষিতা প্রমাণ ও মুক্তি: যখন দূত ইউসুফ (আঃ) কে ডাকতে এলো, তিনি বললেন,","ارْجِعْ إِلَىٰ رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ اللَّاتِي قَطَّعْنَ أَيْدِيَهُنَّ ۚ إِنَّ رَبِّي بِكَيْدِهِنَّ عَلِيمٌ","অর্থ: তুমি তোমার মালিকের কাছে ফিরে যাও এবং তাকে জিজ্ঞাসা করো সেই নারীদের ব্যাপার কী যারা তাদের হাত কেটেছিল। নিশ্চয়ই আমার রব তাদের ষড়যন্ত্র সম্পর্কে জানেন। [সূরা ইউসুফ: ৫০]","ইউসুফ (আঃ) চাইলেন তাঁর নির্দোষিতা প্রমাণিত হোক। বাদশাহ নারীদের ডেকে জিজ্ঞাসা করলেন: 'তোমরা যখন ইউসুফকে প্রলোভিত করেছিলে তখন কী হয়েছিল?' তারা বলল,","حَاشَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوءٍ","অর্থ: আল্লাহর পবিত্রতা! আমরা তার কোনো দোষ জানি না। [সূরা ইউসুফ: ৫১]","জুলাইখা সত্য স্বীকার করল:","الْآنَ حَصْحَصَ الْحَقُّ أَنَا رَاوَدتُّهُ عَن نَّفْسِهِ وَإِنَّهُ لَمِنَ الصَّادِقِينَ","অর্থ: এখন সত্য প্রকাশ হলো। আমিই তাকে প্রলোভিত করেছিলাম এবং সে অবশ্যই সত্যবাদীদের অন্তর্ভুক্ত। [সূরা ইউসুফ: ৫১]","অর্থ: ইউসুফ (আঃ) বললেন, 'এটা এজন্য যাতে সে (আজিজ) জানে যে আমি তার অনুপস্থিতিতে বিশ্বাসঘাতকতা করিনি এবং আল্লাহ বিশ্বাসঘাতকদের ষড়যন্ত্র সফল করেন না।' [সূরা ইউসুফ: ৫২]","অর্থ: মিশরের মন্ত্রী হওয়া: বাদশাহ ইউসুফ (আঃ) কে ডেকে বললেন, 'আজ থেকে তুমি আমাদের কাছে মর্যাদাবান এবং বিশ্বস্ত।' [সূরা ইউসুফ: ৫৪] ইউসুফ (আঃ) বললেন,","اجْعَلْنِي عَلَىٰ خَزَائِنِ الْأَرْضِ ۖ إِنِّي حَفِيظٌ عَلِيمٌ","অর্থ: আমাকে দেশের ভাণ্ডারের দায়িত্ব দিন। আমি হেফাজতকারী, জ্ঞানী। [সূরা ইউসুফ: ৫৫]","বাদশাহ তাঁকে মিশরের অর্থমন্ত্রী বানালেন। ইউসুফ (আঃ) সাত বছরের সমৃদ্ধির সময় খাদ্য সংরক্ষণ করলেন। তারপর দুর্ভিক্ষ শুরু হলো। শুধু মিশরেই নয়, আশেপাশের সব দেশে দুর্ভিক্ষ হলো। কিন্তু মিশরে খাদ্য ছিল। মানুষ সব দেশ থেকে মিশরে খাদ্য কিনতে আসত। ইউসুফ (আঃ) ন্যায়পরায়ণতার সাথে খাদ্য বিতরণ করতেন।","অর্থ: ভাইদের আগমন ও পরীক্ষা: দুর্ভিক্ষ কেনআনেও (ফিলিস্তিন) পৌঁছল। ইয়াকুব (আঃ) তাঁর ছেলেদের মিশরে খাদ্য কিনতে পাঠালেন। শুধু বিনইয়ামিনকে রেখে দিলেন। দশ ভাই মিশরে এলো এবং ইউসুফ (আঃ) এর কাছে খাদ্য চাইতে গেল। ইউসুফ (আঃ) তাদের চিনতে পারলেন কিন্তু তারা তাঁকে চিনতে পারল না। তিনি তাদের খাদ্য দিলেন এবং জিজ্ঞাসা করলেন: 'তোমাদের আরও ভাই আছে?' তারা বলল, 'হ্যাঁ, একজন ছোট ভাই আছে এবং একজন ছিল যে হারিয়ে গেছে।' ইউসুফ (আঃ) বললেন, 'পরবার তোমাদের ছোট ভাইকে নিয়ে এসো। না হলে তোমাদের খাদ্য দেব না।' [সূরা ইউসুফ: ৫৯-৬০] তিনি গোপনে তাদের মূল্য তাদের মালপত্রে ফিরিয়ে দিলেন যাতে তারা আবার আসে।","অর্থ: বিনইয়ামিনকে রেখে দেওয়া: ভাইরা ফিরে গিয়ে পিতাকে বলল। ইয়াকুব (আঃ) প্রথমে রাজি হলেন না। কিন্তু তারা কসম খেয়ে বলল যে তারা বিনইয়ামিনকে রক্ষা করবে। ইয়াকুব (আঃ) বললেন, 'আমি আল্লাহর উপর ভরসা করছি।' [সূরা ইউসুফ: ৬৬-৬৭] তারা বিনইয়ামিনকে নিয়ে মিশরে গেল। ইউসুফ (আঃ) বিনইয়ামিনকে আলাদা ডেকে বললেন, 'আমি তোমার ভাই ইউসুফ। দুঃখ করো না।' [সূরা ইউসুফ: ৬৯] তারপর তিনি একটি পরিকল্পনা করলেন। তিনি বাদশাহর পানপাত্র বিনইয়ামিনের মালপত্রে রেখে দিলেন। তারা যখন ফিরছিল তখন ঘোষণা করা হলো, 'বাদশাহর পানপাত্র হারিয়ে গেছে। যে ফিরিয়ে দেবে তাকে এক উটবোঝা খাদ্য দেওয়া হবে।' [সূরা ইউসুফ: ৭২] তল্লাশি করে বিনইয়ামিনের মালপত্রে পাওয়া গেল। আইন অনুযায়ী চোরকে দাস বানানো হতো। ভাইরা বলল, 'এর আগে তার ভাইও (ইউসুফ) চুরি করেছিল।' [সূরা ইউসুফ: ৭৭] ইউসুফ (আঃ) মনে মনে কষ্ট পেলেন কিন্তু কিছু বললেন না। বিনইয়ামিন মিশরে থেকে গেল।","**সত্য প্রকাশ ও পুনর্মিলন:** ভাইরা পিতার কাছে ফিরে গেল। ইয়াকুব (আঃ) অত্যন্ত দুঃখিত হলেন। তিনি এত কাঁদলেন যে তাঁর চোখ সাদা হয়ে গেল (অন্ধ হয়ে গেলেন)। তিনি বললেন,","يَا أَسَفَىٰ عَلَىٰ يُوسُفَ","অর্থ: হায়! ইউসুফের জন্য আমার কত দুঃখ! [সূরা ইউসুফ: ৮৪]","অর্থ: তিনি বললেন, 'তোমরা আবার যাও এবং ইউসুফ ও তার ভাইকে খুঁজো। আল্লাহর রহমত থেকে নিরাশ হয়ো না।' [সূরা ইউসুফ: ৮৭] ভাইরা আবার মিশরে গেল। তারা ইউসুফ (আঃ) এর কাছে এসে বলল, 'আমাদের ও আমাদের পরিবারে দুর্ভিক্ষ এসেছে। আমরা সামান্য মূল্য নিয়ে এসেছি। আমাদের দান করুন। আল্লাহ দানশীলদের প্রতিদান দেন।' [সূরা ইউসুফ: ৮৮] ইউসুফ (আঃ) বললেন,","هَلْ عَلِمْتُم مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ إِذْ أَنتُمْ جَاهِلُونَ","অর্থ: তোমরা কি জানো তোমরা ইউসুফ ও তার ভাইয়ের সাথে কী করেছিলে যখন তোমরা মূর্খ ছিলে? [সূরা ইউসুফ: ৮৯]","তারা চমকে উঠে বলল, 'আপনি কি সত্যিই ইউসুফ?' তিনি বললেন,","أَنَا يُوسُفُ وَهَٰذَا أَخِي ۖ قَدْ مَنَّ اللَّهُ عَلَيْنَا","অর্থ: আমি ইউসুফ এবং এ আমার ভাই। আল্লাহ আমাদের প্রতি অনুগ্রহ করেছেন। [সূরা ইউসুফ: ৯০]","অর্থ: ভাইরা লজ্জিত হয়ে বলল, 'আল্লাহর কসম! আল্লাহ আপনাকে আমাদের উপর শ্রেষ্ঠত্ব দিয়েছেন এবং আমরা অবশ্যই পাপী ছিলাম।' [সূরা ইউসুফ: ৯১] ইউসুফ (আঃ) বললেন,","لَا تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ ۖ يَغْفِرُ اللَّهُ لَكُمْ ۖ وَهُوَ أَرْحَمُ الرَّاحِمِينَ","অর্থ: আজ তোমাদের বিরুদ্ধে কোনো অভিযোগ নেই। আল্লাহ তোমাদের ক্ষমা করুন। তিনি সবচেয়ে দয়ালু। [সূরা ইউসুফ: ৯২]","অর্থ: স্বপ্ন পূর্ণ হওয়া ও শিক্ষা: ইউসুফ (আঃ) তাঁর জামা পাঠালেন এবং বললেন, 'এটা আমার পিতার মুখে রাখবে, তাঁর দৃষ্টি ফিরে আসবে।' [সূরা ইউসুফ: ৯৩] জামা পৌঁছার আগেই ইয়াকুব (আঃ) ইউসুফের ঘ্রাণ পেলেন এবং বললেন, 'আমি ইউসুফের ঘ্রাণ পাচ্ছি।' [সূরা ইউসুফ: ৯৪] জামা তাঁর মুখে রাখা হলো এবং তিনি দেখতে পেলেন। পুরো পরিবার মিশরে চলে এলো। ইউসুফ (আঃ) তাঁর পিতা-মাতাকে সিংহাসনে বসালেন। তাঁর পিতা, মাতা এবং এগারো ভাই তাঁকে সম্মানে সিজদা করল (সেই সময় সম্মানসূচক সিজদা জায়েজ ছিল)। ইউসুফ (আঃ) বললেন,","يَا أَبَتِ هَٰذَا تَأْوِيلُ رُؤْيَايَ مِن قَبْلُ قَدْ جَعَلَهَا رَبِّي حَقًّا","অর্থ: হে আমার পিতা! এই আমার আগের স্বপ্নের ব্যাখ্যা। আমার রব একে সত্যে পরিণত করেছেন। [সূরা ইউসুফ: ১০০]","তিনি আল্লাহর শুকরিয়া আদায় করে দোয়া করলেন:","رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ","অর্থ: হে আমার রব! আপনি আমাকে রাজত্ব দিয়েছেন এবং স্বপ্নের ব্যাখ্যা শিখিয়েছেন। হে আসমান ও জমিনের সৃষ্টিকর্তা! আপনি দুনিয়া ও আখিরাতে আমার অভিভাবক। আমাকে মুসলিম হিসেবে মৃত্যু দিন এবং সৎকর্মশীলদের সাথে মিলিত করুন। [সূরা ইউসুফ: ১০১]","ইউসুফ (আঃ) মিশরে ১১০ বছর বয়সে ইন্তেকাল করেন। পরে তাঁর লাশ ফিলিস্তিনে নিয়ে যাওয়া হয় এবং তাঁর পিতা-মাতার পাশে দাফন করা হয়।"],"source":"**সূরা ইউসুফ:** ১-১১১; তাফসীরে ইবনে কাসীর; আল-বিদায়া ওয়ান নিহায়া।"},{"id":"nabi_ismail_as","categoryId":"nobider_jiboni","title":"ইসমাঈল (আঃ) - কুরবানীর নবী","paragraphs":["হযরত ইসমাঈল (আঃ) ছিলেন ইব্রাহিম (আঃ) এর জ্যেষ্ঠ পুত্র এবং হাজেরা (আঃ) এর গর্ভজাত সন্তান। তিনি ছিলেন আরব জাতির পিতা এবং রাসূল (সাঃ) এর পূর্বপুরুষ। তাঁর জীবনের সবচেয়ে বড় ঘটনা ছিল কুরবানীর জন্য প্রস্তুত হওয়া।","**জন্ম ও মক্কায় রেখে আসা:** ইব্রাহিম (আঃ) দীর্ঘদিন সন্তানহীন ছিলেন। তাঁর স্ত্রী সারা (আঃ) তাঁকে হাজেরা (আঃ) কে বিবাহ করতে বললেন। হাজেরা (আঃ) থেকে ইসমাঈল (আঃ) জন্ম নেন। ইব্রাহিম (আঃ) তখন ৮৬ বছর বয়সী ছিলেন। কিছুদিন পর আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন শিশু ইসমাঈল এবং হাজেরা (আঃ) কে মক্কায় রেখে আসতে। সেই সময় মক্কা ছিল জনমানবহীন মরুভূমি - কোনো পানি, গাছপালা বা মানুষ ছিল না। ইব্রাহিম (আঃ) তাঁদের রেখে যাওয়ার সময় হাজেরা (আঃ) জিজ্ঞাসা করলেন: 'আল্লাহ কি আপনাকে এই আদেশ দিয়েছেন?' ইব্রাহিম (আঃ) বললেন, 'হ্যাঁ।' হাজেরা (আঃ) বললেন, 'তাহলে আল্লাহ আমাদের ধ্বংস করবেন না।' [সহীহ বুখারী: ৩৩৬৪]","**জমজম কূপের সৃষ্টি:** কিছুদিন পর পানি ও খাবার শেষ হয়ে গেল। শিশু ইসমাঈল (আঃ) তৃষ্ণায় কাঁদতে লাগলেন। হাজেরা (আঃ) পানি খুঁজতে সাফা পাহাড়ে উঠলেন কিন্তু কিছু দেখতে পেলেন না। তারপর মারওয়া পাহাড়ে দৌড়ে গেলেন। এভাবে সাত বার সাফা-মারওয়ার মধ্যে দৌড়ালেন। সপ্তমবার মারওয়া থেকে ফিরে এসে দেখলেন শিশু ইসমাঈল (আঃ) এর পায়ের কাছে পানি বের হচ্ছে। তিনি 'জম জম' (থামো থামো) বলে পানির চারপাশে বাঁধ দিলেন। এভাবে জমজম কূপের সৃষ্টি হলো। রাসূল (সাঃ) বলেছেন, 'আল্লাহ হাজেরার প্রতি রহম করুন। যদি তিনি পানিকে না থামাতেন তাহলে জমজম একটি প্রবাহমান নদী হতো।' [সহীহ বুখারী: ৩৩৬৪]","**জুরহুম গোত্রের আগমন ও বড় হওয়া:** জমজম কূপের কারণে পাখি সেখানে আসতে শুরু করল। ইয়েমেন থেকে জুরহুম গোত্র যাচ্ছিল। তারা পাখি দেখে বুঝল এখানে পানি আছে। তারা এসে হাজেরা (আঃ) এর কাছে অনুমতি চাইল বসবাস করার। হাজেরা (আঃ) অনুমতি দিলেন তবে শর্ত দিলেন যে পানির মালিকানা তাঁদের থাকবে। এভাবে মক্কায় বসতি শুরু হলো। ইসমাঈল (আঃ) জুরহুম গোত্রের মধ্যে বড় হলেন এবং তাদের ভাষা (আরবি) শিখলেন। তিনি ছিলেন অত্যন্ত সুন্দর চরিত্রের এবং তীরন্দাজিতে দক্ষ। জুরহুম গোত্র তাঁকে অত্যন্ত ভালোবাসত।","**কুরবানীর মহান পরীক্ষা:** ইসমাঈল (আঃ) যখন কিশোর হলেন (১৩ বছর বয়সে), ইব্রাহিম (আঃ) স্বপ্নে দেখলেন তিনি তাঁর প্রিয় পুত্রকে কুরবানী করছেন। নবীদের স্বপ্ন হলো ওহী। তিনি ইসমাঈল (আঃ) কে বললেন,","يَا بُنَيَّ إِنِّي أَرَىٰ فِي الْمَنَامِ أَنِّي أَذْبَحُكَ فَانظُرْ مَاذَا تَرَىٰ","অর্থ: হে আমার ছেলে! আমি স্বপ্নে দেখি যে আমি তোমাকে জবাই করছি। তুমি কী মনে করো? [সূরা সাফফাত: ১০২]","ইসমাঈল (আঃ) এক মুহূর্তও দ্বিধা করলেন না। তিনি বললেন,","يَا أَبَتِ افْعَلْ مَا تُؤْمَرُ ۖ سَتَجِدُنِي إِن شَاءَ اللَّهُ مِنَ الصَّابِرِينَ","অর্থ: হে আমার পিতা! আপনাকে যা আদেশ করা হয়েছে তা করুন। ইনশাআল্লাহ আপনি আমাকে ধৈর্যশীলদের মধ্যে পাবেন। [সূরা সাফফাত: ১০২]","এই উত্তরে ইসমাঈল (আঃ) এর পূর্ণ আত্মসমর্পণ প্রকাশ পায়। একজন কিশোর তাঁর জীবন দিতে প্রস্তুত শুধুমাত্র আল্লাহর আদেশ পালনের জন্য।","**মিনায় কুরবানীর প্রস্তুতি ও শয়তানের বাধা:** ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে মিনায় নিয়ে গেলেন। পথে তিনটি স্থানে শয়তান এসে বাধা দিতে চেষ্টা করল। প্রথমবার শয়তান ইব্রাহিম (আঃ) কে বলল, 'এটা শয়তানের কুমন্ত্রণা। তুমি তোমার পুত্রকে হত্যা করছ?' ইব্রাহিম (আঃ) সাতটি পাথর মেরে তাকে তাড়ালেন। দ্বিতীয়বার শয়তান ইসমাঈল (আঃ) কে বলল, 'তোমার পিতা তোমাকে হত্যা করতে যাচ্ছেন!' ইসমাঈল (আঃ) ও সাতটি পাথর মেরে তাকে তাড়ালেন। তৃতীয়বার শয়তান হাজেরা (আঃ) কে বলল, 'তোমার স্বামী তোমার সন্তানকে হত্যা করতে যাচ্ছে!' হাজেরা (আঃ) ও সাতটি পাথর মেরে তাকে তাড়ালেন। এই তিনটি স্থানই এখন জামারাত (শয়তানকে পাথর মারার স্থান) নামে পরিচিত এবং হজের অন্যতম রুকন।","**আল্লাহর মুজিজা ও দুম্বা কুরবানী:** মিনায় পৌঁছে ইব্রাহিম (আঃ) ইসমাঈল (আঃ) কে শুইয়ে দিলেন। ইসমাঈল (আঃ) বললেন, 'হে আমার পিতা! আমার হাত-পা বেঁধে নিন যাতে আমি ছটফট না করি। আপনার কাপড় গুটিয়ে নিন যাতে আমার রক্ত না লাগে। ছুরি ভালো করে ধার দিয়ে নিন যাতে আমার কষ্ট কম হয়। আমার মাকে আমার সালাম দিবেন।' ইব্রাহিম (আঃ) কাঁদতে কাঁদতে ছুরি চালালেন। কিন্তু আল্লাহর কুদরতে ছুরি কাটল না। আল্লাহ ডাক দিলেন:","يَا إِبْرَاهِيمُ ۝ قَدْ صَدَّقْتَ الرُّؤْيَا ۚ إِنَّا كَذَٰلِكَ نَجْزِي الْمُحْسِنِينَ ۝ إِنَّ هَٰذَا لَهُوَ الْبَلَاءُ الْمُبِينُ ۝ وَفَدَيْنَاهُ بِذِبْحٍ عَظِيمٍ","অর্থ: হে ইব্রাহিম! তুমি স্বপ্ন সত্য করে দেখিয়েছ। আমি এভাবেই সৎকর্মশীলদের প্রতিদান দেই। নিশ্চয়ই এটি ছিল এক স্পষ্ট পরীক্ষা। আমি তাকে মুক্ত করলাম এক মহান কুরবানীর বিনিময়ে। [সূরা সাফফাত: ১০৪-১০৭]","আল্লাহ জান্নাত থেকে একটি বড় দুম্বা পাঠালেন যা ইব্রাহিম (আঃ) কুরবানী করলেন। এই ঘটনার স্মরণে প্রতি বছর ঈদুল আযহায় কুরবানী করা হয়।","**কাবা নির্মাণ ও দায়িত্ব:** ইসমাঈল (আঃ) বড় হলে আল্লাহ ইব্রাহিম (আঃ) কে আদেশ দিলেন কাবা ঘর নির্মাণ করতে। পিতা-পুত্র মিলে কাবা নির্মাণ করলেন। ইব্রাহিম (আঃ) পাথর বহন করতেন এবং ইসমাঈল (আঃ) দেয়াল তৈরি করতেন। তাঁরা দোয়া করতেন:","رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ","অর্থ: হে আমাদের রব! আমাদের থেকে কবুল করুন। নিশ্চয়ই আপনি সর্বশ্রোতা, সর্বজ্ঞ। [সূরা বাকারা: ১২৭]","কাবা নির্মাণের পর ইসমাঈল (আঃ) কে কাবার তত্ত্বাবধানের দায়িত্ব দেওয়া হয়। তিনি জমজম কূপের দেখাশোনা করতেন এবং হাজীদের সেবা করতেন।","**বিবাহ ও সন্তান:** ইসমাঈল (আঃ) জুরহুম গোত্রের এক মেয়েকে বিবাহ করেন। তাঁর বারোজন ছেলে হয় যারা আরব উপদ্বীপে ছড়িয়ে পড়ে এবং বারোটি গোত্রের জন্ম দেয়। তাঁর বংশধরদের মধ্যে সবচেয়ে বিখ্যাত হলেন কুরাইশ গোত্র এবং তাদের মধ্য থেকে আসেন শেষ নবী মুহাম্মাদ (সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম)। ইসমাঈল (আঃ) আরবি ভাষা প্রচার করেন এবং তাঁর বংশধররা আরব জাতি হিসেবে পরিচিত হয়।","**নবুয়ত ও দাওয়াত:** ইসমাঈল (আঃ) নবী ছিলেন। তিনি তাঁর পরিবার এবং আশেপাশের মানুষকে তাওহীদের দাওয়াত দিতেন। কুরআনে তাঁর প্রশংসা করে বলা হয়েছে:","وَاذْكُرْ فِي الْكِتَابِ إِسْمَاعِيلَ ۚ إِنَّهُ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُولًا نَّبِيًّا ۝ وَكَانَ يَأْمُرُ أَهْلَهُ بِالصَّلَاةِ وَالزَّكَاةِ وَكَانَ عِندَ رَبِّهِ مَرْضِيًّا","অর্থ: এই কিতাবে ইসমাঈলের কথা স্মরণ করুন। নিশ্চয়ই তিনি ছিলেন প্রতিশ্রুতি পালনকারী এবং তিনি ছিলেন রাসূল, নবী। তিনি তাঁর পরিবারকে নামাজ ও যাকাতের আদেশ দিতেন এবং তিনি ছিলেন তাঁর রবের কাছে সন্তুষ্টিপ্রাপ্ত। [সূরা মারইয়াম: ৫৪-৫৫]","**মৃত্যু ও দাফন:** ইসমাঈল (আঃ) ১৩৭ বছর বয়সে মক্কায় ইন্তেকাল করেন। তাঁকে কাবার হাতিমে (হিজরে ইসমাঈল) তাঁর মা হাজেরা (আঃ) এর পাশে দাফন করা হয়। তাঁর জীবন ছিল আত্মসমর্পণ, ধৈর্য এবং আল্লাহর আনুগত্যের উজ্জ্বল দৃষ্টান্ত। তিনি ছিলেন আরব জাতির পিতা এবং শেষ নবীর পূর্বপুরুষ।"],"source":"**সূরা সাফফাত: ১০০-১১৩; সূরা বাকারা:** ১২৫-১২৯; সূরা মারইয়াম: ৫৪-৫৫; সহীহ বুখারী: ৩৩৬৪; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_ishaq_as","categoryId":"nobider_jiboni","title":"ইসহাক (আঃ) - প্রতিশ্রুত পুত্র","paragraphs":["হযরত ইসহাক (আঃ) ছিলেন ইব্রাহিম (আঃ) এর দ্বিতীয় পুত্র এবং সারা (আঃ) এর গর্ভজাত সন্তান। তিনি ছিলেন বনী ইসরাঈলের পিতা এবং অনেক নবীর পূর্বপুরুষ। আল্লাহ তাঁকে নবুয়ত দান করেছিলেন এবং তিনি ছিলেন ধৈর্যশীল ও আল্লাহভীরু।","**জন্মের সুসংবাদ ও মুজিজা:** ইব্রাহিম (আঃ) এবং সারা (আঃ) দীর্ঘদিন সন্তানহীন ছিলেন। সারা (আঃ) বৃদ্ধা হয়ে গিয়েছিলেন এবং ইব্রাহিম (আঃ) ও বৃদ্ধ। একদিন তিনজন ফেরেশতা মানুষের রূপে ইব্রাহিম (আঃ) এর কাছে এলেন। তাঁরা ছিলেন জিবরাঈল, মিকাঈল এবং ইসরাফিল (আঃ)। ইব্রাহিম (আঃ) তাঁদের চিনতে পারলেন না এবং মেহমানদারি করতে একটি ভুনা বাছুর নিয়ে এলেন। কিন্তু তাঁরা খেলেন না। ইব্রাহিম (আঃ) ভয় পেলেন। তাঁরা বললেন, 'ভয় পাবেন না। আমরা লূত (আঃ) এর জাতির কাছে পাঠানো হয়েছি তাদের ধ্বংস করতে।' সারা (আঃ) দাঁড়িয়ে শুনছিলেন। ফেরেশতারা তাঁকে সুসংবাদ দিলেন:","فَبَشَّرْنَاهَا بِإِسْحَاقَ وَمِن وَرَاءِ إِسْحَاقَ يَعْقُوبَ","অর্থ: আমরা তাঁকে ইসহাকের সুসংবাদ দিলাম এবং ইসহাকের পরে ইয়াকুবের। [সূরা হুদ: ৭১]","সারা (আঃ) অবাক হয়ে বললেন, 'আমি কীভাবে সন্তান জন্ম দেব? আমি তো বৃদ্ধা এবং আমার স্বামীও বৃদ্ধ!' ফেরেশতারা বললেন,","أَتَعْجَبِينَ مِنْ أَمْرِ اللَّهِ ۖ رَحْمَتُ اللَّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ ۚ إِنَّهُ حَمِيدٌ مَّجِيدٌ","অর্থ: আপনি কি আল্লাহর কাজে বিস্মিত হচ্ছেন? হে পরিবারের লোকেরা! আল্লাহর রহমত ও বরকত আপনাদের উপর। নিশ্চয়ই তিনি প্রশংসিত, মহিমান্বিত। [সূরা হুদ: ৭৩]","**জন্ম ও শৈশব:** আল্লাহর ইচ্ছায় সারা (আঃ) গর্ভবতী হলেন এবং ইসহাক (আঃ) জন্ম নিলেন। এটা ছিল একটি মহা মুজিজা - একজন বৃদ্ধা মহিলা এবং বৃদ্ধ পুরুষের ঘরে সন্তান! ইব্রাহিম (আঃ) তখন ১০০ বছর বয়সী ছিলেন। ইসহাক (আঃ) জন্মের সময় তাঁর বড় ভাই ইসমাঈল (আঃ) ১৪ বছর বয়সী ছিলেন। ইসহাক (আঃ) ফিলিস্তিনে (কেনআন) বড় হলেন। তিনি পিতা ইব্রাহিম (আঃ) এর কাছ থেকে তাওহীদ এবং আল্লাহর ইবাদত শিখলেন।","**বিবাহ ও সন্তান:** ইসহাক (আঃ) চল্লিশ বছর বয়সে রিবকা (রিফকা) কে বিবাহ করেন। তিনি ছিলেন ইব্রাহিম (আঃ) এর ভাই নাহোরের নাতনি। রিবকা দীর্ঘদিন সন্তানহীন ছিলেন। ইসহাক (আঃ) আল্লাহর কাছে দোয়া করলেন এবং আল্লাহ তাঁর দোয়া কবুল করলেন। রিবকা যমজ দুই পুত্র সন্তান জন্ম দিলেন - এসাউ (আল-ঈস) এবং ইয়াকুব (আঃ)। এসাউ প্রথমে জন্ম নিলেন এবং ইয়াকুব (আঃ) তাঁর পরে। ইয়াকুব (আঃ) কে আল্লাহ নবুয়ত দান করলেন এবং তিনি বনী ইসরাঈলের পিতা হলেন।","**নবুয়ত ও দাওয়াত:** ইসহাক (আঃ) নবী ছিলেন। তিনি তাঁর পরিবার এবং কেনআনের মানুষদের তাওহীদের দাওয়াত দিতেন। তিনি পিতা ইব্রাহিম (আঃ) এর পথ অনুসরণ করতেন এবং মূর্তিপূজার বিরুদ্ধে ছিলেন। কুরআনে আল্লাহ তাঁর প্রশংসা করে বলেছেন,","وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا","অর্থ: আমি তাঁকে (ইব্রাহিমকে) দান করলাম ইসহাক ও ইয়াকুব। প্রত্যেককে আমি হিদায়াত দিয়েছি। [সূরা আনআম: ৮৪]","আল্লাহ আরও বলেছেন,","وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ أُولِي الْأَيْدِي وَالْأَبْصَارِ","অর্থ: স্মরণ করুন আমার বান্দা ইব্রাহিম, ইসহাক ও ইয়াকুবকে যারা ছিলেন শক্তিশালী এবং দূরদর্শী। [সূরা সোয়াদ: ৪৫]","**পিতার মৃত্যু ও উত্তরাধিকার:** ইব্রাহিম (আঃ) ১৭৫ বছর বয়সে ইন্তেকাল করেন। ইসহাক (আঃ) এবং ইসমাঈল (আঃ) মিলে তাঁদের পিতাকে হেব্রনে (আল-খলিল) মাকপেলার গুহায় দাফন করেন। ইব্রাহিম (আঃ) এর মৃত্যুর পর ইসহাক (আঃ) কেনআনে থেকে যান এবং তাওহীদের দাওয়াত চালিয়ে যান। তিনি ছিলেন ধৈর্যশীল এবং আল্লাহর উপর পূর্ণ ভরসাকারী।","**পরীক্ষা ও ধৈর্য:** ইসহাক (আঃ) এর জীবনে অনেক পরীক্ষা এসেছিল। তাঁর মা সারা (আঃ) মারা গিয়েছিলেন যখন তিনি যুবক ছিলেন। তাঁর স্ত্রী দীর্ঘদিন সন্তানহীন ছিলেন। তাঁর দুই পুত্রের মধ্যে মতবিরোধ ছিল। কিন্তু তিনি সব পরীক্ষায় ধৈর্য ধরেছিলেন এবং আল্লাহর উপর ভরসা করেছিলেন। তিনি কখনো আল্লাহর আদেশ অমান্য করেননি।","**বংশধর ও নবীগণ:** ইসহাক (আঃ) এর পুত্র ইয়াকুব (আঃ) থেকে বনী ইসরাঈল জাতির জন্ম হয়। ইয়াকুব (আঃ) এর বারো পুত্র ছিল যাদের থেকে বনী ইসরাঈলের বারো গোত্র সৃষ্টি হয়। এই বংশ থেকে অনেক নবী এসেছেন - ইউসুফ, মূসা, হারুন, দাউদ, সুলাইমান, ইয়াহইয়া, ঈসা (আলাইহিমুস সালাম) সহ অনেকে। কুরআনে আল্লাহ বলেছেন,","وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ نَافِلَةً ۖ وَكُلًّا جَعَلْنَا صَالِحِينَ ۝ وَجَعَلْنَاهُمْ أَئِمَّةً يَهْدُونَ بِأَمْرِنَا","অর্থ: আমি তাঁকে দান করলাম ইসহাক এবং অতিরিক্ত হিসেবে ইয়াকুব। প্রত্যেককে আমি সৎকর্মশীল বানালাম। আমি তাঁদের নেতা বানালাম যারা আমার আদেশে মানুষকে পথ দেখায়। [সূরা আম্বিয়া: ৭২-৭৩]","**মৃত্যু ও দাফন:** ইসহাক (আঃ) ১৮০ বছর বয়সে ইন্তেকাল করেন। তাঁর দুই পুত্র এসাউ এবং ইয়াকুব (আঃ) তাঁকে হেব্রনে মাকপেলার গুহায় তাঁর পিতা-মাতার পাশে দাফন করেন। তাঁর জীবন ছিল ধৈর্য, তাওহীদ এবং আল্লাহর আনুগত্যে পূর্ণ। তিনি ছিলেন আল্লাহর প্রিয় বান্দা এবং সৎকর্মশীল নবী।"],"source":"**সূরা হুদ: ৬৯-৭৩; সূরা আনআম: ৮৪; সূরা সোয়াদ:** ৪৫-৪৭; সূরা আম্বিয়া: ৭২-৭৩; তাওরাত (আদি পুস্তক); তাফসীরে ইবনে কাসীর।"},{"id":"nabi_yaqub_as","categoryId":"nobider_jiboni","title":"ইয়াকুব (আঃ) - ইসরাঈল","paragraphs":["হযরত ইয়াকুব (আঃ) ছিলেন ইসহাক (আঃ) এর পুত্র এবং ইব্রাহিম (আঃ) এর নাতি। তাঁর উপনাম ছিল 'ইসরাঈল' যার অর্থ 'আল্লাহর বান্দা'। তাঁর বংশধররা বনী ইসরাঈল নামে পরিচিত। তিনি ছিলেন ধৈর্যশীল নবী এবং তাঁর জীবন ছিল পরীক্ষা ও ধৈর্যে পূর্ণ।","**জন্ম ও শৈশব:** ইয়াকুব (আঃ) এবং তাঁর যমজ ভাই এসাউ একসাথে জন্ম নিয়েছিলেন। এসাউ প্রথমে জন্ম নেন এবং ইয়াকুব (আঃ) তাঁর পরে। ইয়াকুব (আঃ) ছিলেন শান্ত, ধার্মিক এবং ইবাদতগুজার। এসাউ ছিলেন শিকারী এবং পার্থিব জীবনে বেশি আগ্রহী। পিতা ইসহাক (আঃ) এসাউকে বেশি ভালোবাসতেন কারণ তিনি শিকার করে আনতেন। কিন্তু মা রিবকা ইয়াকুব (আঃ) কে বেশি ভালোবাসতেন কারণ তিনি ছিলেন ধার্মিক।","**নবুয়ত লাভ:** আল্লাহ ইয়াকুব (আঃ) কে নবুয়ত দান করলেন। তিনি তাঁর পরিবার এবং কেনআনের মানুষদের তাওহীদের দাওয়াত দিতেন। কুরআনে আল্লাহ তাঁর প্রশংসা করে বলেছেন,","وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا","অর্থ: আমি তাঁকে দান করলাম ইসহাক ও ইয়াকুব। প্রত্যেককে আমি হিদায়াত দিয়েছি। [সূরা আনআম: ৮৪]","**বারো পুত্র ও বনী ইসরাঈল:** ইয়াকুব (আঃ) এর বারো পুত্র ছিল। তাঁদের নাম: রূবিল, শিমিয়োন, লেবি, ইয়াহুদা, দান, নাফতালি, গাদ, আশের, ইসাখার, জাবুলুন, ইউসুফ এবং বিনইয়ামিন। এই বারো পুত্র থেকে বনী ইসরাঈলের বারো গোত্র সৃষ্টি হয়। তাঁর সবচেয়ে প্রিয় পুত্র ছিলেন ইউসুফ (আঃ) এবং বিনইয়ামিন কারণ তাঁদের মা রাহেল (আঃ) মারা গিয়েছিলেন।","**ইউসুফ (আঃ) হারানোর মহাপরীক্ষা:** ইয়াকুব (আঃ) এর জীবনের সবচেয়ে বড় পরীক্ষা ছিল প্রিয় পুত্র ইউসুফ (আঃ) কে হারানো। ইউসুফ (আঃ) এর ভাইরা হিংসার বশবর্তী হয়ে তাঁকে কূপে ফেলে দেয় এবং পিতাকে মিথ্যা বলে যে বাঘ তাঁকে খেয়ে ফেলেছে। ইয়াকুব (আঃ) বুঝতে পারলেন এটা মিথ্যা কিন্তু তিনি ধৈর্য ধরলেন। তিনি বললেন,","بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا ۖ فَصَبْرٌ جَمِيلٌ ۖ وَاللَّهُ الْمُسْتَعَانُ عَلَىٰ مَا تَصِفُونَ","অর্থ: বরং তোমাদের মন তোমাদের একটি কাজ সাজিয়ে দিয়েছে। সুতরাং সুন্দর ধৈর্য! তোমরা যা বর্ণনা করছ সে ব্যাপারে আল্লাহই সাহায্যস্থল। [সূরা ইউসুফ: ১৮]","এই আয়াতে 'সবরুন জামিল' (সুন্দর ধৈর্য) শব্দটি ইয়াকুব (আঃ) এর মুখ থেকে বের হয়েছিল। তিনি কাঁদলেন কিন্তু অভিযোগ করলেন না। তিনি দুঃখ করলেন কিন্তু আল্লাহর ফয়সালায় রাজি থাকলেন।","**দীর্ঘ বিরহ ও অন্ধত্ব:** ইউসুফ (আঃ) কে হারানোর পর ইয়াকুব (আঃ) প্রতিদিন কাঁদতেন। বছরের পর বছর কেটে গেল কিন্তু ইউসুফ (আঃ) এর কোনো খবর নেই। ইয়াকুব (আঃ) এত কাঁদলেন যে তাঁর চোখ সাদা হয়ে গেল এবং তিনি অন্ধ হয়ে গেলেন। পুত্ররা বলল, 'আপনি কি ইউসুফের কথা ভুলবেন না? আপনি নিজেকে ধ্বংস করে ফেলছেন!' ইয়াকুব (আঃ) বললেন,","إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ","অর্থ: আমি আমার দুঃখ ও বেদনা শুধু আল্লাহর কাছেই পেশ করি। আমি আল্লাহর কাছ থেকে এমন কিছু জানি যা তোমরা জানো না। [সূরা ইউসুফ: ৮৬]","তিনি আল্লাহর কাছে আশা রাখতেন যে একদিন ইউসুফ (আঃ) ফিরে আসবেন। তিনি বললেন,","يَا بَنِيَّ اذْهَبُوا فَتَحَسَّسُوا مِن يُوسُفَ وَأَخِيهِ وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ","অর্থ: হে আমার পুত্রগণ! তোমরা যাও এবং ইউসুফ ও তার ভাইকে খুঁজো। আল্লাহর রহমত থেকে নিরাশ হয়ো না। নিশ্চয়ই কাফির সম্প্রদায় ছাড়া কেউ আল্লাহর রহমত থেকে নিরাশ হয় না। [সূরা ইউসুফ: ৮৭]","**পুনর্মিলন ও দৃষ্টি ফিরে পাওয়া:** অবশেষে আল্লাহ ইয়াকুব (আঃ) এর ধৈর্যের পুরস্কার দিলেন। ইউসুফ (আঃ) মিশরের মন্ত্রী হয়েছিলেন এবং তিনি তাঁর ভাইদের চিনতে পারলেন। তিনি তাঁর জামা পাঠালেন এবং বললেন এটা পিতার মুখে রাখতে। জামা পৌঁছার আগেই ইয়াকুব (আঃ) ইউসুফ (আঃ) এর ঘ্রাণ পেলেন এবং বললেন,","إِنِّي لَأَجِدُ رِيحَ يُوسُفَ ۖ لَوْلَا أَن تُفَنِّدُونِ","অর্থ: আমি ইউসুফের ঘ্রাণ পাচ্ছি, যদি তোমরা আমাকে বুড়ো বলে মনে না করো। [সূরা ইউসুফ: ৯৪]","জামা তাঁর মুখে রাখা হলো এবং তাঁর দৃষ্টি ফিরে এলো। তিনি দেখতে পেলেন! তারপর পুরো পরিবার মিশরে গেল এবং ইউসুফ (আঃ) এর সাথে মিলিত হলো। ইয়াকুব (আঃ), তাঁর স্ত্রী এবং এগারো পুত্র সবাই ইউসুফ (আঃ) কে সম্মানে সিজদা করলেন (সেই সময় সম্মানসূচক সিজদা জায়েজ ছিল)।","**মিশরে জীবন ও মৃত্যু:** ইয়াকুব (আঃ) মিশরে তাঁর প্রিয় পুত্র ইউসুফ (আঃ) এর সাথে শান্তিতে বসবাস করলেন। তিনি সেখানে ১৭ বছর কাটালেন। মৃত্যুর সময় তিনি তাঁর পুত্রদের ডেকে বললেন,","يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَىٰ لَكُمُ الدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم مُّسْلِمُونَ","অর্থ: হে আমার পুত্রগণ! নিশ্চয়ই আল্লাহ তোমাদের জন্য এই দীন মনোনীত করেছেন। সুতরাং তোমরা মুসলিম না হয়ে মৃত্যুবরণ করো না। [সূরা বাকারা: ১৩২]","তিনি তাঁর পুত্রদের তাওহীদ ও ইসলামের উপর অটল থাকার উপদেশ দিলেন। ইয়াকুব (আঃ) ১৪৭ বছর বয়সে মিশরে ইন্তেকাল করেন। তাঁর ইচ্ছা অনুযায়ী তাঁর লাশ কেনআনে (ফিলিস্তিন) নিয়ে যাওয়া হয় এবং হেব্রনে মাকপেলার গুহায় তাঁর পিতা-মাতা ও দাদার পাশে দাফন করা হয়।"],"source":"**সূরা ইউসুফ:** ১-১১১; সূরা বাকারা: ১৩২-১৩৩; সূরা আনআম: ৮৪; তাওরাত (আদি পুস্তক); তাফসীরে ইবনে কাসীর।"},{"id":"nabi_shuaib_as","categoryId":"nobider_jiboni","title":"শুআইব (আঃ) - খতিবুল আম্বিয়া","paragraphs":["হযরত শুআইব (আঃ) ছিলেন মাদইয়ান জাতির নবী। তাঁকে 'খতিবুল আম্বিয়া' (নবীদের বক্তা) বলা হতো কারণ তিনি ছিলেন অত্যন্ত বাগ্মী এবং সুন্দর ভাষায় দাওয়াত দিতেন। তিনি ছিলেন ইব্রাহিম (আঃ) এর বংশধর এবং মূসা (আঃ) এর শ্বশুর।","**মাদইয়ান জাতি ও তাদের পাপ:** মাদইয়ান ছিল আরব উপদ্বীপের উত্তর-পশ্চিমে লোহিত সাগরের কাছে একটি শহর। এই জাতির মানুষ ব্যবসা-বাণিজ্যে দক্ষ ছিল কিন্তু তারা তিনটি বড় পাপে লিপ্ত ছিল। প্রথমত, তারা মূর্তিপূজা করত এবং 'আইকা' নামক একটি বৃক্ষের পূজা করত। দ্বিতীয়ত, তারা ওজনে ও মাপে কম দিত - যখন কিনত তখন পূর্ণ মাপ চাইত কিন্তু যখন বিক্রি করত তখন কম দিত। তৃতীয়ত, তারা রাস্তায় বসে মানুষকে ডাকাতি করত এবং ভয় দেখাত।","**শুআইব (আঃ) এর দাওয়াত:** আল্লাহ শুআইব (আঃ) কে তাদের কাছে নবী বানিয়ে পাঠালেন। তিনি তাদের বললেন,","يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ","অর্থ: হে আমার জাতি! আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। [সূরা আরাফ: ৮৫]","তিনি তাদের তিনটি বিষয়ে সতর্ক করলেন। প্রথমত, তাওহীদ - এক আল্লাহর ইবাদত করতে এবং মূর্তিপূজা ছাড়তে। দ্বিতীয়ত, সততা - ওজনে ও মাপে পূর্ণ দিতে। তৃতীয়ত, ন্যায়বিচার - মানুষের সাথে প্রতারণা না করতে। তিনি বললেন,","وَيَا قَوْمِ أَوْفُوا الْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِ ۖ وَلَا تَبْخَسُوا النَّاسَ أَشْيَاءَهُمْ وَلَا تَعْثَوْا فِي الْأَرْضِ مُفْسِدِينَ","অর্থ: হে আমার জাতি! মাপ ও ওজন ন্যায্যভাবে পূর্ণ করো। মানুষকে তাদের জিনিসপত্র কম দিয়ো না এবং পৃথিবীতে বিপর্যয় সৃষ্টি করো না। [সূরা হুদ: ৮৫]","তিনি তাদের বুঝালেন যে সৎভাবে অল্প উপার্জন করা প্রতারণা করে বেশি উপার্জনের চেয়ে উত্তম। তিনি বললেন,","بَقِيَّتُ اللَّهِ خَيْرٌ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ ۚ وَمَا أَنَا عَلَيْكُم بِحَفِيظٍ","অর্থ: আল্লাহর দেওয়া বাকি অংশ তোমাদের জন্য উত্তম, যদি তোমরা মুমিন হও। আমি তোমাদের উপর তত্ত্বাবধায়ক নই। [সূরা হুদ: ৮৬]","**জাতির প্রত্যাখ্যান ও হুমকি:** মাদইয়ান জাতির নেতারা শুআইব (আঃ) কে প্রত্যাখ্যান করল। তারা বলল, 'হে শুআইব! তোমার নামাজ কি তোমাকে এই শিখিয়েছে যে আমরা আমাদের পূর্বপুরুষদের দেবতা ছেড়ে দেব এবং আমাদের সম্পদ নিয়ে যা ইচ্ছা তা করব না?' তারা তাঁকে বলল, 'তুমি তো আমাদের মধ্যে দুর্বল। তোমার পরিবার না থাকলে আমরা তোমাকে পাথর মেরে হত্যা করতাম।' শুআইব (আঃ) বললেন,","يَا قَوْمِ أَعَشِيرَتِي أَعَزُّ عَلَيْكُم مِّنَ اللَّهِ","অর্থ: হে আমার জাতি! আমার পরিবার কি তোমাদের কাছে আল্লাহর চেয়ে বেশি সম্মানিত? [সূরা হুদ: ৯২]","তারা শুআইব (আঃ) এবং যারা তাঁর সাথে ঈমান এনেছিল তাদের বহিষ্কার করার হুমকি দিল। তারা বলল, 'হে শুআইব! আমরা তোমাকে এবং তোমার সাথে যারা ঈমান এনেছে তাদের আমাদের শহর থেকে বের করে দেব, অথবা তোমরা আমাদের ধর্মে ফিরে আসবে।' শুআইব (আঃ) বললেন, 'যদিও আমরা অপছন্দ করি?'","**শুআইব (আঃ) এর দোয়া ও সতর্কবাণী:** শুআইব (আঃ) তাদের সতর্ক করলেন যে আল্লাহর শাস্তি আসবে। তিনি বললেন, 'হে আমার জাতি! তোমরা তোমাদের অবস্থানে কাজ করতে থাকো, আমিও কাজ করছি। শীঘ্রই তোমরা জানতে পারবে কার উপর লাঞ্ছনাদায়ক শাস্তি আসে এবং কে মিথ্যাবাদী। অপেক্ষা করো, আমিও তোমাদের সাথে অপেক্ষা করছি।' তিনি আল্লাহর কাছে দোয়া করলেন:","رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ","অর্থ: হে আমাদের রব! আমাদের ও আমাদের জাতির মধ্যে সত্যের ভিত্তিতে ফয়সালা করে দিন। আপনি সর্বোত্তম ফয়সালাকারী। [সূরা আরাফ: ৮৯]","**ভয়ংকর শাস্তি ও ধ্বংস:** মাদইয়ান জাতি শুআইব (আঃ) কে প্রত্যাখ্যান করতে থাকল। অবশেষে আল্লাহর শাস্তি এলো। প্রথমে সাত দিন ধরে প্রচণ্ড গরম শুরু হলো। মানুষ ঘরে থাকতে পারছিল না। তারা শহরের বাইরে একটি মেঘের নিচে ছায়া খুঁজতে গেল। কিন্তু সেই মেঘ ছিল শাস্তির মেঘ। কুরআনে বলা হয়েছে:","فَأَخَذَهُمْ عَذَابُ يَوْمِ الظُّلَّةِ ۚ إِنَّهُ كَانَ عَذَابَ يَوْمٍ عَظِيمٍ","অর্থ: অতঃপর তাদের পাকড়াও করল মেঘের দিনের শাস্তি। নিশ্চয়ই এটা ছিল এক মহাদিনের শাস্তি। [সূরা শুআরা: ১৮৯]","সেই মেঘ থেকে আগুনের বৃষ্টি নামল এবং প্রচণ্ড শব্দ হলো। একই সাথে ভূমিকম্প হলো। সব কাফির ধ্বংস হয়ে গেল। তারা তাদের ঘরে মৃত অবস্থায় পড়ে রইল যেন তারা কখনো সেখানে বাস করেনি। শুআইব (আঃ) এবং যারা ঈমান এনেছিল তাদের আল্লাহ রক্ষা করলেন।","**মূসা (আঃ) এর সাথে সাক্ষাৎ:** শুআইব (আঃ) এর জীবনের আরেকটি গুরুত্বপূর্ণ ঘটনা হলো মূসা (আঃ) এর সাথে সাক্ষাৎ। মূসা (আঃ) মিশর থেকে পালিয়ে মাদইয়ানে এসেছিলেন। তিনি একটি কূপের কাছে শুআইব (আঃ) এর দুই কন্যাকে সাহায্য করলেন। শুআইব (আঃ) মূসা (আঃ) কে তাঁর বাড়িতে ডাকলেন এবং তাঁকে আশ্রয় দিলেন। তিনি মূসা (আঃ) এর সততা ও শক্তি দেখে মুগ্ধ হলেন এবং তাঁর এক কন্যাকে মূসা (আঃ) এর সাথে বিবাহ দিলেন। মূসা (আঃ) আট থেকে দশ বছর শুআইব (আঃ) এর কাছে থেকে পশু চরালেন এবং তাঁর কাছ থেকে অনেক কিছু শিখলেন।","**মৃত্যু ও উত্তরাধিকার:** শুআইব (আঃ) দীর্ঘ জীবন পেয়েছিলেন। তিনি মাদইয়ানে ইন্তেকাল করেন। তাঁর জীবন ছিল সততা, ন্যায়বিচার এবং আল্লাহর দাওয়াতে পূর্ণ। তিনি ছিলেন বাগ্মী নবী এবং তাঁর দাওয়াতের পদ্ধতি ছিল অত্যন্ত কার্যকর। তাঁর কন্যা মূসা (আঃ) এর স্ত্রী হয়েছিলেন এবং এভাবে তিনি মূসা (আঃ) এর শ্বশুর হওয়ার সম্মান পেয়েছিলেন।"],"source":"**সূরা আরাফ: ৮৫-৯৩; সূরা হুদ: ৮৪-৯৫; সূরা শুআরা:** ১৭৬-১৯১; সূরা আনকাবুত: ৩৬-৩৭; সূরা কাসাস: ২২-২৮; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_ayyub_as","categoryId":"nobider_jiboni","title":"আইয়ুব (আঃ) - ধৈর্যের প্রতীক","paragraphs":["হযরত আইয়ুব (আঃ) ছিলেন ধৈর্যের প্রতীক এবং আল্লাহর প্রিয় নবী। তাঁর জীবন ছিল কঠিন পরীক্ষা এবং অসীম ধৈর্যে পূর্ণ। তিনি ছিলেন ইসহাক (আঃ) এর বংশধর এবং রোমান (শাম) অঞ্চলের অধিবাসী। তাঁর ধৈর্যের কাহিনী পৃথিবীর সব ভাষায় প্রবাদ হয়ে আছে।","**সমৃদ্ধ জীবন ও পরিবার:** আইয়ুব (আঃ) ছিলেন অত্যন্ত ধনী এবং সম্মানিত ব্যক্তি। তাঁর বিশাল জমি, অসংখ্য পশু, প্রচুর সম্পদ এবং অনেক চাকর-বাকর ছিল। তাঁর চৌদ্দ সন্তান ছিল - সাত ছেলে এবং সাত মেয়ে। তিনি ছিলেন সুস্বাস্থ্যের অধিকারী এবং মানুষের মধ্যে অত্যন্ত প্রিয়। কিন্তু সবচেয়ে বড় কথা, তিনি ছিলেন আল্লাহর কৃতজ্ঞ বান্দা। তিনি সবসময় আল্লাহর ইবাদত করতেন এবং দরিদ্রদের সাহায্য করতেন।","**মহাপরীক্ষার শুরু:** শয়তান আল্লাহর কাছে বলল, 'আইয়ুব তো আপনার ইবাদত করে কারণ আপনি তাকে সম্পদ দিয়েছেন। যদি তার সম্পদ কেড়ে নেন তাহলে সে আপনার বিরুদ্ধে যাবে।' আল্লাহ শয়তানকে অনুমতি দিলেন আইয়ুব (আঃ) কে পরীক্ষা করতে, তবে তাঁর জীবন ও ঈমানে হাত দিতে পারবে না। প্রথমে আইয়ুব (আঃ) এর সব সম্পদ ধ্বংস হয়ে গেল। তাঁর ক্ষেত-খামার, পশু-পাখি সব শেষ হয়ে গেল। কিন্তু আইয়ুব (আঃ) ধৈর্য ধরলেন এবং আল্লাহর শুকরিয়া আদায় করলেন।","**সন্তানদের হারানো:** এরপর আরও বড় বিপদ এলো। একদিন তাঁর সব সন্তান একটি ঘরে একসাথে ছিল। হঠাৎ ঘরটি ভেঙে পড়ল এবং চৌদ্দ সন্তানই মারা গেল। এই খবর শুনে আইয়ুব (আঃ) সিজদায় পড়ে গেলেন এবং বললেন, 'আল্লাহ দিয়েছিলেন, আল্লাহই নিয়ে নিলেন। আলহামদুলিল্লাহ!' তিনি আল্লাহর ফয়সালায় রাজি থাকলেন এবং কোনো অভিযোগ করলেন না।","**কঠিন রোগ ও দৈহিক কষ্ট:** শয়তান হার মানল না। সে আল্লাহর কাছে আবার অনুমতি চাইল। এবার আল্লাহ তাকে অনুমতি দিলেন আইয়ুব (আঃ) এর শরীরে আঘাত করতে, তবে তাঁর হৃদয় ও জিহ্বা ছাড়া। আইয়ুব (আঃ) ভয়ংকর রোগে আক্রান্ত হলেন। তাঁর সারা শরীরে ক্ষত হলো এবং পোকা বের হতে লাগল। তাঁর শরীর থেকে দুর্গন্ধ বের হতে লাগল। মানুষ তাঁকে ত্যাগ করল এবং শহর থেকে বের করে দিল। তাঁকে শহরের বাইরে একটি ডাস্টবিনের কাছে ফেলে রাখা হলো। কিন্তু আইয়ুব (আঃ) তবুও আল্লাহর যিকির করতে থাকলেন এবং ধৈর্য ধরলেন।","**স্ত্রীর অবিচল সাহচর্য:** সবাই আইয়ুব (আঃ) কে ছেড়ে চলে গেল কিন্তু তাঁর স্ত্রী রাহমা (লাইয়া) তাঁর পাশে থাকলেন। তিনি মানুষের বাড়িতে কাজ করে খাবার আনতেন এবং আইয়ুব (আঃ) কে সেবা করতেন। তিনি তাঁর ক্ষত পরিষ্কার করতেন এবং তাঁকে সান্ত্বনা দিতেন। এভাবে দীর্ঘ আঠারো বছর কেটে গেল। কিন্তু আইয়ুব (আঃ) কখনো অভিযোগ করলেন না। তিনি শুধু আল্লাহর যিকির করতেন এবং ধৈর্য ধরতেন।","**আল্লাহর কাছে দোয়া:** দীর্ঘ কষ্টের পর আইয়ুব (আঃ) আল্লাহর কাছে দোয়া করলেন। তিনি অভিযোগ করলেন না বরং বিনীতভাবে বললেন,","أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ","অর্থ: আমি কষ্টে পতিত হয়েছি এবং আপনি সর্বশ্রেষ্ঠ দয়ালু। [সূরা আম্বিয়া: ৮৩]","তিনি আল্লাহর রহমত চাইলেন, অভিযোগ করলেন না। তিনি বললেন না 'কেন আমাকে এই কষ্ট দিলেন' বরং বললেন 'আপনি তো দয়ালু'। এই দোয়ার মধ্যে ছিল পূর্ণ আদব এবং আল্লাহর প্রতি সুধারণা।","**আল্লাহর রহমত ও সুস্থতা:** আল্লাহ আইয়ুব (আঃ) এর দোয়া কবুল করলেন। আল্লাহ তাঁকে আদেশ দিলেন:","ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ","অর্থ: তোমার পা দিয়ে মাটিতে আঘাত করো। এই হলো ঠান্ডা পানি গোসল ও পান করার জন্য। [সূরা সোয়াদ: ৪২]","আইয়ুব (আঃ) পা দিয়ে মাটিতে আঘাত করলেন এবং সেখান থেকে একটি ঝর্ণা বের হলো। তিনি সেই পানি দিয়ে গোসল করলেন এবং পান করলেন। আল্লাহর কুদরতে তাঁর সব রোগ সেরে গেল। তিনি আগের চেয়েও বেশি সুস্থ ও সুন্দর হয়ে গেলেন। আল্লাহ বলেছেন,","فَاسْتَجَبْنَا لَهُ فَكَشَفْنَا مَا بِهِ مِن ضُرٍّ ۖ وَآتَيْنَاهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنْ عِندِنَا وَذِكْرَىٰ لِلْعَابِدِينَ","অর্থ: আমি তাঁর দোয়া কবুল করলাম এবং তাঁর কষ্ট দূর করে দিলাম। আমি তাঁকে তাঁর পরিবার ফিরিয়ে দিলাম এবং তাদের সাথে আরও দ্বিগুণ দিলাম আমার পক্ষ থেকে রহমত হিসেবে এবং ইবাদতকারীদের জন্য শিক্ষা হিসেবে। [সূরা আম্বিয়া: ৮৪]","**সম্পদ ও পরিবার ফিরে পাওয়া:** আল্লাহ আইয়ুব (আঃ) কে তাঁর সব সম্পদ ফিরিয়ে দিলেন এবং দ্বিগুণ করে দিলেন। তাঁর মৃত সন্তানদের জায়গায় আল্লাহ তাঁকে নতুন চৌদ্দ সন্তান দিলেন এবং তাঁর মৃত সন্তানরা জান্নাতে অপেক্ষা করছিল। তাঁর স্ত্রীও যৌবন ফিরে পেলেন। আল্লাহ তাঁকে আগের চেয়ে বেশি সম্মান ও মর্যাদা দিলেন।","**স্ত্রীর ব্যাপারে কসম পূরণ:** রোগের সময় একবার আইয়ুব (আঃ) এর স্ত্রী দেরি করে ফিরেছিলেন। আইয়ুব (আঃ) রাগে কসম খেয়ে বলেছিলেন যে সুস্থ হলে তিনি তাঁর স্ত্রীকে একশত বেত্রাঘাত করবেন। কিন্তু সুস্থ হওয়ার পর তিনি চিন্তিত হলেন কারণ তাঁর স্ত্রী তাঁর সবচেয়ে বড় সাহায্যকারী ছিলেন। আল্লাহ তাঁকে সমাধান দিলেন:","وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِب بِّهِ وَلَا تَحْنَثْ","অর্থ: তুমি তোমার হাতে একগুচ্ছ ঘাস নাও এবং তা দিয়ে আঘাত করো, এতে তোমার কসম ভঙ্গ হবে না। [সূরা সোয়াদ: ৪৪]","আইয়ুব (আঃ) একশত ঘাসের একটি আঁটি নিয়ে একবার তাঁর স্ত্রীকে স্পর্শ করলেন এবং এভাবে কসম পূরণ হলো।","**মৃত্যু ও উত্তরাধিকার:** আইয়ুব (আঃ) দীর্ঘ জীবন পেয়েছিলেন। তিনি ৯৩ বছর বয়সে ইন্তেকাল করেন। তাঁর জীবন ছিল ধৈর্য, কৃতজ্ঞতা এবং আল্লাহর প্রতি পূর্ণ আত্মসমর্পণে পূর্ণ। কুরআনে আল্লাহ তাঁর প্রশংসা করে বলেছেন,","إِنَّا وَجَدْنَاهُ صَابِرًا ۚ نِّعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ","অর্থ: নিশ্চয়ই আমি তাঁকে ধৈর্যশীল পেয়েছি। কী উত্তম বান্দা! নিশ্চয়ই তিনি ছিলেন আল্লাহমুখী। [সূরা সোয়াদ: ৪৪]"],"source":"**সূরা আম্বিয়া: ৮৩-৮৪; সূরা সোয়াদ:** ৪১-৪৪; সূরা নিসা: ১৬৩; তাফসীরে ইবনে কাসীর; কিতাবুল আম্বিয়া।"},{"id":"nabi_musa_as","categoryId":"nobider_jiboni","title":"মূসা (আঃ) - কালিমুল্লাহ","paragraphs":["হযরত মূসা (আঃ) ছিলেন বনী ইসরাঈলের সবচেয়ে বড় নবী এবং 'কালিমুল্লাহ' (আল্লাহর সাথে কথা বলেছেন যিনি)। তিনি ফেরাউনের বিরুদ্ধে লড়াই করেছিলেন এবং বনী ইসরাঈলকে মুক্ত করেছিলেন। আল্লাহ তাঁকে তাওরাত কিতাব দিয়েছিলেন এবং নয়টি স্পষ্ট মুজিজা দান করেছিলেন।","**জন্ম ও ফেরাউনের ষড়যন্ত্র:** মূসা (আঃ) মিশরে জন্মগ্রহণ করেন যখন ফেরাউন স্বপ্ন দেখেছিল যে বনী ইসরাঈল থেকে একটি ছেলে জন্ম নেবে যে তার রাজত্ব ধ্বংস করবে। তাই ফেরাউন আদেশ দিল সব নবজাতক ছেলে শিশুকে হত্যা করতে। মূসা (আঃ) এর মা ভয় পেলেন। আল্লাহ তাঁকে অহী পাঠালেন:","وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ","অর্থ: আমি মূসার মায়ের কাছে অহী পাঠালাম: তাকে দুধ পান করাও। যখন তার ব্যাপারে ভয় করবে তখন তাকে নদীতে ভাসিয়ে দাও। [সূরা কাসাস: ৭]","**ফেরাউনের প্রাসাদে লালন-পালন:** মূসা (আঃ) এর মা তাঁকে একটি বাক্সে রেখে নীল নদে ভাসিয়ে দিলেন। বাক্সটি ফেরাউনের প্রাসাদের কাছে এসে থামল। ফেরাউনের স্ত্রী আসিয়া (আঃ) বাক্স খুলে শিশুটিকে দেখলেন এবং তাঁকে ভালোবেসে ফেললেন। তিনি ফেরাউনকে বললেন, 'এই শিশুকে হত্যা করো না। এ আমার ও তোমার চোখের শীতলতা হতে পারে।' ফেরাউন রাজি হলো। কিন্তু মূসা (আঃ) কোনো ধাত্রীর দুধ পান করছিলেন না। তাঁর বোন এসে বলল, 'আমি কি এমন একজনকে বলব যে তাকে লালন-পালন করবে?' এভাবে মূসা (আঃ) তাঁর আপন মায়ের কাছে ফিরে এলেন এবং ফেরাউনের প্রাসাদেই বড় হলেন।","**মিশরীয়কে হত্যা ও মাদইয়ানে পলায়ন:** মূসা (আঃ) যুবক হলেন। একদিন তিনি দেখলেন একজন মিশরীয় একজন বনী ইসরাঈলকে মারছে। মূসা (আঃ) মিশরীয়কে একটি ঘুষি মারলেন এবং সে মারা গেল। মূসা (আঃ) তওবা করলেন এবং আল্লাহর কাছে ক্ষমা চাইলেন। পরদিন ফেরাউনের লোকেরা মূসা (আঃ) কে হত্যা করার পরিকল্পনা করল। একজন সৎ ব্যক্তি এসে মূসা (আঃ) কে সতর্ক করল। মূসা (আঃ) মিশর ছেড়ে মাদইয়ানের দিকে রওনা হলেন।","**শুআইব (আঃ) এর কন্যাকে বিবাহ:** মাদইয়ানে পৌঁছে মূসা (আঃ) একটি কূপের কাছে দেখলেন দুই মহিলা পশুদের পানি পান করাতে পারছে না। তিনি তাদের সাহায্য করলেন। তারা ছিল শুআইব (আঃ) এর দুই কন্যা। শুআইব (আঃ) মূসা (আঃ) কে তাঁর বাড়িতে ডাকলেন এবং তাঁকে আশ্রয় দিলেন। তিনি বললেন, 'আমি চাই তুমি আমার এক কন্যাকে বিবাহ করো এই শর্তে যে তুমি আট বছর আমার জন্য কাজ করবে। যদি দশ বছর পূর্ণ করো তা তোমার ইচ্ছা।' মূসা (আঃ) রাজি হলেন এবং দশ বছর পূর্ণ করলেন।","**তুর পাহাড়ে নবুয়ত লাভ:** দশ বছর পর মূসা (আঃ) পরিবার নিয়ে মিশরের দিকে রওনা হলেন। রাতে তুর পাহাড়ের কাছে তিনি আগুন দেখলেন। তিনি পরিবারকে বললেন, 'তোমরা থাকো, আমি আগুন থেকে একটি জ্বলন্ত কাঠ নিয়ে আসছি।' কিন্তু সেখানে পৌঁছে তিনি আল্লাহর কথা শুনলেন:","إِنِّي أَنَا اللَّهُ لَا إِلَٰهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي","অর্থ: নিশ্চয়ই আমি আল্লাহ। আমি ছাড়া কোনো ইলাহ নেই। সুতরাং আমার ইবাদত করো এবং আমার স্মরণে নামাজ কায়েম করো। [সূরা তাহা: ১৪]","আল্লাহ মূসা (আঃ) কে নবী বানালেন এবং তাঁকে ফেরাউনের কাছে পাঠালেন। মূসা (আঃ) বললেন, 'হে আমার রব! আমার বুক প্রশস্ত করে দিন এবং আমার কাজ সহজ করে দিন। আমার ভাই হারুনকে আমার সাহায্যকারী বানিয়ে দিন।' আল্লাহ তাঁর দোয়া কবুল করলেন।","**ফেরাউনের কাছে দাওয়াত ও মুজিজা:** মূসা (আঃ) এবং হারুন (আঃ) ফেরাউনের কাছে গেলেন এবং বললেন, 'আমরা জগতসমূহের রবের রাসূল। বনী ইসরাঈলকে আমাদের সাথে পাঠিয়ে দাও।' ফেরাউন অহংকার করে বলল, 'আমি কি তোমাকে শিশু হিসেবে লালন-পালন করিনি? আর তুমি একজনকে হত্যা করেছ!' মূসা (আঃ) বললেন, 'আমি ভুল করে তা করেছিলাম এবং আল্লাহ আমাকে ক্ষমা করেছেন।' ফেরাউন বলল, 'তোমার রব কে?' মূসা (আঃ) বললেন, 'আমাদের রব তিনি যিনি প্রতিটি জিনিসকে তার যথাযথ আকৃতি দিয়েছেন তারপর পথ দেখিয়েছেন।' ফেরাউন মুজিজা চাইল। মূসা (আঃ) লাঠি ফেললেন এবং তা বিশাল সাপ হয়ে গেল। তিনি হাত বের করলেন এবং তা উজ্জ্বল সাদা হয়ে গেল।","**জাদুকরদের সাথে প্রতিযোগিতা:** ফেরাউন তার সব জাদুকরদের ডাকল। তারা তাদের লাঠি ও রশি ফেলল এবং জাদুর মাধ্যমে সেগুলো সাপের মতো দেখাল। মূসা (আঃ) তাঁর লাঠি ফেললেন এবং তা সব জাদুকে গিলে ফেলল। জাদুকররা বুঝল এটা জাদু নয়, আল্লাহর কুদরত। তারা সবাই সিজদায় পড়ে গেল এবং বলল, 'আমরা মূসা ও হারুনের রবের প্রতি ঈমান আনলাম!' ফেরাউন রাগান্বিত হয়ে তাদের হাত-পা কেটে হত্যা করল কিন্তু তারা ঈমানে অটল রইল।","**লোহিত সাগর অতিক্রম ও ফেরাউনের ডুবে মরা:** আল্লাহ মূসা (আঃ) কে আদেশ দিলেন রাতে বনী ইসরাঈল নিয়ে মিশর ছেড়ে যেতে। ফেরাউন সকালে জানতে পেরে বিশাল বাহিনী নিয়ে তাদের তাড়া করল। বনী ইসরাঈল লোহিত সাগরে পৌঁছে বলল, 'আমরা তো ধরা পড়ে গেলাম!' মূসা (আঃ) বললেন, 'কখনো না! আমার রব আমার সাথে আছেন, তিনি আমাকে পথ দেখাবেন।' আল্লাহ আদেশ দিলেন:","فَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنِ اضْرِب بِّعَصَاكَ الْبَحْرَ ۖ فَانفَلَقَ فَكَانَ كُلُّ فِرْقٍ كَالطَّوْدِ الْعَظِيمِ","অর্থ: আমি মূসার কাছে অহী পাঠালাম: তোমার লাঠি দিয়ে সাগরে আঘাত করো। তখন সাগর দুই ভাগ হয়ে গেল এবং প্রতিটি ভাগ বিশাল পাহাড়ের মতো হয়ে গেল। [সূরা শুআরা: ৬৩]","বনী ইসরাঈল নিরাপদে পার হয়ে গেল। ফেরাউন তার বাহিনী নিয়ে সাগরে ঢুকল। যখন তারা মাঝখানে পৌঁছল তখন আল্লাহ সাগর বন্ধ করে দিলেন এবং ফেরাউন ও তার সব সৈন্য ডুবে মরল। ডুবে যাওয়ার সময় ফেরাউন বলল, 'আমি ঈমান আনলাম যে বনী ইসরাঈল যার প্রতি ঈমান এনেছে তিনি ছাড়া কোনো ইলাহ নেই।' কিন্তু তখন আর কোনো লাভ হলো না।","**তুর পাহাড়ে তাওরাত লাভ:** আল্লাহ মূসা (আঃ) কে তুর পাহাড়ে ডাকলেন এবং তাঁকে তাওরাত কিতাব দিলেন। মূসা (আঃ) চল্লিশ দিন সেখানে থাকলেন। এই সময়ে সামেরি নামক এক ব্যক্তি স্বর্ণ দিয়ে একটি গরুর বাছুর বানাল এবং বনী ইসরাঈলকে বলল এটাই তোমাদের ইলাহ। অনেকে তার পূজা শুরু করল। হারুন (আঃ) তাদের নিষেধ করলেন কিন্তু তারা মানল না। মূসা (আঃ) ফিরে এসে রাগান্বিত হলেন এবং বাছুরটি পুড়িয়ে ফেললেন। তিনি তাদের তওবা করালেন এবং আল্লাহ তাদের ক্ষমা করলেন।","**আল্লাহকে দেখার আবদার:** বনী ইসরাঈল মূসা (আঃ) কে বলল, 'আমরা আল্লাহকে প্রকাশ্যে না দেখা পর্যন্ত আপনার প্রতি ঈমান আনব না।' মূসা (আঃ) নিজেও আল্লাহর কাছে বললেন, 'হে আমার রব! আমাকে দেখা দিন যাতে আমি আপনাকে দেখতে পারি।' আল্লাহ বললেন, 'তুমি আমাকে দেখতে পারবে না। তবে পাহাড়ের দিকে তাকাও। যদি তা স্থির থাকে তাহলে তুমি আমাকে দেখতে পারবে।' যখন আল্লাহ পাহাড়ে তাজাল্লি দিলেন তখন পাহাড় চূর্ণ-বিচূর্ণ হয়ে গেল এবং মূসা (আঃ) বেহুঁশ হয়ে পড়লেন।","**মৃত্যু ও উত্তরাধিকার:** মূসা (আঃ) ১২০ বছর বয়সে ইন্তেকাল করেন। তিনি ছিলেন দৃঢ়চেতা নবী এবং আল্লাহর সাথে সরাসরি কথা বলার সম্মান পেয়েছিলেন। তাঁর জীবন ছিল ধৈর্য, সংগ্রাম এবং আল্লাহর প্রতি পূর্ণ আত্মসমর্পণে পূর্ণ।"],"source":"সূরা তাহা; সূরা কাসাস; সূরা আরাফ; সূরা বাকারা; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_harun_as","categoryId":"nobider_jiboni","title":"হারুন (আঃ) - মূসার সহযোগী","paragraphs":["হযরত হারুন (আঃ) ছিলেন মূসা (আঃ) এর বড় ভাই এবং তাঁর সহযোগী নবী। তিনি ছিলেন ইমরান ইবনে কাহাস এর পুত্র এবং মূসা (আঃ) এর তিন বছরের বড় ভাই। তাঁর মা ছিলেন ইউকাবিদ। তিনি মিসরে জন্মগ্রহণ করেন যখন ফেরাউন বনী ইসরাঈলের ছেলে সন্তানদের হত্যা করছিল, কিন্তু তাঁর জন্মের বছর ছিল 'ছাড়ের বছর' তাই তিনি রক্ষা পেয়েছিলেন। তিনি ছিলেন বাগ্মী এবং মূসা (আঃ) এর চেয়ে সুন্দর কথা বলতে পারতেন।","**নবুয়ত লাভ:** মূসা (আঃ) যখন তুর পাহাড়ে আল্লাহর সাথে কথা বললেন, তখন তিনি দোয়া করলেন যেন তাঁর ভাই হারুনকে তাঁর সহযোগী বানানো হয়। তিনি বললেন,","وَاجْعَل لِّي وَزِيرًا مِّنْ أَهْلِي ۝ هَارُونَ أَخِي ۝ اشْدُدْ بِهِ أَزْرِي","অর্থ: আমার পরিবার থেকে আমার জন্য একজন সাহায্যকারী বানিয়ে দিন, হারুন আমার ভাই, তার দ্বারা আমার শক্তি বৃদ্ধি করুন। [সূরা তাহা: ২৯-৩২]","আল্লাহ তাঁর দোয়া কবুল করলেন এবং হারুন (আঃ) কে নবী বানিয়ে মূসা (আঃ) এর সহযোগী করলেন। আল্লাহ বললেন,","وَوَهَبْنَا لَهُ مِن رَّحْمَتِنَا أَخَاهُ هَارُونَ نَبِيًّا","অর্থ: আমি আমার রহমত থেকে তার ভাই হারুনকে নবী বানিয়ে দিলাম। [সূরা মারইয়াম: ৫৩]","**ফেরাউনের দরবারে দাওয়াত:** মূসা (আঃ) এবং হারুন (আঃ) একসাথে ফেরাউনের দরবারে গেলেন। আল্লাহ তাঁদের বললেন নরম ভাষায় কথা বলতে। তাঁরা ফেরাউনের কাছে গিয়ে তাওহীদের দাওয়াত দিলেন এবং বনী ইসরাঈলকে মুক্ত করার দাবি করলেন। কিন্তু ফেরাউন অহংকার করল এবং তাদের জাদুকর বলল। সে তার জাদুকরদের ডেকে প্রতিযোগিতার আয়োজন করল। জাদুকররা তাদের জাদু দেখাল, কিন্তু মূসা ও হারুন (আঃ) তাঁদের লাঠি ফেললেন যা বিশাল সাপ হয়ে সব জাদু গিলে ফেলল। জাদুকররা বুঝতে পারল এটা জাদু নয়, আল্লাহর কুদরত। তারা সাথে সাথে সিজদায় পড়ে গেল এবং ঈমান আনল। ফেরাউন তাদের হুমকি দিল কিন্তু তারা ঈমানে অটল রইল।","**গরুর বাছুরের ফিতনা:** মূসা (আঃ) যখন তুর পাহাড়ে চল্লিশ দিনের জন্য গেলেন আল্লাহর সাথে কথা বলতে, তখন হারুন (আঃ) কে বনী ইসরাঈলের দায়িত্ব দিয়ে গেলেন। কিন্তু সামেরি নামক এক মুনাফিক মানুষের গহনা সংগ্রহ করে একটি সোনার গরুর বাছুর বানাল এবং বলল এটাই তোমাদের ইলাহ। হারুন (আঃ) তাদের কঠোরভাবে নিষেধ করলেন এবং বললেন,","يَا قَوْمِ إِنَّمَا فُتِنتُم بِهِ وَإِنَّ رَبَّكُمُ الرَّحْمَٰنُ فَاتَّبِعُونِي","অর্থ: হে আমার জাতি! তোমরা পরীক্ষায় পড়েছ, তোমাদের রব হলেন রহমান, আমার অনুসরণ করো। [সূরা তাহা: ৯০]","কিন্তু অধিকাংশ মানুষ তাঁর কথা শুনল না। হারুন (আঃ) ভয় পেলেন যে তিনি যদি কঠোর হন তাহলে বনী ইসরাঈল বিভক্ত হয়ে যাবে, তাই তিনি ধৈর্য ধরলেন এবং মূসা (আঃ) এর ফিরে আসার অপেক্ষা করলেন।","**মূসার রাগ ও ক্ষমা:** মূসা (আঃ) ফিরে এসে দেখলেন তাঁর জাতি গরুর বাছুরের পূজা করছে। তিনি অত্যন্ত রাগান্বিত হলেন এবং হারুন (আঃ) এর দাড়ি ও মাথার চুল ধরে টানলেন। হারুন (আঃ) বললেন,","يَا ابْنَ أُمَّ لَا تَأْخُذْ بِلِحْيَتِي وَلَا بِرَأْسِي","অর্থ: হে আমার মায়ের পুত্র! আমার দাড়ি ও মাথা ধরো না। আমি ভয় পেয়েছিলাম যে তুমি বলবে আমি বনী ইসরাঈলের মধ্যে বিভেদ সৃষ্টি করেছি। [সূরা তাহা: ৯৪] মূসা (আঃ) বুঝতে পারলেন যে হারুন (আঃ) তাঁর সাধ্যমতো চেষ্টা করেছেন এবং তিনি আল্লাহর কাছে দুই ভাইয়ের জন্য ক্ষমা চাইলেন।","**মৃত্যু ও মর্যাদা:** হারুন (আঃ) মূসা (আঃ) এর আগে তুর পাহাড়ের কাছে ইন্তেকাল করেন। বনী ইসরাঈল তাঁর মৃত্যুতে অত্যন্ত শোকাহত হয়েছিল এবং তিরিশ দিন শোক পালন করেছিল। তিনি ছিলেন ধৈর্যশীল, বাগ্মী এবং আল্লাহর অনুগত নবী যিনি সবসময় মূসা (আঃ) এর পাশে ছিলেন এবং তাঁর দাওয়াতে সাহায্য করেছিলেন।"],"source":"**সূরা তাহা: ২৯-৩৬, ৯০-৯৪; সূরা আরাফ:** ১৪২-১৫১; সূরা মারইয়াম: ৫৩; তাফসীরে ইবনে কাসীর; কাসাসুল আম্বিয়া।"},{"id":"nabi_yunus_as","categoryId":"nobider_jiboni","title":"ইউনুস (আঃ) - মাছের পেটের নবী","paragraphs":["হযরত ইউনুস (আঃ) ছিলেন নিনাওয়া শহরের নবী। তিনি মাছের পেটে তিন দিন তিন রাত কাটিয়েছিলেন এবং আল্লাহর রহমতে মুক্তি পেয়েছিলেন। তাঁর জীবন ধৈর্য, তওবা এবং আল্লাহর রহমতের শিক্ষা দেয়। কুরআনে তাঁকে 'যুন-নুন' (মাছওয়ালা) এবং 'সাহিবুল হুত' (মাছের সাথী) বলা হয়েছে।","**বংশ ও নিনাওয়া শহর:** ইউনুস (আঃ) এর পূর্ণ নাম ছিল ইউনুস ইবনে মাত্তা। তিনি বনী ইসরাঈলের বংশধর ছিলেন। আল্লাহ তাঁকে নিনাওয়া শহরের মানুষের কাছে পাঠালেন। নিনাওয়া ছিল ইরাকের মসুল শহরের কাছে একটি বিশাল শহর যেখানে এক লক্ষের বেশি মানুষ বাস করত। তারা মূর্তিপূজা করত এবং পাপাচারে লিপ্ত ছিল।","**দাওয়াত ও রাগ করে চলে যাওয়া:** ইউনুস (আঃ) দীর্ঘ সময় ধরে তাঁর জাতিকে তাওহীদের দাওয়াত দিলেন এবং বললেন,","اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ","অর্থ: তোমরা আল্লাহর ইবাদত করো, তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। কিন্তু তারা তাঁকে মিথ্যাবাদী বলল এবং তাঁর দাওয়াত প্রত্যাখ্যান করল। বছরের পর বছর চেষ্টা করেও কেউ ঈমান আনল না। ইউনুস (আঃ) হতাশ হয়ে পড়লেন এবং রাগান্বিত হলেন। তিনি তাদের সতর্ক করে বললেন তিন দিনের মধ্যে আযাব আসবে, এরপর আল্লাহর অনুমতি না নিয়েই রাগ করে নিনাওয়া ছেড়ে চলে গেলেন। আল্লাহ বলেন,","وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا","অর্থ: যুন-নুন রাগান্বিত হয়ে চলে গিয়েছিল। [সূরা আম্বিয়া: ৮৭]","**জাহাজ, ঝড় ও লটারি:** ইউনুস (আঃ) সমুদ্রের তীরে পৌঁছলেন এবং একটি জাহাজে উঠলেন। জাহাজ যখন সমুদ্রের মাঝখানে পৌঁছল, তখন হঠাৎ ভয়ংকর ঝড় উঠল এবং জাহাজ ডুবে যাওয়ার উপক্রম হলো। নাবিকরা বুঝতে পারল জাহাজে কোনো পাপী আছে যার কারণে এই বিপদ। তারা লটারি করার সিদ্ধান্ত নিল। তিনবার লটারি করা হলো এবং তিনবারই ইউনুস (আঃ) এর নাম উঠল। আল্লাহ বলেন,","فَسَاهَمَ فَكَانَ مِنَ الْمُدْحَضِينَ","অর্থ: সে লটারিতে অংশ নিল এবং পরাজিত হলো। [সূরা সাফফাত: ১৪১] ইউনুস (আঃ) বুঝতে পারলেন এটা আল্লাহর পরীক্ষা। তিনি নিজেই সমুদ্রে ঝাঁপ দিলেন এবং সাথে সাথে ঝড় থেমে গেল।","**মাছের পেটে তিন দিন তিন রাত:** আল্লাহর আদেশে একটি বিশাল মাছ এসে ইউনুস (আঃ) কে গিলে ফেলল। আল্লাহ বলেন,","فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ","অর্থ: মাছ তাকে গিলে ফেলল এবং সে ছিল নিজের প্রতি অভিযোগকারী। [সূরা সাফফাত: ১৪২] কিন্তু আল্লাহ মাছকে আদেশ দিলেন যেন সে ইউনুস (আঃ) কে আঘাত না করে এবং তাঁকে জীবিত রাখে। ইউনুস (আঃ) মাছের পেটে তিন দিন তিন রাত ছিলেন। চারদিকে ঘন অন্ধকার - মাছের পেটের অন্ধকার, সমুদ্রের গভীরের অন্ধকার এবং রাতের অন্ধকার। তিনি বুঝতে পারলেন এটা তাঁর ভুলের শাস্তি এবং আল্লাহর কাছে তওবা করলেন।","**তওবা ও বিখ্যাত দোয়া:** মাছের পেটে অন্ধকারে ইউনুস (আঃ) আল্লাহর কাছে কাঁদলেন এবং পড়লেন সেই বিখ্যাত দোয়া যা 'দোয়ায়ে ইউনুস' নামে পরিচিত:","لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ","অর্থ: আপনি ছাড়া কোনো ইলাহ নেই, আপনি পবিত্র, নিশ্চয়ই আমি জালিমদের অন্তর্ভুক্ত ছিলাম। [সূরা আম্বিয়া: ৮৭] রাসূলুল্লাহ (সাঃ) বলেছেন, যে কোনো মুসলমান যে কোনো বিপদে এই দোয়া পড়লে আল্লাহ তার দোয়া কবুল করবেন। [তিরমিযী]","**মুক্তি ও লাউ গাছের ছায়া:** আল্লাহ ইউনুস (আঃ) এর তওবা কবুল করলেন এবং বললেন,","فَاسْتَجَبْنَا لَهُ وَنَجَّيْنَاهُ مِنَ الْغَمِّ","অর্থ: আমি তার দোয়া কবুল করলাম এবং তাকে দুঃখ-কষ্ট থেকে মুক্তি দিলাম। [সূরা আম্বিয়া: ৮৮] আল্লাহ মাছকে আদেশ দিলেন এবং মাছ ইউনুস (আঃ) কে সমুদ্রের তীরে উগলে দিল। তাঁর শরীর দুর্বল হয়ে গিয়েছিল এবং রোদ সহ্য করতে পারছিলেন না। আল্লাহ তাঁর প্রতি দয়া করে একটি লাউ গাছ গজিয়ে দিলেন যা দ্রুত বড় হয়ে তাঁর উপর ছায়া দিল। আল্লাহ বলেন, 'وَأَنبَتْنَا عَلَيْهِ شَجَرَةً مِّن يَقْطِينٍ' - আমি তার উপর একটি লাউ গাছ উৎপন্ন করলাম। [সূরা সাফফাত: ১৪৬] ধীরে ধীরে ইউনুস (আঃ) সুস্থ হলেন এবং শক্তি ফিরে পেলেন।","**নিনাওয়ার মানুষের ঈমান:** ইউনুস (আঃ) যখন নিনাওয়া ছেড়ে চলে গিয়েছিলেন, তখন তাঁর জাতি দেখল আকাশে শাস্তির লক্ষণ দেখা দিচ্ছে। তারা ভয় পেয়ে গেল এবং বুঝতে পারল ইউনুস (আঃ) সত্য বলেছিলেন। তারা সবাই মিলে তওবা করল, আল্লাহর কাছে কাঁদল এবং ঈমান আনল। মা-বাবা তাদের শিশুদের থেকে আলাদা করল, গরু-ছাগল তাদের বাচ্চা থেকে আলাদা করল এবং সবাই আল্লাহর কাছে কাঁদতে লাগল। আল্লাহ তাদের তওবা দেখে দয়া করলেন এবং শাস্তি তুলে নিলেন। আল্লাহ বলেন,","فَلَوْلَا كَانَتْ قَرْيَةٌ آمَنَتْ فَنَفَعَهَا إِيمَانُهَا إِلَّا قَوْمَ يُونُسَ","অর্থ: ইউনুসের জাতি ছাড়া এমন কোনো জনপদ ছিল না যারা ঈমান এনে উপকৃত হয়েছে। [সূরা ইউনুস: ৯৮] ইউনুস (আঃ) নিনাওয়ায় ফিরে গেলেন এবং দেখলেন পুরো শহরের মানুষ ঈমান এনেছে। তিনি খুশি হলেন এবং তাদের তাওহীদ ও সৎকর্মের শিক্ষা দিতে লাগলেন। এটি ছিল একমাত্র জাতি যারা শাস্তি আসার পরেও ঈমান এনে রক্ষা পেয়েছিল।"],"source":"**সূরা আম্বিয়া: ৮৭-৮৮; সূরা সাফফাত:** ১৩৯-১৪৮; সূরা ইউনুস: ৯৮; সুনানে তিরমিযী; তাফসীরে ইবনে কাসীর; কাসাসুল আম্বিয়া।"},{"id":"nabi_dawud_as","categoryId":"nobider_jiboni","title":"দাউদ (আঃ) - জাবুর কিতাবের নবী","paragraphs":["হযরত দাউদ (আঃ) ছিলেন বনী ইসরাঈলের মহান নবী ও বাদশাহ। আল্লাহ তাঁকে জাবুর কিতাব দিয়েছিলেন এবং তিনি ছিলেন অত্যন্ত সুন্দর কণ্ঠের অধিকারী। তাঁর কণ্ঠে কুরআন তিলাওয়াত শুনে পাখি ও পাহাড় তাসবিহ পড়ত। তিনি ছিলেন ন্যায়বিচারক এবং আল্লাহর অনুগত বান্দা।","**জালুতকে হত্যা ও বাদশাহ হওয়া:** দাউদ (আঃ) যুবক বয়সে একজন সাধারণ রাখাল ছিলেন। সেই সময় জালুত নামক এক বিশাল ও শক্তিশালী যোদ্ধা বনী ইসরাঈলের বিরুদ্ধে যুদ্ধ করছিল। কেউ তার সাথে লড়তে সাহস পাচ্ছিল না। তালুত বাদশাহ ঘোষণা দিলেন যে যে জালুতকে হত্যা করবে তাকে তিনি তাঁর কন্যা বিবাহ দেবেন এবং রাজত্বের অংশীদার করবেন। দাউদ (আঃ) সামনে এগিয়ে গেলেন। তিনি গুলতি দিয়ে একটি পাথর ছুঁড়লেন এবং তা জালুতের কপালে লাগল। জালুত মারা গেল এবং বনী ইসরাঈল জয়ী হলো। কুরআনে বলা হয়েছে:","فَهَزَمُوهُم بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُودُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ","অর্থ: তারা আল্লাহর অনুমতিতে তাদের পরাজিত করল এবং দাউদ জালুতকে হত্যা করল। আল্লাহ তাঁকে রাজত্ব ও হিকমত দান করলেন। [সূরা বাকারা: ২৫১]","**নবুয়ত ও জাবুর কিতাব:** আল্লাহ দাউদ (আঃ) কে নবুয়ত দান করলেন এবং জাবুর কিতাব দিলেন। জাবুর ছিল দোয়া ও তাসবিহে পূর্ণ একটি কিতাব। দাউদ (আঃ) অত্যন্ত সুন্দর কণ্ঠে জাবুর তিলাওয়াত করতেন। তাঁর তিলাওয়াত শুনে পাখিরা এসে জড়ো হতো এবং পাহাড় তাসবিহ পড়ত। আল্লাহ বলেছেন,","إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ ۝ وَالطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَّهُ أَوَّابٌ","অর্থ: আমি পাহাড়সমূহকে তাঁর অধীন করে দিয়েছিলাম, তারা সন্ধ্যায় ও সকালে তাসবিহ পড়ত। এবং পাখিদেরও একত্রিত করা হতো। সবাই তাঁর সাথে আল্লাহমুখী ছিল। [সূরা সোয়াদ: ১৮-১৯]","**বর্ম তৈরি ও জীবিকা:** দাউদ (আঃ) নিজ হাতে লোহার বর্ম তৈরি করতেন। আল্লাহ তাঁর জন্য লোহা নরম করে দিয়েছিলেন। তিনি বর্ম বিক্রি করে জীবিকা নির্বাহ করতেন এবং কারো দান গ্রহণ করতেন না। রাসূল (সাঃ) বলেছেন, 'সবচেয়ে উত্তম খাবার হলো যা মানুষ নিজ হাতে কাজ করে খায়। আল্লাহর নবী দাউদ নিজ হাতে কাজ করে খেতেন।'","**ন্যায়বিচার ও ইবাদত:** দাউদ (আঃ) ছিলেন ন্যায়বিচারক। একবার দুই ব্যক্তি তাঁর কাছে বিচারের জন্য এলো। একজন বলল, 'এর নিরানব্বইটি ভেড়া আছে এবং আমার একটি। সে আমার ভেড়াটিও চায়।' দাউদ (আঃ) রায় দিলেন যে এটা অন্যায়। আল্লাহ তাঁকে বুঝালেন যে এটা ছিল একটি পরীক্ষা। দাউদ (আঃ) তওবা করলেন। তিনি দিনের এক তৃতীয়াংশ ইবাদত করতেন, এক তৃতীয়াংশ ঘুমাতেন এবং এক তৃতীয়াংশ বিচার কাজ করতেন। তিনি একদিন রোজা রাখতেন এবং একদিন রাখতেন না।","**মৃত্যু ও উত্তরাধিকার:** দাউদ (আঃ) দীর্ঘ জীবন পেয়েছিলেন এবং তিনি ছিলেন আল্লাহর প্রিয় বান্দা। তাঁর পুত্র সুলাইমান (আঃ) তাঁর পরে নবী ও বাদশাহ হন এবং তাঁর চেয়েও বড় রাজত্ব পান।"],"source":"**সূরা বাকারা: ২৫১; সূরা সাবা: ১০-১১; সূরা সোয়াদ:** ১৭-২৬; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_sulaiman_as","categoryId":"nobider_jiboni","title":"সুলাইমান (আঃ) - জিন ও পশু-পাখির বাদশাহ","paragraphs":["হযরত সুলাইমান (আঃ) ছিলেন দাউদ (আঃ) এর পুত্র এবং পৃথিবীর ইতিহাসে সবচেয়ে শক্তিশালী বাদশাহ। আল্লাহ তাঁকে এমন রাজত্ব দিয়েছিলেন যা আর কাউকে দেননি। তিনি জিন, মানুষ, পশু-পাখি সবার ভাষা বুঝতেন এবং বাতাস তাঁর নিয়ন্ত্রণে ছিল। তাঁর বাদশাহী ছিল আল্লাহর দান এবং তিনি সবসময় আল্লাহর শুকরিয়া আদায় করতেন।","**নবুয়ত ও রাজত্ব লাভ:** দাউদ (আঃ) এর উনিশ পুত্র ছিল। সুলাইমান (আঃ) ছিলেন তাঁদের মধ্যে সবচেয়ে জ্ঞানী এবং বিচক্ষণ। আল্লাহ তাঁকে নবুয়ত ও রাজত্ব দান করলেন। সুলাইমান (আঃ) আল্লাহর কাছে দোয়া করলেন:","رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ","অর্থ: হে আমার রব! আমাকে ক্ষমা করুন এবং আমাকে এমন রাজত্ব দান করুন যা আমার পরে আর কারো জন্য উপযুক্ত হবে না। নিশ্চয়ই আপনি মহাদাতা। [সূরা সোয়াদ: ৩৫]","আল্লাহ তাঁর দোয়া কবুল করলেন এবং তাঁকে অসাধারণ ক্ষমতা দিলেন।","**পশু-পাখির ভাষা বোঝা:** সুলাইমান (আঃ) সব পশু-পাখির ভাষা বুঝতেন। একবার তিনি তাঁর বিশাল বাহিনী নিয়ে যাচ্ছিলেন। একটি পিঁপড়া অন্য পিঁপড়াদের বলল, 'হে পিঁপড়ারা! তোমাদের ঘরে ঢুকে পড়ো যাতে সুলাইমান ও তাঁর বাহিনী অজান্তে তোমাদের পিষে না ফেলে।' সুলাইমান (আঃ) এই কথা শুনে হেসে ফেললেন এবং বললেন,","رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ","অর্থ: হে আমার রব! আমাকে তাওফিক দিন যাতে আমি আপনার নিয়ামতের শুকরিয়া আদায় করতে পারি যা আপনি আমাকে ও আমার পিতা-মাতাকে দিয়েছেন। [সূরা নামল: ১৯]","**হুদহুদ পাখি ও সাবার রানী:** একদিন সুলাইমান (আঃ) দেখলেন হুদহুদ পাখি নেই। তিনি বললেন, 'হুদহুদ কোথায়? যদি সে ভালো কারণ না দেখায় তাহলে আমি তাকে শাস্তি দেব।' হুদহুদ এসে বলল, 'আমি এমন এক খবর নিয়ে এসেছি যা আপনি জানেন না। আমি সাবা থেকে আসছি। সেখানে একজন রানী আছে যার বিশাল রাজত্ব আছে এবং সে ও তার জাতি সূর্যের পূজা করে।' সুলাইমান (আঃ) হুদহুদকে একটি চিঠি দিয়ে পাঠালেন। চিঠিতে লেখা ছিল: 'বিসমিল্লাহির রাহমানির রাহিম। আমার বিরুদ্ধে অহংকার করো না এবং আমার কাছে মুসলিম হয়ে এসো।'","**বিলকিসের ইসলাম গ্রহণ:** রানী বিলকিস চিঠি পড়ে তার মন্ত্রীদের সাথে পরামর্শ করলেন। তারা বলল, 'আমরা শক্তিশালী, আপনি যা চান তাই করুন।' বিলকিস বুদ্ধিমতী ছিলেন। তিনি উপহার পাঠালেন। সুলাইমান (আঃ) বললেন, 'তোমরা কি আমাকে সম্পদ দিয়ে খুশি করতে চাও? আল্লাহ আমাকে যা দিয়েছেন তা তোমাদের চেয়ে উত্তম।' অবশেষে বিলকিস নিজে এলেন। সুলাইমান (আঃ) তাঁর রাজপ্রাসাদ দেখালেন যার মেঝে ছিল স্বচ্ছ কাঁচের এবং নিচে পানি। বিলকিস ভাবলেন এটা পানি এবং কাপড় তুলে নিলেন। সুলাইমান (আঃ) বললেন, 'এটা কাঁচের মেঝে।' বিলকিস আল্লাহর কুদরত দেখে মুগ্ধ হলেন এবং বললেন,","رَبِّ إِنِّي ظَلَمْتُ نَفْسِي وَأَسْلَمْتُ مَعَ سُلَيْمَانَ لِلَّهِ رَبِّ الْعَالَمِينَ","অর্থ: হে আমার রব! আমি নিজের উপর জুলুম করেছি এবং আমি সুলাইমানের সাথে জগতসমূহের রব আল্লাহর জন্য আত্মসমর্পণ করলাম। [সূরা নামল: ৪৪]","**জিন ও বাতাসের নিয়ন্ত্রণ:** আল্লাহ জিনদের সুলাইমান (আঃ) এর অধীন করে দিয়েছিলেন। তারা তাঁর জন্য মহল, মূর্তি (সেই সময় জায়েজ ছিল), বিশাল পাত্র তৈরি করত। বাতাস তাঁর আদেশে চলত - সকালে এক মাসের পথ এবং বিকালে এক মাসের পথ। শয়তানরাও তাঁর অধীন ছিল এবং তারা সমুদ্রে ডুব দিয়ে মুক্তা তুলে আনত।","**মৃত্যু ও জিনদের অজ্ঞতা:** সুলাইমান (আঃ) দাঁড়িয়ে থাকা অবস্থায় ইন্তেকাল করেন। তিনি লাঠিতে ভর দিয়ে দাঁড়িয়ে ছিলেন। জিনরা বুঝতে পারেনি তিনি মারা গেছেন এবং কাজ করতে থাকল। দীর্ঘ সময় পর উইপোকা লাঠি খেয়ে ফেললে তিনি পড়ে গেলেন। তখন জিনরা বুঝল তিনি মারা গেছেন। এতে প্রমাণ হলো জিনরা গায়েব জানে না।"],"source":"**সূরা নামল: ১৫-৪৪; সূরা সাবা: ১২-১৪; সূরা সোয়াদ:** ৩০-৪০; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_zakariya_as","categoryId":"nobider_jiboni","title":"যাকারিয়া (আঃ) - বৃদ্ধ বয়সে সন্তান লাভ","paragraphs":["হযরত যাকারিয়া (আঃ) ছিলেন বনী ইসরাঈলের নবী এবং বাইতুল মাকদিসের তত্ত্বাবধায়ক। তিনি ছিলেন মারইয়াম (আঃ) এর অভিভাবক এবং একজন সম্মানিত কাঠমিস্ত্রি। তাঁর জীবনের সবচেয়ে বড় দোয়া ছিল সন্তান লাভ এবং আল্লাহ তাঁর দোয়া অলৌকিকভাবে কবুল করেছিলেন।","**মারইয়াম (আঃ) এর অভিভাবক ও সন্তানের জন্য দোয়া:** যাকারিয়া (আঃ) মারইয়াম (আঃ) এর অভিভাবক ছিলেন। মারইয়াম (আঃ) বাইতুল মাকদিসের মিহরাবে ইবাদত করতেন। যাকারিয়া (আঃ) যখন তাঁর কাছে যেতেন, তখন তাঁর কাছে মৌসুম বহির্ভূত ফল পেতেন। তিনি জিজ্ঞেস করতেন: 'হে মারইয়াম! এগুলো তোমার কাছে কোথা থেকে আসে?' মারইয়াম (আঃ) বলতেন: 'এগুলো আল্লাহর পক্ষ থেকে। আল্লাহ যাকে চান বিনা হিসাবে রিযিক দেন।' এই দেখে যাকারিয়া (আঃ) অনুপ্রাণিত হলেন এবং আল্লাহর কাছে সন্তানের জন্য দোয়া করার সাহস পেলেন। তিনি বৃদ্ধ হয়ে গিয়েছিলেন, তাঁর মাথার চুল সাদা হয়ে গিয়েছিল এবং তাঁর কোনো সন্তান ছিল না। তাঁর স্ত্রীও বন্ধ্যা ছিলেন। তিনি ভয় পেতেন যে তাঁর পরে তাঁর বংশের কেউ থাকবে না যে দ্বীনের দায়িত্ব পালন করবে। তিনি আল্লাহর কাছে অত্যন্ত গোপনে দোয়া করলেন:","رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُن بِدُعَائِكَ رَبِّ شَقِيًّا ۝ رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ","অর্থ: হে আমার রব! আমার হাড় দুর্বল হয়ে গেছে এবং মাথা সাদা চুলে ভরে গেছে। কিন্তু হে আমার রব! আমি আপনার কাছে দোয়া করে কখনো বঞ্চিত হইনি। হে আমার রব! আপনার পক্ষ থেকে আমাকে সৎ সন্তান দান করুন। নিশ্চয়ই আপনি দোয়া শোনেন। [সূরা মারইয়াম: ৪; সূরা আলে ইমরান: ৩৮]","**ইয়াহইয়া (আঃ) এর সুসংবাদ ও নিদর্শন:** যাকারিয়া (আঃ) মিহরাবে দাঁড়িয়ে নামাজ পড়ছিলেন। এমন সময় ফেরেশতারা তাঁকে ডেকে বলল,","يَا زَكَرِيَّا إِنَّا نُبَشِّرُكَ بِغُلَامٍ اسْمُهُ يَحْيَىٰ لَمْ نَجْعَل لَّهُ مِن قَبْلُ سَمِيًّا","অর্থ: হে যাকারিয়া! আমরা তোমাকে এক পুত্রের সুসংবাদ দিচ্ছি যার নাম ইয়াহইয়া। এই নামে আমরা আগে কাউকে সৃষ্টি করিনি। [সূরা মারইয়াম: ৭]","ফেরেশতারা আরো বলল যে এই পুত্র হবে সম্মানিত, সংযমী, নবী এবং সৎকর্মশীল। যাকারিয়া (আঃ) অবাক হয়ে বললেন,","رَبِّ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَقَدْ بَلَغَنِيَ الْكِبَرُ وَامْرَأَتِي عَاقِرٌ","অর্থ: হে আমার রব! কীভাবে আমার পুত্র হবে? আমি তো বৃদ্ধ হয়ে গেছি এবং আমার স্ত্রী বন্ধ্যা। [সূরা মারইয়াম: ৮]","ফেরেশতা বলল, 'আল্লাহ যা চান তাই করেন। এটা আল্লাহর জন্য সহজ।' যাকারিয়া (আঃ) নিদর্শন চাইলেন। আল্লাহ বললেন,","أَلَّا تُكَلِّمَ النَّاسَ ثَلَاثَةَ أَيَّامٍ إِلَّا رَمْزًا","অর্থ: তুমি তিন দিন মানুষের সাথে কথা বলতে পারবে না, শুধু ইশারায় কথা বলবে। [সূরা আলে ইমরান: ৪১]","এভাবেই হলো। যাকারিয়া (আঃ) তিন দিন কথা বলতে পারলেন না কিন্তু আল্লাহর তাসবিহ করতে পারলেন। তিনি মিহরাব থেকে বের হয়ে মানুষকে ইশারায় বললেন সকাল-সন্ধ্যা আল্লাহর তাসবিহ করতে। তাঁর স্ত্রী গর্ভবতী হলেন এবং আল্লাহর কুদরতে ইয়াহইয়া (আঃ) জন্ম নিলেন।","**শাহাদাত:** যাকারিয়া (আঃ) শহীদ হয়েছিলেন। বনী ইসরাঈলের কিছু জালিম লোক তাঁকে হত্যা করেছিল। তিনি ছিলেন আল্লাহর প্রিয় বান্দা, দোয়ার মাধ্যমে আল্লাহর কুদরত প্রমাণকারী এবং বৃদ্ধ বয়সে সন্তান লাভের অলৌকিক ঘটনার সাক্ষী।"],"moral":"","source":"সূরা আলে ইমরান: ৩৭-৪১; সূরা মারইয়াম: ২-১১; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_yahya_as","categoryId":"nobider_jiboni","title":"ইয়াহইয়া (আঃ) - শহীদ নবী","paragraphs":["হযরত ইয়াহইয়া (আঃ) ছিলেন যাকারিয়া (আঃ) এর পুত্র এবং ঈসা (আঃ) এর সমসাময়িক নবী। তিনি ছিলেন অত্যন্ত পবিত্র এবং আল্লাহভীরু। তাঁকে শৈশব থেকেই জ্ঞান ও নবুয়ত দেওয়া হয়েছিল। তাঁর নাম 'ইয়াহইয়া' আল্লাহ নিজেই রেখেছিলেন এবং এই নামে আগে কেউ ছিল না।","**মুজিজাপূর্ণ জন্ম:** যাকারিয়া (আঃ) বৃদ্ধ ছিলেন এবং তাঁর স্ত্রী বন্ধ্যা ছিলেন। কিন্তু আল্লাহর কুদরতে ইয়াহইয়া (আঃ) জন্ম নিলেন। আল্লাহ ফেরেশতাদের মাধ্যমে যাকারিয়া (আঃ) কে সুসংবাদ দিয়েছিলেন:","يَا زَكَرِيَّا إِنَّا نُبَشِّرُكَ بِغُلَامٍ اسْمُهُ يَحْيَىٰ لَمْ نَجْعَل لَّهُ مِن قَبْلُ سَمِيًّا","অর্থ: হে যাকারিয়া! আমি তোমাকে এক পুত্রের সুসংবাদ দিচ্ছি যার নাম ইয়াহইয়া। এই নামে আমি আগে কাউকে সৃষ্টি করিনি। [সূরা মারইয়াম: ৭]","**শৈশব থেকে জ্ঞান ও নবুয়ত:** আল্লাহ ইয়াহইয়া (আঃ) কে শৈশব থেকেই জ্ঞান, বিচক্ষণতা এবং নবুয়ত দান করেছিলেন। কুরআনে বলা হয়েছে:","يَا يَحْيَىٰ خُذِ الْكِتَابَ بِقُوَّةٍ ۖ وَآتَيْنَاهُ الْحُكْمَ صَبِيًّا","অর্থ: হে ইয়াহইয়া! কিতাব দৃঢ়ভাবে ধরো। আমি তাঁকে শৈশবেই জ্ঞান দান করেছি। [সূরা মারইয়াম: ১২]","অন্য শিশুরা যখন খেলাধুলা করত তখন ইয়াহইয়া (আঃ) ইবাদত করতেন এবং ইলম অর্জন করতেন। তিনি শৈশব থেকেই গম্ভীর এবং আল্লাহমুখী ছিলেন।","**বিশেষ গুণাবলী:** আল্লাহ ইয়াহইয়া (আঃ) এর বিশেষ গুণের কথা উল্লেখ করেছেন:","وَحَنَانًا مِّن لَّدُنَّا وَزَكَاةً ۖ وَكَانَ تَقِيًّا ۝ وَبَرًّا بِوَالِدَيْهِ وَلَمْ يَكُن جَبَّارًا عَصِيًّا","অর্থ: আমি তাঁকে দয়া ও পবিত্রতা দান করেছি এবং তিনি ছিলেন আল্লাহভীরু। তিনি ছিলেন পিতা-মাতার অনুগত এবং তিনি ছিলেন না উদ্ধত, না অবাধ্য। [সূরা মারইয়াম: ১৩-১৪]","তিনি অত্যন্ত দয়ালু, বিনয়ী এবং পবিত্র ছিলেন। তিনি কখনো পাপ করেননি এবং কখনো অহংকার করেননি। তিনি পিতা-মাতার খুব সেবা করতেন এবং তাঁদের কথা মানতেন।","**সত্যের জন্য লড়াই:** ইয়াহইয়া (আঃ) বনী ইসরাঈলের মধ্যে সত্য ও ন্যায়ের দাওয়াত দিতেন। তিনি মানুষকে তাওরাতের শিক্ষা দিতেন এবং আল্লাহর পথে ডাকতেন। তিনি কখনো অন্যায়ের সাথে আপস করতেন না।","**শাহাদাত:** সেই সময়ে হেরোদ নামক একজন জালিম শাসক ছিল। সে তার ভাইয়ের স্ত্রীকে বিবাহ করতে চাইল যা শরীয়তে হারাম। ইয়াহইয়া (আঃ) এই অন্যায় বিবাহের বিরুদ্ধে কথা বললেন এবং বললেন এটা হারাম। হেরোদের স্ত্রী এতে রাগান্বিত হলো এবং প্রতিশোধ নিতে চাইল। সে তার মেয়েকে দিয়ে হেরোদকে খুশি করল এবং পুরস্কার হিসেবে ইয়াহইয়া (আঃ) এর মাথা চাইল। হেরোদ তার প্রতিশ্রুতি রক্ষা করতে ইয়াহইয়া (আঃ) কে শহীদ করে ফেলল। তাঁর মাথা কেটে একটি থালায় রেখে দেওয়া হলো।","**শাহাদাতের পর:** ইয়াহইয়া (আঃ) ছিলেন প্রথম নবী যিনি শহীদ হন। তিনি সত্যের জন্য জীবন দিয়েছিলেন এবং অন্যায়ের বিরুদ্ধে কথা বলতে ভয় পাননি। তাঁর শাহাদাত মুমিনদের জন্য শিক্ষা যে সত্য বলতে হয় যত কঠিনই হোক। আল্লাহ তাঁর প্রশংসা করে বলেছেন,","وَسَلَامٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوتُ وَيَوْمَ يُبْعَثُ حَيًّا","অর্থ: তাঁর উপর শান্তি যেদিন তিনি জন্মগ্রহণ করেছেন, যেদিন তিনি মৃত্যুবরণ করবেন এবং যেদিন তিনি জীবিত অবস্থায় পুনরুত্থিত হবেন। [সূরা মারইয়াম: ১৫]"],"source":"**সূরা মারইয়াম: ১২-১৫; সূরা আলে ইমরান:** ৩৯; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_isa_as","categoryId":"nobider_jiboni","title":"ঈসা (আঃ) - রুহুল্লাহ","paragraphs":["হযরত ঈসা (আঃ) ছিলেন মারইয়াম (আঃ) এর পুত্র এবং পিতা ছাড়াই জন্মগ্রহণ করেছিলেন। তিনি ছিলেন আল্লাহর মহান নবী এবং 'রুহুল্লাহ' (আল্লাহর রূহ) ও 'মাসিহ' (মসীহ) উপাধিতে ভূষিত। আল্লাহ তাঁকে ইনজিল কিতাব দিয়েছিলেন এবং অসংখ্য মুজিজা দান করেছিলেন। তিনি ছিলেন বনী ইসরাঈলের শেষ বড় নবী এবং মুহাম্মাদ (সাঃ) এর আগমনের সুসংবাদদাতা।","মারইয়াম (আঃ) এর পবিত্রতা ও মর্যাদা: মারইয়াম (আঃ) ছিলেন ইমরান (আঃ) এর কন্যা এবং পৃথিবীর সবচেয়ে পবিত্র মহিলাদের একজন। তাঁর মা হান্না গর্ভাবস্থায় মানত করেছিলেন যে সন্তান হলে তাকে বাইতুল মাকদিসের সেবায় উৎসর্গ করবেন। কিন্তু মেয়ে হওয়ায় তিনি চিন্তিত হলেন। আল্লাহ বললেন, 'পুত্র মেয়ের মতো নয়।' আল্লাহ মারইয়াম (আঃ) কে কবুল করলেন এবং তাঁকে সুন্দরভাবে বড় করলেন। যাকারিয়া (আঃ) তাঁর অভিভাবক হলেন। মারইয়াম (আঃ) বাইতুল মাকদিসের একটি বিশেষ কক্ষে ইবাদত করতেন। যাকারিয়া (আঃ) যখনই তাঁর কাছে যেতেন তখন তাঁর কাছে মৌসুম বহির্ভূত খাবার পেতেন। তিনি জিজ্ঞাসা করলেন:","يَا مَرْيَمُ أَنَّىٰ لَكِ هَٰذَا ۖ قَالَتْ هُوَ مِنْ عِندِ اللَّهِ ۖ إِنَّ اللَّهَ يَرْزُقُ مَن يَشَاءُ بِغَيْرِ حِسَابٍ","অর্থ: হে মারইয়াম! এটা তোমার কাছে কোথা থেকে এলো? তিনি বললেন, এটা আল্লাহর পক্ষ থেকে। নিশ্চয়ই আল্লাহ যাকে চান বিনা হিসাবে রিজিক দেন। [সূরা আলে ইমরান: ৩৭]","**ঈসা (আঃ) এর সুসংবাদ:** একদিন মারইয়াম (আঃ) ইবাদতের জন্য পূর্ব দিকে একাকী ছিলেন এবং পর্দা করেছিলেন। জিবরাঈল (আঃ) পূর্ণ মানুষের রূপে তাঁর কাছে এলেন। মারইয়াম (আঃ) ভয় পেয়ে বললেন, 'আমি তোমার থেকে দয়াময়ের আশ্রয় চাই, যদি তুমি আল্লাহভীরু হও।' জিবরাঈল (আঃ) বললেন, 'আমি তোমার রবের পক্ষ থেকে প্রেরিত ফেরেশতা। আমি তোমাকে একটি পবিত্র পুত্র দেব।' মারইয়াম (আঃ) অবাক হয়ে বললেন,","قَالَتْ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَلَمْ يَمْسَسْنِي بَشَرٌ وَلَمْ أَكُ بَغِيًّا","অর্থ: কীভাবে আমার পুত্র হবে যখন কোনো মানুষ আমাকে স্পর্শ করেনি এবং আমি ব্যভিচারিণীও নই? [সূরা মারইয়াম: ২০]","জিবরাঈল (আঃ) বললেন, 'এভাবেই হবে। তোমার রব বলেছেন, এটা আমার জন্য সহজ। আমি তাকে মানুষের জন্য নিদর্শন এবং আমার পক্ষ থেকে রহমত বানাব। এটা সিদ্ধান্ত হয়ে গেছে।' জিবরাঈল (আঃ) মারইয়াম (আঃ) এর জামার ভেতরে ফুঁ দিলেন এবং তিনি গর্ভবতী হলেন।","**ঈসা (আঃ) এর জন্ম:** মারইয়াম (আঃ) গর্ভবতী হওয়ার পর মানুষের ভয়ে দূরে বাইতুল লাহাম (বেথলেহেম) এর দিকে চলে গেলেন। একটি খেজুর গাছের নিচে তাঁর প্রসব বেদনা শুরু হলো। তিনি কষ্টে ও লজ্জায় বললেন, 'হায়! আমি যদি এর আগে মরে যেতাম এবং সম্পূর্ণ বিস্মৃত হয়ে যেতাম!' তখন ঈসা (আঃ) নিচ থেকে তাঁকে ডেকে বললেন, 'দুঃখ করো না। তোমার রব তোমার নিচে একটি ঝর্ণা সৃষ্টি করেছেন। খেজুর গাছের কাণ্ড নাড়া দাও, তোমার উপর তাজা পাকা খেজুর পড়বে। খাও, পান করো এবং চোখ জুড়াও।' আল্লাহ তাঁকে আরও বললেন যে কোনো মানুষকে কিছু বলবেন না, শুধু বলবেন যে তিনি রোজা রেখেছেন।","**শিশু ঈসা (আঃ) এর কথা বলা:** মারইয়াম (আঃ) শিশু নিয়ে তাঁর জাতির কাছে ফিরে এলেন। তারা অবাক হয়ে বলল,","يَا مَرْيَمُ لَقَدْ جِئْتِ شَيْئًا فَرِيًّا ۝ يَا أُخْتَ هَارُونَ مَا كَانَ أَبُوكِ امْرَأَ سَوْءٍ وَمَا كَانَتْ أُمُّكِ بَغِيًّا","অর্থ: হে মারইয়াম! তুমি তো অদ্ভুত কাজ করেছ! হে হারুনের বোন! তোমার পিতা খারাপ মানুষ ছিলেন না এবং তোমার মা ব্যভিচারিণী ছিলেন না! [সূরা মারইয়াম: ২৭-২৮]","মারইয়াম (আঃ) কিছু না বলে শিশুর দিকে ইশারা করলেন। তারা রেগে বলল, 'আমরা কীভাবে এমন একজনের সাথে কথা বলব যে দোলনায় শিশু?' তখন আল্লাহর কুদরতে শিশু ঈসা (আঃ) কথা বললেন,","إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا ۝ وَجَعَلَنِي مُبَارَكًا أَيْنَ مَا كُنتُ وَأَوْصَانِي بِالصَّلَاةِ وَالزَّكَاةِ مَا دُمْتُ حَيًّا ۝ وَبَرًّا بِوَالِدَتِي وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا","অর্থ: আমি আল্লাহর বান্দা। তিনি আমাকে কিতাব দিয়েছেন এবং আমাকে নবী বানিয়েছেন। তিনি আমাকে বরকতময় করেছেন যেখানেই আমি থাকি এবং আমাকে নামাজ ও যাকাতের নির্দেশ দিয়েছেন যতদিন আমি জীবিত থাকব। এবং আমার মায়ের প্রতি সদয় হতে এবং তিনি আমাকে উদ্ধত ও হতভাগ্য করেননি। [সূরা মারইয়াম: ৩০-৩২]","এই মুজিজা দেখে মানুষ অবাক হলো এবং মারইয়াম (আঃ) এর পবিত্রতা প্রমাণিত হলো।","**শৈশব ও যৌবন:** ঈসা (আঃ) মারইয়াম (আঃ) এর সাথে বড় হলেন। তিনি ছিলেন অত্যন্ত জ্ঞানী এবং আল্লাহভীরু। তিনি তাওরাত শিখলেন এবং তাতে পারদর্শী হলেন। ত্রিশ বছর বয়সে আল্লাহ তাঁকে নবুয়ত দান করলেন এবং বনী ইসরাঈলের কাছে পাঠালেন।","**ইনজিল কিতাব ও দাওয়াত:** আল্লাহ ঈসা (আঃ) কে ইনজিল কিতাব দিলেন যা তাওরাতের সত্যায়নকারী ছিল। তিনি বনী ইসরাঈলকে বললেন,","وَمُصَدِّقًا لِّمَا بَيْنَ يَدَيَّ مِنَ التَّوْرَاةِ وَلِأُحِلَّ لَكُم بَعْضَ الَّذِي حُرِّمَ عَلَيْكُمْ","অর্থ: আমি তাওরাতের সত্যায়নকারী এবং তোমাদের জন্য কিছু জিনিস হালাল করতে এসেছি যা তোমাদের উপর হারাম ছিল। [সূরা আলে ইমরান: ৫০]","তিনি তাদের তাওহীদের দাওয়াত দিলেন এবং বললেন, 'আল্লাহ আমার রব এবং তোমাদের রব। সুতরাং তাঁর ইবাদত করো। এটাই সরল পথ।'","**মুজিজাসমূহ:** আল্লাহ ঈসা (আঃ) কে অনেক মুজিজা দিয়েছিলেন যাতে মানুষ বুঝে যে তিনি আল্লাহর নবী। প্রথমত, তিনি মাটি দিয়ে পাখির আকৃতি বানাতেন এবং তাতে ফুঁ দিলে আল্লাহর হুকুমে তা জীবিত পাখি হয়ে উড়ে যেত। দ্বিতীয়ত, তিনি জন্মান্ধকে দৃষ্টি দিতেন - যারা জন্ম থেকে অন্ধ তাদের চোখে হাত বুলালেই তারা দেখতে পেত। তৃতীয়ত, তিনি কুষ্ঠ রোগীকে সুস্থ করতেন - যে রোগ সেই সময় অসাধ্য ছিল। চতুর্থত, তিনি মৃতকে জীবিত করতেন আল্লাহর অনুমতিতে - তিনি কবর থেকে মৃতদের ডাকতেন এবং তারা জীবিত হয়ে বের হতো। পঞ্চমত, তিনি মানুষকে বলতেন তারা ঘরে কী খায় এবং কী জমা করে রাখে - এটা ছিল গায়েবের খবর।","**হাওয়ারিগণ (বিশেষ সাহাবী):** ঈসা (আঃ) এর বারোজন বিশেষ সাহাবী ছিলেন যাদের হাওয়ারি বলা হতো। তারা তাঁর প্রতি ঈমান এনেছিল এবং তাঁকে সাহায্য করত। তাদের নাম ছিল: শামউন (পিটার), আন্দ্রিয়াস, ইয়াকুব, ইউহান্না, ফিলিপ, বার্থলোমিউ, থোমা, মাথি, ইয়াকুব (আলফিয়াসের পুত্র), থাদ্দেয়, শামউন (যিলোত) এবং ইয়াহুদা ইসকারিয়োত। তারা ঈসা (আঃ) এর সাথে ভ্রমণ করতেন এবং দাওয়াতে সাহায্য করতেন।","**আসমান থেকে খাবারের দস্তরখান:** একবার হাওয়ারিগণ ঈসা (আঃ) কে বলল,","هَلْ يَسْتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ","অর্থ: হে ঈসা! আপনার রব কি আমাদের জন্য আসমান থেকে খাবারের দস্তরখান নামাতে পারেন? [সূরা মায়িদা: ১১২]","ঈসা (আঃ) বললেন, 'আল্লাহকে ভয় করো যদি তোমরা মুমিন হও।' তারা বলল, 'আমরা তা থেকে খেতে চাই, আমাদের অন্তর প্রশান্ত হবে এবং আমরা জানব যে আপনি আমাদের সত্য বলেছেন।' ঈসা (আঃ) দোয়া করলেন: 'হে আল্লাহ! হে আমাদের রব! আমাদের জন্য আসমান থেকে খাবারের দস্তরখান নামিয়ে দিন যা আমাদের জন্য ঈদ হবে।' আল্লাহ বললেন, 'আমি তোমাদের জন্য তা নামাব। কিন্তু এরপর যে কুফরি করবে তাকে কঠিন শাস্তি দেব।' আল্লাহ আসমান থেকে খাবারের দস্তরখান নামালেন যাতে মাছ, রুটি এবং অন্যান্য খাবার ছিল।","**ইহুদিদের বিরোধিতা:** ইহুদি আলেম ও নেতারা ঈসা (আঃ) কে মানল না। তারা তাঁর বিরুদ্ধে ষড়যন্ত্র করতে লাগল। তারা বলত: 'এ তো কাঠমিস্ত্রির ছেলে। এর মা আমরা চিনি এবং ভাই-বোনদেরও চিনি। তাহলে এ কোথা থেকে এসব পেল?' তারা তাঁকে জাদুকর বলত এবং তাঁর মুজিজাকে জাদু বলে চালিয়ে দিতে চাইত। তারা রোমান শাসকদের কাছে মিথ্যা অভিযোগ করল যে ঈসা (আঃ) বিদ্রোহী এবং নিজেকে বাদশাহ দাবি করে।","**ইয়াহুদা ইসকারিয়োতের বিশ্বাসঘাতকতা:** হাওয়ারিদের একজন ইয়াহুদা ইসকারিয়োত ছিল লোভী। ইহুদি নেতারা তাকে ত্রিশটি রৌপ্য মুদ্রা দিয়ে ঘুষ দিল যাতে সে ঈসা (আঃ) কে ধরিয়ে দেয়। ইয়াহুদা রাজি হলো এবং ঈসা (আঃ) কোথায় আছেন তা জানিয়ে দিল।","**আসমানে উঠানো:** ইহুদিরা রাতে ঈসা (আঃ) কে গ্রেফতার করতে এলো। কিন্তু আল্লাহ তাঁকে রক্ষা করলেন। আল্লাহ বলেছেন,","وَمَكَرُوا وَمَكَرَ اللَّهُ ۖ وَاللَّهُ خَيْرُ الْمَاكِرِينَ ۝ إِذْ قَالَ اللَّهُ يَا عِيسَىٰ إِنِّي مُتَوَفِّيكَ وَرَافِعُكَ إِلَيَّ","অর্থ: তারা ষড়যন্ত্র করল এবং আল্লাহও পরিকল্পনা করলেন। আল্লাহ সর্বোত্তম পরিকল্পনাকারী। যখন আল্লাহ বললেন, হে ঈসা! আমি তোমাকে তুলে নেব এবং আমার কাছে উঠিয়ে নেব। [সূরা আলে ইমরান: ৫৪-৫৫]","আল্লাহ ঈসা (আঃ) কে আসমানে তুলে নিলেন এবং বিশ্বাসঘাতক ইয়াহুদা ইসকারিয়োতকে ঈসা (আঃ) এর মতো বানিয়ে দিলেন। ইহুদিরা ইয়াহুদাকে ধরে নিয়ে গেল ভেবে যে সে ঈসা (আঃ)। তারা তাকে শূলে চড়িয়ে হত্যা করল। কিন্তু আল্লাহ বলেছেন,","وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِن شُبِّهَ لَهُمْ","অর্থ: তারা তাঁকে হত্যা করেনি এবং শূলেও চড়ায়নি, বরং তাদের জন্য সাদৃশ্য করা হয়েছিল। [সূরা নিসা: ১৫৭]","**কিয়ামতের আগে ফিরে আসা:** ঈসা (আঃ) এখনও জীবিত আছেন আসমানে। কিয়ামতের আগে তিনি পৃথিবীতে ফিরে আসবেন। রাসূল (সাঃ) বলেছেন, 'আল্লাহর কসম! মারইয়াম পুত্র ঈসা অবশ্যই ন্যায়বিচারক হিসেবে অবতরণ করবেন। তিনি ক্রুশ ভাঙবেন, শূকর হত্যা করবেন, জিজিয়া রহিত করবেন এবং দাজ্জালকে হত্যা করবেন।' তিনি চল্লিশ বছর পৃথিবীতে থাকবেন এবং তারপর মৃত্যুবরণ করবেন। মুসলিমরা তাঁর জানাজা পড়বে।"],"source":"**সূরা মারইয়াম: ১৬-৩৬; সূরা আলে ইমরান:** ৪৫-৫৫; সূরা নিসা: ১৫৭-১৫৮; তাফসীরে ইবনে কাসীর।"},{"id":"nabi_muhammad_saw","categoryId":"nobider_jiboni","title":"মুহাম্মাদ (সাঃ) - সর্বশেষ ও সর্বশ্রেষ্ঠ নবী","paragraphs":["হযরত মুহাম্মাদ (সাঃ) হলেন আল্লাহর সর্বশেষ নবী ও রাসূল। তিনি সমগ্র মানবজাতির জন্য রহমত স্বরূপ প্রেরিত হয়েছেন। তাঁর পরে আর কোনো নবী আসবেন না। তিনি হলেন খাতামুন নাবিয়্যীন - নবীদের সীলমোহর। আল্লাহ বলেন,","وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِّلْعَالَمِينَ","অর্থ: আমি আপনাকে সমগ্র বিশ্বের জন্য রহমত হিসেবে প্রেরণ করেছি। [সূরা আম্বিয়া: ১০৭]","**বংশ পরিচয়:** তাঁর পূর্ণ নাম মুহাম্মাদ ইবনে আবদুল্লাহ ইবনে আবদুল মুত্তালিব ইবনে হাশিম। তিনি কুরাইশ বংশের বনু হাশিম গোত্রের সন্তান। তাঁর বংশ ইব্রাহিম (আঃ) এর পুত্র ইসমাঈল (আঃ) পর্যন্ত পৌঁছায়। কুরাইশরা ছিল আরবের সবচেয়ে সম্মানিত গোত্র এবং কাবা ঘরের রক্ষক। তাঁর দাদা আবদুল মুত্তালিব ছিলেন মক্কার নেতা এবং কাবা ঘরের তত্ত্বাবধায়ক। তাঁর পিতা আবদুল্লাহ ছিলেন অত্যন্ত সুদর্শন এবং সৎ চরিত্রের অধিকারী।","**জন্মের পূর্বে পিতার মৃত্যু:** আবদুল্লাহ ব্যবসার উদ্দেশ্যে সিরিয়া গিয়েছিলেন। ফেরার পথে মদীনায় অসুস্থ হয়ে পড়েন এবং সেখানেই ইন্তেকাল করেন। তখন আমিনা গর্ভবতী ছিলেন মাত্র দুই মাস। এভাবে মুহাম্মাদ (সাঃ) পিতৃহীন অবস্থায় জন্মগ্রহণ করেন।","**জন্ম ও জন্মের রাত:** ৫৭০ খ্রিস্টাব্দে (হস্তী বর্ষ) ১২ই রবিউল আউয়াল সোমবার রাতে ফজরের আগে মক্কায় জন্মগ্রহণ করেন। জন্মের রাতে অনেক অলৌকিক ঘটনা ঘটেছিল। পারস্যের রাজপ্রাসাদ কেঁপে উঠেছিল, পারস্যের অগ্নিকুণ্ড নিভে গিয়েছিল যা হাজার বছর ধরে জ্বলছিল। আমিনা বলেন, জন্মের সময় আমি দেখলাম একটি নূর আমার থেকে বের হয়ে সিরিয়ার প্রাসাদগুলো আলোকিত করল। তিনি খতনা করা অবস্থায় এবং নাভির কাটা অবস্থায় জন্মগ্রহণ করেন। দাদা আবদুল মুত্তালিব তাঁকে কাবা ঘরে নিয়ে গিয়ে আল্লাহর শুকরিয়া আদায় করেন এবং তাঁর নাম রাখেন 'মুহাম্মাদ' যার অর্থ প্রশংসিত। এই নাম আরবে তখন খুব কম ব্যবহৃত হতো।","**দুধপান ও হালিমার কাছে:** আরবের রীতি অনুযায়ী শিশুদের মরুভূমিতে দুধমাতার কাছে পাঠানো হতো যাতে তারা শুদ্ধ আরবি ভাষা শিখে এবং সুস্বাস্থ্যে বেড়ে ওঠে। হালিমা সা'দিয়া নামে এক দুধমাতা তাঁকে নিয়ে যান। হালিমা ছিলেন দরিদ্র এবং তাঁর উট ছিল দুর্বল। কিন্তু মুহাম্মাদ (সাঃ) কে নেওয়ার পর তাঁর ঘরে বরকত আসে। উট দুধে ভরে যায়, ছাগল মোটা হয়ে যায়, ঘরে সচ্ছলতা আসে। হালিমা বলেন, আমি এমন বরকতময় শিশু কখনো দেখিনি।","**বক্ষ বিদারণ:** চার বছর বয়সে এক অলৌকিক ঘটনা ঘটে। দুই ফেরেশতা এসে তাঁর বুক চিরে হৃদয় বের করেন, যমযমের পানি দিয়ে ধুয়ে পরিষ্কার করেন এবং শয়তানের অংশ বের করে ফেলেন। তারপর হৃদয় আবার স্থাপন করেন। এই ঘটনার পর হালিমা ভয় পেয়ে তাঁকে মায়ের কাছে ফিরিয়ে দেন। এই ঘটনা তাঁকে সব পাপ থেকে মুক্ত করে দেয়।","**মাতার সাথে মদীনা সফর ও মাতার মৃত্যু:** ছয় বছর বয়সে মা আমিনা তাঁকে নিয়ে মদীনায় যান পিতার কবর যিয়ারত করতে এবং মাতুল পরিবারের সাথে দেখা করতে। এক মাস সেখানে থাকার পর ফেরার পথে 'আবওয়া' নামক স্থানে মা আমিনা অসুস্থ হয়ে ইন্তেকাল করেন। ছয় বছরের শিশু মুহাম্মাদ (সাঃ) মায়ের কবরের পাশে দাঁড়িয়ে কাঁদছিলেন। দাসী উম্মে আইমান তাঁকে নিয়ে মক্কায় ফিরে আসেন। এভাবে তিনি ইয়াতিম (এতিম) হয়ে যান।","**দাদার তত্ত্বাবধান:** দাদা আবদুল মুত্তালিব তাঁকে অত্যন্ত ভালোবাসতেন। তিনি কাবা ঘরের ছায়ায় বিছানা পেতে বসতেন এবং কেউ সেখানে বসতে পারত না। কিন্তু মুহাম্মাদ (সাঃ) এসে দাদার বিছানায় বসতেন এবং দাদা খুশি হতেন। তিনি বলতেন: আমার এই নাতির মহান ভবিষ্যৎ আছে। কিন্তু আট বছর বয়সে দাদাও ইন্তেকাল করেন। মৃত্যুর আগে তিনি তাঁর ছেলে আবু তালিবকে মুহাম্মাদের দায়িত্ব দেন।","**চাচা আবু তালিবের তত্ত্বাবধান:** আবু তালিব ছিলেন দরিদ্র কিন্তু সৎ এবং সম্মানিত। তিনি মুহাম্মাদ (সাঃ) কে নিজের সন্তানদের চেয়েও বেশি ভালোবাসতেন। তিনি তাঁকে সব সময় নিজের কাছে রাখতেন। মুহাম্মাদ (সাঃ) চাচার ব্যবসায় সাহায্য করতেন এবং ছাগল চরাতেন। তিনি বলেছেন, আল্লাহ এমন কোনো নবী পাঠাননি যিনি ছাগল চরাননি। আমিও মক্কাবাসীদের ছাগল চরিয়েছি কিছু পয়সার বিনিময়ে।","**সিরিয়া সফর ও বুহায়রার সাক্ষ্য:** বারো বছর বয়সে চাচার সাথে ব্যবসায়িক কাফেলায় সিরিয়া যান। পথে 'বুসরা' নামক স্থানে বুহায়রা নামক এক খ্রিস্টান পাদ্রী তাঁকে দেখে চিনে ফেলেন। তিনি পূর্ববর্তী কিতাবে তাঁর বর্ণনা পড়েছিলেন। তিনি আবু তালিবকে বলেন, এই বালককে মক্কায় ফিরিয়ে নিয়ে যান এবং ইহুদিদের থেকে রক্ষা করুন। এ হবে মহান নবী। আবু তালিব তাঁকে নিয়ে দ্রুত মক্কায় ফিরে আসেন।","**যৌবন ও চরিত্র:** যৌবনে তিনি ছিলেন সত্যবাদী, আমানতদার এবং উত্তম চরিত্রের অধিকারী। তিনি কখনো মিথ্যা বলতেন না, কখনো প্রতিশ্রুতি ভঙ্গ করতেন না। তিনি কখনো মূর্তিপূজা করেননি, কখনো মদ পান করেননি, কখনো জুয়া খেলেননি। তিনি কখনো অশ্লীল কথা বলতেন না। মক্কার লোকেরা তাঁকে 'আল-আমিন' (বিশ্বস্ত) এবং 'আস-সাদিক' (সত্যবাদী) উপাধিতে ভূষিত করেছিল। মানুষ তাঁর কাছে আমানত রাখত। তিনি ব্যবসা করতেন এবং তাঁর সততার জন্য বিখ্যাত ছিলেন।","**হাজরে আসওয়াদ স্থাপন:** পঁচিশ বছর বয়সের আগে কাবা ঘর পুনর্নির্মাণ করা হয়। হাজরে আসওয়াদ (কালো পাথর) স্থাপন নিয়ে কুরাইশ গোত্রগুলোর মধ্যে বিবাদ শুরু হয়। সবাই এই সম্মান চাইছিল। যুদ্ধ হওয়ার উপক্রম হলো। তখন তারা সিদ্ধান্ত নিল যে পরদিন সকালে যে প্রথম কাবায় প্রবেশ করবে সে এই বিবাদের মীমাংসা করবে। পরদিন মুহাম্মাদ (সাঃ) প্রথম প্রবেশ করেন। সবাই খুশি হয়ে বলল, ইনি আল-আমিন, আমরা তাঁর ফয়সালা মানব। তিনি একটি চাদর বিছিয়ে তার উপর পাথর রাখলেন এবং প্রতিটি গোত্রের নেতাকে চাদরের এক কোণ ধরতে বললেন। সবাই মিলে পাথর উঁচুতে তুলল এবং তিনি নিজ হাতে পাথর স্থাপন করলেন। এভাবে বিবাদ শান্তিপূর্ণভাবে মীমাংসা হলো।","**খাদিজা (রাঃ) এর ব্যবসায়:** খাদিজা (রাঃ) ছিলেন মক্কার ধনী ও সম্ভ্রান্ত মহিলা ব্যবসায়ী। তিনি বিশ্বস্ত লোক দিয়ে সিরিয়ায় ব্যবসা করতেন। মুহাম্মাদ (সাঃ) এর সততার কথা শুনে তিনি তাঁকে তাঁর পণ্য নিয়ে সিরিয়া যেতে বলেন। মুহাম্মাদ (সাঃ) তাঁর দাস মায়সারাকে সাথে নিয়ে সিরিয়া যান। এই সফরে অনেক বরকত হয় এবং দ্বিগুণ লাভ হয়। মায়সারা তাঁর সততা, বিশ্বস্ততা এবং উত্তম চরিত্রের কথা খাদিজা (রাঃ) কে বলেন। তিনি আরও বলেন যে পথে একজন খ্রিস্টান পাদ্রী বলেছেন এই ব্যক্তি নবী হবেন।","**খাদিজা (রাঃ) এর সাথে বিবাহ:** খাদিজা (রাঃ) মুহাম্মাদ (সাঃ) এর চরিত্রে মুগ্ধ হন এবং তাঁর বান্ধবী নাফিসার মাধ্যমে বিয়ের প্রস্তাব পাঠান। মুহাম্মাদ (সাঃ) চাচা আবু তালিবের সাথে পরামর্শ করেন এবং তিনি রাজি হন। ২৫ বছর বয়সে তিনি ৪০ বছর বয়সী খাদিজা (রাঃ) কে বিয়ে করেন। খাদিজা (রাঃ) ছিলেন তাঁর প্রথম স্ত্রী এবং জীবনের সবচেয়ে বড় সমর্থক। তাঁদের ঘরে চার মেয়ে জন্ম নেয় - যায়নাব, রুকাইয়া, উম্মে কুলসুম এবং ফাতিমা। এবং দুই ছেলে - কাসিম ও আবদুল্লাহ (তাহির ও তাইয়িব নামেও পরিচিত)। ছেলেরা শৈশবেই মারা যান। খাদিজা (রাঃ) এর জীবদ্দশায় তিনি আর কোনো বিয়ে করেননি।","**হেরা গুহায় ধ্যান:** নবুয়তের আগে তিনি হেরা গুহায় নির্জনে ধ্যান করতেন। তিনি রমজান মাসে খাবার নিয়ে হেরা গুহায় যেতেন এবং সেখানে আল্লাহর ইবাদত করতেন। তিনি মক্কার মূর্তিপূজা এবং অন্যায় দেখে মনে মনে কষ্ট পেতেন। তিনি সৃষ্টিকর্তা সম্পর্কে চিন্তা করতেন।","**নবুয়ত লাভ:** ৪০ বছর বয়সে রমজান মাসের ২৭ তারিখে (লাইলাতুল কদর) রাতে হেরা গুহায় ধ্যানরত অবস্থায় জিবরাঈল (আঃ) মানুষের রূপে এসে বললেন, 'ইকরা' (পড়ুন)। তিনি বললেন, আমি পড়তে পারি না। জিবরাঈল (আঃ) তাঁকে জড়িয়ে ধরে চাপ দিলেন এবং ছেড়ে দিয়ে আবার বললেন, 'ইকরা'। তিনি আবার বললেন, আমি পড়তে পারি না। তৃতীয়বার জিবরাঈল (আঃ) চাপ দিয়ে ছেড়ে দিয়ে বললেন -","اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ ۝ خَلَقَ الْإِنسَانَ مِنْ عَلَقٍ ۝ اقْرَأْ وَرَبُّكَ الْأَكْرَمُ ۝ الَّذِي عَلَّمَ بِالْقَلَمِ ۝ عَلَّمَ الْإِنسَانَ مَا لَمْ يَعْلَمْ","অর্থ: পড়ো তোমার রবের নামে যিনি সৃষ্টি করেছেন। সৃষ্টি করেছেন মানুষকে জমাট রক্ত থেকে। পড়ো এবং তোমার রব মহা সম্মানিত। যিনি কলমের সাহায্যে শিক্ষা দিয়েছেন। শিক্ষা দিয়েছেন মানুষকে যা সে জানত না। [সূরা আলাক: ১-৫]","এভাবে তিনি নবুয়ত লাভ করেন এবং আল্লাহর বাণী মানুষের কাছে পৌঁছানোর দায়িত্ব পান। তিনি ভয় পেয়ে কাঁপতে কাঁপতে বাড়ি ফিরে এসে খাদিজা (রাঃ) কে বললেন, আমাকে কম্বল দিয়ে ঢেকে দাও। খাদিজা (রাঃ) তাঁকে সান্ত্বনা দিয়ে বললেন, আল্লাহর কসম! আল্লাহ আপনাকে কখনো লাঞ্ছিত করবেন না। আপনি আত্মীয়তার সম্পর্ক রক্ষা করেন, সত্য কথা বলেন, অসহায়দের সাহায্য করেন, মেহমানদের সেবা করেন এবং বিপদগ্রস্তদের সাহায্য করেন। খাদিজা (রাঃ) তাঁকে তাঁর চাচাতো ভাই ওয়ারাকা ইবনে নাওফেলের কাছে নিয়ে যান। ওয়ারাকা ছিলেন বয়স্ক খ্রিস্টান পণ্ডিত। তিনি সব শুনে বললেন, এ হলো সেই ফেরেশতা যিনি মূসা (আঃ) এর কাছে এসেছিলেন। আপনি এই উম্মতের নবী। আপনার জাতি আপনাকে বের করে দেবে। আমি যদি সেদিন বেঁচে থাকি তাহলে আপনাকে সাহায্য করব। কিন্তু ওয়ারাকা শীঘ্রই মারা যান।","**প্রথম মুসলমান:** খাদিজা (রাঃ) সর্বপ্রথম ইসলাম গ্রহণ করেন। তারপর আলী (রাঃ) যিনি তখন ১০ বছরের বালক। তারপর যায়েদ ইবনে হারিসা (রাঃ) যিনি ছিলেন তাঁর মুক্ত দাস। তারপর আবু বকর (রাঃ) যিনি ছিলেন তাঁর ঘনিষ্ঠ বন্ধু। আবু বকর (রাঃ) অনেক মানুষকে ইসলামে আনেন - উসমান, তালহা, যুবাইর, আবদুর রহমান ইবনে আউফ, সা'দ ইবনে আবি ওয়াক্কাস প্রমুখ।","**গোপন দাওয়াত:** প্রথম তিন বছর গোপনে দাওয়াত দেন। তিনি আরকাম (রাঃ) এর ঘরে গোপনে সাহাবীদের সাথে মিলিত হতেন এবং তাদের ইসলাম শেখাতেন। ধীরে ধীরে মুসলমানদের সংখ্যা বাড়তে থাকে। তিন বছরে প্রায় ৪০ জন মুসলমান হন।","**প্রকাশ্য দাওয়াত:** তিন বছর পর আল্লাহ আদেশ দেন -","فَاصْدَعْ بِمَا تُؤْمَرُ وَأَعْرِضْ عَنِ الْمُشْرِكِينَ","অর্থ: আপনি প্রকাশ্যে বলুন যা আপনাকে আদেশ করা হয়েছে এবং মুশরিকদের থেকে মুখ ফিরিয়ে নিন। [সূরা হিজর: ৯৪]","তিনি সাফা পাহাড়ে দাঁড়িয়ে কুরাইশদের ডাকলেন এবং বললেন, আমি যদি বলি পাহাড়ের ওপাশে শত্রু বাহিনী আসছে তোমরা কি বিশ্বাস করবে? তারা বলল, হ্যাঁ, আমরা তোমাকে কখনো মিথ্যা বলতে দেখিনি। তিনি বললেন, তাহলে আমি তোমাদের কঠিন শাস্তি সম্পর্কে সতর্ক করছি। তোমরা লা ইলাহা ইল্লাল্লাহ বলো, সফল হবে। আবু লাহাব রেগে গিয়ে বলল, তোমার ধ্বংস হোক! এজন্যই কি আমাদের ডেকেছ? এরপর সূরা লাহাব নাজিল হয়।","**কুরাইশদের নির্যাতন:** কুরাইশরা মুসলমানদের উপর ভয়ংকর নির্যাতন শুরু করে। বিলাল (রাঃ) কে গরম বালুতে শুইয়ে বুকে পাথর চাপা দিত। আম্মার (রাঃ) এর পরিবারকে মরুভূমিতে নিয়ে নির্যাতন করত। খাব্বাব (রাঃ) কে জ্বলন্ত কয়লার উপর শুইয়ে রাখত। সুমাইয়া (রাঃ) কে আবু জাহেল বর্শা দিয়ে হত্যা করে - তিনি ইসলামের প্রথম শহীদ। কিন্তু মুসলমানরা ধৈর্য ধরেন এবং ঈমান ছাড়েননি।","**রাসূলের উপর নির্যাতন:** তাঁর পথে কাঁটা বিছিয়ে দিত, তাঁর উপর আবর্জনা ফেলত। একবার তিনি কাবায় নামাজ পড়ছিলেন, উকবা ইবনে আবি মুয়াইত তাঁর গলায় কাপড় পেঁচিয়ে শ্বাসরোধ করার চেষ্টা করে। আবু বকর (রাঃ) এসে তাঁকে বাঁচান। আরেকবার সিজদারত অবস্থায় তাঁর পিঠে উটের নাড়িভুঁড়ি ফেলে দেয়। তাঁর মেয়ে ফাতিমা (রাঃ) কেঁদে কেঁদে তা সরিয়ে দেন। কিন্তু তিনি ধৈর্যের সাথে সব সহ্য করেন এবং তাদের জন্য দোয়া করেন: হে আল্লাহ! আমার জাতিকে হেদায়েত দাও, তারা জানে না।","**আবিসিনিয়ায় হিজরত:** নির্যাতন যখন অসহ্য হয়ে উঠল তখন তিনি সাহাবীদের আবিসিনিয়ায় হিজরত করতে বলেন। প্রথম দলে ১১ জন পুরুষ ও ৪ জন মহিলা যান। পরে আরও বড় দল যায়। আবিসিনিয়ার খ্রিস্টান বাদশাহ নাজাশি তাদের আশ্রয় দেন এবং কুরাইশদের ফেরত দেওয়ার দাবি প্রত্যাখ্যান করেন।","**হামজা ও উমরের ইসলাম গ্রহণ:** ৬ষ্ঠ নবুয়ত বর্ষে হামজা (রাঃ) ইসলাম গ্রহণ করেন। আবু জাহেল রাসূলকে গালি দিলে হামজা (রাঃ) রেগে গিয়ে তার মাথায় ধনুক দিয়ে আঘাত করেন এবং ইসলাম গ্রহণ করেন। তিন দিন পর উমর (রাঃ) ইসলাম গ্রহণ করেন। উমর (রাঃ) এর ইসলাম গ্রহণে মুসলমানরা শক্তিশালী হন এবং প্রকাশ্যে কাবায় নামাজ পড়তে শুরু করেন।","**বয়কট:** কুরাইশরা বনু হাশিম ও বনু মুত্তালিব গোত্রকে সামাজিক ও অর্থনৈতিক বয়কট করে। তিন বছর তারা শিয়াবে আবি তালিবে অবরুদ্ধ থাকেন। খাবার-পানির অভাবে কষ্ট পান। শিশুদের কান্নার শব্দ বাইরে শোনা যেত। অবশেষে কিছু সৎ কুরাইশ বয়কট তুলে নেয়।","**দুঃখের বছর:** ১০ম নবুয়ত বর্ষে চাচা আবু তালিব এবং স্ত্রী খাদিজা (রাঃ) ইন্তেকাল করেন। এই বছরকে 'আমুল হুযন' (দুঃখের বছর) বলা হয়। আবু তালিব ছিলেন তাঁর রক্ষাকারী এবং খাদিজা (রাঃ) ছিলেন তাঁর সান্ত্বনাদাত্রী। তাঁদের মৃত্যুতে তিনি গভীর শোকে মগ্ন হন।","**তায়েফ সফর:** মক্কায় দাওয়াত বন্ধ হয়ে যাওয়ায় তিনি তায়েফ যান ইসলামের দাওয়াত দিতে। কিন্তু তায়েফের লোকেরা তাঁকে অপমান করে এবং ছেলেপুলেদের লেলিয়ে দেয়। তারা তাঁকে পাথর মারে। তাঁর পা রক্তাক্ত হয়ে যায়। যায়েদ (রাঃ) তাঁকে রক্ষা করার চেষ্টা করেন এবং নিজে আহত হন। তিনি একটি বাগানে আশ্রয় নেন এবং আল্লাহর কাছে দোয়া করেন: হে আল্লাহ! আমি আমার দুর্বলতা, সম্বলহীনতা এবং মানুষের কাছে অপমানের অভিযোগ আপনার কাছে করছি। জিবরাঈল (আঃ) এসে বলেন, আল্লাহ পাহাড়ের ফেরেশতা পাঠিয়েছেন। আপনি চাইলে এই দুই পাহাড় দিয়ে তায়েফবাসীদের পিষে ফেলতে পারেন। তিনি বললেন, না, আমি আশা করি আল্লাহ তাদের বংশ থেকে এমন লোক বের করবেন যারা এক আল্লাহর ইবাদত করবে।","**মিরাজ:** ১১ নবুয়ত বর্ষে রজব মাসে মিরাজ সংঘটিত হয়। এক রাতে জিবরাঈল (আঃ) বুরাক নিয়ে আসেন। তিনি মক্কা থেকে জেরুজালেমে যান (ইসরা) এবং সেখান থেকে সাত আসমান অতিক্রম করে আল্লাহর সান্নিধ্যে যান (মিরাজ)। সেখানে তিনি পূর্ববর্তী নবীদের সাথে দেখা করেন, জান্নাত-জাহান্নাম দেখেন এবং আল্লাহ তাঁর সাথে কথা বলেন। এই রাতে পাঁচ ওয়াক্ত নামাজ ফরজ হয়।","**আকাবার বাইয়াত:** মদীনার আউস ও খাজরাজ গোত্রের কিছু লোক হজ্জে এসে ইসলাম গ্রহণ করেন। পরের বছর ১২ জন এসে প্রথম আকাবার বাইয়াত করেন। তার পরের বছর ৭৩ জন পুরুষ ও ২ জন মহিলা এসে দ্বিতীয় আকাবার বাইয়াত করেন এবং রাসূলকে মদীনায় আমন্ত্রণ জানান। তারা বলেন, আমরা আপনাকে রক্ষা করব যেভাবে আমরা আমাদের স্ত্রী-সন্তানদের রক্ষা করি।","**হিজরত:** কুরাইশরা যখন তাঁকে হত্যার ষড়যন্ত্র করে তখন আল্লাহ তাঁকে হিজরতের অনুমতি দেন। রাতে সব গোত্র থেকে একজন করে যুবক তাঁর ঘর ঘেরাও করে। কিন্তু আল্লাহ তাদের চোখ অন্ধ করে দেন। আলী (রাঃ) তাঁর বিছানায় শুয়ে থাকেন এবং তিনি বের হয়ে যান। তিনি আবু বকর (রাঃ) কে সাথে নিয়ে সাওর গুহায় তিন দিন লুকিয়ে থাকেন। কুরাইশরা তাদের খুঁজতে গুহার মুখে এসে দাঁড়ায়। আবু বকর (রাঃ) ভয় পান। রাসূল (সাঃ) বলেন,","لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا","অর্থ: চিন্তা করো না, আল্লাহ আমাদের সাথে আছেন। [সূরা তাওবা: ৪০]","আল্লাহ গুহার মুখে মাকড়সার জাল এবং পাখির বাসা তৈরি করে দেন। কুরাইশরা ভেবে নেয় এখানে কেউ নেই। তিন দিন পর তারা মদীনার উদ্দেশ্যে রওনা হন এবং নিরাপদে পৌঁছান। মদীনাবাসী তাঁকে স্বাগত জানায় এবং তালবিয়া পাঠ করে।","**মদীনায় প্রথম কাজ:** মদীনায় পৌঁছে তিনি প্রথমে মসজিদে নববী নির্মাণ করেন। তারপর মুহাজির ও আনসারদের মধ্যে ভ্রাতৃত্ব স্থাপন করেন। তারপর মদীনার সনদ রচনা করেন যা ছিল পৃথিবীর প্রথম লিখিত সংবিধান। এতে মুসলিম, ইহুদি সবার অধিকার নিশ্চিত করা হয়।","**বদরের যুদ্ধ:** ২ হিজরিতে রমজান মাসে বদরের যুদ্ধ হয়। ৩১৩ জন মুসলমান ১০০০ কুরাইশের বিরুদ্ধে লড়াই করেন। আল্লাহ ফেরেশতা পাঠিয়ে মুসলমানদের সাহায্য করেন। ৭০ জন কাফের নিহত এবং ৭০ জন বন্দী হয়। মুসলমানদের ১৪ জন শহীদ হন। এই যুদ্ধে আবু জাহেল নিহত হয়। এটি ছিল ইসলামের প্রথম বড় বিজয়।","**উহুদের যুদ্ধ:** ৩ হিজরিতে শাওয়াল মাসে উহুদের যুদ্ধ হয়। ৭০০ মুসলমান ৩০০০ কুরাইশের বিরুদ্ধে লড়াই করেন। প্রথমে মুসলমানরা জয়ী হন কিন্তু তীরন্দাজরা পাহাড় ছেড়ে চলে গেলে খালিদ ইবনে ওয়ালিদ পেছন থেকে আক্রমণ করেন। ৭০ জন সাহাবী শহীদ হন যাদের মধ্যে হামজা (রাঃ) ছিলেন। রাসূল (সাঃ) নিজে আহত হন, দাঁত ভেঙে যায়, মুখ রক্তাক্ত হয়। কিন্তু তিনি ধৈর্য ধরেন এবং বলেন, হে আল্লাহ! আমার জাতিকে ক্ষমা করো, তারা জানে না।","**খন্দকের যুদ্ধ:** ৫ হিজরিতে শাওয়াল মাসে ১০,০০০ কাফের মদীনা আক্রমণ করে। সালমান ফারসি (রাঃ) এর পরামর্শে মদীনার চারপাশে পরিখা খনন করা হয়। এক মাস অবরোধের পর আল্লাহ ঝড় পাঠিয়ে কাফেরদের তাঁবু উড়িয়ে দেন এবং তারা পালিয়ে যায়। এই যুদ্ধে কোনো বড় সংঘর্ষ হয়নি এবং মাত্র ৬ জন শহীদ হন।","**হুদায়বিয়ার সন্ধি:** ৬ হিজরিতে রাসূল (সাঃ) ১৪০০ সাহাবী নিয়ে উমরাহ করতে যান। কুরাইশরা বাধা দেয়। হুদায়বিয়ায় সন্ধি হয় যার শর্তগুলো দেখতে মুসলমানদের বিপক্ষে মনে হয়। কিন্তু আল্লাহ একে 'ফাতহুম মুবিন' (সুস্পষ্ট বিজয়) বলেছেন। এই সন্ধির ফলে দুই বছরে ইসলাম দ্রুত ছড়িয়ে পড়ে।","**খায়বার বিজয়:** ৭ হিজরিতে খায়বার বিজয় হয়। ইহুদিদের শক্তিশালী দুর্গ ছিল। আলী (রাঃ) দুর্গের দরজা উপড়ে ফেলেন এবং মুসলমানরা বিজয়ী হন। এই যুদ্ধে প্রচুর গনিমত পাওয়া যায়।","**মক্কা বিজয়:** ৮ হিজরিতে রমজান মাসে ১০,০০০ সাহাবী নিয়ে মক্কা বিজয় করেন। কুরাইশরা হুদায়বিয়ার সন্ধি ভঙ্গ করেছিল। মক্কা বিনা রক্তপাতে বিজিত হয়। তিনি কাবা ঘরে প্রবেশ করেন এবং ৩৬০টি মূর্তি ভেঙে ফেলেন। তিনি বলেন,","جَاءَ الْحَقُّ وَزَهَقَ الْبَاطِلُ","অর্থ: সত্য এসেছে এবং মিথ্যা বিলুপ্ত হয়েছে। [সূরা ইসরা: ৮১]","**তারপর তিনি কুরাইশদের জিজ্ঞাসা করেন:** আমি তোমাদের সাথে কী ব্যবহার করব? তারা বলল, আপনি সম্মানিত ভাই এবং সম্মানিত ভাইয়ের ছেলে। তিনি বলেন, আজ তোমাদের বিরুদ্ধে কোনো অভিযোগ নেই। যাও, তোমরা মুক্ত। এভাবে তিনি সবাইকে ক্ষমা করে দেন।","**তাবুক অভিযান:** ৯ হিজরিতে রজব মাসে ৩০,০০০ সাহাবী নিয়ে তাবুক অভিযান করেন। রোমানরা যুদ্ধ না করে পালিয়ে যায়। এটি ছিল তাঁর শেষ অভিযান।","**বিদায় হজ্জ:** ১০ হিজরিতে যিলকদ মাসে তিনি বিদায় হজ্জের জন্য রওনা হন। তাঁর সাথে ছিল ১ লক্ষ ৪০ হাজার সাহাবী। এটি ছিল তাঁর প্রথম এবং শেষ হজ্জ। আরাফাতের ময়দানে ৯ই যিলহজ্জ জুমার দিন তিনি ঐতিহাসিক ভাষণ দেন। তিনি বলেন, হে মানুষ! আমার কথা মনোযোগ দিয়ে শোনো। আমি জানি না, এই বছরের পর আমি তোমাদের সাথে এখানে আর দেখা করতে পারব কিনা।","তিনি বলেন, তোমাদের রক্ত, তোমাদের সম্পদ এবং তোমাদের সম্মান একে অপরের জন্য হারাম - যেমন এই দিন, এই মাস এবং এই শহর পবিত্র। সাবধান! জাহেলিয়াতের সব কিছু আমার পায়ের নিচে। সব রক্তের বদলা বাতিল। সব সুদ বাতিল। নারীদের সাথে ভালো ব্যবহার করো। তারা তোমাদের আমানত। সব মুসলমান ভাই ভাই। কোনো আরবের অনারবের উপর শ্রেষ্ঠত্ব নেই। শ্রেষ্ঠত্ব শুধু তাকওয়ায়।","**তারপর তিনি জিজ্ঞাসা করলেন:** আমি কি তোমাদের কাছে আল্লাহর বাণী পৌঁছে দিয়েছি? সবাই বলল, হ্যাঁ, আল্লাহর কসম! তিনি আঙুল আকাশের দিকে তুলে বললেন, হে আল্লাহ! তুমি সাক্ষী থাকো। তিনি বললেন, যারা উপস্থিত তারা যেন অনুপস্থিতদের কাছে পৌঁছে দেয়। এই দিন এই আয়াত নাজিল হয় -","الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا","অর্থ: আজ আমি তোমাদের দ্বীন পূর্ণ করলাম এবং তোমাদের উপর আমার নিয়ামত সম্পূর্ণ করলাম এবং ইসলামকে তোমাদের দ্বীন হিসেবে মনোনীত করলাম। [সূরা মায়িদা: ৩]","উমর (রাঃ) এই আয়াত শুনে কাঁদতে লাগলেন। তাঁকে জিজ্ঞাসা করা হলো কেন কাঁদছেন? তিনি বললেন, পূর্ণতার পর শুধু ঘাটতি আসে। এটি রাসূলের বিদায়ের ইঙ্গিত।","**অসুস্থতা:** মদীনায় ফিরে আসার পর সফর মাসের শেষে তিনি অসুস্থ হয়ে পড়েন। একদিন রাতে তিনি জান্নাতুল বাকিতে গিয়ে শহীদদের জন্য দোয়া করেন। তারপর থেকে জ্বর শুরু হয়। তিনি প্রচণ্ড মাথাব্যথায় ভুগছিলেন। তিনি বলেন, আমি এত কষ্ট পাচ্ছি যা তোমরা দুজন মিলে পাও না।","**শেষ দিনগুলো:** অসুস্থতা বাড়তে থাকে। তিনি সব স্ত্রীর কাছে অনুমতি চান আয়েশা (রাঃ) এর ঘরে থাকার। সবাই রাজি হন। আলী ও ফযল (রাঃ) তাঁকে ধরে আয়েশা (রাঃ) এর ঘরে নিয়ে যান। তিনি ১৩ দিন অসুস্থ ছিলেন। এই সময়ে তিনি আবু বকর (রাঃ) কে ইমামতি করতে বলেন। আয়েশা (রাঃ) বলেন, আমার পিতা কোমল হৃদয়ের মানুষ, তিনি কাঁদবেন। কিন্তু রাসূল (সাঃ) বললেন, তুমি ইউসুফের সাথীদের মতো। আবু বকরকে বলো নামাজ পড়াতে।","**শেষ খুতবা:** একদিন তিনি একটু সুস্থ বোধ করলেন। মাথায় পট্টি বেঁধে আলী ও ফযল (রাঃ) এর কাঁধে ভর দিয়ে মসজিদে এলেন। আবু বকর (রাঃ) নামাজ পড়াচ্ছিলেন। তিনি পেছনে সরে গেলেন। রাসূল (সাঃ) বসে নামাজ পড়ালেন। নামাজের পর তিনি বললেন, হে মানুষ! আমার কাছে যদি কারো কোনো পাওনা থাকে সে নিয়ে নিক। আমি যদি কাউকে কষ্ট দিয়ে থাকি সে আমাকে কষ্ট দিক। একজন বলল, আপনার কাছে আমার তিন দিরহাম পাওনা। তিনি তা পরিশোধ করলেন। তিনি বললেন, দুনিয়ার অপমান আখিরাতের অপমানের চেয়ে সহজ।","তিনি আরও বললেন, আল্লাহ একজন বান্দাকে দুনিয়া ও আখিরাতের মধ্যে একটি বেছে নেওয়ার সুযোগ দিয়েছেন। সে আখিরাত বেছে নিয়েছে। আবু বকর (রাঃ) কাঁদতে লাগলেন। তিনি বুঝেছিলেন রাসূল (সাঃ) নিজের কথা বলছেন। রাসূল (সাঃ) বললেন, ধীরে আবু বকর! তিনি বললেন, আনসারদের সাথে ভালো ব্যবহার করো। তারা আমার আশ্রয়দাতা। তাদের ভালোদের ভালো মানবে এবং মন্দদের ক্ষমা করবে।","**শেষ মুহূর্ত:** সোমবার সকালে তিনি পর্দা সরিয়ে মসজিদের দিকে তাকালেন। সাহাবীরা নামাজে দাঁড়িয়ে আছেন। তিনি মুসকুরালেন। সাহাবীরা খুশি হলেন যে তিনি সুস্থ হয়ে গেছেন। দুপুরের দিকে তাঁর মাথা আয়েশা (রাঃ) এর কোলে ছিল। তিনি বারবার বলছিলেন:","اللَّهُمَّ الرَّفِيقَ الْأَعْلَى","অর্থ: হে আল্লাহ! সর্বোচ্চ বন্ধুর (তোমার) সান্নিধ্য দাও।","তাঁর হাত ভারী হয়ে গেল এবং চোখ স্থির হয়ে গেল। আয়েশা (রাঃ) বুঝলেন তিনি ইন্তেকাল করেছেন। তিনি রাসূলের মাথা বালিশে রেখে কাঁদতে লাগলেন। ফাতিমা (রাঃ) এসে বললেন, হায় আমার পিতা! হায় আল্লাহর নবী! হায় জান্নাতুল ফিরদাউসের অধিবাসী!","**ইন্তেকাল:** ১১ হিজরির ১২ই রবিউল আউয়াল সোমবার দুপুরে (৬৩২ খ্রিস্টাব্দ, ৮ই জুন) ৬৩ বছর বয়সে তিনি ইন্তেকাল করেন। সাহাবীরা অবিশ্বাস করতে পারছিলেন না। উমর (রাঃ) তরবারি হাতে বলছিলেন: যে বলবে রাসূল মারা গেছেন আমি তার গর্দান কেটে দেব। তিনি শুধু মূসা (আঃ) এর মতো আল্লাহর সাথে সাক্ষাতে গেছেন।","আবু বকর (রাঃ) ঘরে এসে রাসূলের চেহারা থেকে কাপড় সরিয়ে কপালে চুমু দিয়ে বললেন, আমার পিতা-মাতা আপনার জন্য কুরবান! আপনি জীবিত অবস্থায় যেমন সুন্দর ছিলেন মৃত অবস্থায়ও তেমন সুন্দর। তারপর মসজিদে এসে বললেন,","مَنْ كَانَ يَعْبُدُ مُحَمَّدًا فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَيٌّ لَا يَمُوتُ","অর্থ: যে মুহাম্মাদের ইবাদত করত সে জেনে রাখুক মুহাম্মাদ মারা গেছেন। আর যে আল্লাহর ইবাদত করত সে জেনে রাখুক আল্লাহ চিরঞ্জীব, কখনো মরবেন না।","তারপর তিনি এই আয়াত পাঠ করলেন:","وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ ۚ أَفَإِن مَّاتَ أَوْ قُتِلَ انقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ","অর্থ: মুহাম্মাদ একজন রাসূল মাত্র। তাঁর আগেও অনেক রাসূল গত হয়েছেন। তিনি যদি মারা যান বা নিহত হন তবে কি তোমরা পেছনে ফিরে যাবে? [সূরা আলে ইমরান: ১৪৪]","উমর (রাঃ) বলেন, আমি যেন এই আয়াত প্রথমবার শুনলাম। আমার পা কাঁপছিল এবং আমি মাটিতে পড়ে গেলাম।","**দাফন:** মঙ্গলবার সারাদিন সাহাবীরা তাঁর জানাযা পড়েন। কোনো ইমাম ছিল না। প্রত্যেকে আলাদাভাবে জানাযা পড়েন। বুধবার রাতে তাঁকে আয়েশা (রাঃ) এর ঘরে দাফন করা হয় যেখানে তিনি ইন্তেকাল করেছিলেন। আলী, ফযল, কাসাম ও শুকরান (রাঃ) কবরে নামেন। আবু তালহা (রাঃ) কবর খনন করেন। এভাবে সর্বশ্রেষ্ঠ মানুষ দুনিয়া থেকে বিদায় নেন।","**চরিত্র ও গুণাবলী:** তিনি ছিলেন সর্বোত্তম চরিত্রের অধিকারী। আল্লাহ বলেন,","وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ","অর্থ: নিশ্চয়ই আপনি মহান চরিত্রের অধিকারী। [সূরা কলম: ৪]","তিনি ছিলেন দয়ালু, ক্ষমাশীল, বিনয়ী, সাহসী, ন্যায়পরায়ণ। শিশুদের ভালোবাসতেন, দরিদ্রদের সাহায্য করতেন, প্রতিবেশীদের খোঁজ নিতেন। তিনি নিজে কম খেতেন কিন্তু অন্যদের খাওয়াতেন। তিনি নিজে পরিশ্রম করতেন, নিজের কাজ নিজে করতেন।"],"source":"সহীহ বুখারী; সহীহ মুসলিম; সীরাতে ইবনে হিশাম; আর-রাহীকুল মাখতুম।"}]