[
  {
    "id": "yusuf_as_dream",
    "categoryId": "quraner_golpo",
    "title": "ইউসুফ (আঃ)-এর স্বপ্ন ও ভাইদের ষড়যন্ত্র",
    "summary": "হযরত ইউসুফ (আঃ) শৈশবে এক অলৌকিক স্বপ্ন দেখেন যেখানে এগারটি নক্ষত্র, সূর্য ও চন্দ্র তাঁকে সিজদা করছে। এই স্বপ্নের কারণে তাঁর ভাইদের মনে তীব্র ঈর্ষা জন্ম নেয় এবং তারা তাঁকে কূপে ফেলে দেয়।",
    "paragraphs": [
      "হযরত ইউসুফ (আঃ) ছিলেন হযরত ইয়াকুব (আঃ)-এর সবচেয়ে প্রিয় পুত্র। একদিন ছোট্ট ইউসুফ তাঁর পিতার কাছে এসে বললেন।",
      "হে আমার পিতা! আমি স্বপ্নে দেখলাম এগারটি নক্ষত্র, সূর্য এবং চন্দ্র আমাকে সিজদা করছে।",
      "يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ",
      "ইয়াকুব (আঃ) বুঝতে পারলেন এই স্বপ্নের গভীর অর্থ আছে। তিনি জানতেন তাঁর এই পুত্র ভবিষ্যতে মহান মর্যাদা পাবেন। তিনি স্নেহভরে ইউসুফকে বললেন।",
      "বেটা, তোমার এই স্বপ্নের কথা তোমার ভাইদের কাছে বলো না। তারা তোমার বিরুদ্ধে চক্রান্ত করতে পারে। শয়তান মানুষের প্রকাশ্য শত্রু।",
      "কিন্তু ইউসুফ (আঃ)-এর ভাইদের মনে আগে থেকেই ঈর্ষা ছিল। তারা নিজেদের মধ্যে আলোচনা করল।",
      "আমাদের পিতা ইউসুফ ও তার ছোট ভাইকে আমাদের চেয়ে বেশি ভালোবাসেন। অথচ আমরা একটি শক্তিশালী দল। আমাদের পিতা স্পষ্টই ভুল করছেন।",
      "তাদের একজন বলল।",
      "তোমরা ইউসুফকে হত্যা করো অথবা তাকে কোনো দূর দেশে ফেলে এসো। তাহলে তোমাদের পিতার সমস্ত মনোযোগ তোমাদের দিকে ফিরবে।",
      "কিন্তু তাদের মধ্যে একজন একটু নরম মনের ছিল। সে বলল।",
      "ইউসুফকে হত্যা করো না। যদি তোমরা কিছু করতেই চাও, তাহলে তাকে কোনো অন্ধকার কূপে ফেলে দাও। কোনো পথিক তাকে তুলে নিয়ে যাবে।",
      "তারা তাদের পিতার কাছে গিয়ে বলল।",
      "হে আমাদের পিতা! আপনি ইউসুফকে আমাদের সাথে পাঠাচ্ছেন না কেন? আমরা তো তার শুভাকাঙ্ক্ষী। আগামীকাল তাকে আমাদের সাথে পাঠান। সে খেলাধুলা করবে এবং আনন্দ করবে। আমরা অবশ্যই তার রক্ষক।",
      "ইয়াকুব (আঃ) চিন্তিত হয়ে বললেন।",
      "তোমরা তাকে নিয়ে গেলে আমার মন খুব কষ্ট পাবে। আমার ভয় হয়, তোমরা যখন অসাবধান থাকবে তখন নেকড়ে তাকে খেয়ে ফেলবে।",
      "তারা বলল।",
      "আমরা এত শক্তিশালী দল থাকতে যদি নেকড়ে তাকে খেয়ে ফেলে, তাহলে আমরা তো সত্যিই ক্ষতিগ্রস্ত!",
      "অনিচ্ছা সত্ত্বেও ইয়াকুব (আঃ) ইউসুফকে তাদের সাথে পাঠালেন। তারা ইউসুফকে নিয়ে মরুভূমিতে গেল এবং তাঁকে একটি গভীর অন্ধকার কূপে ফেলে দিল।",
      "আল্লাহ সেই কূপে ইউসুফ (আঃ)-কে সান্ত্বনা দিলেন এবং তাঁকে জানালেন যে একদিন তিনি তাঁর ভাইদের এই কাজের কথা তাদের মুখের উপর বলবেন, কিন্তু তারা তাঁকে চিনতে পারবে না।",
      "সন্ধ্যায় তারা কাঁদতে কাঁদতে বাড়ি ফিরল। তারা ইউসুফের জামায় মিথ্যা রক্ত মাখিয়ে এনেছিল। তারা বলল।",
      "হে আমাদের পিতা! আমরা দৌড় প্রতিযোগিতা করছিলাম এবং ইউসুফকে আমাদের জিনিসপত্রের কাছে রেখে গিয়েছিলাম। তখন নেকড়ে তাকে খেয়ে ফেলেছে। আপনি আমাদের কথা বিশ্বাস করবেন না, যদিও আমরা সত্যবাদী।",
      "ইয়াকুব (আঃ) জামাটি দেখলেন এবং বুঝতে পারলেন এটা মিথ্যা। জামায় কোনো ছেঁড়া দাগ নেই। তিনি বললেন।",
      "না, বরং তোমাদের মন তোমাদের জন্য একটি মিথ্যা গল্প সাজিয়েছে। এখন আমার জন্য ধৈর্যই সুন্দর। তোমরা যা বলছ সে ব্যাপারে আল্লাহর কাছেই সাহায্য চাই।",
      "ইয়াকুব (আঃ) আল্লাহর উপর ভরসা করলেন এবং জানতেন যে আল্লাহ তাঁর প্রিয় পুত্রকে রক্ষা করবেন।"
    ],
    "moral": "ঈর্ষা মানুষকে অন্যায় কাজে প্ররোচিত করে। কিন্তু আল্লাহর পরিকল্পনা সব চক্রান্তের ঊর্ধ্বে। ধৈর্য ও আল্লাহর উপর ভরসাই মুমিনের সম্পদ।",
    "source": "সূরা ইউসুফ: ৪-১৮"
  }
]