[
  {
    "id": "yusuf_as_dream",
    "categoryId": "quraner_golpo",
    "title": "ইউসুফ (আঃ)-এর স্বপ্ন ও ভাইদের ষড়যন্ত্র",
    "summary": "হযরত ইউসুফ (আঃ) শৈশবে এক অলৌকিক স্বপ্ন দেখেন যেখানে এগারটি নক্ষত্র, সূর্য ও চন্দ্র তাঁকে সিজদা করছে। এই স্বপ্নের কারণে তাঁর ভাইদের মনে তীব্র ঈর্ষা জন্ম নেয় এবং তারা তাঁকে কূপে ফেলে দেয়।",
    "paragraphs": [
      "হযরত ইউসুফ (আঃ) ছিলেন হযরত ইয়াকুব (আঃ)-এর সবচেয়ে প্রিয় ও গুণবান পুত্র। একদিন ছোট্ট ইউসুফ তাঁর পিতার কাছে এসে একটি অদ্ভুত স্বপ্নের কথা বললেন।",
      "يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ",
      "অর্থ: হে আমার পিতা! আমি স্বপ্নে দেখলাম এগারটি নক্ষত্র, সূর্য এবং চন্দ্র আমাকে সিজদা করছে। [সূরা ইউসুফ: ৪]",
      "ইয়াকুব (আঃ) সেই স্বপ্নের গভীর তাৎপর্য বুঝতে পারলেন। তিনি জানতেন তাঁর এই পুত্র ভবিষ্যতে মহান মর্যাদার অধিকারী হবেন। তিনি স্নেহভরে ইউসুফকে সতর্ক করে বললেন যে এই স্বপ্নের কথা তার ভাইদের কাছে প্রকাশ না করতে, কারণ তারা ঈর্ষাবশত তার বিরুদ্ধে চক্রান্ত করতে পারে।",
      "কিন্তু ইউসুফ (আঃ)-এর ভাইদের মনে আগে থেকেই তাঁর প্রতি তীব্র ঈর্ষা ছিল। তারা মনে করত পিতা তাঁদের চেয়ে ইউসুফকে বেশি ভালোবাসেন। তারা নিজেদের মধ্যে পরামর্শ করল এবং সিদ্ধান্ত নিল যে ইউসুফকে সরিয়ে দিতে পারলেই পিতার সমস্ত স্নেহ ও মনোযোগ তারা লাভ করবে।",
      "তাদের একজন বলল: \"তাকে হত্যা না করে বরং কোনো গভীর অন্ধ কূপে নিক্ষেপ করো, যাতে কোনো পথিক তাকে তুলে নিয়ে যায়।\"",
      "তারা তাদের পিতাকে ভুল বুঝিয়ে ইউসুফকে সাথে নিয়ে মরুভূমিতে গেল। সেখানে তারা তাঁকে একটি গভীর কূপে ফেলে দিল। আল্লাহ সেই অন্ধকার কূপে ইউসুফ (আঃ)-কে সান্ত্বনা দিলেন এবং জানালেন যে একদিন তিনি তাঁর ভাইদের এই কাজের কথা তাদের মুখের উপর বলবেন।",
      "এরপর তারা কাঁদতে কাঁদতে বাড়ি ফিরে পিতাকে মিথ্যা খবর দিল যে ইউসুফকে নেকড়ে খেয়ে ফেলেছে। প্রমাণস্বরূপ তারা ইউসুফের জামায় মিথ্যা রক্ত মাখিয়ে নিয়ে এসেছিল।",
      "ইয়াকুব (আঃ) তাদের মিথ্যা বুঝতে পারলেন। জামায় কোনো ছেঁড়া দাগ ছিল না। তিনি আল্লাহর ওপর পূর্ণ ভরসা করলেন এবং বললেন: \"সুতরাং ধৈর্য ধারণ করাই শ্রেয়। তোমাদের বানানো এই মিথ্যা কাহিনীর জন্য আমি আল্লাহর সাহায্য প্রার্থনা করছি।\"",
      "এই ঘটনাই ছিল ইউসুফ (আঃ)-এর জীবনের কঠিনতম কষ্টের সূচনা, যা পরবর্তীতে তাঁকে মিসরের সিংহাসনের পথ দেখিয়েছিল।"
    ],
    "moral": "ঈর্ষা মানুষের অন্তরকে অন্ধ করে দিলেও, আল্লাহর পরিকল্পনা মানবীয় চক্রান্তের ঊর্ধ্বে। জীবনের চরম কষ্টের মুহূর্তেও আল্লাহর ওপর ভরসা ও ধৈর্যশীলতাই মুক্তির পথ।",
    "source": "সূরা ইউসুফ: ৪-১৮"
  },
  {
    "id": "musa_as_birth",
    "categoryId": "quraner_golpo",
    "title": "মূসা (আঃ)-এর জন্ম ও নীল নদের মুজিযা",
    "summary": "দাম্ভিক ফেরাউন যখন বনি ইসরাইলের সকল পুত্র সন্তানকে হত্যার নির্দেশ দিয়েছিল, তখন মূসা (আঃ)-এর মা আল্লাহর নির্দেশে নবজাতক শিশুকে সিন্দুকে ভরে নীল নদে ভাসিয়ে দেন। এটি ছিল একজন মায়ের চরম ত্যাগ ও আল্লাহর কুদরতের এক অবিস্মরণীয় ঘটনা।",
    "paragraphs": [
      "তখনকার মিশরের প্রতাপশালী শাসক ছিল ফেরাউন, যে নিজেকে খোদা বলে দাবি করত। একদিন তার দরবারে জ্যোতিষীরা এসে ভবিষ্যদ্বাণী করল যে বনি ইসরাইলের এক পুত্র সন্তানের হাতেই তার রাজত্বের পতন হবে।",
      "ফেরাউন ক্রোধে গর্জে উঠল এবং নির্দেশ দিল: \"আজ থেকে বনি ইসরাইলের ঘরে জন্ম নেওয়া সকল নবজাতক পুত্র সন্তানকে দেখামাত্র হত্যা করা হবে!\"",
      "এই চরম আতঙ্কের সময়েই মূসা (আঃ)-এর জন্ম হলো। তাঁর মা সন্তানকে হারানোর ভয়ে সর্বদা শঙ্কিত থাকতেন। তিনি কাঁদতে কাঁদতে আল্লাহর কাছে দোয়া করতেন।",
      "তখন আল্লাহ তাঁর প্রতি ওহী নাজিল করলেন।",
      "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
      "অর্থ: তুমি তোমার সন্তানকে দুধ পান করাও এবং যখন তুমি তার ব্যাপারে ভয় অনুভব করবে, তখন তাকে নদীতে নিক্ষেপ করে দিও। ভয় করো না ও চিন্তা করো না; আমি তাকে তোমার কাছে ফিরিয়ে দেব এবং তাকে রাসূলদের অন্তর্ভুক্ত করব। [সূরা আল-কাসাস: ৭]",
      "মূসা (আঃ)-এর মা আল্লাহর উপর পূর্ণ বিশ্বাস রাখলেন। তিনি একটি সিন্দুক তৈরি করলেন এবং বুকের ধন শিশুকে তাতে ভরে নীল নদের বুকে ভাসিয়ে দিলেন। তাঁর চোখ দিয়ে অশ্রু ঝরছিল। তিনি তাঁর কন্যাকে বললেন: \"বেটি! তুমি দূর থেকে সিন্দুকটির গতিপথ অনুসরণ করো।\"",
      "আল্লাহর অলৌকিক ইচ্ছায় সেই সিন্দুকটি সোজা গিয়ে পৌঁছাল ফেরাউনের স্ত্রী আসিয়া (আঃ)-এর প্রাসাদের ঘাটে। আসিয়া (আঃ) যখন সিন্দুকের ভেতরে শিশুটিকে দেখলেন, তিনি চমকে উঠলেন এবং শিশুটিকে কোলে তুলে নিলেন।",
      "ফেরাউন এসে বলল: \"এই শিশুকে হত্যা করো! এটা নিশ্চয়ই বনি ইসরাইলের সন্তান।\"",
      "কিন্তু আসিয়া (আঃ) দৃঢ়ভাবে বললেন: \"না! এই শিশুকে আমি রাখব। এটা আমার এবং তোমার চোখের শীতলতা হতে পারে। তুমি একে হত্যা করো না।\"",
      "ফেরাউন তাঁর স্ত্রীর কথায় রাজি হলো। এভাবেই আল্লাহ তাঁর পরিকল্পনা বাস্তবায়ন করলেন - মূসা (আঃ) তাঁর সবচেয়ে বড় শত্রুর ঘরেই পরম নিরাপদে লালিত-পালিত হতে শুরু করলেন।",
      "কিন্তু শিশু মূসা কোনো ধাত্রীর দুধ পান করছিলেন না। তখন মূসা (আঃ)-এর বোন এগিয়ে এসে বলল: \"আমি কি আপনাদের এমন একজনের কথা বলব যিনি এই শিশুকে লালন-পালন করতে পারবেন?\"",
      "আসিয়া (আঃ) বললেন: \"হ্যাঁ! তাড়াতাড়ি নিয়ে এসো।\"",
      "মূসা (আঃ)-এর বোন দৌড়ে গিয়ে তাঁর মাকে ডেকে আনলেন। মূসা (আঃ)-এর মা যখন শিশুকে কোলে নিলেন, তিনি সাথে সাথে দুধ পান করতে শুরু করলেন। আল্লাহ তাঁর ওয়াদা পূরণ করলেন - মূসা (আঃ) তাঁর মায়ের কাছে ফিরে এলেন এবং পারিশ্রমিক সহ তাঁকে লালন-পালনের সুযোগ পেলেন।"
    ],
    "moral": "মানুষের সব চক্রান্ত আল্লাহর ইচ্ছার কাছে ব্যর্থ। আল্লাহর ওপর পূর্ণ ভরসা রাখলে তিনি তাঁর অলৌকিক কুদরতে বান্দাকে রক্ষা করেন এবং কষ্টের পর স্বস্তি দান করেন।",
    "source": "সূরা আল-কাসাস: ৭-১৩"
  },
  {
    "id": "yunus_as_whale",
    "categoryId": "quraner_golpo",
    "title": "ইউনুস (আঃ) ও মাছের পেটের পরীক্ষা",
    "summary": "হযরত ইউনুস (আঃ) তাঁর গোত্রের দাওয়াতে হতাশ হয়ে আল্লাহর অনুমতি ছাড়া তাদের ছেড়ে চলে গিয়েছিলেন। এর ফলস্বরূপ তিনি মাছের পেটে বন্দী হন এবং সেই অন্ধকারে আল্লাহর কাছে ক্ষমা চেয়ে মুক্তি লাভ করেন।",
    "paragraphs": [
      "হযরত ইউনুস (আঃ) তাঁর গোত্রের লোকদের কাছে বহু বছর ধরে দাওয়াত দিচ্ছিলেন। তিনি তাদের বলতেন: \"হে আমার গোত্র! তোমরা এক আল্লাহর ইবাদত করো। তিনি ছাড়া কোনো ইলাহ নেই।\"",
      "কিন্তু তারা বারবার প্রত্যাখ্যান করত এবং বলত: \"আমরা আমাদের বাপ-দাদার ধর্ম ছাড়ব না।\"",
      "ইউনুস (আঃ) যখন তাদের সতর্ক করলেন যে আল্লাহর আজাব আসবে, তারা হেসে বলল: \"তাহলে আজাব নিয়ে আসো!\"",
      "বারবার চেষ্টা করেও তারা বিশ্বাস করল না। ইউনুস (আঃ) হতাশ ও ক্রুদ্ধ হয়ে গেলেন। তিনি আল্লাহর অনুমতি না নিয়েই তাদের ছেড়ে চলে গেলেন এবং একটি নৌকায় আরোহণ করলেন।",
      "নৌকাটি যখন মাঝসমুদ্রে পৌঁছাল, তখন এক ভয়াবহ ঝড় শুরু হলো। নাবিকরা ভয় পেয়ে বলল: \"নৌকা ডুবে যাচ্ছে! আমাদের মধ্যে একজনকে সমুদ্রে ফেলে দিতে হবে।\"",
      "তারা লটারি করল এবং ইউনুস (আঃ)-এর নাম উঠল। ইউনুস (আঃ) বুঝতে পারলেন এটি আল্লাহর পক্ষ থেকে পরীক্ষা। তিনি সমুদ্রে ঝাঁপ দিলেন।",
      "সাথে সাথেই আল্লাহর নির্দেশে একটি বিশাল তিমি মাছ তাঁকে গিলে ফেলল। মাছের পেটে, গভীর সাগরের নিচে ইউনুস (আঃ) চরম অন্ধকারে বন্দী হলেন। তিনি চারপাশে তাকালেন - শুধু অন্ধকার।",
      "এই ভয়ংকর একাকীত্ব ও কষ্টের মধ্যে তিনি অনুতাপে আল্লাহর কাছে ক্ষমা চেয়ে দোয়া করলেন।",
      "لَا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
      "অর্থ: তুমি ছাড়া কোনো মাবুদ নেই, তুমি পবিত্র, আমি নিশ্চয়ই জালিমদের অন্তর্ভুক্ত। [সূরা আম্বিয়া: ৮৭]",
      "তিনি বারবার এই দোয়া পড়তে লাগলেন। আল্লাহ তাঁর দোয়া কবুল করলেন এবং তিমি মাছটিকে নির্দেশ দিলেন তাঁকে উগলে দিতে। তিমি মাছটি তাঁকে সুস্থ অবস্থায় একটি নির্জন বালুকাময় তীরে উগলে দিল।",
      "ইউনুস (আঃ) বালিতে শুয়ে আল্লাহর শুকরিয়া আদায় করলেন। আল্লাহ তাঁকে ক্ষমা করেছেন এবং মুক্তি দিয়েছেন। পরবর্তীতে তিনি তাঁর গোত্রের কাছে ফিরে গেলেন এবং দেখলেন তারা সবাই ঈমান এনেছে।"
    ],
    "moral": "আল্লাহর নৈকট্য লাভে হতাশ হওয়া উচিত নয়। জীবনের সবচেয়ে কঠিন পরিস্থিতিতেও আল্লাহর কাছে ক্ষমা ও সাহায্য চাইলে তিনি তা কবুল করেন। ধৈর্য ও তাওবাই মুক্তির পথ।",
    "source": "সূরা ইউনুস: ৯৮; সূরা আম্বিয়া: ৮৭-৮৮"
  },
  {
    "id": "sulayman_as_ant",
    "categoryId": "quraner_golpo",
    "title": "সুলায়মান (আঃ) ও পিঁপড়ার কথোপকথন",
    "summary": "হযরত সুলায়মান (আঃ) ছিলেন এমন এক বাদশাহ যিনি সকল প্রাণীর ভাষা বুঝতে পারতেন। একবার তাঁর বিশাল সৈন্যবাহিনী নিয়ে চলার পথে তিনি একটি পিঁপড়ের কথা শুনে আল্লাহর কৃতজ্ঞতা প্রকাশ করেছিলেন।",
    "paragraphs": [
      "হযরত সুলায়মান (আঃ) ছিলেন আল্লাহর এক বিশেষ অনুগ্রহপ্রাপ্ত নবী ও বাদশাহ। আল্লাহ তাঁকে এমন এক বিশাল সাম্রাজ্য দান করেছিলেন যার ওপর মানুষ, জ্বিন এবং পশুপাখি সবারই নিয়ন্ত্রণ ছিল। তিনি সকল প্রাণীর ভাষা বুঝতে পারতেন।",
      "একবার সুলায়মান (আঃ) তাঁর বিশাল সেনাবাহিনী নিয়ে একটি উপত্যকার ওপর দিয়ে যাচ্ছিলেন, যা ছিল পিঁপড়াদের আবাসস্থল। যখন তাঁর সৈন্যরা পিঁপড়াদের উপত্যকার কাছাকাছি পৌঁছাল, তখন সুলায়মান (আঃ) একটি পিঁপড়ের কণ্ঠস্বর শুনতে পেলেন।",
      "পিঁপড়েটি তার স্বগোত্রের পিঁপড়াদের উদ্দেশ্যে বলল।",
      "يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ",
      "অর্থ: হে পিঁপড়ার দল! তোমরা তোমাদের ঘরে প্রবেশ করো, যাতে সুলায়মান ও তার সৈন্যবাহিনী অজ্ঞাতসারে তোমাদের পিষ্ট না করে ফেলে। [সূরা নামল: ১৮]",
      "এই ক্ষুদ্র পিঁপড়ার কথা শুনে সুলায়মান (আঃ) মুচকি হাসলেন। তিনি অবাক হলেন এই ভেবে যে একটি ছোট্ট পিঁপড়া তার সাথীদের রক্ষা করার জন্য কত সতর্ক এবং দায়িত্বশীল। তিনি তাঁর বাহন থামালেন এবং আল্লাহর কাছে দোয়া করলেন।",
      "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ",
      "অর্থ: হে আমার রব! আমাকে সামর্থ্য দাও যেন আমি তোমার সেই নেয়ামতের শুকরিয়া আদায় করতে পারি যা তুমি আমাকে ও আমার পিতামাতাকে দান করেছ। [সূরা নামল: ১৯]",
      "সুলায়মান (আঃ) তাঁর বিশাল ক্ষমতা ও রাজত্ব থাকা সত্ত্বেও একটি ক্ষুদ্র পিঁপড়ার প্রতি যত্নশীল ছিলেন এবং আল্লাহর প্রতি কৃতজ্ঞ ছিলেন। এটি তাঁর বিনয় ও আল্লাহভীতির প্রমাণ।"
    ],
    "moral": "প্রকৃত ক্ষমতা ও মর্যাদা আল্লাহর দান। যত বড় ক্ষমতাই থাকুক না কেন, আল্লাহর সৃষ্টির প্রতি দয়া ও কৃতজ্ঞতা প্রকাশ করা মুমিনের বৈশিষ্ট্য।",
    "source": "সূরা নামল: ১৮-১৯"
  }
]