[
  {
    "id": "yusuf_as_dream",
    "categoryId": "quraner_golpo",
    "title": "ইউসুফ (আঃ)-এর স্বপ্ন ও ভাইদের ষড়যন্ত্র",
    "summary": "হযরত ইউসুফ (আঃ) শৈশবে এক অলৌকিক স্বপ্ন দেখেন যেখানে এগারটি নক্ষত্র, সূর্য ও চন্দ্র তাঁকে সিজদা করছে। এই স্বপ্নের কারণে তাঁর ভাইদের মনে তীব্র ঈর্ষা জন্ম নেয় এবং তারা তাঁকে কূপে ফেলে দেয়।",
    "paragraphs": [
      "হযরত ইউসুফ (আঃ) ছিলেন হযরত ইয়াকুব (আঃ)-এর সবচেয়ে প্রিয় ও গুণবান পুত্র। একদিন ছোট্ট ইউসুফ তাঁর পিতার কাছে এসে একটি অদ্ভুত স্বপ্নের কথা বললেন।",
      "يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ",
      "অর্থ: হে আমার পিতা! আমি স্বপ্নে দেখলাম এগারটি নক্ষত্র, সূর্য এবং চন্দ্র আমাকে সিজদা করছে। [সূরা ইউসুফ: ৪]",
      "ইয়াকুব (আঃ) সেই স্বপ্নের গভীর তাৎপর্য বুঝতে পারলেন। তিনি জানতেন তাঁর এই পুত্র ভবিষ্যতে মহান মর্যাদার অধিকারী হবেন। তিনি স্নেহভরে ইউসুফকে সতর্ক করে বললেন যে এই স্বপ্নের কথা তার ভাইদের কাছে প্রকাশ না করতে, কারণ তারা ঈর্ষাবশত তার বিরুদ্ধে চক্রান্ত করতে পারে।",
      "কিন্তু ইউসুফ (আঃ)-এর ভাইদের মনে আগে থেকেই তাঁর প্রতি তীব্র ঈর্ষা ছিল। তারা মনে করত পিতা তাঁদের চেয়ে ইউসুফকে বেশি ভালোবাসেন। তারা নিজেদের মধ্যে পরামর্শ করল এবং সিদ্ধান্ত নিল যে ইউসুফকে সরিয়ে দিতে পারলেই পিতার সমস্ত স্নেহ ও মনোযোগ তারা লাভ করবে।",
      "তাদের একজন বলল: \"তাকে হত্যা না করে বরং কোনো গভীর অন্ধ কূপে নিক্ষেপ করো, যাতে কোনো পথিক তাকে তুলে নিয়ে যায়।\"",
      "তারা তাদের পিতাকে ভুল বুঝিয়ে ইউসুফকে সাথে নিয়ে মরুভূমিতে গেল। সেখানে তারা তাঁকে একটি গভীর কূপে ফেলে দিল। আল্লাহ সেই অন্ধকার কূপে ইউসুফ (আঃ)-কে সান্ত্বনা দিলেন এবং জানালেন যে একদিন তিনি তাঁর ভাইদের এই কাজের কথা তাদের মুখের উপর বলবেন।",
      "এরপর তারা কাঁদতে কাঁদতে বাড়ি ফিরে পিতাকে মিথ্যা খবর দিল যে ইউসুফকে নেকড়ে খেয়ে ফেলেছে। প্রমাণস্বরূপ তারা ইউসুফের জামায় মিথ্যা রক্ত মাখিয়ে নিয়ে এসেছিল।",
      "ইয়াকুব (আঃ) তাদের মিথ্যা বুঝতে পারলেন। জামায় কোনো ছেঁড়া দাগ ছিল না। তিনি আল্লাহর ওপর পূর্ণ ভরসা করলেন এবং বললেন: \"সুতরাং ধৈর্য ধারণ করাই শ্রেয়। তোমাদের বানানো এই মিথ্যা কাহিনীর জন্য আমি আল্লাহর সাহায্য প্রার্থনা করছি।\"",
      "এই ঘটনাই ছিল ইউসুফ (আঃ)-এর জীবনের কঠিনতম কষ্টের সূচনা, যা পরবর্তীতে তাঁকে মিসরের সিংহাসনের পথ দেখিয়েছিল।"
    ],
    "moral": "ঈর্ষা মানুষের অন্তরকে অন্ধ করে দিলেও, আল্লাহর পরিকল্পনা মানবীয় চক্রান্তের ঊর্ধ্বে। জীবনের চরম কষ্টের মুহূর্তেও আল্লাহর ওপর ভরসা ও ধৈর্যশীলতাই মুক্তির পথ।",
    "source": "সূরা ইউসুফ: ৪-১৮"
  }
]