[{"id":"yusuf_as_dream","categoryId":"quraner_golpo","title":"ইউসুফ (আঃ)-এর স্বপ্ন ও ভাইদের ষড়যন্ত্র","summary":"হযরত ইউসুফ (আঃ) শৈশবে এক অলৌকিক স্বপ্ন দেখেন যেখানে এগারটি নক্ষত্র, সূর্য ও চন্দ্র তাঁকে সিজদা করছে। এই স্বপ্নের কারণে তাঁর ভাইদের মনে তীব্র ঈর্ষা জন্ম নেয় এবং তারা তাঁকে কূপে ফেলে দেয়।","paragraphs":["হযরত ইউসুফ (আঃ) ছিলেন হযরত ইয়াকুব (আঃ)-এর সবচেয়ে প্রিয় ও গুণবান পুত্র। একদিন ছোট্ট ইউসুফ তাঁর পিতার কাছে এসে একটি অদ্ভুত স্বপ্নের কথা বললেন।","يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ","অর্থ: হে আমার পিতা! আমি স্বপ্নে দেখলাম এগারটি নক্ষত্র, সূর্য এবং চন্দ্র আমাকে সিজদা করছে। [সূরা ইউসুফ: ৪]","ইয়াকুব (আঃ) সেই স্বপ্নের গভীর তাৎপর্য বুঝতে পারলেন। তিনি জানতেন তাঁর এই পুত্র ভবিষ্যতে মহান মর্যাদার অধিকারী হবেন। তিনি স্নেহভরে ইউসুফকে সতর্ক করে বললেন যে এই স্বপ্নের কথা তার ভাইদের কাছে প্রকাশ না করতে, কারণ তারা ঈর্ষাবশত তার বিরুদ্ধে চক্রান্ত করতে পারে।","কিন্তু ইউসুফ (আঃ)-এর ভাইদের মনে আগে থেকেই তাঁর প্রতি তীব্র ঈর্ষা ছিল। তারা মনে করত পিতা তাঁদের চেয়ে ইউসুফকে বেশি ভালোবাসেন। তারা নিজেদের মধ্যে পরামর্শ করল এবং সিদ্ধান্ত নিল যে ইউসুফকে সরিয়ে দিতে পারলেই পিতার সমস্ত স্নেহ ও মনোযোগ তারা লাভ করবে।","তাদের একজন বলল।","\"তাকে হত্যা না করে বরং কোনো গভীর অন্ধ কূপে নিক্ষেপ করো, যাতে কোনো পথিক তাকে তুলে নিয়ে যায়।\"","তারা তাদের পিতাকে ভুল বুঝিয়ে ইউসুফকে সাথে নিয়ে মরুভূমিতে গেল। সেখানে তারা তাঁকে একটি গভীর কূপে ফেলে দিল। আল্লাহ সেই অন্ধকার কূপে ইউসুফ (আঃ)-কে সান্ত্বনা দিলেন এবং জানালেন যে একদিন তিনি তাঁর ভাইদের এই কাজের কথা তাদের মুখের উপর বলবেন।","এরপর তারা কাঁদতে কাঁদতে বাড়ি ফিরে পিতাকে মিথ্যা খবর দিল যে ইউসুফকে নেকড়ে খেয়ে ফেলেছে। প্রমাণস্বরূপ তারা ইউসুফের জামায় মিথ্যা রক্ত মাখিয়ে নিয়ে এসেছিল।","ইয়াকুব (আঃ) তাদের মিথ্যা বুঝতে পারলেন। জামায় কোনো ছেঁড়া দাগ ছিল না। তিনি আল্লাহর ওপর পূর্ণ ভরসা করলেন এবং বললেন।","\"সুতরাং ধৈর্য ধারণ করাই শ্রেয়। তোমাদের বানানো এই মিথ্যা কাহিনীর জন্য আমি আল্লাহর সাহায্য প্রার্থনা করছি।\"","এই ঘটনাই ছিল ইউসুফ (আঃ)-এর জীবনের কঠিনতম কষ্টের সূচনা, যা পরবর্তীতে তাঁকে মিসরের সিংহাসনের পথ দেখিয়েছিল।"],"moral":"ঈর্ষা মানুষের অন্তরকে অন্ধ করে দিলেও, আল্লাহর পরিকল্পনা মানবীয় চক্রান্তের ঊর্ধ্বে। জীবনের চরম কষ্টের মুহূর্তেও আল্লাহর ওপর ভরসা ও ধৈর্যশীলতাই মুক্তির পথ।","source":"**সূরা ইউসুফ:** ৪-১৮"},{"id":"musa_as_birth","categoryId":"quraner_golpo","title":"মূসা (আঃ)-এর জন্ম ও নীল নদের মুজিযা","paragraphs":["তখনকার মিশরের প্রতাপশালী শাসক ছিল ফেরাউন, যে নিজেকে খোদা বলে দাবি করত। একদিন তার দরবারে জ্যোতিষীরা এসে ভবিষ্যদ্বাণী করল যে বনি ইসরাইলের এক পুত্র সন্তানের হাতেই তার রাজত্বের পতন হবে।","ফেরাউন ক্রোধে গর্জে উঠল এবং নির্দেশ দিল: \"আজ থেকে বনি ইসরাইলের ঘরে জন্ম নেওয়া সকল নবজাতক পুত্র সন্তানকে দেখামাত্র হত্যা করা হবে!\"","এই চরম আতঙ্কের সময়েই মূসা (আঃ)-এর জন্ম হলো। তাঁর মা সন্তানকে হারানোর ভয়ে সর্বদা শঙ্কিত থাকতেন। তিনি কাঁদতে কাঁদতে আল্লাহর কাছে দোয়া করতেন।","তখন আল্লাহ তাঁর প্রতি ওহী নাজিল করলেন।","وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ","অর্থ: তুমি তোমার সন্তানকে দুধ পান করাও এবং যখন তুমি তার ব্যাপারে ভয় অনুভব করবে, তখন তাকে নদীতে নিক্ষেপ করে দিও। ভয় করো না ও চিন্তা করো না; আমি তাকে তোমার কাছে ফিরিয়ে দেব এবং তাকে রাসূলদের অন্তর্ভুক্ত করব। [সূরা আল-কাসাস: ৭]","মূসা (আঃ)-এর মা আল্লাহর উপর পূর্ণ বিশ্বাস রাখলেন। তিনি একটি সিন্দুক তৈরি করলেন এবং বুকের ধন শিশুকে তাতে ভরে নীল নদের বুকে ভাসিয়ে দিলেন। তাঁর চোখ দিয়ে অশ্রু ঝরছিল। তিনি তাঁর কন্যাকে বললেন।","\"বেটি! তুমি দূর থেকে সিন্দুকটির গতিপথ অনুসরণ করো।\"","আল্লাহর অলৌকিক ইচ্ছায় সেই সিন্দুকটি সোজা গিয়ে পৌঁছাল ফেরাউনের স্ত্রী আসিয়া (আঃ)-এর প্রাসাদের ঘাটে। আসিয়া (আঃ) যখন সিন্দুকের ভেতরে শিশুটিকে দেখলেন, তিনি চমকে উঠলেন এবং শিশুটিকে কোলে তুলে নিলেন।","ফেরাউন এসে বলল।","\"এই শিশুকে হত্যা করো! এটা নিশ্চয়ই বনি ইসরাইলের সন্তান।\"","কিন্তু আসিয়া (আঃ) দৃঢ়ভাবে বললেন।","\"না! এই শিশুকে আমি রাখব। এটা আমার এবং তোমার চোখের শীতলতা হতে পারে। তুমি একে হত্যা করো না।\"","ফেরাউন তাঁর স্ত্রীর কথায় রাজি হলো। এভাবেই আল্লাহ তাঁর পরিকল্পনা বাস্তবায়ন করলেন - মূসা (আঃ) তাঁর সবচেয়ে বড় শত্রুর ঘরেই পরম নিরাপদে লালিত-পালিত হতে শুরু করলেন।","কিন্তু শিশু মূসা কোনো ধাত্রীর দুধ পান করছিলেন না। তখন মূসা (আঃ)-এর বোন এগিয়ে এসে বলল।","\"আমি কি আপনাদের এমন একজনের কথা বলব যিনি এই শিশুকে লালন-পালন করতে পারবেন?\"","আসিয়া (আঃ) বললেন।","\"হ্যাঁ! তাড়াতাড়ি নিয়ে এসো।\"","মূসা (আঃ)-এর বোন দৌড়ে গিয়ে তাঁর মাকে ডেকে আনলেন। মূসা (আঃ)-এর মা যখন শিশুকে কোলে নিলেন, তিনি সাথে সাথে দুধ পান করতে শুরু করলেন। আল্লাহ তাঁর ওয়াদা পূরণ করলেন - মূসা (আঃ) তাঁর মায়ের কাছে ফিরে এলেন এবং পারিশ্রমিক সহ তাঁকে লালন-পালনের সুযোগ পেলেন।"],"moral":"মানুষের সব চক্রান্ত আল্লাহর ইচ্ছার কাছে ব্যর্থ। আল্লাহর ওপর পূর্ণ ভরসা রাখলে তিনি তাঁর অলৌকিক কুদরতে বান্দাকে রক্ষা করেন এবং কষ্টের পর স্বস্তি দান করেন।","source":"**সূরা আল-কাসাস:** ৭-১৩"},{"id":"yunus_as_whale","categoryId":"quraner_golpo","title":"ইউনুস (আঃ) ও মাছের পেটের পরীক্ষা","summary":"হযরত ইউনুস (আঃ) তাঁর গোত্রের দাওয়াতে হতাশ হয়ে আল্লাহর অনুমতি ছাড়া তাদের ছেড়ে চলে গিয়েছিলেন। এর ফলস্বরূপ তিনি মাছের পেটে বন্দী হন এবং সেই অন্ধকারে আল্লাহর কাছে ক্ষমা চেয়ে মুক্তি লাভ করেন।","paragraphs":["হযরত ইউনুস (আঃ) তাঁর গোত্রের লোকদের কাছে বহু বছর ধরে দাওয়াত দিচ্ছিলেন। তিনি তাদের বলতেন: \"হে আমার গোত্র! তোমরা এক আল্লাহর ইবাদত করো। তিনি ছাড়া কোনো ইলাহ নেই।\"","**কিন্তু তারা বারবার প্রত্যাখ্যান করত এবং বলত:** \"আমরা আমাদের বাপ-দাদার ধর্ম ছাড়ব না।\"","ইউনুস (আঃ) যখন তাদের সতর্ক করলেন যে আল্লাহর আজাব আসবে, তারা হেসে বলল।","\"তাহলে আজাব নিয়ে আসো!\"","বারবার চেষ্টা করেও তারা বিশ্বাস করল না। ইউনুস (আঃ) হতাশ ও ক্রুদ্ধ হয়ে গেলেন। তিনি আল্লাহর অনুমতি না নিয়েই তাদের ছেড়ে চলে গেলেন এবং একটি নৌকায় আরোহণ করলেন।","নৌকাটি যখন মাঝসমুদ্রে পৌঁছাল, তখন এক ভয়াবহ ঝড় শুরু হলো। নাবিকরা ভয় পেয়ে বলল।","\"নৌকা ডুবে যাচ্ছে! আমাদের মধ্যে একজনকে সমুদ্রে ফেলে দিতে হবে।\"","তারা লটারি করল এবং ইউনুস (আঃ)-এর নাম উঠল। ইউনুস (আঃ) বুঝতে পারলেন এটি আল্লাহর পক্ষ থেকে পরীক্ষা। তিনি সমুদ্রে ঝাঁপ দিলেন।","সাথে সাথেই আল্লাহর নির্দেশে একটি বিশাল তিমি মাছ তাঁকে গিলে ফেলল। মাছের পেটে, গভীর সাগরের নিচে ইউনুস (আঃ) চরম অন্ধকারে বন্দী হলেন। তিনি চারপাশে তাকালেন - শুধু অন্ধকার।","এই ভয়ংকর একাকীত্ব ও কষ্টের মধ্যে তিনি অনুতাপে আল্লাহর কাছে ক্ষমা চেয়ে দোয়া করলেন।","لَا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ","অর্থ: তুমি ছাড়া কোনো মাবুদ নেই, তুমি পবিত্র, আমি নিশ্চয়ই জালিমদের অন্তর্ভুক্ত। [সূরা আম্বিয়া: ৮৭]","তিনি বারবার এই দোয়া পড়তে লাগলেন। আল্লাহ তাঁর দোয়া কবুল করলেন এবং তিমি মাছটিকে নির্দেশ দিলেন তাঁকে উগলে দিতে। তিমি মাছটি তাঁকে সুস্থ অবস্থায় একটি নির্জন বালুকাময় তীরে উগলে দিল।","ইউনুস (আঃ) বালিতে শুয়ে আল্লাহর শুকরিয়া আদায় করলেন। আল্লাহ তাঁকে ক্ষমা করেছেন এবং মুক্তি দিয়েছেন। পরবর্তীতে তিনি তাঁর গোত্রের কাছে ফিরে গেলেন এবং দেখলেন তারা সবাই ঈমান এনেছে।"],"moral":"আল্লাহর নৈকট্য লাভে হতাশ হওয়া উচিত নয়। জীবনের সবচেয়ে কঠিন পরিস্থিতিতেও আল্লাহর কাছে ক্ষমা ও সাহায্য চাইলে তিনি তা কবুল করেন। ধৈর্য ও তাওবাই মুক্তির পথ।","source":"**সূরা ইউনুস: ৯৮; সূরা আম্বিয়া:** ৮৭-৮৮"},{"id":"sulayman_as_ant","categoryId":"quraner_golpo","title":"সুলায়মান (আঃ) ও পিঁপড়ার কথোপকথন","summary":"হযরত সুলায়মান (আঃ) ছিলেন এমন এক বাদশাহ যিনি সকল প্রাণীর ভাষা বুঝতে পারতেন। একবার তাঁর বিশাল সৈন্যবাহিনী নিয়ে চলার পথে তিনি একটি পিঁপড়ের কথা শুনে আল্লাহর কৃতজ্ঞতা প্রকাশ করেছিলেন।","paragraphs":["হযরত সুলায়মান (আঃ) ছিলেন আল্লাহর এক বিশেষ অনুগ্রহপ্রাপ্ত নবী ও বাদশাহ। আল্লাহ তাঁকে এমন এক বিশাল সাম্রাজ্য দান করেছিলেন যার ওপর মানুষ, জ্বিন এবং পশুপাখি সবারই নিয়ন্ত্রণ ছিল। তিনি সকল প্রাণীর ভাষা বুঝতে পারতেন।","একবার সুলায়মান (আঃ) তাঁর বিশাল সেনাবাহিনী নিয়ে একটি উপত্যকার ওপর দিয়ে যাচ্ছিলেন, যা ছিল পিঁপড়াদের আবাসস্থল। যখন তাঁর সৈন্যরা পিঁপড়াদের উপত্যকার কাছাকাছি পৌঁছাল, তখন সুলায়মান (আঃ) একটি পিঁপড়ের কণ্ঠস্বর শুনতে পেলেন।","পিঁপড়েটি তার স্বগোত্রের পিঁপড়াদের উদ্দেশ্যে বলল।","يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ","অর্থ: হে পিঁপড়ার দল! তোমরা তোমাদের ঘরে প্রবেশ করো, যাতে সুলায়মান ও তার সৈন্যবাহিনী অজ্ঞাতসারে তোমাদের পিষ্ট না করে ফেলে। [সূরা নামল: ১৮]","এই ক্ষুদ্র পিঁপড়ার কথা শুনে সুলায়মান (আঃ) মুচকি হাসলেন। তিনি অবাক হলেন এই ভেবে যে একটি ছোট্ট পিঁপড়া তার সাথীদের রক্ষা করার জন্য কত সতর্ক এবং দায়িত্বশীল। তিনি তাঁর বাহন থামালেন এবং আল্লাহর কাছে দোয়া করলেন।","رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ","অর্থ: হে আমার রব! আমাকে সামর্থ্য দাও যেন আমি তোমার সেই নেয়ামতের শুকরিয়া আদায় করতে পারি যা তুমি আমাকে ও আমার পিতামাতাকে দান করেছ। [সূরা নামল: ১৯]","সুলায়মান (আঃ) তাঁর বিশাল ক্ষমতা ও রাজত্ব থাকা সত্ত্বেও একটি ক্ষুদ্র পিঁপড়ার প্রতি যত্নশীল ছিলেন এবং আল্লাহর প্রতি কৃতজ্ঞ ছিলেন। এটি তাঁর বিনয় ও আল্লাহভীতির প্রমাণ।"],"moral":"প্রকৃত ক্ষমতা ও মর্যাদা আল্লাহর দান। যত বড় ক্ষমতাই থাকুক না কেন, আল্লাহর সৃষ্টির প্রতি দয়া ও কৃতজ্ঞতা প্রকাশ করা মুমিনের বৈশিষ্ট্য।","source":"**সূরা নামল:** ১৮-১৯"},{"id":"ibrahim_as_fire","categoryId":"quraner_golpo","title":"ইব্রাহীম (আঃ) ও আগুনের পরীক্ষা","summary":"হযরত ইব্রাহীম (আঃ) যখন মূর্তি ভেঙে একত্ববাদের দাওয়াত দিলেন, তখন নমরুদ তাঁকে জ্বলন্ত আগুনে নিক্ষেপ করল। কিন্তু আল্লাহর নির্দেশে আগুন তাঁর জন্য শীতল ও শান্তিদায়ক হয়ে গেল।","paragraphs":["হযরত ইব্রাহীম (আঃ) ছোটবেলা থেকেই তাঁর জাতির মূর্তিপূজা দেখে অবাক হতেন। তিনি ভাবতেন এই পাথরের মূর্তি কীভাবে উপাস্য হতে পারে যা নিজেই কিছু করতে পারে না।","একদিন যখন সবাই উৎসবে গেল, ইব্রাহীম (আঃ) মূর্তিগুলো ভেঙে ফেললেন। শুধু সবচেয়ে বড় মূর্তিটি রেখে দিলেন এবং তার গলায় কুঠার ঝুলিয়ে দিলেন।","লোকেরা ফিরে এসে দেখল তাদের মূর্তি ভাঙা। তারা ক্রোধে বলল।","\"এটা কে করেছে?\"","কেউ বলল।","\"আমরা একজন যুবককে এগুলোর সমালোচনা করতে শুনেছি। তার নাম ইব্রাহীম।\"","তারা ইব্রাহীম (আঃ)-কে ডেকে আনল এবং জিজ্ঞেস করল।","\"তুমি কি আমাদের উপাস্যদের সাথে এটা করেছ?\"","ইব্রাহীম (আঃ) বললেন।","\"বরং এটা করেছে তাদের এই সর্দার। তোমরা তাদের জিজ্ঞেস করো, যদি তারা কথা বলতে পারে!\"","**তারা নিজেদের মধ্যে বলাবলি করল:** \"তোমরাই তো অন্যায়কারী। এই মূর্তিগুলো কথা বলতে পারে না।\"","ইব্রাহীম (আঃ) বললেন।","\"তাহলে তোমরা আল্লাহকে ছেড়ে এমন কিছুর ইবাদত করো যা তোমাদের কোনো উপকার বা ক্ষতি করতে পারে না? ধিক তোমাদের এবং তোমরা আল্লাহ ছাড়া যাদের ইবাদত করো তাদের! তোমরা কি বুঝো না?\"","তারা লজ্জিত হলো কিন্তু অহংকারবশত বলল।","\"তোমরা তোমাদের উপাস্যদের সাহায্য করতে চাইলে একে পুড়িয়ে ফেলো!\"","তারা একটি বিশাল আগুন জ্বালাল। আগুন এত বড় ছিল যে কাছে যাওয়া যাচ্ছিল না। তারা একটি ম্যাঞ্জানিক (বড় ছোড়ার যন্ত্র) দিয়ে ইব্রাহীম (আঃ)-কে আগুনে নিক্ষেপ করল।","ঠিক সেই মুহূর্তে আল্লাহ আগুনকে নির্দেশ দিলেন।","قُلْنَا يَا نَارُ كُونِي بَرْدًا وَسَلَامًا عَلَىٰ إِبْرَاهِيمَ","অর্থ: আমি বললাম, হে আগুন! তুমি ইব্রাহীমের জন্য শীতল ও শান্তিদায়ক হয়ে যাও। [সূরা আম্বিয়া: ৬৯]","আগুন ইব্রাহীম (আঃ)-এর জন্য ঠান্ডা ও আরামদায়ক হয়ে গেল। তিনি আগুনের মধ্যে বসে আল্লাহর জিকির করতে লাগলেন। লোকেরা অবাক হয়ে দেখল ইব্রাহীম (আঃ) আগুনে পুড়ছেন না।","এভাবে আল্লাহ তাঁর নবীকে রক্ষা করলেন এবং তাঁর শত্রুদের পরিকল্পনা ব্যর্থ করে দিলেন।"],"moral":"আল্লাহর উপর পূর্ণ ভরসা রাখলে তিনি সব বিপদ থেকে রক্ষা করেন। সত্যের পথে অটল থাকাই মুমিনের বৈশিষ্ট্য।","source":"**সূরা আম্বিয়া:** ৫১-৭০"},{"id":"nuh_as_flood","categoryId":"quraner_golpo","title":"নূহ (আঃ) ও মহাপ্লাবন","paragraphs":["হযরত নূহ (আঃ) তাঁর জাতির কাছে দীর্ঘ ৯৫০ বছর ধরে আল্লাহর দিকে আহ্বান করেছিলেন। তিনি দিনে-রাতে, প্রকাশ্যে-গোপনে সব সময় তাদের বুঝাতেন।","তিনি বলতেন: \"হে আমার জাতি! তোমরা আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই। আমি তোমাদের জন্য এক ভয়াবহ দিনের শাস্তির ভয় করছি।\"","কিন্তু তাঁর জাতির নেতারা বলল।","\"আমরা তো তোমাকে স্পষ্ট বিভ্রান্তিতে দেখছি। তুমি তো আমাদের মতোই একজন মানুষ। তোমার অনুসরণকারীরাও তো আমাদের মধ্যে নিচু শ্রেণীর লোক।\"","নূহ (আঃ) ধৈর্য ধরে বললেন।","\"হে আমার জাতি! আমি বিভ্রান্ত নই, বরং আমি বিশ্বজগতের রবের পক্ষ থেকে একজন রাসূল। আমি তোমাদের কাছে আমার রবের বাণী পৌঁছে দিচ্ছি এবং তোমাদের কল্যাণ কামনা করছি।\"","দীর্ঘ সময় পরেও যখন তারা ঈমান আনল না, নূহ (আঃ) আল্লাহর কাছে দোয়া করলেন: \"হে আমার রব! আমার জাতির লোকেরা আমাকে অস্বীকার করেছে। তুমি আমার ও তাদের মধ্যে ফয়সালা করে দাও।\"","আল্লাহ নূহ (আঃ)-কে নির্দেশ দিলেন একটি বিশাল নৌকা তৈরি করতে। নূহ (আঃ) নৌকা তৈরি শুরু করলেন। তাঁর জাতির লোকেরা তাঁকে দেখে হাসাহাসি করত এবং বলত: \"তুমি নবী হয়ে এখন ছুতার হয়ে গেলে?\"","নূহ (আঃ) বললেন।","\"তোমরা যদি আমাকে নিয়ে হাসো, তাহলে আমিও তোমাদের নিয়ে হাসব যেমন তোমরা হাসছ। শীঘ্রই তোমরা জানতে পারবে কার উপর লাঞ্ছনাদায়ক শাস্তি আসে।\"","অবশেষে যখন আল্লাহর নির্দেশ এলো, তখন আকাশ থেকে প্রবল বৃষ্টি শুরু হলো এবং জমিন থেকে ঝর্ণা ফুটে উঠল। পানি দ্রুত বাড়তে লাগল।","আল্লাহ নূহ (আঃ)-কে বললেন।","\"প্রতিটি প্রজাতি থেকে এক জোড়া করে নৌকায় তুলে নাও এবং যারা ঈমান এনেছে তাদেরও।\"","নূহ (আঃ)-এর একটি ছেলে ঈমান আনেনি। নূহ (আঃ) তাকে ডেকে বললেন।","\"হে আমার বেটা! আমাদের সাথে নৌকায় ওঠো, কাফিরদের সাথে থেকো না।\"","তার ছেলে বলল।","\"আমি একটি পাহাড়ে আশ্রয় নেব যা আমাকে পানি থেকে রক্ষা করবে।\"","নূহ (আঃ) বললেন।","\"আজ আল্লাহর শাস্তি থেকে কোনো রক্ষাকারী নেই, শুধু যার প্রতি তিনি দয়া করেন।\"","এরপর একটি বিশাল ঢেউ তাদের মাঝে আসল এবং তার ছেলে ডুবে গেল। নূহ (আঃ) অত্যন্ত দুঃখিত হলেন এবং আল্লাহকে ডাকলেন: \"হে আমার রব! আমার ছেলে তো আমার পরিবারের অন্তর্ভুক্ত এবং তোমার ওয়াদা সত্য।\"","আল্লাহ বললেন।","\"হে নূহ! সে তোমার পরিবারের অন্তর্ভুক্ত নয়। সে তো অসৎ কর্মপরায়ণ। পরিবার শুধু রক্তের সম্পর্ক নয়, ঈমানের সম্পর্ক।\"","অবশেষে পানি কমে গেল এবং নৌকা জুদি পর্বতে থামল। আল্লাহ বললেন।","\"হে নূহ! তুমি আমার পক্ষ থেকে শান্তি ও বরকত সহ নৌকা থেকে নামো।\"","নূহ (আঃ) এবং তাঁর সাথের মুমিনরা নিরাপদে নৌকা থেকে নামলেন এবং আল্লাহর শুকরিয়া আদায় করলেন।"],"moral":"দীর্ঘ সময় ধরে সত্যের দাওয়াত দিতে হয় এবং ধৈর্য ধরতে হয়। পরিবার মানে শুধু রক্তের সম্পর্ক নয়, ঈমানের সম্পর্কও। আল্লাহর শাস্তি থেকে বাঁচার একমাত্র উপায় হলো তাঁর আনুগত্য।","source":"**সূরা হুদ:** ২৫-৪৯"},{"id":"adam_as_creation","categoryId":"quraner_golpo","title":"আদম (আঃ)-এর সৃষ্টি ও ফেরেশতাদের সিজদা","summary":"আল্লাহ যখন আদম (আঃ)-কে সৃষ্টি করলেন এবং ফেরেশতাদের তাঁকে সিজদা করতে বললেন, তখন ইবলিস অহংকার করে অস্বীকার করল এবং মানুষের চিরশত্রু হয়ে গেল।","paragraphs":["আল্লাহ যখন আদম (আঃ)-কে সৃষ্টি করার ইচ্ছা করলেন, তখন তিনি ফেরেশতাদের বললেন।","\"আমি পৃথিবীতে একজন খলিফা সৃষ্টি করব।\"","ফেরেশতারা বিনয়ের সাথে বলল।","\"আপনি কি সেখানে এমন কাউকে সৃষ্টি করবেন যে ফাসাদ করবে এবং রক্তপাত ঘটাবে? অথচ আমরা তো আপনার প্রশংসা ও পবিত্রতা ঘোষণা করি।\"","আল্লাহ বললেন।","\"আমি যা জানি তোমরা তা জানো না।\"","আল্লাহ মাটি থেকে আদম (আঃ)-কে সৃষ্টি করলেন এবং তাঁর মধ্যে রূহ ফুঁকে দিলেন। তারপর তিনি আদম (আঃ)-কে সব কিছুর নাম শিখিয়ে দিলেন।","তারপর আল্লাহ ফেরেশতাদের বললেন।","\"তোমরা আমাকে এসব জিনিসের নাম বলো, যদি তোমরা সত্যবাদী হও।\"","ফেরেশতারা বলল।","\"আপনি পবিত্র! আপনি আমাদের যা শিখিয়েছেন তা ছাড়া আমাদের কোনো জ্ঞান নেই। নিশ্চয়ই আপনি সর্বজ্ঞ, প্রজ্ঞাময়।\"","আল্লাহ বললেন।","\"হে আদম! তুমি তাদের এসবের নাম বলে দাও।\" আদম (আঃ) সব কিছুর নাম বলে দিলেন। ফেরেশতারা বুঝতে পারল মানুষকে বিশেষ জ্ঞান দেওয়া হয়েছে।","**তারপর আল্লাহ সকল ফেরেশতাকে নির্দেশ দিলেন:** \"তোমরা আদমকে সিজদা করো।\"","সকল ফেরেশতা সিজদা করল, কিন্তু ইবলিস অস্বীকার করল। সে অহংকার করল এবং কাফিরদের অন্তর্ভুক্ত হলো।","আল্লাহ বললেন।","\"হে ইবলিস! আমি যখন আমার হাতে সৃষ্টি করেছি তাকে সিজদা করতে কিসে তোমাকে বাধা দিল? তুমি কি অহংকার করলে, নাকি তুমি উচ্চ মর্যাদাসম্পন্নদের অন্তর্ভুক্ত?\"","ইবলিস বলল।","\"আমি তার চেয়ে উত্তম। আপনি আমাকে আগুন থেকে সৃষ্টি করেছেন আর তাকে মাটি থেকে।\"","আল্লাহ বললেন।","\"তাহলে তুমি এখান থেকে বের হয়ে যাও। তুমি অভিশপ্ত। কিয়ামত দিবস পর্যন্ত তোমার উপর আমার অভিশাপ।\"","ইবলিস বলল।","\"হে আমার রব! তাহলে আমাকে সেদিন পর্যন্ত অবকাশ দিন যেদিন তাদের পুনরুত্থিত করা হবে।\"","আল্লাহ বললেন।","\"তুমি অবকাশপ্রাপ্তদের অন্তর্ভুক্ত।\"","ইবলিস বলল।","\"আপনার ইজ্জতের কসম! আমি অবশ্যই তাদের সবাইকে বিপথগামী করব, তবে তাদের মধ্যে আপনার নির্বাচিত বান্দাদের ছাড়া।\"","এভাবে ইবলিস মানুষের চিরশত্রু হয়ে গেল এবং আল্লাহ আদম (আঃ)-কে সতর্ক করে দিলেন যে ইবলিস তাঁর ও তাঁর স্ত্রীর শত্রু।"],"moral":"অহংকার মানুষকে ধ্বংস করে। আল্লাহর আদেশ মানাই প্রকৃত সম্মান। শয়তান মানুষের প্রকাশ্য শত্রু এবং সর্বদা সতর্ক থাকতে হবে।","source":"**সূরা বাকারাহ: ৩০-৩৪; সূরা সোয়াদ:** ৭১-৮৫"},{"id":"musa_as_khidr","categoryId":"quraner_golpo","title":"মূসা (আঃ) ও খিজির (আঃ)-এর সফর","summary":"মূসা (আঃ) খিজির (আঃ)-এর সাথে সফরে বের হন জ্ঞান অর্জনের জন্য। খিজির (আঃ) তিনটি রহস্যময় কাজ করেন যা মূসা (আঃ) বুঝতে পারেননি। পরে তার ব্যাখ্যা শুনে মূসা (আঃ) আল্লাহর হিকমত বুঝতে পারেন।","paragraphs":["একবার মূসা (আঃ) তাঁর জাতির সামনে বক্তব্য দিচ্ছিলেন। একজন জিজ্ঞেস করল।","\"হে আল্লাহর নবী! পৃথিবীতে সবচেয়ে জ্ঞানী কে?\"","মূসা (আঃ) বললেন।","\"আমি।\" কারণ তিনি ভাবলেন আল্লাহ তাঁকে তাওরাত দিয়েছেন এবং তিনি নবী।","আল্লাহ তাঁকে সংশোধন করে বললেন।","\"না, দুই সাগরের সংযোগস্থলে আমার এক বান্দা আছে যে তোমার চেয়ে বেশি জ্ঞানী।\"","মূসা (আঃ) বললেন।","\"হে আমার রব! আমি কীভাবে তাঁর সাথে দেখা করতে পারি?\"","আল্লাহ বললেন।","\"একটি মাছ নিয়ে যাও। যেখানে মাছটি হারিয়ে যাবে, সেখানেই তাঁর সাথে দেখা হবে।\"","মূসা (আঃ) তাঁর সহচর ইউশা ইবনে নূনকে নিয়ে সফরে বের হলেন। তাঁরা একটি পাথরের কাছে বিশ্রাম নিলেন। সেখানে মাছটি জীবিত হয়ে সাগরে ঝাঁপ দিয়ে চলে গেল।","অনেক দূর যাওয়ার পর মূসা (আঃ) বললেন।","\"আমাদের খাবার নিয়ে এসো। আমরা তো এই সফরে ক্লান্ত হয়ে পড়েছি।\"","ইউশা বললেন।","\"আপনি কি লক্ষ করেছেন? যখন আমরা পাথরের কাছে বিশ্রাম নিয়েছিলাম, তখন আমি মাছের কথা ভুলে গিয়েছিলাম। শয়তান আমাকে এটা বলতে ভুলিয়ে দিয়েছিল। মাছটি আশ্চর্যজনকভাবে সাগরে চলে গেছে।\"","মূসা (আঃ) বললেন।","\"এটাই তো আমরা খুঁজছিলাম!\" তাঁরা নিজেদের পদচিহ্ন ধরে ফিরে গেলেন।","সেখানে তাঁরা একজন ব্যক্তিকে পেলেন যাঁকে আল্লাহ তাঁর পক্ষ থেকে রহমত দান করেছিলেন এবং বিশেষ জ্ঞান শিখিয়েছিলেন। তিনি ছিলেন খিজির (আঃ)।","মূসা (আঃ) বললেন।","\"আমি কি আপনার অনুসরণ করতে পারি যাতে আপনি আমাকে সঠিক পথের জ্ঞান শেখান?\"","খিজির (আঃ) বললেন।","\"তুমি আমার সাথে ধৈর্য ধরতে পারবে না। যে বিষয়ের জ্ঞান তোমার নেই, তাতে তুমি কীভাবে ধৈর্য ধরবে?\"","মূসা (আঃ) বললেন।","\"ইনশাআল্লাহ আপনি আমাকে ধৈর্যশীল পাবেন এবং আমি আপনার কোনো আদেশ অমান্য করব না।\"","খিজির (আঃ) বললেন।","\"ঠিক আছে। তবে শর্ত হলো তুমি আমাকে কোনো প্রশ্ন করবে না যতক্ষণ না আমি নিজে তোমাকে ব্যাখ্যা দেই।\"","তাঁরা একটি নৌকায় উঠলেন। খিজির (আঃ) নৌকায় একটি ছিদ্র করে দিলেন। মূসা (আঃ) অবাক হয়ে বললেন।","\"আপনি কি নৌকার লোকদের ডুবিয়ে মারার জন্য এতে ছিদ্র করলেন? এটা তো এক ভয়ানক কাজ!\"","খিজির (আঃ) বললেন।","\"আমি কি বলিনি যে তুমি আমার সাথে ধৈর্য ধরতে পারবে না?\"","মূসা (আঃ) বললেন।","\"আমার ভুলের জন্য আমাকে দোষ দেবেন না।\"","তাঁরা এগিয়ে গেলেন এবং একটি ছেলেকে দেখলেন। খিজির (আঃ) তাকে হত্যা করলেন। মূসা (আঃ) বললেন।","\"আপনি একটি নিরপরাধ প্রাণকে হত্যা করলেন? এটা তো এক জঘন্য কাজ!\"","খিজির (আঃ) বললেন।","\"আমি কি তোমাকে বলিনি যে তুমি আমার সাথে ধৈর্য ধরতে পারবে না?\"","মূসা (আঃ) বললেন।","\"এরপর যদি আমি আপনাকে কোনো প্রশ্ন করি, তাহলে আমাকে আপনার সাথে রাখবেন না।\"","তাঁরা একটি গ্রামে পৌঁছালেন এবং খাবার চাইলেন, কিন্তু গ্রামবাসীরা তাঁদের আতিথ্য দিতে অস্বীকার করল। সেখানে তাঁরা একটি দেয়াল দেখলেন যা ভেঙে পড়ার উপক্রম। খিজির (আঃ) সেটি সোজা করে দিলেন।","মূসা (আঃ) বললেন।","\"আপনি চাইলে এর জন্য পারিশ্রমিক নিতে পারতেন।\"","খিজির (আঃ) বললেন।","\"এই হলো আমার ও তোমার মধ্যে বিচ্ছেদের সময়। এখন আমি তোমাকে সেসব বিষয়ের ব্যাখ্যা দেব যাতে তুমি ধৈর্য ধরতে পারনি।\"","\"নৌকাটি ছিল কিছু দরিদ্র লোকের যারা সাগরে কাজ করত। আমি এটি ত্রুটিযুক্ত করতে চেয়েছিলাম কারণ তাদের পিছনে একজন রাজা ছিল যে প্রতিটি ভালো নৌকা জোর করে কেড়ে নিত।\"","\"ছেলেটির বাবা-মা ছিল মুমিন। আমরা আশঙ্কা করেছিলাম যে সে বড় হয়ে তাদের অবাধ্যতা ও কুফরিতে লিপ্ত করবে। তাই আমরা চেয়েছিলাম তাদের রব তাদের এর চেয়ে ভালো ও বেশি দয়ালু সন্তান দান করুন।\"","\"আর দেয়ালটি ছিল শহরের দুই ইয়াতীম ছেলের। এর নিচে তাদের জন্য একটি গুপ্তধন ছিল। তাদের পিতা ছিল সৎকর্মশীল। তোমার রব চেয়েছিলেন যে তারা যৌবনে পৌঁছে তাদের গুপ্তধন বের করুক। এটা ছিল তোমার রবের রহমত।\"","\"আমি এসব নিজের ইচ্ছায় করিনি। এই হলো সেসব বিষয়ের ব্যাখ্যা যাতে তুমি ধৈর্য ধরতে পারনি।\"","মূসা (আঃ) বুঝতে পারলেন যে আল্লাহর পরিকল্পনা অনেক গভীর এবং আপাতদৃষ্টিতে খারাপ মনে হলেও তাতে কল্যাণ থাকতে পারে।"],"moral":"আল্লাহর পরিকল্পনা আমাদের বোঝার ঊর্ধ্বে। যা আমাদের কাছে খারাপ মনে হয় তাতে আল্লাহর হিকমত ও কল্যাণ থাকতে পারে। ধৈর্য ও বিশ্বাস রাখতে হবে।","source":"**সূরা কাহফ:** ৬০-৮২"},{"id":"ashab_kahf","categoryId":"quraner_golpo","title":"আসহাবুল কাহফ: গুহাবাসী যুবকদের ঈমান","summary":"কিছু যুবক তাদের ঈমান রক্ষার জন্য অত্যাচারী রাজার শহর ছেড়ে একটি গুহায় আশ্রয় নেয়। আল্লাহ তাদের ৩০৯ বছর ঘুমিয়ে রাখেন এবং পরে জাগিয়ে দেন।","paragraphs":["অনেক আগে এক শহরে কিছু যুবক বাস করত যারা এক আল্লাহতে বিশ্বাস করত। কিন্তু তাদের রাজা ও জাতির লোকেরা মূর্তিপূজা করত এবং মুমিনদের উপর অত্যাচার করত।","এই যুবকরা নিজেদের মধ্যে বলল।","\"আমাদের রব তো আসমান ও জমিনের রব। আমরা তাঁকে ছাড়া অন্য কোনো ইলাহকে ডাকব না। তাহলে তো আমরা সীমালঙ্ঘন করব।\"","তারা সিদ্ধান্ত নিল শহর ছেড়ে চলে যাবে। একজন বলল।","\"আমাদের জাতি আল্লাহ ছাড়া অন্যদের উপাস্য বানিয়ে নিয়েছে। তারা কেন স্পষ্ট প্রমাণ নিয়ে আসে না? আল্লাহর উপর মিথ্যা রটনাকারীর চেয়ে বড় জালিম আর কে?\"","তারা বলল।","\"যখন তোমরা তাদের এবং আল্লাহ ছাড়া তারা যাদের ইবাদত করে তাদের থেকে পৃথক হয়ে গেছ, তখন তোমরা গুহায় আশ্রয় নাও। তোমাদের রব তোমাদের জন্য তাঁর রহমত বিস্তার করবেন।\"","তারা তাদের কুকুরসহ একটি গুহায় প্রবেশ করল। আল্লাহ তাদের উপর গভীর ঘুম ফেলে দিলেন। সূর্য উঠার সময় তাদের গুহার ডান দিক থেকে সরে যেত এবং অস্ত যাওয়ার সময় বাম দিক থেকে সরে যেত। এভাবে সূর্যের আলো সরাসরি তাদের উপর পড়ত না।","তাদের দেখলে মনে হতো তারা জাগ্রত, কিন্তু তারা ঘুমিয়ে ছিল। আল্লাহ তাদের ডানে-বামে পাশ ফেরাতেন যাতে তাদের শরীর ক্ষতিগ্রস্ত না হয়। তাদের কুকুরটি গুহার মুখে দুই পা প্রসারিত করে শুয়ে ছিল।","এভাবে তারা ৩০৯ বছর ঘুমিয়ে রইল। তারপর আল্লাহ তাদের জাগিয়ে দিলেন যাতে মানুষ জানতে পারে যে আল্লাহর ওয়াদা সত্য এবং কিয়ামতে কোনো সন্দেহ নেই।","যখন তারা জাগল, তারা একে অপরকে জিজ্ঞেস করল।","\"তোমরা কতক্ষণ থেকেছ?\"","কেউ বলল।","\"একদিন বা একদিনের কিছু অংশ।\"","তারা বলল।","\"তোমাদের রবই ভালো জানেন তোমরা কতকাল থেকেছ। এখন তোমাদের একজনকে এই রৌপ্যমুদ্রা নিয়ে শহরে পাঠাও। সে যেন দেখে কোন খাবার বেশি পবিত্র এবং সেখান থেকে তোমাদের জন্য খাবার নিয়ে আসে। সে যেন সতর্ক থাকে এবং কেউ যেন তোমাদের সম্পর্কে জানতে না পারে।\"","একজন যুবক শহরে গেল। কিন্তু সে অবাক হয়ে দেখল শহর সম্পূর্ণ বদলে গেছে। তার মুদ্রা দেখে দোকানদার বলল।","\"এটা তো অনেক পুরনো মুদ্রা! তুমি কোথা থেকে এলে?\"","ধীরে ধীরে খবর ছড়িয়ে পড়ল এবং মানুষ বুঝতে পারল এরা সেই যুবক যারা শত শত বছর আগে নিখোঁজ হয়েছিল। এভাবে আল্লাহ তাদের ঘটনা প্রকাশ করলেন যাতে মানুষ জানতে পারে যে আল্লাহর ওয়াদা সত্য এবং মৃত্যুর পর পুনরুত্থান হবে।"],"moral":"ঈমান রক্ষার জন্য যেকোনো ত্যাগ স্বীকার করতে হয়। আল্লাহ তাঁর মুমিন বান্দাদের রক্ষা করেন এবং তাদের ঘটনা দিয়ে পরবর্তী প্রজন্মকে শিক্ষা দেন।","source":"সূরা কাহফ:৯-২৬"},{"id":"maryam_as_birth_isa","categoryId":"quraner_golpo","title":"মারইয়াম (আঃ) ও ঈসা (আঃ)-এর জন্ম","paragraphs":["মারইয়াম (আঃ) ছিলেন অত্যন্ত পরহেজগার ও ইবাদতগুজার এক নারী। তাঁর মা তাঁকে জন্মের আগেই আল্লাহর জন্য উৎসর্গ করেছিলেন। তিনি বাইতুল মুকাদ্দাসের মিহরাবে থেকে ইবাদত করতেন।","জাকারিয়া (আঃ) ছিলেন তাঁর অভিভাবক। তিনি যখনই মারইয়াম (আঃ)-এর কাছে যেতেন, তখন তাঁর কাছে খাবার পেতেন। তিনি জিজ্ঞেস করতেন: \"হে মারইয়াম! এটা তোমার কাছে কোথা থেকে এলো?\"","মারইয়াম (আঃ) বলতেন: \"এটা আল্লাহর পক্ষ থেকে। নিশ্চয়ই আল্লাহ যাকে ইচ্ছা বেহিসাব রিজিক দান করেন।\"","একদিন মারইয়াম (আঃ) তাঁর পরিবার থেকে পূর্ব দিকে একটি নির্জন স্থানে চলে গেলেন। সেখানে তিনি একটি পর্দার আড়ালে ছিলেন।","তখন আল্লাহ তাঁর কাছে তাঁর রূহ (জিবরাঈল আঃ) পাঠালেন। তিনি তাঁর সামনে পূর্ণ মানুষের আকৃতিতে আবির্ভূত হলেন।","মারইয়াম (আঃ) ভয় পেয়ে বললেন।","\"আমি তোমার থেকে পরম করুণাময়ের আশ্রয় চাই, যদি তুমি আল্লাহভীরু হও।\"","ফেরেশতা বললেন।","\"আমি তো শুধু তোমার রবের প্রেরিত দূত, তোমাকে এক পবিত্র পুত্র দান করার জন্য।\"","মারইয়াম (আঃ) বললেন।","\"কীভাবে আমার পুত্র হবে অথচ কোনো মানুষ আমাকে স্পর্শ করেনি এবং আমি অসতী নই?\"","ফেরেশতা বললেন।","\"এভাবেই হবে। তোমার রব বলেছেন, এটা আমার জন্য সহজ। আর আমি তাকে মানুষের জন্য নিদর্শন ও আমার পক্ষ থেকে রহমত বানাব। এটা তো এক স্থিরকৃত বিষয়।\"","মারইয়াম (আঃ) গর্ভবতী হলেন এবং নির্জন স্থানে চলে গেলেন। প্রসব বেদনা তাঁকে একটি খেজুর গাছের কাণ্ডের কাছে নিয়ে গেল।","তিনি কষ্টে বললেন।","\"হায়! আমি যদি এর আগে মরে যেতাম এবং সম্পূর্ণ বিস্মৃত হয়ে যেতাম!\"","তখন তাঁর নিচ থেকে (ঈসা আঃ) তাঁকে ডেকে বললেন।","\"দুঃখ করো না। তোমার রব তোমার নিচে একটি ঝর্ণা প্রবাহিত করেছেন। আর তুমি খেজুর গাছের কাণ্ড তোমার দিকে নাড়া দাও, তা তোমার উপর তাজা পাকা খেজুর ফেলবে।\"","মারইয়াম (আঃ) খেজুর খেলেন এবং পানি পান করলেন। তারপর তিনি শিশুকে নিয়ে তাঁর জাতির কাছে ফিরে গেলেন।","লোকেরা বলল।","\"হে মারইয়াম! তুমি তো এক অদ্ভুত কাজ করেছ! হে হারূনের বোন! তোমার পিতা অসৎ ব্যক্তি ছিলেন না এবং তোমার মাও অসতী ছিলেন না।\"","মারইয়াম (আঃ) শিশুর দিকে ইশারা করলেন। তারা বলল।","\"আমরা কীভাবে কথা বলব তার সাথে যে কোলের শিশু?\"","তখন শিশু ঈসা (আঃ) বললেন।","إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا","অর্থ: আমি আল্লাহর বান্দা। তিনি আমাকে কিতাব দিয়েছেন এবং আমাকে নবী বানিয়েছেন। [সূরা মারইয়াম: ৩০]","লোকেরা অবাক হয়ে গেল। এভাবে আল্লাহ মারইয়াম (আঃ)-এর সম্মান রক্ষা করলেন এবং ঈসা (আঃ)-এর জন্মকে তাঁর কুদরতের নিদর্শন বানালেন।"],"moral":"আল্লাহর কুদরত সীমাহীন। তিনি যা চান তা-ই করেন। পবিত্রতা ও ইবাদতের মাধ্যমে আল্লাহর নৈকট্য লাভ করা যায়।","source":"**সূরা মারইয়াম:** ১৬-৩৪"},{"id":"talut_jalut","categoryId":"quraner_golpo","title":"তালুত, জালুত ও দাউদ (আঃ)","summary":"বনি ইসরাইল যখন শত্রুদের বিরুদ্ধে যুদ্ধ করতে চাইল, আল্লাহ তালুতকে তাদের রাজা বানালেন। যুদ্ধে একজন যুবক দাউদ (আঃ) বিশাল যোদ্ধা জালুতকে পরাজিত করলেন।","paragraphs":["বনি ইসরাইল শত্রুদের দ্বারা নির্যাতিত হচ্ছিল। তারা তাদের নবীর কাছে এসে বলল।","\"আমাদের জন্য একজন রাজা নিযুক্ত করুন যাতে আমরা আল্লাহর পথে যুদ্ধ করতে পারি।\"","নবী বললেন।","\"তোমাদের উপর যুদ্ধ ফরজ করা হলে তোমরা কি যুদ্ধ করবে না?\"","তারা বলল।","\"আমরা কেন আল্লাহর পথে যুদ্ধ করব না অথচ আমাদের ঘরবাড়ি থেকে বের করে দেওয়া হয়েছে এবং আমাদের সন্তানদের থেকে আলাদা করা হয়েছে?\"","আল্লাহ তাদের জন্য তালুতকে রাজা নিযুক্ত করলেন। কিন্তু তারা আপত্তি করে বলল।","\"তার রাজত্ব আমাদের উপর কীভাবে হবে অথচ আমরা তার চেয়ে রাজত্বের বেশি হকদার এবং তাকে প্রচুর সম্পদও দেওয়া হয়নি?\"","নবী বললেন।","\"আল্লাহ তাকে তোমাদের উপর মনোনীত করেছেন এবং তাকে জ্ঞান ও শারীরিক শক্তিতে প্রাচুর্য দান করেছেন। আল্লাহ যাকে ইচ্ছা তাঁর রাজত্ব দান করেন।\"","তালুত সৈন্যদের নিয়ে বের হলেন। পথে একটি নদী আসল। তালুত বললেন।","\"আল্লাহ তোমাদের একটি নদী দিয়ে পরীক্ষা করবেন। যে এর পানি পান করবে সে আমার দলের নয়। আর যে এর স্বাদ গ্রহণ করবে না সে আমার দলের, তবে এক আঁজলা পানি ছাড়া।\"","তাদের মধ্যে অল্প কিছু ছাড়া সবাই পানি পান করল। যারা ঈমান রেখেছিল শুধু তারাই নদী পার হলো।","যখন তারা জালুত ও তার বাহিনীকে দেখল, তখন বলল।","\"আজ জালুত ও তার বাহিনীর বিরুদ্ধে লড়াই করার শক্তি আমাদের নেই।\"","কিন্তু যারা বিশ্বাস করত যে তারা আল্লাহর সাথে সাক্ষাৎ করবে, তারা বলল।","\"কত ছোট দল আল্লাহর অনুমতিতে বড় দলকে পরাজিত করেছে! আল্লাহ ধৈর্যশীলদের সাথে আছেন।\"","যুদ্ধের ময়দানে একজন যুবক দাউদ (আঃ) এগিয়ে এলেন। তিনি ছিলেন রাখাল কিন্তু অত্যন্ত সাহসী এবং আল্লাহর উপর দৃঢ় বিশ্বাসী।","বিশাল যোদ্ধা জালুত যখন ময়দানে এলো, সবাই ভয় পেল। কিন্তু দাউদ (আঃ) তাঁর গুলতি দিয়ে একটি পাথর ছুড়লেন যা জালুতের কপালে আঘাত করল এবং সে মারা গেল।","আল্লাহ দাউদ (আঃ)-কে বিজয় দান করলেন এবং তাঁকে রাজত্ব ও হিকমত দান করলেন। এভাবে ছোট কিন্তু ঈমানদার দল বড় দলকে পরাজিত করল।"],"moral":"সংখ্যা নয়, ঈমান ও আল্লাহর সাহায্যই বিজয়ের চাবিকাঠি। ধৈর্য ও দৃঢ়তার সাথে যুদ্ধ করলে আল্লাহ সাহায্য করেন।","source":"**সূরা বাকারাহ:** ২৪৬-২৫১"},{"id":"qarun_treasure","categoryId":"quraner_golpo","title":"কারূনের ধনসম্পদ ও অহংকার","paragraphs":["কারূন ছিল মূসা (আঃ)-এর জাতির লোক। আল্লাহ তাকে এত বেশি ধনসম্পদ দিয়েছিলেন যে তার ধনভাণ্ডারের চাবিগুলো বহন করতে একদল শক্তিশালী লোকের কষ্ট হতো।","তার জাতির লোকেরা তাকে উপদেশ দিয়ে বলল।","\"অহংকার করো না। নিশ্চয়ই আল্লাহ অহংকারীদের পছন্দ করেন না। আল্লাহ তোমাকে যা দিয়েছেন তা দিয়ে আখিরাতের ঘর অন্বেষণ করো এবং দুনিয়া থেকে তোমার অংশ ভুলে যেও না।\"","কিন্তু কারূন অহংকারের সাথে বলল।","\"আমি তো এটা আমার জ্ঞানের কারণে পেয়েছি।\" সে বুঝল না যে আল্লাহই তাকে এই সম্পদ দিয়েছেন এবং তিনি চাইলে তা কেড়ে নিতে পারেন।","একদিন কারূন তার সম্পদ ও সাজসজ্জা নিয়ে তার জাতির সামনে বের হলো। যারা দুনিয়ার জীবন কামনা করত তারা বলল।","\"হায়! কারূনকে যা দেওয়া হয়েছে তা যদি আমাদের থাকত! সে তো বড় ভাগ্যবান!\"","কিন্তু যাদের জ্ঞান দেওয়া হয়েছিল তারা বলল।","\"ধিক তোমাদের! যারা ঈমান আনে ও সৎকর্ম করে তাদের জন্য আল্লাহর পুরস্কার উত্তম। আর এটা কেবল ধৈর্যশীলদেরই দেওয়া হয়।\"","অবশেষে আল্লাহ কারূন, তার প্রাসাদ ও তার সম্পদকে মাটিতে ধসিয়ে দিলেন। তার কোনো দল ছিল না যারা আল্লাহর শাস্তি থেকে তাকে সাহায্য করতে পারত এবং সে নিজেও প্রতিরোধ করতে পারল না।","যারা গতকাল তার মতো হতে চেয়েছিল তারা বলতে লাগল: \"আহা! আল্লাহ তাঁর বান্দাদের মধ্যে যার জন্য ইচ্ছা রিজিক প্রশস্ত করেন এবং সংকুচিত করেন। আল্লাহ যদি আমাদের প্রতি অনুগ্রহ না করতেন তাহলে আমাদেরও ধসিয়ে দিতেন।\"","এভাবে কারূনের অহংকার ও অকৃতজ্ঞতার পরিণাম হলো ধ্বংস।"],"moral":"সম্পদ আল্লাহর দান, নিজের বুদ্ধির ফল নয়। অহংকার ও অকৃতজ্ঞতা ধ্বংস ডেকে আনে। আখিরাতের জন্য কাজ করাই প্রকৃত সফলতা।","source":"**সূরা কাসাস:** ৭৬-৮২"},{"id":"luqman_advice","categoryId":"quraner_golpo","title":"লুকমান (আঃ)-এর প্রজ্ঞাপূর্ণ উপদেশ","summary":"লুকমান (আঃ) ছিলেন একজন প্রজ্ঞাবান ব্যক্তি যিনি তাঁর ছেলেকে অত্যন্ত মূল্যবান উপদেশ দিয়েছিলেন যা কুরআনে সংরক্ষিত আছে।","paragraphs":["লুকমান (আঃ) ছিলেন একজন জ্ঞানী ও প্রজ্ঞাবান ব্যক্তি। আল্লাহ তাঁকে হিকমত (প্রজ্ঞা) দান করেছিলেন। তিনি তাঁর ছেলেকে উপদেশ দিতেন।","তিনি বললেন।","\"হে আমার প্রিয় বৎস! আল্লাহর সাথে শিরক করো না। নিশ্চয়ই শিরক হলো মহা অন্যায়।\"","তিনি আরও বললেন।","\"হে আমার বৎস! কোনো কিছু যদি সরিষা দানার পরিমাণও হয় এবং তা থাকে পাথরের ভিতরে অথবা আসমানে বা জমিনে, আল্লাহ তা নিয়ে আসবেন। নিশ্চয়ই আল্লাহ সূক্ষ্মদর্শী, সর্বজ্ঞ।\"","\"হে আমার বৎস! সালাত কায়েম করো, সৎকাজের আদেশ দাও এবং অসৎকাজে নিষেধ করো। আর তোমার উপর যে বিপদ আসে তাতে ধৈর্য ধরো। নিশ্চয়ই এটা দৃঢ় সংকল্পের কাজ।\"","\"মানুষের দিক থেকে তোমার মুখ ফিরিয়ে নিও না এবং জমিনে দম্ভভরে চলো না। নিশ্চয়ই আল্লাহ কোনো দাম্ভিক অহংকারীকে পছন্দ করেন না।\"","\"তোমার চলায় মধ্যপন্থা অবলম্বন করো এবং তোমার আওয়াজ নিচু করো। নিশ্চয়ই সবচেয়ে খারাপ আওয়াজ হলো গাধার আওয়াজ।\"","এই উপদেশগুলো এত মূল্যবান যে আল্লাহ সেগুলো কুরআনে সংরক্ষণ করেছেন যাতে সব যুগের মানুষ এগুলো থেকে শিক্ষা নিতে পারে।"],"moral":"শিরক থেকে বেঁচে থাকা, সালাত কায়েম করা, সৎকাজের আদেশ দেওয়া, বিনয়ী হওয়া এবং মধ্যপন্থা অবলম্বন করা প্রকৃত প্রজ্ঞার লক্ষণ।","source":"**সূরা লুকমান:** ১২-১৯"},{"id":"salih_as_camel","categoryId":"quraner_golpo","title":"সালিহ (আঃ) ও আল্লাহর উটনী","summary":"সামুদ জাতি পাথর কেটে ঘর বানাত এবং অহংকার করত। সালিহ (আঃ) তাদের দাওয়াত দিলে তারা মুজিযা চাইল। আল্লাহ একটি উটনী পাঠালেন কিন্তু তারা সেটি হত্যা করল এবং ধ্বংস হলো।","paragraphs":["সামুদ জাতি ছিল অত্যন্ত শক্তিশালী। তারা পাহাড় কেটে বিশাল বিশাল ঘর বানাত এবং নিজেদের শক্তিতে অহংকার করত।","আল্লাহ তাদের কাছে সালিহ (আঃ)-কে নবী করে পাঠালেন। তিনি বললেন।","\"হে আমার জাতি! তোমরা আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের কোনো ইলাহ নেই।\"","তারা বলল।","\"তুমি যদি সত্যবাদী হও তাহলে আমাদের একটি মুজিযা দেখাও। এই পাথর থেকে একটি উটনী বের করে দেখাও।\"","সালিহ (আঃ) আল্লাহর কাছে দোয়া করলেন। আল্লাহর কুদরতে সেই পাথর ফেটে গেল এবং একটি বিশাল উটনী বের হলো।","সালিহ (আঃ) বললেন।","\"এটা আল্লাহর উটনী, তোমাদের জন্য নিদর্শন। একে আল্লাহর জমিনে চরতে দাও এবং একে কোনো ক্ষতি করো না।\"","কিন্তু তাদের নেতারা উটনীকে হত্যা করল। সালিহ (আঃ) বললেন।","\"তোমরা তোমাদের ঘরে তিন দিন ভোগ করো।\"","তিন দিন পর প্রচণ্ড শব্দ ও ভূমিকম্প এলো এবং তারা সবাই ধ্বংস হয়ে গেল।"],"moral":"আল্লাহর নিদর্শন দেখার পরও যারা অস্বীকার করে তাদের জন্য কঠিন শাস্তি। অহংকার ধ্বংস ডেকে আনে।","source":"**সূরা হুদ:** ৬১-৬৮"}]