[
  {
    "id": "quraner_golpo_yusuf_as_vision_detailed",
    "categoryId": "quraner_golpo",
    "title": "ইউসুফ (আঃ)-এর স্বপ্ন: ঈর্ষা, চক্রান্ত ও কূপের অন্ধকার",
    "summary": "হযরত ইয়াকুব (আঃ)-এর প্রিয় পুত্র ইউসুফ (আঃ) শৈশবে এক অলৌকিক স্বপ্ন দেখেছিলেন। তাঁর ভাইদের মনে সেই স্বপ্নের কারণে জন্ম নেয় তীব্র ঈর্ষা। এই ঈর্ষার বশবর্তী হয়ে তারা ইউসুফকে এক অন্ধকার কূপে নিক্ষেপ করে, যা ছিল ইউসুফ (আঃ)-এর জীবনের চরম কষ্টের সূচনা।",
    "paragraphs": [
      "হযরত ইউসুফ (আ.) ছিলেন তাঁর পিতা হযরত ইয়াকুব (আ.)-এর সবচেয়ে প্রিয় ও গুণবান পুত্র। একদিন ইউসুফ (আ.) তাঁর পিতাকে এসে বললেন:",
      "يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ",
      "অর্থাৎ, হে আমার পিতা! আমি স্বপ্নে দেখলাম এগারটি নক্ষত্র, সূর্য এবং চন্দ্র আমাকে সিজদা করছে। [সূরা ইউসুফ: ৪]",
      "ইয়াকুব (আ.) সেই স্বপ্নের গুরুত্ব বুঝতে পারলেন; তিনি জানতেন তাঁর এই পুত্র ভবিষ্যতে এক মহান মর্যাদার অধিকারী হবেন। তিনি স্নেহভরে ইউসুফকে সতর্ক করে বললেন:",
      "'তোমার এই স্বপ্নের কথা তোমার ভাইদের কাছে প্রকাশ করো না, কারণ তারা তোমার বিরুদ্ধে কোনো চক্রান্ত করতে পারে।'",
      "কিন্তু ইউসুফ (আ.)-এর ভাইদের মনে আগে থেকেই তাঁর প্রতি তীব্র ঈর্ষা ছিল। তারা মনে করত, পিতা তাঁদের চেয়ে ইউসুফকেই বেশি ভালোবাসেন। তারা নিজেদের মধ্যে পরামর্শ করল এবং সিদ্ধান্ত নিল যে ইউসুফকে সরিয়ে দিতে পারলেই পিতার সমস্ত স্নেহ ও মনোযোগ তারা লাভ করবে। ঈর্ষার আগুন তাঁদেরকে এক ভয়াবহ চক্রান্তে প্ররোচিত করল।",
      "তারা তাদের পিতাকে ভুল বুঝিয়ে ইউসুফকে সাথে নিয়ে মরুভূমিতে গেল। সেখানেই তারা তাঁকে হত্যা করার পরিকল্পনা করল। তাদের মধ্যে একজন দয়া দেখিয়ে বলল:",
      "'তাকে হত্যা না করে বরং কোনো গভীর অন্ধ কূপে নিক্ষেপ করো, যাতে কোনো পথিক তাকে তুলে নিয়ে যায়।'",
      "এই নিষ্ঠুর পরিকল্পনা বাস্তবায়ন করে তারা ইউসুফকে বিবস্ত্র করে কূপে ফেলে দিল।",
      "এরপর তারা কাঁদতে কাঁদতে বাড়ি ফিরে পিতাকে মিথ্যা খবর দিল যে, ইউসুফকে বাঘে খেয়ে ফেলেছে। প্রমাণস্বরূপ তারা ইউসুফের জামায় মিথ্যা রক্ত মাখিয়ে নিয়ে এসেছিল।",
      "ইয়াকুব (আ.) তাদের মিথ্যা বুঝতে পারলেন, কিন্তু তিনি আল্লাহর ওপর পূর্ণ ভরসা করলেন এবং বললেন:",
      "'সুতরাং ধৈর্য ধারণ করাই শ্রেয়। তোমাদের বানানো এই মিথ্যা কাহিনীর জন্য আমি আল্লাহর সাহায্য প্রার্থনা করছি।'",
      "এই ঘটনাই ছিল ইউসুফ (আ.)-এর জীবনের কঠিনতম কষ্টের সূচনা, যা তাঁকে মিসরের সিংহাসনের পথ দেখিয়েছিল।"
    ],
    "moral": "ঈর্ষা মানুষের অন্তরকে অন্ধ করে দিলেও, আল্লাহর পরিকল্পনা মানবীয় চক্রান্তের ঊর্ধ্বে। জীবনের চরম কষ্টের মুহূর্তেও আল্লাহর ওপর ভরসা ও ধৈর্যশীলতাই মুক্তির পথ।",
    "source": "পবিত্র কুরআন (সূরা ইউসুফ: ৪-১৮)।"
  },
  {
    "id": "quraner_golpo_musa_as_birth_detailed",
    "categoryId": "quraner_golpo",
    "title": "মূসা (আঃ)-এর জন্ম: নীল নদের বুকে মায়ের বিশ্বাস ও মুক্তি",
    "summary": "দাম্ভিক ফেরাউন যখন বনি ইসরাইলের সকল পুত্র সন্তানকে হত্যার নির্দেশ দিয়েছিল, তখন মূসা (আঃ)-এর মা আল্লাহর অলৌকিক নির্দেশে নবজাতক শিশুকে এক সিন্দুকে ভরে নীল নদে ভাসিয়ে দেন। এটি ছিল একজন মায়ের চরম ত্যাগ, বিশ্বাস এবং আল্লাহর কুদরতের এক অবিস্মরণীয় ঘটনা।",
    "paragraphs": [
      "তখনকার মিশরের প্রতাপশালী শাসক ছিল ফেরাউন, যে নিজেকে খোদা বলে দাবি করত। একদিন তার দরবারে জ্যোতিষীরা এসে বলল:",
      "\"হে মহান ফেরাউন! আমরা নক্ষত্রে দেখেছি যে বনি ইসরাইলের এক পুত্র সন্তানের হাতেই আপনার রাজত্বের পতন হবে।\"",
      "ফেরাউন ক্রোধে গর্জে উঠল: \"তাহলে আজ থেকে বনি ইসরাইলের ঘরে জন্ম নেওয়া সকল নবজাতক পুত্র সন্তানকে দেখামাত্র হত্যা করা হবে!\"",
      "এই চরম আতঙ্কের সময়েই মূসা (আঃ)-এর জন্ম হলো। তাঁর মা সন্তানকে হারানোর ভয়ে সর্বদা শঙ্কিত থাকতেন। তিনি কাঁদতে কাঁদতে আল্লাহর কাছে দোয়া করতেন:",
      "\"হে আল্লাহ! আমার সন্তানকে রক্ষা করো। আমি কী করব?\"",
      "তখন আল্লাহ তাঁর প্রতি ওহী নাজিল করলেন:",
      "وَأَوْحَيْنَا إِلَىٰ أُمِّ مُوسَىٰ أَنْ أَرْضِعِيهِ ۖ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلَا تَخَافِي وَلَا تَحْزَنِي ۖ إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ",
      "\"তুমি তোমার সন্তানকে দুধ পান করাও এবং যখন তুমি তার ব্যাপারে কোনো ভয় অনুভব করবে, তখন তাকে নদীতে নিক্ষেপ করে দিও। আর ভয় করো না ও চিন্তা করো না; আমি তাকে তোমার কাছে ফিরিয়ে দেব এবং তাকে রাসূলদের অন্তর্ভুক্ত করব।\" [সূরা আল-কাসাস: ৭]",
      "মূসা (আঃ)-এর মা অবাক হলেন: \"আমি আমার কোলের শিশুকে নদীতে ভাসিয়ে দেব? কীভাবে সম্ভব?\"",
      "কিন্তু তিনি আল্লাহর উপর পূর্ণ বিশ্বাস রাখলেন। তিনি একটি সিন্দুক তৈরি করলেন এবং বুকের ধন শিশুকে তাতে ভরে নীল নদের বুকে ভাসিয়ে দিলেন। তাঁর চোখ দিয়ে অশ্রু ঝরছিল।",
      "তিনি তাঁর কন্যাকে বললেন:",
      "\"বেটি! তুমি দূর থেকে সিন্দুকটির গতিপথ অনুসরণ করো এবং দেখো কোথায় যায়।\"",
      "তাঁর কন্যা বলল: \"ঠিক আছে আম্মা। আমি দেখছি।\"",
      "আল্লাহর অলৌকিক ইচ্ছায় সেই সিন্দুকটি সোজা গিয়ে পৌঁছাল ফেরাউনের স্ত্রীর আসিয়া (আঃ)-এর প্রাসাদের ঘাটে। আসিয়া (আঃ) যখন সিন্দুকের ভেতরে শিশুটিকে দেখলেন, তিনি চমকে উঠলেন:",
      "\"এ কী! এত সুন্দর শিশু! কার এই শিশু?\"",
      "তিনি শিশুটিকে কোলে তুলে নিলেন। ফেরাউন এসে বলল:",
      "\"এই শিশুকে হত্যা করো! এটা নিশ্চয়ই বনি ইসরাইলের সন্তান।\"",
      "কিন্তু আসিয়া (আঃ) দৃঢ়ভাবে বললেন:",
      "\"না! এই শিশুকে আমি রাখব। এটা আমার এবং তোমার চোখের শীতলতা হতে পারে। তুমি একে হত্যা করো না।\"",
      "ফেরাউন তাঁর স্ত্রীর কথায় রাজি হলো। এভাবেই আল্লাহ তাঁর পরিকল্পনা বাস্তবায়ন করলেন - মূসা (আঃ) তাঁর সবচেয়ে বড় শত্রুর ঘরেই পরম নিরাপদে লালিত-পালিত হতে শুরু করলেন।",
      "কিন্তু শিশু মূসা কোনো ধাত্রীর দুধ পান করছিলেন না। আসিয়া (আঃ) চিন্তিত হয়ে বললেন:",
      "\"এই শিশু কারো দুধ পান করছে না! কী করব?\"",
      "তখন মূসা (আঃ)-এর বোন এগিয়ে এসে বলল:",
      "\"আমি কি আপনাদের এমন একজনের কথা বলব যিনি এই শিশুকে লালন-পালন করতে পারবেন?\"",
      "আসিয়া (আঃ) বললেন: \"হ্যাঁ! তাড়াতাড়ি নিয়ে এসো।\"",
      "মূসা (আঃ)-এর বোন দৌড়ে গিয়ে তাঁর মাকে ডেকে আনলেন। মূসা (আঃ)-এর মা যখন শিশুকে কোলে নিলেন, তিনি সাথে সাথে দুধ পান করতে শুরু করলেন।",
      "আসিয়া (আঃ) খুশি হয়ে বললেন:",
      "\"তুমি এই শিশুকে লালন-পালন করবে এবং আমরা তোমাকে পারিশ্রমিক দেব।\"",
      "মূসা (আঃ)-এর মা মনে মনে আল্লাহর শুকরিয়া আদায় করলেন: \"আলহামদুলিল্লাহ! আল্লাহ তাঁর ওয়াদা পূরণ করেছেন। আমার সন্তান আমার কাছে ফিরে এসেছে।\""
    ],
    "moral": "মানুষের সব চক্রান্ত আল্লাহর ইচ্ছার কাছে ব্যর্থ। আল্লাহর ওপর পূর্ণ ভরসা রাখলে তিনি তাঁর অলৌকিক কুদরতে বান্দাকে রক্ষা করেন এবং কষ্টের পর স্বস্তি দান করেন।",
    "source": "পবিত্র কুরআন (সূরা আল-কাসাস: ৭-১৩)।"
  },
  {
    "id": "quraner_golpo_yunus_as_whale_detailed",
    "categoryId": "quraner_golpo",
    "title": "ইউনুস (আঃ)-এর পরীক্ষা: মাছের পেটে অন্ধকার রাতের বন্দিত্ব",
    "summary": "হযরত ইউনুস (আঃ) তাঁর গোত্রের দাওয়াতে হতাশ হয়ে আল্লাহর অনুমতি ছাড়া তাদের ছেড়ে চলে গিয়েছিলেন। এর ফলস্বরূপ তিনি মাছের পেটে বন্দী হন। মাছের পেটের সেই চরম অন্ধকার, কষ্ট ও একাকীত্বে তিনি আল্লাহর কাছে ক্ষমা চেয়ে বিখ্যাত দোয়া পাঠ করেন এবং মুক্তি লাভ করেন।",
    "paragraphs": [
      "হযরত ইউনুস (আঃ) তাঁর গোত্রের লোকদের কাছে দাওয়াত দিচ্ছিলেন:",
      "\"হে আমার গোত্র! তোমরা এক আল্লাহর ইবাদত করো। তিনি ছাড়া কোনো ইলাহ নেই।\"",
      "কিন্তু তারা বলল: \"আমরা আমাদের বাপ-দাদার ধর্ম ছাড়ব না।\"",
      "ইউনুস (আঃ) আবার বললেন: \"তোমরা যদি আল্লাহর আদেশ না মানো, তাহলে তোমাদের উপর আজাব আসবে।\"",
      "তারা হেসে বলল: \"তাহলে আজাব নিয়ে আসো!\"",
      "বারবার চেষ্টা করেও তারা বিশ্বাস করল না। ইউনুস (আঃ) হতাশ ও ক্রুদ্ধ হয়ে গেলেন। তিনি মনে মনে বললেন:",
      "\"আমি আর এদের সাথে থাকব না। আল্লাহ এদের উপর আজাব পাঠাবেন।\"",
      "তিনি আল্লাহর অনুমতি না নিয়েই তাদের ছেড়ে চলে গেলেন। তিনি একটি নৌকায় আরোহণ করলেন। নৌকাটি যখন মাঝসমুদ্রে পৌঁছাল, তখন এক ভয়াবহ ঝড় শুরু হলো।",
      "নাবিকরা ভয় পেয়ে বলল:",
      "\"নৌকা ডুবে যাচ্ছে! আমাদের মধ্যে একজনকে সমুদ্রে ফেলে দিতে হবে।\"",
      "তারা লটারি করল এবং ইউনুস (আঃ)-এর নাম উঠল।",
      "ইউনুস (আঃ) বুঝতে পারলেন: \"এটি আল্লাহর পক্ষ থেকে পরীক্ষা। আমি আল্লাহর অনুমতি ছাড়া চলে এসেছি।\"",
      "তিনি সমুদ্রে ঝাঁপ দিলেন। সাথে সাথেই আল্লাহর নির্দেশে একটি বিশাল তিমি মাছ তাঁকে গিলে ফেলল। মাছের পেটে, গভীর সাগরের নিচে ইউনুস (আঃ) চরম অন্ধকারে বন্দী হলেন।",
      "তিনি চারপাশে তাকালেন - শুধু অন্ধকার। তিনি কাঁদতে লাগলেন এবং বললেন:",
      "\"হে আল্লাহ! আমি ভুল করেছি। আমি আপনার অনুমতি ছাড়া চলে এসেছি।\"",
      "এই ভয়ংকর একাকীত্ব ও কষ্টের মধ্যে তিনি অনুতাপে আল্লাহর কাছে ক্ষমা চেয়ে দোয়া করলেন:",
      "لَا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
      "\"তুমি ছাড়া কোনো মাবুদ নেই, তুমি পবিত্র, আমি নিশ্চয়ই জালিমদের অন্তর্ভুক্ত।\" [সূরা আম্বিয়া: ৮৭]",
      "তিনি বারবার এই দোয়া পড়তে লাগলেন। আল্লাহ তাঁর দোয়া কবুল করলেন এবং তিমি মাছটিকে নির্দেশ দিলেন:",
      "\"তাকে উগলে দাও।\"",
      "তিমি মাছটি তাঁকে সুস্থ অবস্থায় একটি নির্জন বালুকাময় তীরে উগলে দিল। ইউনুস (আঃ) বালিতে শুয়ে আল্লাহর শুকরিয়া আদায় করলেন:",
      "\"আলহামদুলিল্লাহ! আল্লাহ আমাকে ক্ষমা করেছেন এবং মুক্তি দিয়েছেন।\""
    ],
    "moral": "আল্লাহর নৈকট্য লাভে হতাশ হওয়া উচিত নয়। জীবনের সবচেয়ে কঠিন পরিস্থিতিতেও আল্লাহর কাছে ক্ষমা ও সাহায্য চাইলে তিনি তা কবুল করেন।",
    "source": "পবিত্র কুরআন (সূরা ইউনুস: ৯৮; সূরা আম্বিয়া: ৮৭-৮৮; সূরা সাফফাত: ১৪২-১৪৬)।"
  },
  {
    "id": "quraner_golpo_sulayman_as_ant",
    "categoryId": "quraner_golpo",
    "title": "সুলায়মান (আঃ)-এর সাম্রাজ্য: পিঁপড়াদের সাথে কথোপকথন ও কৃতজ্ঞতা",
    "summary": "হযরত সুলায়মান (আঃ) ছিলেন এমন এক বাদশাহ, যিনি মানুষ, জ্বিন ও পশুপাখির ভাষা বুঝতে পারতেন। একবার তাঁর বিশাল সৈন্যবাহিনী নিয়ে চলার পথে একটি পিঁপড়ের উপত্যকা অতিক্রম করার সময় তিনি একটি পিঁপড়ের কথা শুনে হেসেছিলেন এবং আল্লাহর কাছে কৃতজ্ঞতা প্রকাশ করেছিলেন।",
    "paragraphs": [
      "হযরত সুলায়মান (আঃ) ছিলেন আল্লাহর এক বিশেষ অনুগ্রহপ্রাপ্ত নবী ও বাদশাহ। আল্লাহ তাঁকে এমন এক বিশাল সাম্রাজ্য দান করেছিলেন, যার ওপর মানুষ, জ্বিন এবং পশুপাখি—সবারই নিয়ন্ত্রণ ছিল। তিনি বাতাসের পিঠে সওয়ার হয়ে মুহূর্তেই দূরদূরান্তে ভ্রমণ করতে পারতেন এবং সকল প্রাণীর ভাষা বুঝতে পারতেন।",
      "একবার সুলায়মান (আ.) তাঁর বিশাল সেনাবাহিনী নিয়ে একটি উপত্যকার ওপর দিয়ে যাচ্ছিলেন, যা ছিল পিঁপড়াদের আবাসস্থল। যখন তাঁর সৈন্যরা পিঁপড়াদের উপত্যকার কাছাকাছি পৌঁছাল, তখন সুলায়মান (আ.) একটি পিঁপড়ের কণ্ঠস্বর শুনতে পেলেন।",
      "পিঁপড়েটি তার স্বগোত্রের পিঁপড়াদের উদ্দেশ্যে বলল:",
      "يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ",
      "অর্থাৎ, হে পিঁপড়েরা! তোমরা তোমাদের ঘরে প্রবেশ করো, যেন সুলায়মান এবং তার সৈন্যরা তোমাদেরকে অজ্ঞাতসারে পিষে না ফেলে। [সূরা নামল: ১৮]",
      "পিঁপড়ের এই সতর্কতা এবং নিজের সম্প্রদায়কে রক্ষা করার প্রচেষ্টা শুনে সুলায়মান (আ.) হেসে উঠলেন। তিনি আল্লাহর প্রতি তাঁর এই বিশেষ ক্ষমতার জন্য কৃতজ্ঞতা প্রকাশ করলেন।",
      "তিনি তখন আল্লাহর কাছে দোয়া করে বললেন:",
      "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
      "অর্থাৎ, হে আমার রব! আমাকে সামর্থ্য দাও যেন আমি তোমার সেই নিয়ামতের কৃতজ্ঞতা প্রকাশ করতে পারি, যা তুমি আমার ও আমার পিতা-মাতার ওপর দান করেছ। আর যেন আমি এমন নেক আমল করতে পারি যা তুমি পছন্দ করো। এবং আমাকে তোমার রহমতে তোমার নেক বান্দাদের অন্তর্ভুক্ত করো। [সূরা নামল: ১৯]",
      "এই ঘটনা প্রমাণ করে যে, আল্লাহর বিশেষ ক্ষমতা পেয়েও একজন বান্দা কতটা বিনয়ী ও কৃতজ্ঞ হতে পারে।"
    ],
    "moral": "আল্লাহর বিশেষ নিয়ামত ও ক্ষমতা লাভ করলেও বিনয়ী থাকা উচিত। আল্লাহর সৃষ্টিকে ছোট করে দেখা উচিত নয়, কারণ সৃষ্টিকর্তার কাছে প্রতিটি সৃষ্টিরই মর্যাদা রয়েছে।",
    "source": "পবিত্র কুরআন (সূরা নামল: ১৫-১৯)।"
  },
  {
    "id": "quraner_golpo_dhul_qarnain",
    "categoryId": "quraner_golpo",
    "title": "যুল-কারনাইন (আঃ)-এর অভিযান ও ইয়াজুজ-মাজুজের প্রাচীর",
    "summary": "যুল-কারনাইন (আঃ) ছিলেন এক ন্যায়পরায়ণ শাসক, যাকে আল্লাহ পৃথিবীর পূর্ব ও পশ্চিম প্রান্ত পর্যন্ত ভ্রমণের ক্ষমতা দিয়েছিলেন। তাঁর এক অভিযানে তিনি এমন এক দুর্বল জাতির সাক্ষাৎ পান, যারা ইয়াজুজ ও মাজুজ নামক দুই অত্যাচারী গোষ্ঠীর হাত থেকে রক্ষা পেতে একটি শক্তিশালী প্রাচীর নির্মাণের আবেদন করেছিল।",
    "paragraphs": [
      "যুল-কারনাইন (আঃ) ছিলেন একজন মুমিন ও ন্যায়পরায়ণ বাদশাহ, যাকে আল্লাহ তাঁর সাম্রাজ্যের বিস্তৃতি এবং সঠিক জ্ঞান দিয়ে সম্মানিত করেছিলেন। তিনি পৃথিবীর পূর্ব ও পশ্চিম, উত্তর ও দক্ষিণ—বিভিন্ন দিকে অভিযান পরিচালনা করেন।",
      "তাঁর এক অভিযানে তিনি সূর্যের অস্তাচলে পৌঁছান, যেখানে তিনি এক উষ্ণ ঝর্ণার কাছে এক গোত্রের সাক্ষাৎ পান। এরপর তিনি অন্য অভিযানে সূর্যের উদয়াচলের দিকে অগ্রসর হন, যেখানে তিনি এমন এক গোত্রের সাক্ষাৎ পান যাদের জন্য সূর্যের তাপ থেকে রক্ষা পাওয়ার কোনো আবরণ ছিল না। উভয় ক্ষেত্রেই তিনি ন্যায় ও ইনসাফ প্রতিষ্ঠা করেন।",
      "এরপর তিনি দুই পর্বতের মাঝখানে অবস্থিত এক গোত্রের কাছে পৌঁছান। এই গোত্রের লোকেরা তাঁকে বলল:",
      "'হে যুল-কারনাইন! ইয়াজুজ ও মাজুজ নামক দুটি গোষ্ঠী পৃথিবীতে অশান্তি সৃষ্টি করছে। আমরা আপনাকে অর্থ দেব, আপনি কি আমাদের এবং তাদের মাঝে একটি শক্তিশালী প্রাচীর তৈরি করে দিতে পারেন?'",
      "যুল-কারনাইন (আ.) উত্তর দিলেন:",
      "'আমার রব আমাকে যে ক্ষমতা দিয়েছেন, তা তোমাদের অর্থের চেয়ে উত্তম। তোমরা শুধু আমাকে কায়িক শ্রম দিয়ে সাহায্য করো।'",
      "এরপর তিনি তাদের সহায়তায় লোহা ও গলিত তামার মিশ্রণে দুটি পাহাড়ের মাঝখানে এক সুবিশাল ও দুর্ভেদ্য প্রাচীর নির্মাণ করেন, যা ইয়াজুজ ও মাজুজকে বহুকাল পর্যন্ত পৃথিবীতে বিশৃঙ্খলা সৃষ্টি করা থেকে বিরত রাখে। তিনি এই সাফল্যের জন্য আল্লাহর কাছে কৃতজ্ঞতা প্রকাশ করেন।",
      "এই প্রাচীর ছিল এক শক্তিশালী প্রকৌশলগত বিস্ময়, যা প্রমাণ করে যে, আল্লাহর দেওয়া ক্ষমতা শুধু যুদ্ধের জন্য নয়, বরং মানুষের কল্যাণের জন্যও ব্যবহৃত হওয়া উচিত।"
    ],
    "moral": "প্রকৃত ক্ষমতা অর্থ বা সম্পদের মধ্যে নয়, বরং মানবকল্যাণ ও ন্যায়ের প্রতিষ্ঠার মধ্যে নিহিত। আল্লাহর দেওয়া ক্ষমতাকে মানুষের উপকারে ব্যবহার করা উচিত।",
    "source": "পবিত্র কুরআন (সূরা কাহফ: ৮৩-৯৮)।"
  },
  {
    "id": "quraner_golpo_kahf_as_companions",
    "categoryId": "quraner_golpo",
    "title": "আসহাবুল কাহফ: গুহাবাসী যুবকদের অলৌকিক ঘুম",
    "summary": "আসহাবুল কাহফ বা গুহাবাসী যুবকেরা ছিল এক অত্যাচারী শাসকের যুগে বসবাসকারী মুমিন যুবকদের একটি দল। তারা তাদের ঈমান ও জীবন রক্ষার জন্য একটি গুহার ভেতরে আশ্রয় নিয়েছিল এবং আল্লাহর কুদরতে সেখানে তারা কয়েকশ বছর ঘুমিয়ে কাটিয়েছিল।",
    "paragraphs": [
      "প্রাচীনকালে এক অত্যাচারী শাসক ছিল, যে তার রাজ্যের সকল মানুষকে তার মনমতো মিথ্যা দেব-দেবীর উপাসনা করতে বাধ্য করত। এই সময়ে অল্পসংখ্যক যুবক তাদের ঈমানকে রক্ষা করতে ঐক্যবদ্ধ হলো। তারা বুঝতে পারল যে, সেই সমাজে তাদের ঈমান নিয়ে টিকে থাকা অসম্ভব।",
      "তারা সিদ্ধান্ত নিল যে, মিথ্যা সমাজে জীবন কাটানোর চেয়ে আল্লাহর পথে আত্মত্যাগ করা শ্রেয়। তারা শাসক ও তাদের মিথ্যা উপাস্যদের প্রত্যাখ্যান করে আল্লাহর ওপর ভরসা করে শহর ছেড়ে এক গুহার দিকে রওনা হলো। গুহায় প্রবেশ করার আগে তাদের সাথে থাকা কুকুরটিও তাদের সঙ্গ নিল।",
      "গুহায় প্রবেশ করার পর আল্লাহর নির্দেশে তারা এক গভীর ঘুমে আচ্ছন্ন হলো। কুরআন বর্ণনা করে যে, তারা সেখানে ৩০৯ বছর ঘুমিয়ে কাটিয়েছিল। এই দীর্ঘ সময়ে তারা কোনো ধরনের অনুভূতি বা পরিবর্তন টের পায়নি। আল্লাহ তাদের শরীরকে ক্ষয় থেকে রক্ষা করার জন্য তাদের ডান ও বাম দিকে ফিরিয়ে দিতেন।",
      "দীর্ঘকাল পর তারা যখন ঘুম থেকে উঠল, তখন তাদের মনে হলো, তারা হয়তো এক দিন বা দিনের কিছু অংশ ঘুমিয়েছে। তারা একজনকে খাবার কেনার জন্য শহরে পাঠাল। শহরে গিয়ে লোকটি দেখল, সবকিছু বদলে গেছে—শাসন ব্যবস্থা, মুদ্রা, মানুষের জীবনধারা। তখন তারা বুঝতে পারল যে, আল্লাহ তাদের অলৌকিকভাবে রক্ষা করেছেন। এই ঘটনাটি ছিল পুনরুত্থান এবং আল্লাহর অসীম ক্ষমতার এক জলজ্যান্ত প্রমাণ।"
    ],
    "moral": "ঈমান ও বিশ্বাস রক্ষার জন্য ত্যাগ স্বীকার করলে আল্লাহ অলৌকিকভাবে বান্দাকে রক্ষা করেন। আল্লাহর কুদরত মানুষের ধারণার ঊর্ধ্বে।",
    "source": "পবিত্র কুরআন (সূরা কাহফ: ৯-২৬)।"
  },
  {
    "id": "quraner_golpo_nuh_as_ark",
    "categoryId": "quraner_golpo",
    "title": "নূহ (আঃ)-এর কিস্তি: মহাপ্লাবন ও বিশ্বাসীদের মুক্তি",
    "summary": "হযরত নূহ (আঃ) দীর্ঘ সাড়ে নয়শ বছর ধরে তাঁর গোত্রকে দাওয়াত দিয়েছিলেন, কিন্তু তারা তাঁকে মিথ্যাবাদী বলে প্রত্যাখ্যান করে। আল্লাহর নির্দেশে তিনি এক বিশাল কিস্তি (নৌকা) নির্মাণ করেন এবং মহাপ্লাবনের সময় বিশ্বাসী ও সকল প্রাণীর এক জোড়াকে নিয়ে সেই কিস্তিতে আশ্রয় নিয়ে মুক্তি পান।",
    "paragraphs": [
      "হযরত নূহ (আঃ)-কে আল্লাহ তাঁর গোত্রের কাছে রাসূল হিসেবে পাঠিয়েছিলেন। তিনি দীর্ঘ সাড়ে নয়শ বছর ধরে তাঁর গোত্রের লোকদের এক আল্লাহর ইবাদতের দিকে আহ্বান করেছিলেন। কিন্তু তারা তাঁকে নিয়ে উপহাস করত এবং তাঁর কথা প্রত্যাখ্যান করত। তারা বলত, 'তুমি তো আমাদের মতোই একজন মানুষ, আমরা তোমাকে বিশ্বাস করব কেন?'",
      "দীর্ঘদিন দাওয়াত দিয়ে হতাশ হয়ে নূহ (আঃ) আল্লাহর কাছে ফরিয়াদ করলেন। আল্লাহ তাঁকে একটি বিশাল কিস্তি (নৌকা) তৈরি করার নির্দেশ দিলেন। নূহ (আঃ) যখন কিস্তি বানাচ্ছিলেন, তখন তাঁর গোত্রের নেতারা এসে তাঁকে উপহাস করত এবং বলত, 'আরে! তুমি তো এখন কাঠের মিস্ত্রি হয়ে গেছো!' তিনি শান্তভাবে জবাব দিতেন, 'তোমরা যদি এখন আমাদের নিয়ে উপহাস করো, তবে শিগগিরই আমরা তোমাদের নিয়ে উপহাস করব, যখন আল্লাহর আজাব আসবে।'",
      "আল্লাহর নির্দেশ অনুযায়ী, নির্দিষ্ট সময়ে কিস্তির নির্মাণ কাজ শেষ হলো এবং আজাবের লক্ষণ দেখা গেল। নূহ (আঃ)-কে নির্দেশ দেওয়া হলো, তিনি যেন পৃথিবীর সকল প্রাণী থেকে এক জোড়া (একটি নর ও একটি মাদী) করে কিস্তিতে উঠিয়ে নেন এবং তাঁর পরিবারের যারা ঈমান এনেছে (স্ত্রী ও এক পুত্র ছাড়া) তাদেরও তুলে নেন।",
      "এরপর এক ভয়াবহ মহাপ্লাবন শুরু হলো। আকাশ থেকে অবিরাম বৃষ্টি পড়তে লাগল এবং পৃথিবী থেকে পানি উথলে উঠতে লাগল। অবিশ্বাসীরা সেই প্লাবনে ডুবে গেল। নূহ (আঃ) তাঁর কিস্তিতে বিশ্বাসী ও প্রাণীদের নিয়ে নিরাপদে সেই মহাদুর্যোগ থেকে মুক্তি পান। এটি ছিল আল্লাহর প্রতি ঈমান ও আনুগত্যের ফল।"
    ],
    "moral": "আল্লাহর আনুগত্য ও বিশ্বাসই চূড়ান্ত মুক্তি এনে দিতে পারে। ধৈর্য ও অধ্যবসায় একসময় অবশ্যই ফলপ্রসূ হয়, যদিও পথটি দীর্ঘ ও কঠিন হয়।",
    "source": "পবিত্র কুরআন (সূরা হূদ: ২৫-৪৯; সূরা নূহ: ১-২৮)।"
  },
  {
    "id": "quraner_golpo_maryam_as_birth",
    "categoryId": "quraner_golpo",
    "title": "মরিয়ম (আঃ): বেহেশতী ফল ও ঈসার অলৌকিক জন্ম",
    "summary": "হযরত মরিয়ম (আঃ) ছিলেন আল্লাহর মনোনীত এক পবিত্র নারী, যিনি তাঁর ইবাদত ও পবিত্রতার জন্য সুপরিচিত ছিলেন। আল্লাহর কুদরতে পিতা ছাড়াই পুত্র ঈসা (আঃ)-কে জন্ম দিয়ে তিনি পৃথিবীর সকল অপবাদ ও পরীক্ষার ঊর্ধ্বে উঠে ঈমান ও পবিত্রতার সর্বোচ্চ দৃষ্টান্ত স্থাপন করেন।",
    "paragraphs": [
      "হযরত মরিয়ম (আঃ) ছিলেন ইমরান-এর কন্যা, যাঁকে তাঁর মা আল্লাহর ঘরের খিদমতের জন্য উৎসর্গ করেছিলেন। তিনি তাঁর মামা হযরত জাকারিয়া (আঃ)-এর তত্ত্বাবধানে অত্যন্ত পবিত্র ও আল্লাহভীরু হিসেবে বেড়ে ওঠেন। তাঁর ইবাদতের ঘর ছিল এমন এক জায়গায়, যেখানে অন্য কারো প্রবেশাধিকার ছিল না।",
      "আল্লাহর কুদরতে তিনি তাঁর ইবাদতের স্থানে এমন বে-মৌসুমি ফল দেখতে পেতেন, যা সেই সময়ে পৃথিবীতে পাওয়া যেত না। হযরত জাকারিয়া (আঃ) এই ফল দেখে আশ্চর্য হয়ে জিজ্ঞেস করতেন, 'হে মরিয়ম! এই ফল তুমি কোথা থেকে পেলে?' মরিয়ম (আঃ) বলতেন, 'এগুলো আল্লাহর পক্ষ থেকে। আল্লাহ যাকে ইচ্ছা করেন, তাকে বেহিসাব রিযিক দান করেন।'",
      "একদিন নির্জনে ইবাদত করার সময়, ফেরেশতা জিবরাঈল (আঃ) মানুষের রূপে তাঁর সামনে এসে আল্লাহর পক্ষ থেকে এক পুত্র সন্তানের সুসংবাদ দেন। কুমারী মরিয়ম (আঃ) আশ্চর্য হয়ে জিজ্ঞেস করলেন, 'আমার কীভাবে পুত্র হবে, যখন কোনো পুরুষ আমাকে স্পর্শ করেনি?' উত্তরে ফেরেশতা বললেন, 'এভাবেই। আল্লাহ যা ইচ্ছা সৃষ্টি করেন। তিনি যখন কোনো কিছুর আদেশ করেন, তখন শুধু বলেন 'হও', আর তা হয়ে যায়।'",
      "আল্লাহর কুদরতে তিনি গর্ভধারণ করেন এবং লোকালয় থেকে দূরে এক নির্জন স্থানে চলে যান। সেখানেই এক খেজুর গাছের নিচে তিনি পুত্র ঈসা (আঃ)-কে জন্ম দেন। ক্ষুধা ও যন্ত্রণায় কাতর হলে আল্লাহ তাঁর জন্য খেজুর গাছ থেকে তাজা খেজুর এবং পায়ের নিচ থেকে ঝর্ণাধারা প্রবাহিত করে দেন। এরপর মাত্র কয়েকদিন বয়সী শিশু ঈসা (আঃ) অলৌকিকভাবে কথা বলে মায়ের পবিত্রতার ঘোষণা দেন।"
    ],
    "moral": "আল্লাহর ওপর যার বিশ্বাস অটুট, তিনি তাকে সবচেয়ে কঠিন পরীক্ষা থেকেও অলৌকিকভাবে রক্ষা করেন এবং অপবাদকারীদের সামনে তাঁর সম্মানকে প্রতিষ্ঠিত করেন।",
    "source": "পবিত্র কুরআন (সূরা আলে ইমরান: ৩৫-৪৭; সূরা মারইয়াম: ১৬-৩৪)।"
  },
  {
    "id": "quraner_golpo_firawn_and_musa",
    "categoryId": "quraner_golpo",
    "title": "ফেরাউনের পতন: অহংকার ও লালের পথে করুণ পরিণতি",
    "summary": "ফেরাউন ছিল পৃথিবীর বুকে সবচেয়ে বড় স্বৈরাচারী শাসক, যে নিজেকে খোদা দাবি করত। আল্লাহ হযরত মূসা (আঃ)-কে তার কাছে দাওয়াত দিয়ে পাঠান। কিন্তু ফেরাউন অহংকারের বশবর্তী হয়ে তা প্রত্যাখ্যান করায়, সে ও তার বিশাল বাহিনী নীল নদে ডুবে করুণভাবে ধ্বংস হয়েছিল।",
    "paragraphs": [
      "ফেরাউন ছিল অত্যন্ত দাম্ভিক ও ক্ষমতাধর শাসক। সে নিজেকে পৃথিবীর প্রভু বলে দাবি করত এবং বনি ইসরাইলদের ওপর অমানবিক অত্যাচার করত। আল্লাহ হযরত মূসা (আঃ)-কে তাঁর ভাই হারুন (আঃ)-কে সাথে নিয়ে ফেরাউনের কাছে দাওয়াত দিতে পাঠান। আল্লাহ তাদের নরম ভাষায় কথা বলার নির্দেশ দেন, যাতে সে উপদেশ গ্রহণ করতে পারে।",
      "মূসা (আঃ) ফেরাউনের কাছে গিয়ে এক আল্লাহর ইবাদত করার এবং বনি ইসরাইলদের মুক্তি দেওয়ার আহ্বান জানালেন। কিন্তু ফেরাউন অহংকার করল এবং মূসা (আঃ)-কে জাদু করার অপবাদ দিল। সে নিজের জাদুগরদের ডেকে আনল মূসা (আঃ)-এর সাথে প্রতিযোগিতার জন্য।",
      "প্রতিযোগিতায় মূসা (আঃ)-এর লাঠি যখন বিশাল সাপে পরিণত হলো এবং ফেরাউনের জাদুগরদের সমস্ত জাদুকে গিলে ফেলল, তখন জাদুকরেরা সত্য বুঝতে পেরে সাথে সাথে সিজদায় লুটিয়ে পড়ে ঈমান আনল। কিন্তু ফেরাউন তার অহংকার ধরে রাখল এবং ঈমান আনল না।",
      "এরপর ফেরাউন ও তার লোকেরা মূসা (আঃ) এবং তাঁর অনুসারীদের ওপর অত্যাচার বাড়িয়ে দিল। অবশেষে আল্লাহ মূসা (আঃ)-কে নির্দেশ দিলেন তাঁর অনুসারীদের নিয়ে রাতের অন্ধকারে মিশর ত্যাগ করতে। ফেরাউন তার বিশাল বাহিনী নিয়ে তাঁদের পিছু নিল।",
      "মূসা (আঃ) যখন লোহিত সাগরের কাছে পৌঁছালেন, তখন সামনে সাগর আর পেছনে ফেরাউনের বাহিনী। আল্লাহর নির্দেশে মূসা (আঃ) তাঁর লাঠি দিয়ে সাগরের ওপর আঘাত করলেন। সাথে সাথে সাগর দ্বিখণ্ডিত হয়ে মাঝখানে শুকনা রাস্তা তৈরি হলো। মূসা (আঃ) তাঁর অনুসারীদের নিয়ে নিরাপদে পার হয়ে গেলেন। কিন্তু ফেরাউন যখন সেই রাস্তা ধরে সাগরের মাঝে পৌঁছাল, তখন আল্লাহর আদেশে পানি দুই পাশ থেকে এক হয়ে গেল এবং ফেরাউন তার অহংকার ও দম্ভের সাথে তার পুরো বাহিনী নিয়ে নীল নদে করুণভাবে ডুবে ধ্বংস হলো।"
    ],
    "moral": "অহংকার মানুষকে ধ্বংসের দিকে নিয়ে যায়। আল্লাহর ক্ষমতা চিরন্তন, আর তাঁর অবাধ্যতার ফল সর্বদা করুণ ও অনিবার্য।",
    "source": "পবিত্র কুরআন (সূরা ত্বাহা: ২৫-৮০; সূরা শুআরা: ১০-৬৬)।"
  },
  {
    "id": "musa-as-bani-israel-complete-journey",
    "categoryId": "quraner_golpo",
    "title": "মূসা (আ.) ও বনী ইসরাঈলের সম্পূর্ণ যাত্রা: মুক্তি থেকে পথভ্রষ্টতা",
    "summary": "লোহিত সাগর বিভক্ত হওয়া, মরুভূমিতে আল্লাহর নেয়ামত, সোনার বাছুর পূজা এবং বনী ইসরাঈলের বারবার অবাধ্যতার সম্পূর্ণ ইতিহাস—যা আল্লাহর অসীম রহমত এবং মানুষের অকৃতজ্ঞতার এক জীবন্ত দলিল।",
    "paragraphs": [
      "আল্লাহর নবী মূসা (আ.) যখন ফিরাউন ও তার সভাসদদের কাছে বহু মু'জিযা দেখানোর পরও তারা অহংকার ত্যাগ করল না, তখন আল্লাহ তাঁকে আদেশ দিলেন বনী ইসরাঈলকে নিয়ে রাতের আঁধারে মিশর ত্যাগ করতে। ফিরাউনের চরম অত্যাচার থেকে মুক্তি পেতে হাজার হাজার বনী ইসরাঈলীকে সাথে নিয়ে মূসা (আ.) আল্লাহর নির্দেশমতো চলতে শুরু করলেন।",
      "ফিরাউন এই খবর জানতে পেরে ক্রোধে উন্মত্ত হলো। তার বিশাল সেনাবাহিনী নিয়ে সে মূসা (আ.) ও তাঁর অনুসারীদের পিছু ধাওয়া করল। সকালে যখন বনী ইসরাঈলের লোকেরা দেখল, তাদের সামনে উত্তাল লোহিত সাগর এবং পেছনে ফিরাউনের হিংস্র বাহিনী, তখন তারা ভয়ে চিৎকার করে উঠল:",
      "'আমরা তো এবার সত্যিই ধরা পড়ে গেলাম!'",
      "কিন্তু হযরত মূসা (আ.)-এর বিশ্বাস ছিল অটল। তিনি বললেন:",
      "'كَلَّا إِنَّ مَعِيَ رَبِّي سَيَهْدِينِ'",
      "(অর্থাৎ, 'কখনোই নয়! আমার সাথে আমার রব আছেন। তিনি অবশ্যই আমাকে পথ দেখাবেন।')",
      "ঠিক সেই মুহূর্তে আল্লাহ তায়ালা ওহী পাঠালেন:",
      "'তোমার লাঠি দিয়ে সাগরে আঘাত করো।'",
      "মূসা (আ.) লাঠি দিয়ে সাগরে আঘাত করার সাথে সাথেই এক অলৌকিক ঘটনা ঘটল। সাগরের পানি দুই ভাগে বিভক্ত হয়ে গেল এবং মাঝখানে শুকনো পথ তৈরি হয়ে গেল। বনী ইসরাঈল সেই শুকনো পথ দিয়ে নিরাপদে সাগর পার হয়ে গেল।",
      "তাদের দেখাদেখি ফিরাউনও তার অহংকারবশত সেই পথে প্রবেশ করল। যখন ফিরাউনের বিশাল সেনাবাহিনী সাগরের মাঝখানে, তখন আল্লাহর হুকুমে সাগরের পানি পাহাড়ের মতো ভেঙে পড়ে একত্রিত হয়ে গেল। ফিরাউন এবং তার সেনাবাহিনী সেই উত্তাল সাগরের পানিতে ডুবে ধ্বংস হয়ে গেল। এভাবে অত্যাচারীর পতন ঘটল এবং সত্যের বিজয় হলো।",
      "ফিরাউনের হাত থেকে মুক্তি পাওয়ার পর বনী ইসরাঈল প্রবেশ করল তিয়াহ মরুভূমিতে। সেখানে তাদের খাদ্য ও পানির তীব্র সঙ্কট দেখা দিল। আল্লাহ তখন তাদের জন্য অলৌকিকভাবে খাবার পাঠালেন—'মান্না' ও 'সালওয়া' (আসমানী মিষ্টি খাবার ও এক প্রকার পাখি) এবং মূসা (আ.)-এর লাঠির আঘাতে পাথর থেকে বারোটি ঝর্ণা প্রবাহিত হলো।",
      "কিন্তু এতসব নেয়ামত পাওয়ার পরও বনী ইসরাঈল বারবার অভিযোগ করত এবং তাদের পূর্বের খাবার ও জীবনযাত্রার জন্য আকাঙ্ক্ষা প্রকাশ করত, যা তাদের চরম অকৃতজ্ঞতা প্রমাণ করে।",
      "এরপর আল্লাহ মূসা (আ.)-কে সত্তর জন নেতা নিয়ে সিনাই পর্বতে আসতে বললেন, যেখানে তাঁকে তাওরাত কিতাব দান করা হবে। মূসা (আ.) চল্লিশ দিনের জন্য পর্বত আরোহণে গেলেন।",
      "এই সময়টিতেই ঘটল তাদের ইতিহাসের সবচেয়ে বড় পথভ্রষ্টতা। সামিরী নামক এক ব্যক্তি তাদের সোনার অলঙ্কার গলিয়ে একটি সোনার বাছুর তৈরি করল এবং দাবি করল যে এটিই তাদের ইলাহ। মূসা (আ.) ফিরে এসে দেখলেন, তাঁর কওম আবার মূর্তিপূজায় লিপ্ত হয়েছে।",
      "ক্রোধে তিনি তাওরাতের ফলকগুলো ভেঙে দিলেন এবং তাঁর ভাই হারুন (আ.)-এর প্রতি অসন্তোষ প্রকাশ করলেন। এই চরম পাপের জন্য তারা আল্লাহর কঠোর শাস্তির সম্মুখীন হয়েছিল।",
      "পরবর্তীতে আল্লাহ যখন তাদের ফিলিস্তিনের পবিত্র ভূমিতে (বাইতুল মুকাদ্দাস) প্রবেশ করতে বললেন, সেখানে শক্তিশালী আমালেকা জাতি ছিল। কিন্তু তারা ভীত হয়ে মূসা (আ.)-এর আদেশ অমান্য করল এবং যুদ্ধে যেতে অস্বীকার করল। তারা মূসা (আ.)-কে বলল:",
      "'তুমি এবং তোমার রব গিয়ে যুদ্ধ করো, আমরা এখানেই বসে রইলাম।'",
      "এই চরম অবাধ্যতার শাস্তি হিসেবে আল্লাহ তাদের সেই তিয়াহ মরুভূমিতে চল্লিশ বছর পর্যন্ত উদ্ভ্রান্তের মতো ঘুরতে থাকার শাস্তি দিলেন।",
      "মূসা (আ.) তাঁর ভাই হারুন (আ.) এবং সেই প্রজন্মের অধিকাংশ লোকের মৃত্যু সেই মরুভূমিতেই ঘটে। এই দীর্ঘ কষ্টের সময় তিনি আল্লাহকে সর্বদা স্মরণ করতেন এবং পথপ্রদর্শনের জন্য দু'আ করতেন। অবশেষে, মূসা (আ.)-ও চল্লিশ বছরের সেই মেয়াদ শেষ হওয়ার আগেই পবিত্র ভূমির কাছাকাছি স্থানে ইন্তেকাল করেন।",
      "মূসা (আ.)-এর মৃত্যুর পরও বনী ইসরাঈলরা তাদের প্রতিশ্রুত ভূমিতে প্রবেশ করতে সক্ষম হয়েছিল, তবে তারা বারবার আল্লাহর নির্দেশ অমান্য করেছে। প্রজন্মের পর প্রজন্ম ধরে তারা নবীদের অস্বীকার, আল্লাহর কিতাবের অপব্যাখ্যা এবং সামাজিক দুর্নীতিতে লিপ্ত হয়েছে।",
      "এই পথভ্রষ্টতার ধারাবাহিকতা হলো—আল্লাহর পক্ষ থেকে মুক্তি পেয়েও তারা নিজেদের অবাধ্যতা ও অকৃতজ্ঞতার কারণে দীর্ঘ কষ্টের পথে পর্যবসিত হলো, এবং সেই প্রবণতা আজও বিভিন্নভাবে তাদের ইতিহাসে পরিলক্ষিত হয়।"
    ],
    "moral": "আল্লাহর নেয়ামত পাওয়ার পরও অকৃতজ্ঞতা ও অবাধ্যতা মানুষকে ধ্বংসের দিকে নিয়ে যায়। মুক্তি পাওয়ার পরও যারা আল্লাহর পথ থেকে বিচ্যুত হয়, তারা দীর্ঘ কষ্ট ও পথভ্রষ্টতার শিকার হয়। আল্লাহর ওপর পূর্ণ বিশ্বাস এবং তাঁর আদেশ মেনে চলাই প্রকৃত সফলতার পথ।",
    "source": "সূরা ত্বা-হা: ৭৭-৯৭; সূরা বাকারাহ: ৫১-৯৩; সূরা মায়েদা: ২০-২৬।"
  },
  {
    "id": "saleh-as-samud-nation-camel",
    "categoryId": "quraner_golpo",
    "title": "সালেহ (আ.) ও সামূদ জাতি: আল্লাহর উটনী এবং অহংকারের পরিণতি",
    "summary": "নবী সালেহ (আ.)-এর কওম সামূদ জাতি ছিল অত্যন্ত শক্তিশালী ও সমৃদ্ধ। তারা পাহাড় কেটে প্রাসাদ বানাত কিন্তু আল্লাহর নেয়ামত পেয়েও মূর্তিপূজা করত। আল্লাহ তাদের জন্য পাহাড় থেকে এক উটনী বের করে মু'জিযা দেখালেন, কিন্তু তারা সেই উটনীকে হত্যা করে চরম সীমালঙ্ঘন করল এবং ভয়াবহ শাস্তির শিকার হলো।",
    "paragraphs": [
      "নবী সালেহ (আ.)-কে আল্লাহর পক্ষ থেকে সামূদ জাতির কাছে পাঠানো হয়েছিল। সামূদ জাতি ছিল খুবই শক্তিশালী এবং ধন-সম্পদে সমৃদ্ধ। তারা পাহাড় খোদাই করে সুরম্য প্রাসাদ ও বসতি নির্মাণ করত এবং তাদের শারীরিক ক্ষমতা নিয়ে ছিল প্রচণ্ড অহংকার। আল্লাহর নেয়ামত পেয়েও তারা এক আল্লাহর ইবাদত ছেড়ে মূর্তিপূজায় লিপ্ত হয়েছিল।",
      "সালেহ (আ.) দীর্ঘকাল ধরে তাদের আল্লাহর একত্বের দিকে আহ্বান জানান। তিনি তাদের অহংকার ত্যাগ করে সততা অবলম্বন করতে বলেন এবং বলেন:",
      "يَا قَوْمِ اعْبُدُوا اللَّهَ مَا لَكُم مِّنْ إِلَٰهٍ غَيْرُهُ",
      "অর্থাৎ, হে আমার কওম! তোমরা আল্লাহর ইবাদত করো। তিনি ছাড়া তোমাদের আর কোনো উপাস্য নেই। [সূরা হূদ: ৬১]",
      "কিন্তু তারা সালেহ (আ.)-কে উপহাস করত এবং তাঁকে মিথ্যাবাদী বলত।",
      "তারা আল্লাহর প্রতি ঈমান আনার পরিবর্তে সালেহ (আ.)-এর কাছে একটি অলৌকিক নিদর্শন চাইল। তারা বলল, যদি তিনি তাদের চোখের সামনে পাহাড়ের বুক থেকে একটি জীবন্ত উটনী বের করে আনতে পারেন, তবেই তারা ঈমান আনবে।",
      "সালেহ (আ.) আল্লাহর কাছে প্রার্থনা করলেন। আল্লাহর নির্দেশে পাহাড়ের বুক চিরে প্রসবকাল আসন্ন এক উটনী বের হয়ে এলো, যা ছিল এক সুস্পষ্ট মু'জিযা। এই উটনীকে আল্লাহ 'নাকাতুল্লাহ' (আল্লাহর উটনী) নামে অভিহিত করলেন। এই মু'জিযা দেখে কওমের কিছু লোক ঈমান আনল, কিন্তু অধিকাংশ লোকই তাদের অহংকারে অটল রইল।",
      "সালেহ (আ.) তখন তাঁর কওমকে দুটি শর্ত দিলেন: প্রথমত, এই উটনীকে স্বাধীনভাবে চারণভূমিতে বিচরণ করতে দিতে হবে; দ্বিতীয়ত, জনপদের পানির একটি ঝর্ণা একদিন সম্পূর্ণ উটনীর জন্য এবং পরের দিন সম্পূর্ণ জনপদের জন্য নির্দিষ্ট থাকবে। এই উটনীটি এক দিনে যে পরিমাণ পানি পান করত, তা ছিল পুরো কওমের সমান।",
      "প্রথম দিকে সামূদ জাতি এই শর্ত মেনে নিলেও, পরবর্তীতে তারা উটনীর কারণে পানির ভাগাভাগিকে তাদের জন্য চরম বোঝা মনে করতে শুরু করল। তারা ষড়যন্ত্র শুরু করল এবং একটি দল উটনীটিকে হত্যার পরিকল্পনা করল।",
      "কওমের সবচেয়ে নিকৃষ্ট ও শক্তিশালী নয় জন ব্যক্তি সেই ষড়যন্ত্রে অংশ নিল এবং এক গোপন আক্রমণে তারা উটনীটিকে নির্মমভাবে হত্যা করল।",
      "উটনীর মৃত্যুর খবর শুনে সালেহ (আ.) অত্যন্ত ব্যথিত হলেন। তিনি তাঁর কওমের সীমালঙ্ঘনের জন্য আল্লাহর শাস্তির ভয়াবহতা তাদের সামনে তুলে ধরলেন। সালেহ (আ.) তাদের সতর্ক করে বললেন:",
      "'তোমরা তোমাদের ঘরে মাত্র তিন দিন আনন্দ করে নাও। এরপরই আল্লাহর শাস্তি নেমে আসবে। এই ওয়াদা মিথ্যা হবে না।'",
      "তিন দিন পর, সেই প্রতিশ্রুতি অনুযায়ী, এক ভয়ংকর ঘটনা ঘটল। প্রথমে তাদের মুখমণ্ডলগুলো ক্রমান্বয়ে হলুদ, তারপর লাল এবং শেষে কালো হয়ে গেল।",
      "চতুর্থ দিনে যখন শাস্তি নেমে এলো, তখন আল্লাহর নির্দেশে আসমান থেকে এক ভয়ংকর বিকট শব্দ (সাইহা) এবং প্রচণ্ড ভূকম্পন (রাজফা) শুরু হলো। সেই শব্দ ও কম্পনে সামূদ জাতির অহংকারী বসতিগুলো ধ্বংসস্তূপে পরিণত হলো।",
      "তারা এমনভাবে ধ্বংস হলো যে, তাদের ঘরের ভেতরেই তারা উপুড় হয়ে মৃত অবস্থায় পড়ে রইল, যেন তাদের সেখানে কেউই ছিল না।",
      "আল্লাহ তা'আলা তাঁর নবী সালেহ (আ.) এবং তাঁর প্রতি ঈমান আনা মুমিনদের সেই ভয়ংকর আযাব থেকে রক্ষা করলেন। এই ঘটনা প্রমাণ করে যে, আল্লাহর নিদর্শনকে অস্বীকার করা এবং সীমালঙ্ঘন করার পরিণতি অত্যন্ত ভয়াবহ।"
    ],
    "moral": "আল্লাহর নেয়ামত ও ক্ষমতা থাকা সত্ত্বেও অহংকার ও সীমালঙ্ঘন মানুষকে ধ্বংসের দিকে নিয়ে যায়। আল্লাহর নিদর্শনকে অস্বীকার করা এবং তাঁর আদেশ লঙ্ঘন করার পরিণতি অত্যন্ত ভয়াবহ। প্রকৃত শক্তি ও সম্পদ আল্লাহর আনুগত্যেই নিহিত।",
    "source": "সূরা আশ-শু'আরা: ১৪১-১৫৯; সূরা হূদ: ৬১-৬৮; সূরা আল-আ'রাফ: ৭৩-৭৯।"
  }
]