[
  {
    "id": "abu_bakr_siddiq",
    "categoryId": "sahabider_jibon",
    "title": "আবু বকর সিদ্দিক (রাঃ)",
    "paragraphs": [
      "হযরত আবু বকর (আরবি: أبو بكر الصديق; জন্ম: ২৭ অক্টোবর ৫৭৩ – মৃত্যু: ২৩ আগস্ট ৬৩৪) ছিলেন একজন আরব রাজনৈতিক ও ধর্মীয় নেতা যিনি রাশিদুন খিলাফত প্রতিষ্ঠা করেন এবং ৬৩২ সাল থেকে ৬৩৪ সাল পর্যন্ত ইসলামের প্রথম খলিফা হিসেবে শাসন করেন।",
      "**বংশ ও উপাধি:** আবু বকরের পূর্ণ নাম ছিল আব্দুল্লাহ ইবনে আবি কুহাফা। আরবী ভাষায় আব্দুল্লাহ (আরবি: عَبْدُ ٱللهِ) নামের অর্থ 'আল্লাহর বান্দা।' শৈশবে উটের প্রতি বিশেষ ভালোবাসার কারণে তাকে 'আবু বকর' ডাকনাম দেওয়া হয় যার অর্থ উটের বাছুরের পিতা।",
      "**উপাধি:** ইসলাম গ্রহণের আগে তার উপাধি ছিল আতিক (আরবি: عتيق) যার অর্থ 'রক্ষাকারী'। লাইলাতুল মেরাজের ঘটনায় রাসূল (সাঃ)-কে বিশ্বাস করার পর রাসূল তাকে আল-সিদ্দিক (আরবি: الصديق) উপাধি দেন যার অর্থ 'সত্যবাদী'।",
      "**জন্ম ও প্রারম্ভিক জীবন:** আবু বকর ৫৭৩ খ্রিস্টাব্দে মক্কায় কুরাইশ উপজাতির বনু তাইম শাখায় একটি ধনী পরিবারে জন্মগ্রহণ করেন। তার পিতা ছিলেন উসমান (লাকাব আবু কুহাফা) এবং মা ছিলেন সালমা বিনতে শাখার (উম্মে উল-খায়ের)।",
      "**বংশতালিকাবিদ:** আবু বকর ছিলেন তার সময়ের প্রসিদ্ধ আরব বংশতালিকাবিদ। শুধু কুরাইশের ইতিহাসই নয়, অন্যান্য আরব গোত্রের ইতিহাস সম্পর্কেও তার বিশেষজ্ঞ জ্ঞান ছিল। রাসূল (সাঃ) বলেছেন: 'নিশ্চয়ই আবু বকর কুরাইশদের বংশ সম্পর্কে সবচেয়ে জ্ঞানী।'",
      "**প্রাথমিক জীবন:** ইসলাম গ্রহণের আগে আবু বকর হানিফ ধর্মকে অনুশীলন করতেন এবং কখনও প্রতিমা পূজা করতেন না। তিনি একজন ধনী ব্যবসায়ী ছিলেন এবং মক্কার সম্মানিত ব্যক্তি ছিলেন।",
      "**ইসলাম গ্রহণ:** আবু বকর ব্যবসায়ী হওয়ায় তিনি সিরিয়া সফর করতেন। একটি যাত্রার সময় এক বৃদ্ধ তাকে একজন নবীর আগমনের কথা বলেন। রাসূল (সাঃ) নবুয়ত ঘোষণা করলে আবু বকর তাৎক্ষণিকভাবে ইসলাম গ্রহণ করেন। তিনি ছিলেন ইসলাম গ্রহণকারী প্রথম স্বাধীন পুরুষ।",
      "**দাস মুক্তি:** আবু বকর দাসদের প্রতি সহানুভূতি অনুভব করতেন। তিনি বিলাল ইবনে রাবাহ, আবু ফুকাইয়া, আম্মার ইবনে ইয়াসির সহ আটজন দাস-দাসী কিনে মুক্ত করেন এবং তাদের স্বাধীনতার জন্য ৪০,০০০ দিনার ব্যয় করেন। তার পিতা জিজ্ঞাসা করেন কেন তিনি শক্তিশালী দাস মুক্ত করেননি। আবু বকর উত্তর দেন: 'আমি ঈশ্বরের জন্য দাসদের মুক্ত করছি, নিজের জন্য নয়।'",
      "**কুরাইশদের নিপীড়ন:** ৬১৩ সালে রাসূল (সাঃ) প্রকাশ্যে ইসলামের দাওয়াত দিতে শুরু করলে আবু বকর প্রথম প্রকাশ্য ভাষণ দেন। কুরাইশ যুবকরা তাকে মারধর করে জ্ঞান হারিয়ে ফেলা পর্যন্ত। এই ঘটনার পর তার মা ইসলাম গ্রহণ করেন।",
      "**আবিসিনিয়ায় হিজরত:** ৬১৪ সালে নির্যাতন বৃদ্ধি পেলে তিনি আবিসিনিয়ায় হিজরত করেন। নাজাশি তাদের নিরাপত্তা দেন। ৬১৯-৬২০ সালে তিনি মক্কায় ফিরে আসেন।",
      "**মদিনায় হিজরত:** ৬২২ সালে কুরাইশরা রাসূল (সাঃ)-কে হত্যার চেষ্টা করে। রাসূল আবু বকরকে সাথে নিয়ে জাবাল থাওয়ারের গুহায় আশ্রয় নেন। তিন দিন তিন রাত গুহায় থাকার পর তারা মদিনায় যাত্রা করেন। এ সময় কুরআনের আয়াত নাযিল হয়: 'যদি তোমরা তাকে সাহায্য না করো, তবে আল্লাহ তাকে সাহায্য করেছেন যখন তিনি ছিলেন দুজনের মধ্যে দ্বিতীয়, যখন তারা গুহায় ছিলেন।' (সূরা তাওবা: ৪০)",
      "**মদিনায় জীবন:** মদিনায় রাসূল (সাঃ) মসজিদে নববী নির্মাণের সিদ্ধান্ত নেন এবং জমির দাম আবু বকর প্রদান করেন। আবু বকরের সাথে খায়েরিজাহ বিন জাইদ আনসারির সাথে ভ্রাতৃত্ব বন্ধন করা হয়। তিনি মদিনায় কাপড়ের ব্যবসা শুরু করেন। ৬২৩ সালে তার কন্যা আয়েশা (রাঃ) রাসূল (সাঃ)-এর সাথে বিবাহবন্ধনে আবদ্ধ হন।",
      "**বদরের যুদ্ধ:** ৬২৪ সালে আবু বকর বদরের যুদ্ধে রাসূল (সাঃ)-এর তাঁবুর রক্ষী হিসেবে কাজ করেন। আলী (রাঃ) বলেন: 'আবু বকর সবচেয়ে সাহসী, টানা তলোয়ার নিয়ে রাসূলকে রক্ষা করেন।'",
      "**উহুদ ও খন্দকের যুদ্ধ:** ৬২৫ সালে উহুদের যুদ্ধে তিনি অংশ নেন এবং আহত হন। যুদ্ধ শুরু হওয়ার আগে, তার ছেলে আব্দুর রহমান, সেই সময় এখনও অমুসলিম এবং কুরাইশদের পক্ষে লড়াই করতে এগিয়ে আসে। ৬২৭ সালে তিনি খন্দকের যুদ্ধে অংশ নেন এবং পরিখা খননে সহায়তা করেন।",
      "**হুদায়বিয়ার সন্ধি:** ৬২৮ সালে তিনি হুদায়বিয়ার সন্ধিতে অংশ নেন এবং সাক্ষী হিসেবে এতে স্বাক্ষর করেন। উমর সন্ধির শর্তে অসন্তুষ্ট হয়ে আবু বকরের কাছে আসেন। আবু বকর তাকে বোঝান এবং বলেন: 'তিনি আল্লাহর রাসূল এবং তিনি তাঁর রবের অবাধ্য নন।'",
      "**মক্কা বিজয়:** ৬৩০ সালে মক্কা বিজয়ের সময় আবু বকর রাসূল (সাঃ)-এর সাথে ছিলেন। তার পিতা আবু কুহাফা তখনও অমুসলিম ছিলেন। রাসূল (সাঃ) বলেন: 'আপনি আপনার পিতাকে তাঁর ঘরে রেখে আসতে পারতেন, আমি নিজেই তাঁর কাছে যেতাম।' আবু কুহাফা ইসলাম গ্রহণ করেন এবং আবু বকর খুশিতে কাঁদেন।",
      "**তাবুক অভিযান:** ৬৩০ সালে তাবুক অভিযানে আবু বকর তার সমস্ত সম্পদ দান করেন। রাসূল (সাঃ) জিজ্ঞাসা করেন: 'তুমি তোমার পরিবারের জন্য কী রেখে এসেছ?' আবু বকর উত্তর দেন: 'আমি তাদের জন্য আল্লাহ ও তাঁর রাসূলকে রেখে এসেছি।'",
      "**আমির-উল-হজ্জ:** ৬৩১ সালে রাসূল (সাঃ) আবু বকরকে আমির-উল-হজ্জ (হজ্জের নেতা) হিসেবে নিযুক্ত করেন এবং তিনশ মুসলমানের একটি প্রতিনিধিদল নিয়ে মক্কায় পাঠান। আবু বকর হজ্জ অনুষ্ঠানে সভাপতিত্ব করেন এবং আলী রাসূল (সাঃ)-এর পক্ষ থেকে সূরা তাওবাহর একটি অংশ ঘোষণা করেন।",
      "**রাসূলের শেষ দিন:** রাসূল (সাঃ)-এর শেষ দিনগুলিতে তিনি আবু বকরকে নামাযের ইমামতি করতে বলেন। রাসূল বলেন: 'আবু বকরের দরজা ছাড়া মসজিদের দিকে যাওয়ার সমস্ত দরজা বন্ধ করে দাও, কারণ আমি তার চেয়ে ভাল বন্ধু আর কেউ নেই।'",
      "**রাসূলের মৃত্যু:** রাসূল (সাঃ)-এর মৃত্যুর পর মুসলিম সম্প্রদায় গভীর ধাক্কা খায়। উমর বিশেষভাবে প্রভাবিত হন এবং ঘোষণা করেন যে রাসূল মারা যাননি। আবু বকর মদিনায় ফিরে এসে উমরকে শান্ত করেন এবং মসজিদে সমবেত ব্যক্তিদের উদ্দেশে বলেন: 'কেউ যদি মুহাম্মাদের উপাসনা করে, তবে মুহাম্মাদ মারা গেছেন। যদি কেউ আল্লাহর উপাসনা করে, আল্লাহ জীবিত, অমর।'",
      "**কুরআনের আয়াত:** এরপর তিনি কুরআন থেকে তিলাওয়াত করেন: 'মুহাম্মাদ একজন রাসুল ছাড়া আর কিছুই নন এবং তার পূর্বে অনেক রাসুল মারা গেছেন।' (সূরা আল ইমরান: ১৪৪)",
      "**সাকীফায় নির্বাচন:** রাসূল (সাঃ)-এর মৃত্যুর পর সাকীফায় সমাবেশ অনুষ্ঠিত হয়। আনসাররা তাদের মধ্য থেকে নেতা নির্বাচন করতে চাইলে আবু বকর ও উমর সেখানে যান। আবু বকর বলেন যে উত্তরাধিকার কুরাইশদের মধ্য থেকে হতে হবে। উমর আবু বকরের প্রতি আনুগত্যের শপথ নেন এবং সবাই অনুসরণ করেন।",
      "**খলিফার শপথ:** খলিফার দায়িত্ব গ্রহণের পর আবু বকর বলেন: 'আমি তোমাদের মধ্যে সেরা নই। আমি যদি ভাল করি, আমাকে সাহায্য করো; আর আমি যদি অন্যায় করি, তাহলে আমাকে ঠিক করিয়ে দাও। যতক্ষণ আমি আল্লাহ ও তাঁর রাসূলের আনুগত্য করি ততক্ষণ আমার আনুগত্য করো।'",
      "**রিদ্দার যুদ্ধ:** আবু বকরের নির্বাচনের পর বেশ কয়েকটি আরব উপজাতি বিদ্রোহ শুরু করে এবং যাকাত দিতে অস্বীকার করে। আবু বকর দৃঢ়তার সাথে বলেন: 'যারা নামায ও যাকাতের মধ্যে পার্থক্য করে, আমি তাদের বিরুদ্ধে যুদ্ধ করব।'",
      "**কুরআন সংরক্ষণ:** ইয়ামামার যুদ্ধে অনেক হাফিয শহীদ হওয়ায় উমর আবু বকরকে কুরআন লিখিত আকারে সংকলনের পরামর্শ দেন। আবু বকর প্রথমে দ্বিধাগ্রস্ত ছিলেন কিন্তু পরে রাজি হন এবং যায়েদ ইবনে সাবিতকে এই কাজের দায়িত্ব দেন।",
      "**পারস্য ও সিরিয়ায় অভিযান:** আরব একত্রিত হওয়ার পর আবু বকর বাইজেন্টাইন ও সাসানীয় সাম্রাজ্যে অভিযান পাঠান। ৬৩৩ সালে ইরাক ও ফিলিস্তিনে বাহিনী প্রেরণ করা হয় যা বেশ কয়েকটি শহর দখল করে।",
      "**মৃত্যু:** ৬৩৪ সালের ২৩ আগস্ট আবু বকর অসুস্থ হয়ে পড়েন এবং তার প্রচণ্ড জ্বর হয়। মৃত্যুর আগে তিনি আলী (রাঃ)-কে অনুরোধ করেন যেন তিনি তার গোসল করান। তিনি উমর (রাঃ)-কে তার উত্তরসূরি হিসেবে মনোনীত করেন এবং উসমান (রাঃ)-কে দিয়ে তার শেষ ইচ্ছা লিখিয়ে নেন।",
      "**দাফন:** উমর তার জানাযার নামাযের নেতৃত্ব দেন এবং তাকে রাসূল (সাঃ)-এর কবরের পাশে সমাহিত করা হয়।"
    ],
    "moral": "আবু বকর (রাঃ)-এর জীবন প্রমাণ করে যে সত্যের পথে দৃঢ়তা, ত্যাগ, দানশীলতা এবং রাসূলের প্রতি ভালোবাসা সর্বোচ্চ মর্যাদা এনে দেয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর"
  },
  {
    "id": "umar_ibn_khattab",
    "categoryId": "sahabider_jibon",
    "title": "উমর ইবনুল খাত্তাব (রাঃ)",
    "paragraphs": [
      "হযরত উমর ইবনুল খাত্তাব (আরবি: عُمَر بْن الْخَطَّاب; জন্ম: ৫৮৪ – মৃত্যু: ৬৪৪) ছিলেন ইসলামের দ্বিতীয় খলিফা এবং 'আল-ফারুক' উপাধিপ্রাপ্ত। তিনি ছিলেন ন্যায়বিচার ও শক্তির প্রতীক।",
      "**বংশ ও প্রাথমিক জীবন:** উমর (রাঃ) ৫৮৪ খ্রিস্টাব্দে মক্কায় কুরাইশ বংশের বনু আদি গোত্রে জন্মগ্রহণ করেন। তাঁর পিতা খাত্তাব ইবনে নুফায়েল ছিলেন কুরাইশের সম্মানিত ব্যক্তি। উমরের শৈশব ছিল অত্যন্ত কঠিন। তিনি বলেছেন: 'আমার পিতা আমাকে মরুভূমিতে উট চরাতে পাঠাতেন। যদি কোনো উট হারিয়ে যেত, তিনি আমাকে মারধর করতেন।' এই কঠোর জীবন তাঁকে শক্তিশালী ও ধৈর্যশীল করে তুলেছিল। তিনি ছিলেন ৬ ফুট ৩ ইঞ্চি লম্বা এবং অত্যন্ত শক্তিশালী। সেই যুগে পুরো কুরাইশে মাত্র ১৭ জন লিখতে-পড়তে জানতেন, উমর (রাঃ) ছিলেন তাঁদের একজন। তিনি কবিতা, তীরন্দাজি, অশ্বারোহণ এবং কুস্তিতে পারদর্শী ছিলেন। যুবক উমর একজন সফল ব্যবসায়ী হয়ে ওঠেন এবং কুরাইশরা তাঁকে বিচারক ও সালিশকারী হিসেবে নিয়োগ দিত।",
      "**ইসলাম গ্রহণ, বোনের রক্ত ও কুরআনের আলো:** ৬১৬ খ্রিস্টাব্দ। ৩৯ বছর বয়সী উমর ছিলেন ইসলামের কট্টর শত্রু। একদিন তিনি তলোয়ার হাতে বের হলেন রাসূল (সাঃ)-কে হত্যা করতে। পথে তাঁর বন্ধু নাইম ইবনে আবদুল্লাহ (রাঃ) তাঁকে থামিয়ে বললেন:",
      "'উমর! তুমি কি জানো তোমার নিজের বোন ফাতিমা এবং ভগ্নিপতি সাঈদ ইবনে যায়েদ মুসলমান হয়ে গেছে?'",
      "উমর রাগে জ্বলে উঠলেন এবং সোজা বোনের বাড়িতে গেলেন। সেখানে খাব্বাব (রাঃ) কুরআন তিলাওয়াত করছিলেন। উমর দরজায় কড়া নাড়লে খাব্বাব লুকিয়ে গেলেন এবং ফাতিমা কুরআনের পাতা লুকালেন। উমর ঘরে ঢুকে জিজ্ঞেস করলেন কী হচ্ছে। সাঈদ সাহসের সাথে স্বীকার করলেন যে তারা মুসলমান হয়েছেন। উমর রাগে সাঈদকে মারতে লাগলেন। ফাতিমা স্বামীকে বাঁচাতে এগিয়ে এলে উমর তাঁকেও আঘাত করলেন। ফাতিমার মুখ থেকে রক্ত ঝরতে লাগল।",
      "কিন্তু রক্তাক্ত মুখে ফাতিমা দৃঢ়ভাবে বললেন:",
      "'হ্যাঁ উমর! আমরা মুসলমান হয়েছি এবং আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান এনেছি। তুমি যা ইচ্ছা করো!'",
      "বোনের এই সাহস ও রক্ত দেখে উমরের হৃদয় নরম হলো। তিনি কুরআনের পাতা দেখতে চাইলেন। ফাতিমা বললেন প্রথমে গোসল করতে হবে। উমর গোসল করলেন এবং সূরা তাহা পড়তে শুরু করলেন:",
      "طه ۝ مَا أَنزَلْنَا عَلَيْكَ الْقُرْآنَ لِتَشْقَىٰ",
      "'তা-হা। আমি তোমার উপর কুরআন এজন্য নাজিল করিনি যে তুমি কষ্ট পাবে।' [সূরা তাহা: ১-২]",
      "কুরআন পড়তে পড়তে উমরের চোখে পানি এসে গেল। তিনি বললেন:",
      "'এ কেমন সুন্দর ও মহান বাণী! মুহাম্মাদ কোথায় আছেন?'",
      "উমর তলোয়ার কোমরে ঝুলিয়ে রাসূল (সাঃ)-এর কাছে গেলেন। সাহাবীরা ভয় পেয়ে গেলেন। রাসূল (সাঃ) জিজ্ঞেস করলেন কেন এসেছেন। উমর বললেন:",
      "'হে আল্লাহর রাসূল! আমি এসেছি আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান আনতে।'",
      "রাসূল (সাঃ) এত জোরে 'আল্লাহু আকবার' বললেন যে মক্কার পাহাড় প্রতিধ্বনিত হলো!",
      "**যুদ্ধ ও রাসূলের মৃত্যু:** উমর (রাঃ) বদর, উহুদ, খন্দক, খায়বার, মক্কা বিজয়, হুনাইন, তাবুক, সকল যুদ্ধে রাসূল (সাঃ)-এর সাথে অংশগ্রহণ করেন। তাবুক অভিযানে তিনি তাঁর সম্পদের অর্ধেক দান করলেন। ৬৩২ খ্রিস্টাব্দে রাসূল (সাঃ) ইন্তেকাল করলেন। উমর (রাঃ) এত ভালোবাসতেন রাসূল (সাঃ)-কে যে তিনি বিশ্বাস করতে পারলেন না। তিনি তলোয়ার হাতে মসজিদে দাঁড়িয়ে বললেন: 'যে বলবে রাসূল (সাঃ) মারা গেছেন, আমি তার গর্দান কেটে ফেলব!' আবু বকর (রাঃ) এসে কুরআনের আয়াত তিলাওয়াত করলেন: 'মুহাম্মাদ একজন রাসূল মাত্র। তাঁর পূর্বে অনেক রাসূল গত হয়েছেন।' [সূরা আল ইমরান: ১৪৪]। উমর (রাঃ) বলেন: 'আমি এই আয়াত শুনে মাটিতে পড়ে গেলাম। আমি বুঝলাম রাসূল (সাঃ) সত্যিই চলে গেছেন।' সাকীফায় বনু সাইদায় উমর (রাঃ) আবু বকর (রাঃ)-এর হাত ধরে বললেন: 'আমি আপনার হাতে বাইয়াত করছি।' এভাবে আবু বকর (রাঃ) প্রথম খলিফা হলেন এবং উমর (রাঃ) তাঁর প্রধান উপদেষ্টা হলেন।",
      "**দ্বিতীয় খলিফা:** ২২ আগস্ট ৬৩৪ খ্রিস্টাব্দ। আবু বকর (রাঃ) ইন্তেকালের আগে উমর (রাঃ)-কে তাঁর উত্তরসূরি মনোনীত করেন। উমর (রাঃ) খলিফা হয়ে প্রথম ভাষণে বললেন: 'হে মানুষ! আমি তোমাদের মধ্যে সবচেয়ে ভালো নই। কিন্তু আল্লাহ আমাকে এই দায়িত্ব দিয়েছেন। শক্তিশালী ব্যক্তি আমার কাছে দুর্বল যতক্ষণ না আমি তার কাছ থেকে অন্যের হক আদায় করি। আর দুর্বল ব্যক্তি আমার কাছে শক্তিশালী যতক্ষণ না আমি তার হক ফিরিয়ে দিই। যদি ফোরাত নদীর তীরে একটি কুকুর না খেয়ে মারা যায়, উমর আল্লাহর কাছে জবাবদিহি করবে!' উমর (রাঃ) ইসলামী রাষ্ট্রে অনেক নতুন ব্যবস্থা চালু করেন: হিজরি সন প্রবর্তন, বাইতুল মাল স্থাপন, পুলিশ বাহিনী ও গোয়েন্দা বিভাগ তৈরি, বিচার বিভাগ আলাদা করা, প্রদেশ ও জেলা ব্যবস্থা চালু এবং মসজিদুল হারাম ও মসজিদে নববী সম্প্রসারণ।",
      "**বিশাল বিজয়, ইয়ারমুকের যুদ্ধ (৬৩৬):** উমর (রাঃ)-এর খিলাফতের প্রথম দিকেই রোমান সাম্রাজ্যের বিরুদ্ধে সবচেয়ে বড় যুদ্ধ সংঘটিত হয়। সিরিয়ার ইয়ারমুক নদীর তীরে ২,৪০,০০০ রোমান সৈন্যের বিরুদ্ধে মাত্র ৪০,০০০ মুসলিম সৈন্য লড়াই করেন। খালিদ ইবনুল ওয়ালিদ (রাঃ)-এর নেতৃত্বে মুসলিমরা অসাধারণ বিজয় অর্জন করেন। এই যুদ্ধে রোমান সাম্রাজ্যের শক্তি চূর্ণ হয়ে যায় এবং সিরিয়া মুসলিমদের হাতে আসে।",
      "**কাদিসিয়ার যুদ্ধ (৬৩৭):** ইরাকে পারস্য সাম্রাজ্যের বিরুদ্ধে এই মহাযুদ্ধ সংঘটিত হয়। সা'দ ইবনে আবি ওয়াক্কাস (রাঃ)-এর নেতৃত্বে মুসলিম বাহিনী পারস্যের বিশাল হাতি বাহিনী ও ১,২০,০০০ সৈন্যের বিরুদ্ধে লড়াই করেন। চার দিনব্যাপী এই যুদ্ধে পারস্য সাম্রাজ্যের প্রধান সেনাপতি রুস্তম নিহত হন এবং পারস্য বাহিনী পরাজিত হয়। এই বিজয়ের ফলে ইরাক সম্পূর্ণভাবে মুসলিমদের নিয়ন্ত্রণে আসে।",
      "**দামেস্ক ও জেরুজালেম বিজয় (৬৩৬-৬৩৮):** ইয়ারমুকের বিজয়ের পর দামেস্ক, আলেপ্পো, আন্তিয়খ, একের পর এক শহর বিজিত হতে থাকে। ৬৩৮ খ্রিস্টাব্দে জেরুজালেমের খ্রিস্টান প্যাট্রিয়ার্ক সফরোনিয়াস শর্ত দিলেন যে তিনি শুধুমাত্র মুসলিম খলিফার কাছে শহর সমর্পণ করবেন। উমর (রাঃ) নিজে জেরুজালেমে গেলেন। তিনি সাধারণ পোশাকে একটি উটে চড়ে গেলেন এবং তাঁর দাসের সাথে পালাক্রমে উটে চড়লেন। জেরুজালেমে পৌঁছে যখন দাসের পালা ছিল, উমর (রাঃ) উটের রশি ধরে হাঁটছিলেন। খ্রিস্টান নেতারা অবাক হয়ে জিজ্ঞেস করলেন: 'কে খলিফা?' উমর (রাঃ) বললেন: 'আমি।' তারা বললেন: 'আপনি এভাবে হাঁটছেন?' উমর (রাঃ) বললেন: 'ইসলাম আমাদের সম্মান দিয়েছে। আমাদের অন্য কিছুতে সম্মান খোঁজার দরকার নেই।' উমর (রাঃ) 'উমরের চুক্তি' স্বাক্ষর করলেন যেখানে খ্রিস্টানদের জান-মাল, গির্জা ও ধর্মীয় স্বাধীনতার নিরাপত্তা দেওয়া হলো।",
      "**নাহাওয়ান্দের যুদ্ধ (৬৪২):** এই যুদ্ধকে 'ফাতহুল ফুতুহ' (বিজয়ের বিজয়) বলা হয়। পারস্য সাম্রাজ্যের শেষ বড় যুদ্ধ। পারস্যের সম্রাট ইয়াজদিগার্দ তৃতীয় তাঁর সর্বশক্তি নিয়ে মুসলিমদের বিরুদ্ধে যুদ্ধ করেন। নুমান ইবনে মুকাররিন (রাঃ)-এর নেতৃত্বে মুসলিম বাহিনী চূড়ান্ত বিজয় অর্জন করেন। এই যুদ্ধের পর পারস্য সাম্রাজ্যের পতন ঘটে এবং সম্পূর্ণ ইরান, আজারবাইজান, আর্মেনিয়া মুসলিমদের অধীনে আসে।",
      "**মিসর বিজয় ও আলেকজান্দ্রিয়া (৬৪২):** আমর ইবনুল আস (রাঃ)-এর নেতৃত্বে মিসর অভিযান শুরু হয়। প্রথমে পেলুসিয়াম, তারপর বাবিলন দুর্গ এবং অবশেষে আলেকজান্দ্রিয়া বিজিত হয়। আলেকজান্দ্রিয়া ছিল রোমান সাম্রাজ্যের দ্বিতীয় বৃহত্তম শহর এবং জ্ঞান-বিজ্ঞানের কেন্দ্র। এর বিজয়ের ফলে সম্পূর্ণ মিসর ও উত্তর আফ্রিকা মুসলিমদের নিয়ন্ত্রণে আসে। এভাবে উমর (রাঃ)-এর ১০ বছরের খিলাফতে পশ্চিমে লিবিয়া থেকে পূর্বে সিন্ধু নদ পর্যন্ত, মাত্র ১০ বছরে ২২ লক্ষ বর্গমাইল বিজিত হয়!",
      "**সাধারণ জীবন ও ন্যায়বিচার:** উমর (রাঃ) ছিলেন বিশাল সাম্রাজ্যের খলিফা কিন্তু তাঁর জীবনযাপন ছিল অত্যন্ত সাধারণ। তিনি মাটির ঘরে বাস করতেন। তাঁর পোশাকে ১২টি তালি ছিল। তিনি যব রুটি ও খেজুর খেতেন। উমর (রাঃ) প্রায়ই রাতে ছদ্মবেশে মদীনার রাস্তায় ঘুরতেন মানুষের অবস্থা দেখতে। একবার তিনি একটি তাঁবুর কাছে একজন মহিলার কান্নার আওয়াজ শুনলেন। ভেতরে গিয়ে দেখলেন একজন বিধবা মহিলা তাঁর ক্ষুধার্ত বাচ্চাদের নিয়ে কাঁদছেন। উমর (রাঃ) দৌড়ে বাইতুল মালে গেলেন এবং নিজের পিঠে আটা ও খাবারের বস্তা বহন করে আনলেন। তাঁর দাস আসলাম বললেন: 'আমিরুল মুমিনীন! আমি বহন করি।' উমর (রাঃ) বললেন: 'তুমি কি কিয়ামতের দিন আমার বোঝা বহন করবে?' তিনি নিজে রান্না করে বাচ্চাদের খাওয়ালেন এবং তাদের সাথে খেলা করলেন যতক্ষণ না তারা হাসল। একবার মিসরের গভর্নর আমর ইবনুল আস (রাঃ)-এর ছেলে এক কিবতি যুবককে মারলেন। যুবক মদীনায় এসে উমর (রাঃ)-এর কাছে অভিযোগ করলেন। উমর (রাঃ) আমর ও তাঁর ছেলেকে মদীনায় ডেকে পাঠালেন এবং কিবতি যুবককে বললেন: 'তুমি তাকে মারো যেমন সে তোমাকে মেরেছে।' তারপর উমর (রাঃ) বললেন: 'কখন থেকে তোমরা মানুষকে দাস বানালে যেখানে তাদের মা তাদের স্বাধীন জন্ম দিয়েছে?'",
      "**শাহাদাত:** ৬৪৪ খ্রিস্টাব্দ, ১ নভেম্বর। ফজরের নামাজের সময় পারস্যের দাস আবু লুলু ফিরোজ বিষমাখানো ছুরি নিয়ে মসজিদে ঢুকল। উমর (রাঃ) যখন 'আল্লাহু আকবার' বলে নামাজ শুরু করলেন, ফিরোজ তাঁকে ছয়বার ছুরি দিয়ে আঘাত করল। উমর (রাঃ) রক্তাক্ত অবস্থায় পড়ে গেলেন কিন্তু বললেন: 'নামাজ শেষ করো!' তিনি জানতে চাইলেন: 'কে আমাকে আঘাত করেছে?' তাঁকে বলা হলো: 'আবু লুলু ফিরোজ।' উমর (রাঃ) বললেন: 'আলহামদুলিল্লাহ! অন্তত কোনো মুসলিম আমাকে হত্যা করেনি।' তিন দিন কষ্টে ছটফট করার পর উমর (রাঃ) ৬ সদস্যের একটি কমিটি গঠন করলেন পরবর্তী খলিফা নির্বাচনের জন্য। তিনি তাঁর কন্যা হাফসা (রাঃ)-কে বললেন: 'আমাকে রাসূল (সাঃ) ও আবু বকর (রাঃ)-এর পাশে দাফন করার অনুমতি আয়েশা (রাঃ)-এর কাছে চাও।' ৭ নভেম্বর ৬৪৪ খ্রিস্টাব্দে উমর (রাঃ) শাহাদাত বরণ করেন। তাঁকে রাসূল (সাঃ) ও আবু বকর (রাঃ)-এর পাশে জান্নাতুল বাকীতে দাফন করা হয়। তাঁর খিলাফতকাল ছিল ১০ বছর ৬ মাস। আল্লাহ উমর (রাঃ)-কে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "উমর (রাঃ)-এর জীবন প্রমাণ করে যে ন্যায়বিচার, দৃঢ়তা, সাধারণ জীবনযাপন এবং দরিদ্রদের প্রতি দয়া একজন শাসককে মহান করে তোলে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর"
  },
  {
    "id": "uthman_ibn_affan",
    "categoryId": "sahabider_jibon",
    "title": "উসমান ইবনে আফফান (রাঃ)",
    "paragraphs": [
      "মক্কার ধনী বণিক পরিবারে জন্ম নেওয়া এক যুবক। নাম উসমান ইবনে আফফান। বনু উমাইয়া গোত্রের সন্তান। জন্ম ৫৭৩ বা ৫৭৬ সাল। পিতা আফফান ইবনে আবি আল-আস, মা আরওয়া বিনতে কুরাইয়েজ। মায়ের দিক থেকে রাসূল (সাঃ)-এর চাচাতো ভাই। লাজুক, ভদ্র, সুদর্শন যুবক। কে জানত এই যুবকটি হবেন তৃতীয় খলিফা!",
      "**ধনী ব্যবসায়ী:** অল্প বয়সে পিতা মারা গেলেন। রেখে গেলেন বিশাল সম্পত্তি। উসমান সেই সম্পদ ব্যবসায় বিনিয়োগ করলেন। সিরিয়া, ইয়েমেন, আবিসিনিয়া - সব জায়গায় ব্যবসা। অসাধারণ বুদ্ধিমত্তায় হয়ে উঠলেন কুরাইশদের সবচেয়ে ধনী ব্যবসায়ীদের একজন। কিন্তু সম্পদ তাকে অহংকারী করেনি। ছিলেন বিনয়ী, ভদ্র, দানশীল। মক্কার মানুষ তাকে সম্মান করত।",
      "**ইসলাম গ্রহণ:** ৬১১ সাল। সিরিয়া থেকে ব্যবসায়িক সফর শেষে মক্কায় ফিরলেন। শুনলেন মুহাম্মাদ (সাঃ) নবুয়ত ঘোষণা করেছেন। বন্ধু আবু বকরের সাথে আলোচনা করলেন। আবু বকর বললেন: এসো রাসূলের কাছে যাই। রাসূলের সাথে দেখা। কথা শুনলেন। হৃদয় কাঁপল। সাথে সাথে ইসলাম গ্রহণ করলেন। হলেন প্রথম দিকের মুসলিমদের একজন। ২২ জন মক্কাবাসীর মধ্যে একজন যারা লিখতে জানতেন। চাচা হাকাম ইবনে আবি আল-আস রাগে ফেটে পড়লেন। নির্যাতন শুরু হল।",
      "**আবিসিনিয়ায় হিজরত:** ৬১৫ সাল, এপ্রিল। নির্যাতন বাড়ছে। রাসূল (সাঃ) বললেন: আবিসিনিয়ায় চলে যাও। সেখানে ন্যায়পরায়ণ বাদশাহ আছেন। উসমান ও তার স্ত্রী রুকাইয়া (রাসূলের কন্যা) ১০ জন পুরুষ ও ৩ জন মহিলা সহ হিজরত করলেন। রাসূল (সাঃ) বলেছেন: উসমান ও রুকাইয়া লুত (আঃ) এর পর প্রথম যারা আল্লাহর পথে হিজরত করেছেন। আবিসিনিয়ায় ব্যবসা চালিয়ে গেলেন। সফল হলেন। চার বছর পর খবর এল - কুরাইশরা ইসলাম গ্রহণ করেছে! উসমান ও ৩৯ জন মুসলিম মক্কায় ফিরলেন। কিন্তু খবর ছিল মিথ্যা! তবুও মক্কায় থেকে গেলেন। আবার ব্যবসা শুরু করলেন।",
      "**মদীনায় হিজরত:** ৬২২ সাল। তৃতীয় দলের সাথে মদীনায় হিজরত করলেন। প্রথমে আবু তালহা ইবনে সাবিতের বাড়িতে থাকলেন। তারপর নিজের বাড়ি কিনলেন। মদীনায় বেশিরভাগ মুসলিম ছিলেন কৃষক। ব্যবসায়ে আগ্রহ কম। ইহুদিরা ব্যবসা করত। উসমান বুঝলেন - এখানে ব্যবসার সুযোগ আছে। পরিশ্রম ও সততায় ব্যবসা ফুলে ফেঁপে উঠল। হয়ে উঠলেন মদীনার ধনীতম ব্যক্তিদের একজন।",
      "**যুন-নূরাইন:** রাসূলের দুই কন্যাকে বিয়ে করার সৌভাগ্য হয়েছিল উসমানের। প্রথমে রুকাইয়া (রাঃ)। বদরের যুদ্ধের সময় রুকাইয়া অসুস্থ ছিলেন। রাসূল (সাঃ) উসমানকে বললেন: তুমি মদীনায় থাকো, স্ত্রীর সেবা করো। বদরে যাওয়ার সওয়াব ও গনিমত তোমার জন্য আছে। রুকাইয়া মারা গেলেন। উসমান শোকে মুহ্যমান। রাসূল (সাঃ) তার আরেক কন্যা উম্মে কুলসুম (রাঃ) কে উসমানের সাথে বিয়ে দিলেন। এজন্য তাকে দেওয়া হল বিশেষ উপাধি - যুন-নূরাইন (দুই আলোর অধিকারী)। আরেক উপাধি গনি - অত্যন্ত দানশীল।",
      "**দানশীলতা:** তাবুকের যুদ্ধ। মুসলিম বাহিনীর অর্থ সংকট। রাসূল (সাঃ) বললেন: কে আল্লাহর পথে দান করবে? উসমান ১০০০ উট, ৭০টি ঘোড়া ও ১০০০ দিনার দান করলেন! রাসূল (সাঃ) হাত তুলে দোয়া করলেন: আজকের পর উসমান যা করুক তাতে কোনো ক্ষতি নেই! মদীনায় পানির সংকট। রুমা কূপের মালিক ইহুদি। চড়া দামে পানি বিক্রি করত। উসমান ৩৫,০০০ দিরহাম দিয়ে কূপ কিনে মুসলিমদের জন্য ওয়াক্ফ করে দিলেন। মসজিদে নববী সম্প্রসারণের জন্য জমি কিনে দান করলেন।",
      "**যুদ্ধসমূহ:** বদর ছাড়া সব যুদ্ধে অংশ নিয়েছেন। উহুদ, খন্দক, খায়বার, মক্কা বিজয়, হুনায়ন, তাবুক। গাতাফান ও যাত আল-রিকা অভিযানে রাসূল উসমানকে মদীনার দায়িত্ব দিয়ে গিয়েছিলেন। ৬৩২ সালে বিদায় হজ্জেও ছিলেন উসমান।",
      "**আবু বকর ও উমরের যুগ:** আবু বকর খলিফা হলে উসমান প্রথম বাইয়াত করলেন উমরের পরে। রিদ্দার যুদ্ধে মদীনায় থেকে আবু বকরকে পরামর্শ দিতেন। আবু বকর মৃত্যুশয্যায় উসমান ও ইবনে আউফকে ডেকে অসিয়ত লিখালেন - উমর হবেন পরবর্তী খলিফা। উমরের খিলাফতকালে উসমান ছিলেন প্রধান উপদেষ্টাদের একজন।",
      "**তৃতীয় খলিফা:** ৬৪৪ সাল। উমর শহীদ হলেন। ৬ সদস্যের কমিটি: আলী, উসমান, আবদুর রহমান, সাদ, যুবাইর, তালহা। তিন দিন আলোচনা। আবদুর রহমান আলীকে জিজ্ঞাসা করলেন: কুরআন, সুন্নাহ এবং আবু বকর ও উমরের নীতি অনুসরণ করবেন? আলী: কুরআন ও সুন্নাহ অনুসরণ করব। উসমানকে একই প্রশ্ন। উসমান: হ্যাঁ, সব শর্ত মানব। আবদুর রহমান উসমানের হাতে বাইয়াত করলেন। উসমান হলেন তৃতীয় খলিফা। বয়স ৭০ বছর।",
      "**কুরআন সংকলন:** ৬৫০ সাল। ইসলাম ছড়িয়ে পড়েছে পারস্য, শাম, উত্তর আফ্রিকায়। হুযাইফা ইবনুল ইয়ামান উসমানকে বললেন: আমিরুল মুমিনীন! কুরআন তিলাওয়াতে পার্থক্য দেখা দিচ্ছে। এক এলাকার মানুষ বলছে আমাদের তিলাওয়াত সঠিক, অন্যরা ভুল! উসমান চিন্তিত হলেন। সিদ্ধান্ত নিলেন। যায়িদ ইবনে সাবিত, আবদুল্লাহ ইবনে যুবাইর, সাঈদ ইবনে আল-আস ও আবদুর রহমান ইবনে হারিসকে নিয়ে কমিটি গঠন করলেন। আবু বকরের সংকলিত কপি ব্যবহার করে প্রমিত কুরআন তৈরি করা হল। কুরাইশ উচ্চারণে লেখা হল। সেই কপি থেকে ৭টি অনুলিপি তৈরি করে মক্কা, শাম, ইয়েমেন, বাহরাইন, বসরা, কুফা ও মদীনায় পাঠানো হল। অন্য সব সংস্করণ পুড়িয়ে ফেলার নির্দেশ দিলেন। এভাবে কুরআন সংরক্ষিত হল। উসমানের সবচেয়ে বড় অবদান।",
      "**বিদ্রোহ ও শাহাদাত:** ১২ বছর শাসনের পর কিছু লোক অসন্তুষ্ট হল। অভিযোগ - আত্মীয়দের গভর্নর বানাচ্ছেন। মিশর, কুফা, বসরা থেকে বিদ্রোহীরা এল। ৬৫৬ সালের জুন। বিদ্রোহীরা উসমানের বাড়ি ঘেরাও করল। সাহাবীরা রক্ষা করতে চাইলেন। আলী (রাঃ) তার দুই ছেলে হাসান ও হুসাইনকে পাঠালেন। উসমান বললেন: না, রক্তপাত চাই না। যে আমার পক্ষে লড়বে সে আমার আনুগত্য থেকে মুক্ত। সবাইকে ফিরিয়ে দিলেন। ১৭ জুন। বিদ্রোহীরা প্রতিবেশীর বাড়ি থেকে লাফ দিয়ে ঢুকল। উসমান কুরআন তিলাওয়াত করছিলেন। রোজা রেখেছিলেন। একজন তার দাড়ি ধরে টানল। উসমান বললেন: আমার দাড়ি ছেড়ে দাও। তোমার পিতা এই দাড়িকে সম্মান করত। বিদ্রোহী ছুরি দিয়ে মাথায় আঘাত করল। স্ত্রী নায়িলা বাঁচাতে এগিয়ে এলেন। তার আঙুল কেটে গেল। আরেক আঘাতে উসমান শহীদ হলেন। বয়স ৮২ বছর। খিলাফত ১২ বছর। কুরআনের পাতায় রক্ত পড়ল। সেই আয়াত: فَسَيَكْفِيكَهُمُ اللَّهُ আল্লাহই তোমার জন্য যথেষ্ট। (সূরা বাকারা: ১৩৭) জান্নাতুল বাকীতে দাফন হলেন। লাজুক, দানশীল, ধৈর্যশীল খলিফা। কুরআন সংরক্ষণকারী।"
    ],
    "moral": "হযরত উসমান (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা চরম প্রতিকূলতা এবং ফিতনার মধ্যেও ধৈর্য এবং বিনয় বজায় রেখে আল্লাহর পথে দৃঢ় থাকতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "ali_ibn_abi_talib",
    "categoryId": "sahabider_jibon",
    "title": "আলী ইবনে আবী তালিব (রাঃ)",
    "paragraphs": [
      "মক্কার কাবা ঘরে এক অলৌকিক জন্ম। ৬০০ সাল, ১৩ রজব। পিতা আবু তালিব ইবনে আব্দুল মুত্তালিব, মা ফাতিমা বিনতে আসাদ। কাবার ভিতরে জন্ম নেওয়ার সৌভাগ্য শুধু আলীর! বনু হাশিম গোত্রের সন্তান। আবু তালিব ছিলেন মুহাম্মাদ (সাঃ)-এর চাচা। পাঁচ বছর বয়সে আবু তালিব দারিদ্র্যে পড়লে মুহাম্মাদ (সাঃ) ও খাদিজা (রাঃ) আলীকে নিজেদের কাছে নিয়ে নেন। বড় হলেন রাসূলের ঘরে।",
      "**প্রথম মুসলিম:** ৬১০ সাল। মুহাম্মাদ (সাঃ) নবুয়ত পেলেন। মাত্র ১১ বছর বয়সী আলী প্রথম দিকে ইসলাম গ্রহণ করলেন। খাদিজা (রাঃ) এর পরেই। ছেলেদের মধ্যে প্রথম। তিন বছর পর রাসূল (সাঃ) আত্মীয়দের দাওয়াত দিলেন। বললেন: কে আমাকে সাহায্য করবে? মাত্র ১৪ বছর বয়সী আলী দাঁড়িয়ে বললেন: আমি! রাসূল (সাঃ) বললেন: আলী আমার ভাই এবং আমার উত্তরসূরি। ইতিহাসবিদ তাবারি এই ঘটনা লিখেছেন।",
      "**হিজরতের রাত:** ৬২২ সাল। কুরাইশরা রাসূলকে হত্যার পরিকল্পনা করল। রাসূল (সাঃ) মদীনায় হিজরত করবেন। কিন্তু কে থাকবে মক্কায়? কে ঝুঁকি নেবে? আলী বললেন: আমি আপনার বিছানায় শুয়ে থাকব। রাসূল (সাঃ) নিজের সবুজ চাদর আলীকে দিলেন। রাতে কুরাইশরা ঘেরাও করল। ভোরে দেখল - আলী! রাসূল পালিয়েছেন! এই ঘটনায় কুরআনের আয়াত নাযিল হয়: আর মানুষের মধ্যে কেউ কেউ আল্লাহর সন্তুষ্টির জন্য নিজের জীবন বিক্রয় করে দেয়। (সূরা বাকারা: ২০৭) আলী আমানত ফেরত দিয়ে তিন দিন পর মদীনায় হিজরত করলেন।",
      "**বিবাহ:** মদীনায় রাসূল (সাঃ) মুসলিমদের ভ্রাতৃত্ব বন্ধন করালেন। আলীকে নিজের ভাই বানালেন। ৬২৩-৬২৫ সাল। আবু বকর ও উমর রাসূলের কন্যা ফাতিমাকে বিয়ের প্রস্তাব দিলেন। রাসূল (সাঃ) প্রত্যাখ্যান করলেন। আলী লজ্জা পেয়ে প্রস্তাব দিতে পারছিলেন না। সাহাবীরা উৎসাহ দিলেন। আলী প্রস্তাব দিলেন। রাসূল (সাঃ) খুশি হলেন। বললেন: আল্লাহ আমাকে নির্দেশ দিয়েছেন ফাতিমাকে আলীর সাথে বিয়ে দিতে। বিয়ে হল। মোহরানা ছিল ৪৮০ দিরহাম। আলী তার বর্ম বিক্রি করে মোহরানা দিলেন। উসমান সেই বর্ম কিনে আলীকে উপহার দিলেন। দুই ছেলে হাসান ও হুসাইন, দুই মেয়ে যয়নাব ও উম্মে কুলসুম। রাসূল (সাঃ) বলেছেন: হাসান ও হুসাইন জান্নাতের যুবকদের সর্দার।",
      "**মুবাহালার ঘটনা:** ৬৩২ সাল। নাজরান থেকে খ্রিস্টান প্রতিনিধি দল এল। ঈসা (আঃ) সম্পর্কে বিতর্ক হল। কুরআনের আয়াত নাযিল হল: এসো, আমরা আমাদের পুত্রদের ও তোমাদের পুত্রদের, আমাদের নারীদের ও তোমাদের নারীদের এবং আমাদের নিজেদের ও তোমাদের নিজেদের ডাকি, তারপর মুবাহালা করি। (সূরা আলে ইমরান: ৬১) রাসূল (সাঃ) মুবাহালার জন্য বের হলেন। সাথে নিলেন আলী, ফাতিমা, হাসান ও হুসাইনকে। খ্রিস্টানরা দেখে ভয় পেল। বলল: এরা আল্লাহর প্রিয় মানুষ। মুবাহালা করলে আমরা ধ্বংস হব। তারা সন্ধি করল।",
      "**সামরিক বীরত্ব:** তাবুক ছাড়া সব যুদ্ধে অংশ নিয়েছেন। তাবুকে রাসূল (সাঃ) আলীকে মদীনার দায়িত্ব দিয়ে গেলেন। আলী মন খারাপ করলেন। রাসূল (সাঃ) বললেন: তুমি কি খুশি নও যে, তুমি আমার কাছে সেই স্থানে আছ যেখানে হারুন ছিলেন মূসার কাছে? তবে আমার পরে কোনো নবী নেই। (সহীহ বুখারী ও মুসলিম) বদরের যুদ্ধে পতাকাবাহী। উহুদে রাসূলকে রক্ষা করলেন। খন্দকে আমর ইবনে আবদ উদকে পরাজিত করলেন। খায়বারে দুর্গের লোহার দরজা উপড়ে ফেললেন! ইহুদি বীর মারহাবকে হত্যা করলেন। রাসূল (সাঃ) বলেছেন: আগামীকাল আমি এমন একজনকে পতাকা দেব যে আল্লাহ ও তার রাসূলকে ভালোবাসে এবং আল্লাহ ও তার রাসূল তাকে ভালোবাসেন। পরদিন আলীকে পতাকা দিলেন। উহুদে আল্লাহর পক্ষ থেকে আওয়াজ এল: লা সাইফা ইল্লা যুলফিকার, ওয়া লা ফাতা ইল্লা আলী - যুলফিকার ছাড়া কোনো তলোয়ার নেই, আলী ছাড়া কোনো বীর নেই!",
      "**রাসূলের মৃত্যু:** ৬৩২ সাল। রাসূল (সাঃ) মারা গেলেন। আলী শোকে ভেঙে পড়লেন। রাসূলের গোসল, কাফন, দাফন - সব আলী করলেন। সাকিফায় খিলাফত নির্বাচন হচ্ছিল। আলী রাসূলের দাফনে ব্যস্ত ছিলেন। আবু বকর খলিফা হলেন। আলী পরে বাইয়াত করলেন। ফাতিমা (রাঃ) ৬ মাস পর মারা গেলেন। আলী একাকী হয়ে গেলেন।",
      "**আবু বকর ও উমরের যুগ:** আলী ছিলেন প্রধান উপদেষ্টা। কুরআন ও হাদিসের জ্ঞানে অতুলনীয়। উমর বলতেন: আলী না থাকলে উমর ধ্বংস হত! কঠিন মামলায় আলীর পরামর্শ নিতেন। রাসূল (সাঃ) বলেছেন: আমি জ্ঞানের শহর, আলী তার দরজা। উসমানের খিলাফতকালেও উপদেষ্টা ছিলেন।",
      "**চতুর্থ খলিফা:** ৬৫৬ সাল। উসমান শহীদ হলেন। মুসলিমরা আলীর কাছে এল। বলল: আপনি খলিফা হন। আলী রাজি হলেন না। বললেন: আমাকে ছেড়ে দাও। আমি উপদেষ্টা হতে চাই। কিন্তু মুহাজির ও আনসাররা জোর করল। আলী বললেন: তাহলে মসজিদে বাইয়াত হতে হবে, গোপনে নয়। মসজিদে নববীতে বাইয়াত হল। আলী হলেন চতুর্থ খলিফা। বয়স ৫৬ বছর।",
      "**উটের যুদ্ধ:** ৬৫৬ সাল। আয়েশা (রাঃ), তালহা ও যুবাইর বসরায় গেলেন। দাবি - উসমানের হত্যাকারীদের বিচার করো। আলী বললেন: আগে শান্তি ফিরুক, তারপর বিচার। যুদ্ধ হল। তালহা ও যুবাইর শহীদ হলেন। আয়েশা (রাঃ) উটের হাওদায় ছিলেন। আলী সম্মানের সাথে তাকে মদীনায় পাঠালেন।",
      "**সিফফিনের যুদ্ধ:** ৬৫৭ সাল। মুয়াবিয়া শামে খলিফা মানলেন না। সিফফিনে যুদ্ধ হল। আলীর বাহিনী জিতছিল। হঠাৎ মুয়াবিয়ার সৈন্যরা বর্শার মাথায় কুরআন তুলল। বলল: কুরআনের ফয়সালা চাই! আলী বুঝলেন এটা ফাঁদ। কিন্তু সৈন্যরা যুদ্ধ বন্ধ করল। সালিশি হল। আলী ক্ষতিগ্রস্ত হলেন।",
      "**খারিজিদের বিদ্রোহ:** কিছু সৈন্য বলল: সালিশি মানি না! শুধু আল্লাহর হুকুম! তারা আলী থেকে আলাদা হয়ে গেল। নাম হল খারিজি। নাহরাওয়ানে যুদ্ধ হল। খারিজিরা পরাজিত হল। কিন্তু তারা প্রতিশোধ নিতে চাইল।",
      "**শাহাদাত:** ৬৬১ সাল, ১৯ রমজান। ফজরের নামাযের জন্য মসজিদে গেলেন। খারিজি আবদুর রহমান ইবনে মুলজাম বিষাক্ত তলোয়ার দিয়ে মাথায় আঘাত করল। আলী বললেন: কাবার রবের শপথ, আমি সফল হয়েছি! দুই দিন পর ২১ রমজান শহীদ হলেন। বয়স ৬১ বছর। খিলাফত ৫ বছর। নাজাফে দাফন হলেন। উপাধি: আসাদুল্লাহ (আল্লাহর সিংহ), হায়দার (সিংহ), আবুল হাসান। জ্ঞান, বীরত্ব, ন্যায়পরায়ণতার প্রতীক। রাসূল (সাঃ) বলেছেন: আমি জ্ঞানের শহর, আলী তার দরজা।"
    ],
    "moral": "হযরত আলী (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা জ্ঞান, শক্তি ও সাহসিকতাকে ইসলামের পথে ব্যবহার করে চরম প্রতিকূলতার মধ্যেও ন্যায়ের ওপর অটল থাকতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "talha_ibn_ubaydullah",
    "categoryId": "sahabider_jibon",
    "title": "তালহা ইবনে উবাইদুল্লাহ (রাঃ)",
    "paragraphs": [
      "মক্কার ধুলোমাখা পথে এক উজ্জ্বল নক্ষত্রের জন্ম হয়েছিল ৫৯৪ সালে। তালহা ইবনে উবাইদুল্লাহ আত-তাইমি - যাঁর নাম পরবর্তীতে ইসলামের ইতিহাসে স্বর্ণাক্ষরে লেখা হবে। বনু তাইম গোত্রের সম্ভ্রান্ত পরিবারে জন্ম নেওয়া এই শিশুটি বড় হয়ে উঠলেন এক অসাধারণ ব্যক্তিত্ব নিয়ে। পিতা উবাইদুল্লাহ ইবনে উসমান ছিলেন মক্কার সফল ব্যবসায়ী, মাতা সাবা বিনতে হাদরামি ছিলেন নেককার মহিলা। লম্বা, সুদর্শন, ফর্সা চেহারা, ঘন কোঁকড়ানো চুল - যেন চাঁদের মতো উজ্জ্বল। শক্তিশালী গড়ন, তীরন্দাজিতে পারদর্শী। মক্কার যুবকদের মধ্যে সম্মানিত। কিন্তু তাঁর আসল সৌন্দর্য ছিল তাঁর হৃদয়ে, তাঁর চরিত্রে। কে জানত এই যুবক একদিন হবেন আশারায়ে মুবাশশারার একজন - জান্নাতের সুসংবাদপ্রাপ্ত!",
      "**ব্যবসায়ী জীবনের সূচনা:** পিতা উবাইদুল্লাহ ছিলেন মক্কার একজন সফল ব্যবসায়ী। তালহা পিতার পদাঙ্ক অনুসরণ করলেন এবং অল্প বয়সেই ব্যবসায়ে যুক্ত হলেন। সিরিয়া, ইরাক, ইয়েমেন - দূর দূরান্তে বাণিজ্য করতেন। কিন্তু তাঁর ব্যবসার মূলমন্ত্র ছিল সততা ও বিশ্বস্ততা। তিনি কখনো মিথ্যা বলতেন না, কখনো প্রতারণা করতেন না। মানুষ তাঁকে বিশ্বাস করত, ভালোবাসত। অল্প বয়সেই হয়ে উঠলেন মক্কার অন্যতম সফল ব্যবসায়ী। কিন্তু সম্পদ তাঁকে অহংকারী করেনি - বরং আরও বিনয়ী, আরও দানশীল করে তুলেছিল। তিনি দরিদ্রদের সাহায্য করতেন, এতিমদের দেখাশোনা করতেন।",
      "**সত্যের সন্ধানে:** ৬১০ সাল। তালহা ব্যবসায়িক সফরে সিরিয়ার বসরা শহরে গিয়েছিলেন। সেখানে বাজারে এক বয়স্ক খ্রিস্টান পাদ্রীর সাথে দেখা হলো - নাম বাহিরা। তিনি ছিলেন জ্ঞানী, তাওরাত ও ইঞ্জিলের গভীর পণ্ডিত। তিনি আরব বণিকদের সাথে কথা বলতে ভালোবাসতেন। একদিন তিনি তালহাকে জিজ্ঞাসা করলেন: 'তুমি কোথা থেকে এসেছ হে যুবক?' তালহা বললেন: 'মক্কা থেকে।' বাহিরা গম্ভীর স্বরে বললেন: 'মক্কায় কি কোনো নতুন ঘটনা ঘটেছে?' তালহা: 'না তো, কিছু শুনিনি।' বাহিরা তখন এমন কথা বললেন যা তালহার জীবন বদলে দিল: 'তাহলে শোনো হে যুবক! হারাম শরিফে একজন নবীর আবির্ভাব হয়েছে। তাঁর নাম আহমাদ। তিনি শেষ নবী। তাওরাত ও ইঞ্জিলে তাঁর ভবিষ্যদ্বাণী লেখা আছে। তুমি মক্কায় ফিরে তাঁকে খুঁজে বের করো এবং তাঁর অনুসরণ করো। তিনিই সত্যের পথ দেখাবেন।' তালহার হৃদয়ে এই কথা গভীর রেখাপাত করল। তিনি ব্যবসা দ্রুত শেষ করে মক্কায় ফিরে এলেন - হৃদয়ে এক অদ্ভুত আশা ও উত্তেজনা নিয়ে।",
      "**ঈমানের আলো:** মক্কায় ফিরে তালহা শুনলেন যে মুহাম্মাদ ইবনে আবদুল্লাহ নবুয়তের দাবি করেছেন। তাঁর হৃদয় কেঁপে উঠল - এই তো সেই নবী যার কথা বাহিরা বলেছিলেন! কিন্তু কীভাবে যাবেন? কীভাবে দেখা করবেন? এমন সময় তাঁর প্রিয় বন্ধু আবু বকর সিদ্দিক (রাঃ) এর সাথে দেখা। আবু বকর ইতিমধ্যে ইসলাম গ্রহণ করে ফেলেছেন। তালহা তাঁকে সব বললেন - বাহিরার কথা, নবীর সন্ধান, হৃদয়ের আকুতি। আবু বকর খুশিতে উচ্ছ্বসিত হয়ে বললেন: 'চলো বন্ধু! আমি তোমাকে নবীজির কাছে নিয়ে যাই!' দুই বন্ধু একসাথে গেলেন রাসূল (সাঃ) এর কাছে। রাসূল (সাঃ) তালহাকে দেখে মৃদু হাসলেন। তাঁর চেহারার নূর তালহার হৃদয় ছুঁয়ে গেল। রাসূল (সাঃ) ইসলামের দাওয়াত দিলেন, কুরআনের আয়াত তিলাওয়াত করলেন। তালহার চোখে পানি এসে গেল। তিনি সাথে সাথে কালিমা পড়লেন: **'লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ।'** হয়ে গেলেন অষ্টম মুসলিম - প্রথম দিকের সেই সৌভাগ্যবান মানুষদের একজন যাঁরা সত্যকে চিনে নিয়েছিলেন প্রথম দেখাতেই। রাসূল (সাঃ) তাঁকে বুকে জড়িয়ে ধরলেন এবং দোয়া করলেন।",
      "**নির্যাতনের আগুন, ঈমানের পরীক্ষা:** ইসলাম গ্রহণের খবর দ্রুত ছড়িয়ে পড়ল। কুরাইশদের ক্রোধ আকাশ ছুঁয়ে গেল। বিশেষ করে নাওফাল ইবনে খুওয়াইলিদ - যিনি ছিলেন কুরাইশদের এক শক্তিশালী নেতা এবং খাদিজা (রাঃ) এর চাচাতো ভাই। একদিন তালহা ও আবু বকর একসাথে রাস্তায় ছিলেন। নাওফাল তাঁদের দেখে ফেললেন। রাগে অন্ধ হয়ে তিনি দুই বন্ধুকে ধরে ফেললেন এবং শক্ত দড়ি দিয়ে একসাথে বেঁধে ফেললেন। তারপর শুরু হলো নির্মম মারধর। চাবুক, লাঠি, মুষ্টাঘাত - কিছুই বাদ যায়নি। নাওফাল চিৎকার করে বললেন: **'মুহাম্মাদের ধর্ম ছাড়ো! নইলে তোমাদের মেরে ফেলব!'** কিন্তু তালহা ও আবু বকর দুজনেই এক বাক্যে বললেন: **'কখনো না! আমরা মৃত্যু বরণ করব কিন্তু ইসলাম ছাড়ব না!'** সারাদিন তাঁদের বেঁধে রাখা হলো। সন্ধ্যায় ছেড়ে দেওয়া হলো কিন্তু হুমকি দেওয়া হলো আরও কঠিন শাস্তির। এই ঘটনার পর তালহা ও আবু বকরের একটি বিশেষ উপাধি হয়ে গেল - **'আল-কারিনান'** অর্থাৎ 'দুই বন্ধু যারা একসাথে বাঁধা পড়েছিল'। এই উপাধি তাঁদের ভালোবাসা ও ত্যাগের প্রতীক হয়ে রইল।",
      "**ধৈর্যের পরীক্ষা:** নির্যাতন দিনের পর দিন চলতে থাকল। কিন্তু তালহার ঈমান আরও শক্তিশালী হতে থাকল। তিনি গোপনে রাসূল (সাঃ) এর সাথে দেখা করতেন, কুরআন শিখতেন। নিজের সম্পদ দিয়ে দরিদ্র মুসলিমদের সাহায্য করতেন। বিলাল (রাঃ) ও আম্মার (রাঃ) সহ নির্যাতিত মুসলিমদের জন্য খাবার পৌঁছে দিতেন। ধৈর্যের সাথে সব কষ্ট সহ্য করতেন।",
      "**মদীনায় হিজরত:** ৬২২ সাল। রাসূল (সাঃ) মদীনায় হিজরত করলেন। তালহাও হিজরত করলেন। কিন্তু একটি বিশেষ ঘটনা ঘটল। তালহা ব্যবসায়িক কাজে সিরিয়ায় গিয়েছিলেন। ফেরার পথে মদীনায় পৌঁছলেন। শুনলেন রাসূল (সাঃ) বদরের যুদ্ধে গেছেন। তালহা দ্রুত যেতে চাইলেন কিন্তু পৌঁছতে পারলেন না। যুদ্ধ শেষ হয়ে গিয়েছিল। তালহা অত্যন্ত দুঃখিত হলেন যে বদরে অংশ নিতে পারলেন না। কিন্তু রাসূল (সাঃ) তাকে সান্ত্বনা দিয়ে বললেন: তুমি ব্যবসায়িক কাজে ছিলে, এটা তোমার দোষ নয়। তোমার জন্য বদরের সওয়াব আছে এবং গনিমতের অংশও আছে। তালহা খুশি হলেন। রাসূল (সাঃ) তালহাকে কা'ব ইবনে মালিকের সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**উহুদের বীরত্ব:** ৬২৫ সাল, শাওয়াল মাস। উহুদের যুদ্ধ। এই যুদ্ধে তালহার অসাধারণ বীরত্ব প্রকাশ পেল। যুদ্ধ শুরু হল। প্রথমে মুসলিমরা জয়ী হচ্ছিলেন। কিন্তু তীরন্দাজরা পাহাড় ছেড়ে চলে গেলে খালিদ ইবনে ওয়ালিদ পেছন থেকে আক্রমণ করলেন। মুসলিমরা বিক্ষিপ্ত হয়ে গেলেন। রাসূল (সাঃ) আহত হলেন। মুখে আঘাত লাগল। দাঁত ভেঙে গেল। শিরস্ত্রাণের কড়া মুখে ঢুকে গেল। কাফিররা চারদিক থেকে রাসূলকে ঘিরে ফেলল। এই মুহূর্তে তালহা এগিয়ে এলেন। রাসূলের সামনে ঢাল হয়ে দাঁড়ালেন। তীর এলে নিজের শরীর দিয়ে আটকালেন। তলোয়ার এলে হাত দিয়ে আটকালেন। ডান হাত কেটে গেল। আঙুল অবশ হয়ে গেল। কিন্তু তালহা পিছু হটলেন না। রাসূলকে রক্ষা করতে থাকলেন। মুসআব ইবনে উমাইর শহীদ হলেন। আবু উবাইদা, আবু বকর, আলী - সবাই রাসূলকে রক্ষা করছেন। কিন্তু তালহার বীরত্ব ছিল অতুলনীয়। তার শরীরে ৭০টিরও বেশি আঘাত লাগল। তীর, তলোয়ার, বর্শা - সব ধরনের আঘাত। কিন্তু তিনি রাসূলকে ছাড়লেন না। রাসূল (সাঃ) পরে বলেছেন: 'উহুদের দিন যে জান্নাত দেখতে চায়, সে যেন তালহার দিকে তাকায়।' আরেকটি বর্ণনায় আছে: 'তালহা সেদিন শহীদদের মর্যাদা অর্জন করেছে।' আবু বকর (রাঃ) বলেছেন: 'সেদিন তালহা ছিল আমাদের সবার চেয়ে ভালো।'",
      "**উপাধি:** উহুদের বীরত্বের জন্য তালহাকে বিশেষ উপাধি দেওয়া হল। 'তালহাতুল খায়ের' - ভালো তালহা। 'তালহাতুল ফাইয়্যাদ' - দানশীল তালহা। কারণ তিনি শুধু যুদ্ধেই নয়, দানশীলতায়ও অসাধারণ ছিলেন। নিজের সম্পদ আল্লাহর পথে ব্যয় করতেন।",
      "**খন্দক ও পরবর্তী যুদ্ধ:** ৬২৭ সাল। খন্দকের যুদ্ধে তালহা পরিখা খননে অংশ নিলেন। যুদ্ধে বীরত্ব দেখালেন। ৬২৮ সাল। হুদাইবিয়ার সন্ধিতে উপস্থিত ছিলেন। ৬২৯ সাল। খায়বার বিজয়ে অংশ নিলেন। ৬৩০ সাল। মক্কা বিজয়ে রাসূলের সাথে ছিলেন। হুনায়ন ও তাবুক অভিযানেও অংশ নিলেন। প্রতিটি যুদ্ধে তালহা ছিলেন সামনের সারিতে।",
      "**দানশীলতার মহাসাগর:** তালহা ছিলেন অত্যন্ত ধনী ব্যবসায়ী। কিন্তু সম্পদ তাঁকে আল্লাহ থেকে দূরে রাখেনি। একবার হাদরামাউত থেকে ৭০০,০০০ দিরহাম আয় হলো। সেই রাতে ঘুমাতে পারলেন না। ভাবলেন: এত সম্পদ নিয়ে আল্লাহর কাছে যাব কীভাবে? সকালেই সব আত্মীয়-স্বজন ও দরিদ্রদের মধ্যে বিতরণ করে দিলেন। স্ত্রী বললেন: আমাদের জন্য কিছু রাখলেন না? তালহা মৃদু হেসে বললেন: আল্লাহ আরও দেবেন। যিনি একবার দিয়েছেন, তিনি আবারও দেবেন। তাঁর উপাধি ছিল 'তালহাতুল ফাইয়্যাদ' - দানশীল তালহা।",
      "**রাসূলের মৃত্যুর পর:** ৬৩২ সাল। রাসূল (সাঃ) মৃত্যুবরণ করলেন। তালহা গভীরভাবে শোকাহত হলেন। আবু বকর খলিফা হলে তালহা তার প্রধান সমর্থকদের একজন ছিলেন। রিদ্দার যুদ্ধে অংশ নিলেন। উমরের খিলাফতকালেও গুরুত্বপূর্ণ ভূমিকা পালন করলেন। উমর শহীদ হলে ৬ সদস্যের কমিটিতে ছিলেন তালহা। উসমান খলিফা নির্বাচিত হলেন।",
      "**উসমানের খিলাফত:** উসমানের খিলাফতকালে তালহা কুফায় ছিলেন। সেখানে ইসলাম প্রচার ও শিক্ষাদান করতেন। উসমানের শেষ দিকে ফিতনা শুরু হল। বিদ্রোহীরা উসমানকে ঘেরাও করল। তালহা মদীনায় ছিলেন না। ফিরে এসে শুনলেন উসমান শহীদ হয়েছেন। তালহা অত্যন্ত দুঃখিত হলেন।",
      "**আলীর খিলাফত:** আলী (রাঃ) খলিফা হলেন। তালহা ও যুবাইর প্রথমে বাইয়াত করলেন। কিন্তু পরে তারা চাইলেন উসমানের হত্যাকারীদের দ্রুত বিচার হোক। আলী বললেন: এখন পরিস্থিতি নিয়ন্ত্রণে আনতে হবে। বিচার পরে হবে। তালহা ও যুবাইর সন্তুষ্ট হলেন না। আয়েশা (রাঃ) ও একই মত পোষণ করলেন। তারা বসরায় গেলেন।",
      "**উটের যুদ্ধ:** ৬৫৬ সাল, জমাদিউস সানি। বসরায় উটের যুদ্ধ হল। আয়েশা (রাঃ) উটে ছিলেন বলে এই নাম। তালহা ও যুবাইর এক পক্ষে, আলী অন্য পক্ষে। কিন্তু কেউই যুদ্ধ চাননি। উভয় পক্ষ আলোচনা করছিলেন। কিন্তু আবদুল্লাহ ইবনে সাবা নামক মুনাফিকদের দল রাতে গোপনে আক্রমণ শুরু করল। উভয় পক্ষ ভাবল অন্য পক্ষ আক্রমণ করেছে। যুদ্ধ শুরু হয়ে গেল।",
      "**শাহাদাত:** যুদ্ধক্ষেত্রে তালহা ঘোড়ায় চড়ে ছিলেন। আলী (রাঃ) এর পক্ষের একজন সৈনিক - মারওয়ান ইবনুল হাকাম - তালহাকে লক্ষ্য করে তীর ছুঁড়ল। তীর তালহার পায়ে বিঁধল। রগ কেটে গেল। রক্তপাত শুরু হল। তালহা ঘোড়া থেকে পড়ে গেলেন। সাথীরা তাকে বসরা শহরে নিয়ে গেলেন। কিন্তু রক্তপাত বন্ধ হল না। তালহা বুঝলেন শেষ সময় এসে গেছে। শেষ কথা বললেন: আমি সাক্ষ্য দিচ্ছি লা ইলাহা ইল্লাল্লাহ। মুহাম্মাদ রাসূলুল্লাহ। শাহাদাত বরণ করলেন। বয়স ৬২-৬৪ বছর। বসরায় দাফন করা হল।",
      "**আলীর শোক:** আলী (রাঃ) তালহার শাহাদাতের খবর শুনে কাঁদলেন। বললেন: তালহা জান্নাতে। রাসূল (সাঃ) তাকে জান্নাতের সুসংবাদ দিয়েছেন। এই যুদ্ধ আমরা কেউই চাইনি। মুনাফিকরা এই ফিতনা সৃষ্টি করেছে। তালহার লাশের কাছে গিয়ে দোয়া করলেন। বললেন: হে আল্লাহ! তালহাকে ক্ষমা করো। সে তোমার রাসূলের সাথী ছিল। বদরী সাহাবী না হলেও বদরের সওয়াব পেয়েছিল। উহুদে রাসূলকে রক্ষা করেছিল। আশারায়ে মুবাশশারার একজন ছিল।",
      "**মর্যাদা:** তালহা ইবনে উবাইদুল্লাহ (রাঃ) - আশারায়ে মুবাশশারা, জান্নাতের সুসংবাদপ্রাপ্ত। উহুদের বীর। দানশীল সাহাবী। আবু বকরের সাথী। রাসূলের প্রিয়। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত তালহা (রাঃ)-এর জীবন প্রমাণ করে যে, চরম সাহসিকতা ও দানশীলতার মাধ্যমে একজন ব্যক্তি জান্নাতের সুসংবাদপ্রাপ্ত হতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "zubayr_ibn_al_awwam",
    "categoryId": "sahabider_jibon",
    "title": "যুবাইর ইবনুল আওয়াম (রাঃ)",
    "paragraphs": [
      "মক্কার পবিত্র ভূমিতে এক বীর সন্তানের জন্ম হয়েছিল। যুবাইর ইবনুল আওয়াম ইবনে খুওয়াইলিদ আল-আসাদি - যাঁর নাম ইসলামের ইতিহাসে সাহসিকতা ও আত্মত্যাগের প্রতীক হয়ে আছে। বনু আসাদ গোত্রের সম্ভ্রান্ত পরিবারে জন্ম নেওয়া এই শিশুটি ছিলেন রাসূল (সাঃ) এর অত্যন্ত প্রিয়। কারণ তাঁর মা সাফিয়্যা বিনতে আব্দুল মুত্তালিব ছিলেন রাসূলের ফুফু - পিতার আপন বোন। অর্থাৎ যুবাইর ছিলেন রাসূলের ফুফাতো ভাই এবং খাদিজা (রাঃ) এর ভাগ্নে। এমন সম্মানিত বংশে জন্ম নিয়েও তাঁর আসল পরিচয় হয়ে উঠল তাঁর ঈমান ও সাহসিকতায়। মাত্র ১৫-১৬ বছর বয়সে তিনি ইসলাম গ্রহণ করলেন - চতুর্থ বা পঞ্চম মুসলিম হিসেবে। এত অল্প বয়সে এত বড় সিদ্ধান্ত!",
      "**নির্যাতনের আগুন, ঈমানের পরীক্ষা:** ইসলাম গ্রহণের পর শুরু হলো কঠিন পরীক্ষা। যুবাইরের চাচা তাঁকে ইসলাম ছাড়াতে চাইলেন। তিনি কিশোর যুবাইরকে শক্ত করে রশি দিয়ে বেঁধে ফেলতেন এবং খড়ের আগুনের ধোঁয়া দিতেন। ধোঁয়ায় শ্বাস বন্ধ হয়ে আসত, চোখ জ্বলে যেত। চাচা চিৎকার করে বলতেন: 'মুহাম্মাদের ধর্ম ছাড়ো! নইলে এভাবেই শাস্তি পাবে!' কিন্তু মাত্র ১৫-১৬ বছরের কিশোর যুবাইর দৃঢ় কণ্ঠে বলতেন: **'না! কখনো না! আমি ইসলাম ছাড়ব না, এমনকি মৃত্যু হলেও!'** এই অসাধারণ দৃঢ়তা দেখে চাচা অবশেষে হার মানলেন। বুঝলেন এই কিশোরের ঈমান পাহাড়ের মতো মজবুত।",
      "**ইসলামে প্রথম তলোয়ার:** একদিন মক্কায় ভয়ঙ্কর গুজব ছড়িয়ে পড়ল - রাসূল (সাঃ) কে মেরে ফেলা হয়েছে! মাত্র ১৬ বছর বয়সী কিশোর যুবাইর এই খবর শুনে পাগলের মতো হয়ে গেলেন। তিনি তলোয়ার হাতে নিয়ে রাস্তায় বের হলেন - চোখে আগুন, হৃদয়ে প্রতিশোধের আগুন। মক্কার রাস্তায় তলোয়ার হাতে ছুটছেন। মানুষ অবাক হয়ে দেখছে। হঠাৎ রাসূল (সাঃ) এর সাথে দেখা! রাসূল (সাঃ) জীবিত! যুবাইর স্তব্ধ হয়ে গেলেন। রাসূল (সাঃ) মৃদু হেসে জিজ্ঞাসা করলেন: **'কোথায় যাচ্ছ হে যুবাইর?'** যুবাইর তলোয়ার দেখিয়ে বললেন: **'যে আপনাকে মেরেছে তাকে মারতে যাচ্ছি!'** রাসূল (সাঃ) তাঁর মাথায় হাত রাখলেন এবং দোয়া করলেন। তারপর বললেন: **'যুবাইর! তুমি ইসলামে প্রথম ব্যক্তি যে আল্লাহর পথে তলোয়ার উঁচু করেছ।'** এই ছিল যুবাইরের সাহস - মাত্র ১৬ বছর বয়সে রাসূলের জন্য জীবন দিতে প্রস্তুত!",
      "**রাসূলের হাওয়ারী:** রাসূল (সাঃ) বলেছেন: **'প্রত্যেক নবীর হাওয়ারী (বিশেষ সাথী) থাকে। ঈসা (আঃ) এর হাওয়ারী ছিল। আমার হাওয়ারী যুবাইর ইবনুল আওয়াম।'** [সহীহ বুখারী]। এটি ছিল যুবাইরের সর্বোচ্চ সম্মান। খন্দকের যুদ্ধে একটি ঘটনা এই উপাধির প্রমাণ দেয়। যুদ্ধ চলছে। বনু কুরাইযা ইহুদিরা মুসলিমদের সাথে বিশ্বাসঘাতকতা করেছে। রাসূল (সাঃ) জানতে চাইলেন তাদের অবস্থা কী। জিজ্ঞাসা করলেন: **'কে বনু কুরাইযার খবর এনে দেবে?'** সবাই চুপ - কারণ এটা ছিল অত্যন্ত বিপজ্জনক কাজ। যুবাইর স্বেচ্ছায় এগিয়ে এলেন এবং গেলেন। ফিরে এসে খবর দিলেন। রাসূল (সাঃ) আবার জিজ্ঞাসা করলেন - যুবাইর আবার গেলেন! দুইবার এই বিপজ্জনক কাজ করলেন। রাসূল (সাঃ) আবেগাপ্লুত হয়ে বললেন: **'আমার পিতা-মাতা যুবাইরের জন্য কুরবান! প্রত্যেক নবীর হাওয়ারী থাকে, আমার হাওয়ারী যুবাইর।'** [সহীহ বুখারী: ৩৭১৯]",
      "**সব যুদ্ধে বীরত্ব:** বদর, উহুদ, খন্দক, খায়বার, মক্কা বিজয়, হুনায়ন, তাবুক - রাসূল (সাঃ) এর সাথে সব যুদ্ধে অংশ নিয়েছেন। প্রতিটি যুদ্ধে অসাধারণ বীরত্ব দেখিয়েছেন। খায়বারে এক অবিশ্বাস্য ঘটনা ঘটে। ইহুদিদের শক্তিশালী দুর্গ। উঁচু প্রাচীর। কেউ উঠতে পারছে না। যুবাইর একাই দুর্গের প্রাচীর বেয়ে উপরে উঠে গেলেন এবং ভিতর থেকে দরজা খুলে দিলেন! মুসলিমরা বিজয়ী হলেন। রাসূল (সাঃ) বললেন: **'যুবাইর জান্নাতের অধিবাসী।'**",
      "**জান্নাতের সুসংবাদ:** যুবাইর ছিলেন আশারায়ে মুবাশশারার একজন - সেই দশজন মহান সাহাবী যাঁদের রাসূল (সাঃ) জীবদ্দশায় জান্নাতের সুসংবাদ দিয়েছিলেন। রাসূল (সাঃ) বলেছেন: **'আবু বকর জান্নাতে, উমর জান্নাতে, উসমান জান্নাতে, আলী জান্নাতে, তালহা জান্নাতে, যুবাইর জান্নাতে...'** [সুনানে তিরমিযী: ৩৭৪৭]। এই সুসংবাদ পাওয়া ছিল সর্বোচ্চ সম্মান।",
      "**উটের যুদ্ধ ও প্রত্যাবর্তন:** উসমান (রাঃ) শহীদ হওয়ার পর ফিতনা শুরু হলো। যুবাইর ও তালহা চাইলেন হত্যাকারীদের দ্রুত বিচার। তাঁরা আয়েশা (রাঃ) সহ বসরায় গেলেন। ৬৫৬ সাল। উটের যুদ্ধ শুরু হয়ে গেল - যদিও কেউই যুদ্ধ চাননি। যুদ্ধক্ষেত্রে আলী (রাঃ) যুবাইরকে ডাকলেন এবং বললেন: **'হে যুবাইর! তুমি কি মনে করো না রাসূল (সাঃ) বলেছিলেন: তুমি আলীর বিরুদ্ধে অন্যায়ভাবে লড়বে?'** যুবাইর হঠাৎ মনে পড়ল - হ্যাঁ! রাসূল (সাঃ) একদিন বলেছিলেন! তিনি সাথে সাথে ঘোড়া ঘুরিয়ে যুদ্ধক্ষেত্র ছেড়ে চলে গেলেন। তাঁর পুত্র আবদুল্লাহ বলল: 'আব্বা! কেন যাচ্ছেন?' যুবাইর বললেন: **'আলী আমাকে এমন কথা মনে করিয়ে দিয়েছে যা আমি ভুলে গিয়েছিলাম। আমি এই যুদ্ধে থাকব না।'**",
      "**শাহাদাত:** ৩৬ হিজরি, ৬৫৬ খ্রিস্টাব্দ। যুবাইর যুদ্ধক্ষেত্র ছেড়ে মদীনার দিকে ফিরছিলেন। বসরার কাছে 'ওয়াদিউস সিবা' নামক স্থানে বিশ্রাম নিচ্ছিলেন। নামাজ পড়ে একটু ঘুমিয়ে পড়েছিলেন। আমর ইবনে জুরমুজ নামে এক মুনাফিক - যে আলী (রাঃ) এর সেনাবাহিনীতে ছিল - গোপনে এসে ঘুমন্ত যুবাইরকে হত্যা করল। যুবাইরের তলোয়ার ও আংটি নিয়ে আলী (রাঃ) এর কাছে গেল। ভাবল পুরস্কার পাবে।",
      "**আলীর প্রতিক্রিয়া:** আমর যুবাইরের তলোয়ার নিয়ে আলী (রাঃ) এর কাছে এলো এবং বলল: 'আমি যুবাইরকে হত্যা করেছি!' আলী (রাঃ) তলোয়ার হাতে নিয়ে কাঁদতে লাগলেন। বললেন: **'এই তলোয়ার বহুবার মুশরিকদের থেকে রাসূল (সাঃ) কে রক্ষা করেছে।'** তারপর আমরকে বললেন: **'তুমি জাহান্নামের সুসংবাদ নাও! রাসূল (সাঃ) বলেছেন: যুবাইরের হত্যাকারী জাহান্নামে যাবে।'** [সহীহ বুখারী: ৩৭৪০]",
      "**দাফন ও পরিবার:** যুবাইরকে বসরায় দাফন করা হয়। তাঁর বয়স হয়েছিল ৬৭ বছর। তাঁর দশজন সন্তান ছিল। সবচেয়ে বিখ্যাত পুত্র আবদুল্লাহ ইবনে যুবাইর - যিনি পরবর্তীতে মক্কায় খলিফা হয়েছিলেন এবং কাবা ঘর পুনর্নির্মাণ করেছিলেন। যুবাইরের স্ত্রী আসমা বিনতে আবু বকর (রাঃ) - আবু বকর (রাঃ) এর কন্যা এবং আয়েশা (রাঃ) এর বোন।",
      "**মর্যাদা ও স্মরণ:** যুবাইর ইবনুল আওয়াম (রাঃ) - আশারায়ে মুবাশশারা, জান্নাতের সুসংবাদপ্রাপ্ত। রাসূলের হাওয়ারী (বিশেষ সাথী)। ইসলামে প্রথম তলোয়ার উত্তোলনকারী। সব যুদ্ধে বীরত্ব প্রদর্শনকারী। রাসূল (সাঃ) বলেছেন: **'আমার পিতা-মাতা যুবাইরের জন্য কুরবান।'** আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত যুবাইর (রাঃ)-এর জীবন প্রমাণ করে যে, একজন মুজাহিদ তাঁর বীরত্ব এবং রাসূল (সাঃ)-এর প্রতি আনুগত্যের মাধ্যমে সর্বকালে সম্মানিত হন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "ammar_ibn_yasir",
    "categoryId": "sahabider_jibon",
    "title": "আম্মার ইবনে ইয়াসির (রাঃ)",
    "paragraphs": [
      "হযরত আম্মার ইবনে ইয়াসির (রাঃ)-এর পূর্ণ নাম হলো আম্মার ইবনে ইয়াসির ইবনে আমির আল-আনাসী। তিনি ছিলেন ইসলামের প্রথম দিককার নির্যাতিত সাহাবীদের অন্যতম এবং শাহাদাতের জন্য বিখ্যাত। তাঁর উপাধি ছিল 'আবুল ইয়াকযান'। তিনি রাসূল (সাঃ)-এর কাছে অত্যন্ত প্রিয় ছিলেন এবং তাঁর সততা ও নিষ্ঠা ছিল সর্বজনস্বীকৃত।",
      "**জন্ম ও বংশ পরিচয়**\n\nতিনি মক্কায় জন্মগ্রহণ করেন। তাঁর পরিবার ইয়ামেন থেকে মক্কায় এসেছিল এবং কুরাইশ গোত্রের মিত্র ছিল, কিন্তু তারা ছিল দুর্বল ও রক্ষকহীন। ইসলাম গ্রহণ\n\nতিনি ছিলেন ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। তিনি প্রায় ১১ জনের পরে ইসলাম গ্রহণ করেন।",
      "**নির্যাতন**\n\nতাঁর পুরো পরিবার, আম্মার (রাঃ), তাঁর পিতা ইয়াসির (রাঃ) এবং তাঁর মা সুমাইয়্যা (রাঃ) কুরাইশদের হাতে অকথ্য নির্যাতনের শিকার হন। তাঁদেরকে মক্কার গরম বালিতে দিনের পর দিন নির্যাতন করা হতো। শাহাদাতের মর্যাদা\n\nতাঁর মা সুমাইয়্যা (রাঃ) ছিলেন ইসলামের প্রথম শহীদ, যাঁকে আবু জাহল নির্মমভাবে হত্যা করে। তাঁর পিতা ইয়াসির (রাঃ)-ও নির্যাতনে শহীদ হন।",
      "**রাসূল (সাঃ)-এর সান্ত্বনা\n\nরাসূল (সাঃ) তাঁদের নির্যাতন সহ্য করতে দেখে বলেছিলেন:** 'ধৈর্য ধারণ করো, হে ইয়াসিরের পরিবার, তোমাদের জন্য জান্নাতের ওয়াদা দেওয়া হলো।' আম্মারের পরীক্ষা ও মুক্তি\n\nআম্মার (রাঃ)-কে চরম নির্যাতনের মুখে রাসূল (সাঃ) ও ইসলামকে অস্বীকার করতে বাধ্য করা হয়েছিল। যদিও তিনি বাহ্যিকভাবে তা করেছিলেন, কিন্তু তাঁর হৃদয়ে ঈমান অটুট ছিল।",
      "**আল্লাহর ক্ষমা\n\nআম্মার (রাঃ) আল্লাহর কাছে ক্ষমা প্রার্থনা করলে, আল্লাহ তা'আলা ওহী নাযিল করে তাঁর জন্য ক্ষমা ঘোষণা করেন (সূরা নাহল, ১৬:** ১০৬), যেখানে চরম পরিস্থিতিতে বাধ্য হয়ে কুফরী কথা বলার বৈধতা দেওয়া হয়। হিজরত ও মদীনার জীবন\n\nতিনি মদীনায় হিজরত করেন এবং প্রথম মসজিদ, মসজিদে নববী নির্মাণের কাজে সক্রিয়ভাবে অংশগ্রহণ করেন।",
      "**নির্মাণ কাজে ভূমিকা**\n\nমসজিদে নববী নির্মাণের সময় তাঁকে দ্বিগুণ ভার বহন করতে দেখা যায়। রাসূল (সাঃ) তাঁর মাথায় লেগে থাকা ধুলো ঝেড়ে দেন এবং তাঁর প্রতি বিশেষ স্নেহ প্রকাশ করেন। সামরিক ভূমিকা\n\nতিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল যুদ্ধে অংশগ্রহণ করেন এবং তাঁর বীরত্ব ও নিষ্ঠা ছিল অতুলনীয়। জ্ঞানের মর্যাদা",
      "হযরত উমর (রাঃ) তাঁকে কুফার গভর্নর নিযুক্ত করেন। তিনি ফিকহ ও জ্ঞান বিতরণেও অবদান রাখেন।\n\n****আলী (রাঃ)-এর পক্ষে****\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি হযরত আলী (রাঃ)-এর পক্ষ অবলম্বন করেন। শাহাদাতের ভবিষ্যদ্বাণী",
      "**রাসূল (সাঃ) তাঁর সম্পর্কে ভবিষ্যদ্বাণী করেছিলেন:** 'আফসোসের বিষয় আম্মারের জন্য! তোমাকে একটি বিদ্রোহী দল হত্যা করবে। তুমি তাদের জান্নাতের দিকে আহ্বান করবে, আর তারা তোমাকে জাহান্নামের দিকে আহ্বান করবে।'\n\nশাহাদাত\n\n৩৭ হিজরিতে (৬৫৮ খ্রিস্টাব্দে) সিফফিনের যুদ্ধে তিনি মুয়াবিয়া (রাঃ)-এর পক্ষের বিদ্রোহী দলের হাতে শহীদ হন। ভবিষ্যদ্বাণীর প্রমাণ",
      "**আলীর পক্ষে:** উসমান শহীদ হলেন। আম্মার আলীর পক্ষ নিলেন। সিফফিনের যুদ্ধে অংশ নিলেন।",
      "**শাহাদাত:** ৬৫৭ সাল। সিফফিনে শহীদ হলেন। বয়স ৯০+ বছর। রাসূলের ভবিষ্যদ্বাণী সত্য হল।"
    ],
    "moral": "হযরত আম্মার (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে চরম নিপীড়ন ও নির্যাতনের মুখেও ঈমানের ওপর অটল থাকলেই জান্নাতের ওয়াদা পূরণ হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "khalid_ibn_al_walid",
    "categoryId": "sahabider_jibon",
    "title": "খালিদ ইবনে ওয়ালিদ (রাঃ)",
    "paragraphs": [
      "মক্কার বনু মাখযুম গোত্রে জন্ম। নাম খালিদ ইবনে ওয়ালিদ। জন্ম ৫৮৫ সাল। পিতা ওয়ালিদ ইবনুল মুগিরা - কুরাইশদের নেতা। ছোটবেলা থেকে তীরন্দাজি, তলোয়ার চালনা, অশ্বারোহণে দক্ষ। কুরাইশদের সেরা যোদ্ধা।",
      "**ইসলামের শত্রু:** উহুদের যুদ্ধ, ৬২৫ সাল। খালিদ তখন কাফির। মুসলিম তীরন্দাজরা পাহাড় ছেড়ে চলে গেলে খালিদ পেছন থেকে আক্রমণ করলেন। মুসলিমরা পরাজিত হলেন। খালিদের কৌশল!",
      "**ইসলাম গ্রহণ:** ৬২৯ সাল। হুদাইবিয়ার সন্ধির পর। খালিদ ভাবলেন: মুহাম্মাদ সত্যিই নবী। রাসূল বললেন: খালিদের মতো বুদ্ধিমান মানুষ ইসলাম থেকে দূরে থাকতে পারে না। খালিদ আমর ইবনুল আস ও উসমান ইবনে তালহার সাথে মদীনায় গেলেন। রাসূল খুশি হয়ে বললেন: মক্কা তার কলিজার টুকরো আমাদের কাছে পাঠিয়ে দিয়েছে!",
      "**মুতার যুদ্ধ:** ৬২৯ সাল। রোমান সাম্রাজ্যের বিরুদ্ধে যুদ্ধ। মুসলিম ৩,০০০, শত্রু ২,০০,০০০! যায়িদ শহীদ হলেন। জাফর শহীদ হলেন। আবদুল্লাহ শহীদ হলেন। খালিদ পতাকা তুলে নিলেন। অসাধারণ কৌশলে সেনাবাহিনী নিরাপদে ফিরিয়ে আনলেন। রাসূল বললেন: খালিদ আল্লাহর তলোয়ার! সেদিন থেকে উপাধি - সাইফুল্লাহ।",
      "**মক্কা বিজয়:** ৬৩০ সাল। খালিদ এক দলের নেতৃত্ব দিলেন। বিনা রক্তপাতে মক্কা বিজয়। হুনায়ন ও তায়েফের যুদ্ধেও নেতৃত্ব দিলেন।",
      "**রিদ্দার যুদ্ধ:** ৬৩২ সাল। রাসূল মারা গেলেন। আরবের বিভিন্ন গোত্র ইসলাম ত্যাগ করল। আবু বকর খালিদকে পাঠালেন। মুসাইলিমা কাযযাব - মিথ্যা নবী। ৪০,০০০ সৈন্য। ইয়ামামার যুদ্ধ। ভয়াবহ যুদ্ধ। ৭০০ হাফিজ শহীদ হলেন। খালিদ মুসাইলিমাকে হত্যা করলেন।",
      "**ইরাক বিজয়:** ৬৩৩ সাল। পারস্য সাম্রাজ্যের বিরুদ্ধে যুদ্ধ। উল্লাইস, হিরা, আনবার - একের পর এক বিজয়। ৪ মাসে ইরাকের বেশিরভাগ অংশ বিজয়!",
      "**শামে অভিযান:** ৬৩৪ সাল। আবু বকর খালিদকে শামে পাঠালেন। ইরাক থেকে শাম - ৫ দিনে মরুভূমি পার! অসম্ভব যাত্রা। বসরা, দামেস্ক - একের পর এক বিজয়।",
      "**ইয়ারমুকের যুদ্ধ:** ৬৩৬ সাল। ইসলামের ইতিহাসে সবচেয়ে গুরুত্বপূর্ণ যুদ্ধ। রোমান সাম্রাজ্য ২,৪০,০০০ সৈন্য। মুসলিম ৪০,০০০। খালিদ সেনাপতি। ৬ দিন যুদ্ধ। খালিদের কৌশল অতুলনীয়। রোমানরা পরাজিত। শাম মুসলিমদের হাতে।",
      "**পদচ্যুতি:** উমর খলিফা হলেন। খালিদকে সেনাপতি পদ থেকে সরিয়ে দিলেন। কেন? উমর ভয় পেলেন - মানুষ খালিদকে নিয়ে গর্ব করবে, আল্লাহকে ভুলে যাবে। খালিদ কিছু বললেন না। সাধারণ সৈনিক হয়ে যুদ্ধ চালিয়ে গেলেন। আনুগত্যের অনন্য উদাহরণ!",
      "**মৃত্যু:** ৬৪২ সাল। হিমস বা মদীনায় মৃত্যু। বয়স ৫৭ বছর। মৃত্যুশয্যায় বললেন: আমি ১০০টিরও বেশি যুদ্ধে লড়েছি। আমার শরীরে এমন কোনো জায়গা নেই যেখানে তলোয়ার বা তীরের আঘাত নেই। অথচ আমি বিছানায় মরছি উটের মতো। কাপুরুষদের চোখে ঘুম আসুক না! ১০০+ যুদ্ধ, একটিও পরাজয় নেই! সাইফুল্লাহ - আল্লাহর তলোয়ার।"
    ],
    "moral": "হযরত খালিদ ইবনে ওয়ালিদ (রাঃ)-এর জীবন প্রমাণ করে যে, একজন শ্রেষ্ঠ সামরিক কমান্ডার তাঁর জীবনের সমস্ত দক্ষতা ব্যক্তিগত খ্যাতি নয়, বরং আল্লাহর পথে উৎসর্গ করতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "sahabi_id": "abu_ubaydah_ibn_al_jarrah",
    "title": "আবু উবাইদাহ ইবনুল জাররাহ (রাঃ)",
    "paragraphs": [
      "হযরত আবু উবাইদাহ (রাঃ)-এর পূর্ণ নাম হলো আমের ইবনে আব্দুল্লাহ ইবনে আল-জাররাহ আল-ফিহরী আল-কুরাইশী। তিনি ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং ইসলামের একজন শ্রেষ্ঠ সেনাপতি। তাঁর উপাধি ছিল 'আমীনুল উম্মাহ' (উম্মতের আমানতদার), যা রাসূল (সাঃ) তাঁকে প্রদান করেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় কুরাইশ গোত্রের বনু ফিহর শাখায় জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিকের ইসলাম গ্রহণকারী।\n\n****নির্যাতন****\n\n****ইসলাম গ্রহণের কারণে তিনিও কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন। হিজরত ও সান্নিধ্য****",
      "**তিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন। সামরিক ভূমিকা:** উহুদ যুদ্ধ\n\nউহুদের যুদ্ধে তিনি চরম বীরত্ব প্রদর্শন করেন। যখন রাসূল (সাঃ)-এর চেহারা মুবারকে লৌহবর্মের দুটি কড়া ঢুকে গিয়েছিল, তখন আবু উবাইদাহ (রাঃ) নিজের দাঁত দিয়ে সেগুলো টেনে বের করেন।\n\nএই সময় তিনি নিজের দুটি দাঁত হারান, যা তাঁর গভীর ভালোবাসা ও আত্মত্যাগের প্রমাণ। আমীনুল উম্মাহ উপাধি",
      "**নবী (সাঃ) একবার নাজরানের খ্রিস্টানদের প্রতিনিধি দলকে তাঁর সম্পর্কে বলেন:** 'আমি তোমাদের এমন একজনকে পাঠাব, যিনি আমানতদারিতে অতুলনীয়।' পরে তিনি আবু উবাইদাহ (রাঃ)-কে প্রেরণ করেন এবং তাঁকে আমীনুল উম্মাহ উপাধি দেন।\n\nখিলাফতের ভূমিকা\n\nহযরত আবু বকর (রাঃ) এবং উমর (রাঃ)-এর খিলাফতকালে তিনি সিরিয়ার মুসলিম বাহিনীর প্রধান সেনাপতি ছিলেন। সামরিক বিজয়: সিরিয়া বিজয়",
      "তিনি রোমানদের বিরুদ্ধে পরিচালিত যুদ্ধে নেতৃত্ব দেন এবং সিরিয়ার বিস্তীর্ণ অঞ্চল, বিশেষ করে দামেস্ক, জর্দান এবং ফিলিস্তিন বিজয় সম্পন্ন করেন।\n\n****ইয়ারমুকের যুদ্ধ****\n\nইয়ারমুকের যুদ্ধের আগে হযরত উমর (রাঃ) খালিদ ইবনে ওয়ালিদ (রাঃ)-এর বদলে তাঁকে প্রধান সেনাপতির দায়িত্ব দেন। তিনি অত্যন্ত বিনয়ের সাথে সেই দায়িত্ব গ্রহণ করেন। পদমর্যাদা",
      "তিনি সামরিক কমান্ডার হিসেবে তাঁর প্রজ্ঞা ও দক্ষতার জন্য সুপরিচিত ছিলেন। ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত বিনয়ী, দুনিয়াবিমুখ এবং কঠোরভাবে আল্লাহর তাকওয়াবান। তিনি তাঁর সৈন্যদের সাথে মিশে থাকতেন।\n\n****মৃত্যু****",
      "১৮ হিজরিতে (৬৩৯ খ্রিস্টাব্দে) সিরিয়ায় আমওয়াস (Amwas) মহামারীতে তিনি আক্রান্ত হন। নেতৃত্ব\n\n****মহামারীর সময় তিনি মুসলিম সৈন্যদের সুস্থতা নিশ্চিত করতে সর্বোচ্চ চেষ্টা করেন। শাহাদাত****\n\n****এই মহামারীতেই তিনি ইন্তেকাল করেন। তাঁকে জর্ডানের কাছে দাফন করা হয়। তাঁর জীবনী****",
      "তাঁর জীবনী ইসলামের ইতিহাসে শ্রেষ্ঠ আমানতদারী, বিনয় এবং রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসার এক আদর্শ উদাহরণ।",
      "**সিরিয়ার সেনাপতি:** উমরের খিলাফতে সিরিয়ার সেনাপতি। খালিদকে সম্মান করতেন।",
      "**প্লেগে মৃত্যু:** ৬৩৯ সাল। আমওয়াসের প্লেগে শহীদ। বয়স ৫৮ বছর। আমিনুল উম্মাহ।"
    ],
    "moral": "হযরত আবু উবাইদাহ (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা বিনয়, আমানতদারী এবং ব্যক্তিগত ত্যাগের মাধ্যমে উম্মতের ভালোবাসা ও আস্থা অর্জন করতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "abu_ubaidah_ibn_al_jarrah"
  },
  {
    "sahabi_id": "abdullah_ibn_masud",
    "title": "আব্দুল্লাহ ইবনে মাসউদ (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে মাসউদ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুর রহমান আব্দুল্লাহ ইবনে মাসউদ ইবনে গাফিল আল-হুযালী। তিনি ছিলেন ইসলামের ইতিহাসের প্রথম দিকের অন্যতম শ্রেষ্ঠ কুরআন পাঠক ও ফকীহ সাহাবী। তাঁর উপাধি ছিল 'আব্দুল্লাহ'। তাঁকে 'সাহাবীদের মধ্যে ফিকহের ইমাম' বলা হতো। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় জন্মগ্রহণ করেন। তিনি ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী এবং ইসলাম গ্রহণকারী ষষ্ঠ ব্যক্তি।\n\n****প্রথম তেলাওয়াত****\n\nতিনি মক্কার কাফেরদের সামনে প্রকাশ্যে প্রথম কুরআন তেলাওয়াত করা সাহাবী। এর জন্য তিনি কাফেরদের হাতে মার খেয়েছিলেন। কুরআনের শ্রেষ্ঠ পাঠক",
      "**রাসূল (সাঃ) তাঁর তেলাওয়াতের প্রশংসা করতেন। রাসূল (সাঃ) বলেছিলেন:** 'যে ব্যক্তি কুরআনকে ঠিক যেভাবে নাযিল হয়েছে, সেভাবে পড়তে চায়, সে যেন ইবনে উম্মে আবদ (আব্দুল্লাহ ইবনে মাসউদ)-এর কিরাআতে পড়ে।'\n\nইলমের উৎস\n\nতিনি সরাসরি রাসূল (সাঃ)-এর কাছ থেকে ৭০টিরও বেশি সূরা শিখেছিলেন। তিনি রাসূল (সাঃ)-এর জুতো ও মিসওয়াক বহন করতেন। জ্ঞানের মর্যাদা",
      "হযরত উমর (রাঃ) তাঁর জ্ঞানের গভীরতার কারণে তাঁকে অত্যন্ত শ্রদ্ধা করতেন। ফতোয়া\n\nতিনি ফিকহী মাসআলায় অত্যন্ত গভীর জ্ঞান রাখতেন। তাঁর ফতোয়াগুলোই পরবর্তীতে হানাফি ফিকহের ভিত্তির অন্যতম উৎস হিসেবে কাজ করেছে।\n\n****কুফার শিক্ষক****",
      "হযরত উমর (রাঃ) তাঁকে কুফায় শিক্ষক ও কাজীর (বিচারক) দায়িত্ব দিয়ে প্রেরণ করেন। সেখানে তিনি হাজার হাজার ছাত্র তৈরি করেন, যাঁরা পরবর্তীতে কুফার ফিকহী ধারাকে সমৃদ্ধ করেন। প্রশাসনিক ভূমিকা (শিক্ষক)\n\nকুফায় তাঁর শিক্ষকতা ছিল একটি গুরুত্বপূর্ণ প্রশাসনিক মিশন। তিনি তাঁর ছাত্রদের হাদিসের সনদ এবং ফিকহের জ্ঞান প্রদান করেন।\n\n****সামরিক ভূমিকা****",
      "তিনি বদর, উহুদ সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। বদরের যুদ্ধে অবদান\n\n****বদরের যুদ্ধের পর তিনি আবু জাহলকে হত্যা করেন এবং তার মাথা নিয়ে আসেন। ব্যক্তিগত চরিত্র****\n\nতিনি ছিলেন খুবই বিনয়ী এবং দুনিয়াবিমুখ (যাহিদ)। তাঁর ছাত্ররা",
      "**তাঁর ছাত্রদের মধ্যে অন্যতম:** আলকামা ইবনে কায়স এবং মাসরুক ইবনে আল-আজদা', যারা ইরাকের ফিকহের ভিত্তিস্থাপন করেন।\n\nহাদিস বর্ণনায় সতর্কতা\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন, যাতে রাসূল (সাঃ)-এর কোনো কথা ভুলভাবে বর্ণিত না হয়। খিলাফতের ভূমিকা",
      "তিনি হযরত উসমান (রাঃ)-এর খিলাফতকাল পর্যন্ত জীবিত ছিলেন। মৃত্যু\n\nতিনি ৩২ বা ৩৩ হিজরিতে (৬৫৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।",
      "**কুফার শিক্ষক:** উমর তাকে কুফায় পাঠালেন। হাজার হাজার ছাত্র তৈরি করলেন।",
      "**মৃত্যু:** ৬৫৩ সাল। মদীনায় মৃত্যু। কুরআনের শ্রেষ্ঠ পাঠক।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে মাসউদ (রাঃ)-এর জীবন প্রমাণ করে যে, প্রকৃত মর্যাদা শারীরিক শক্তি বা সম্পদ দ্বারা আসে না, বরং কুরআন ও সুন্নাহর গভীর জ্ঞানের মাধ্যমে অর্জিত হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা",
    "id": "abdullah_ibn_masud"
  },
  {
    "sahabi_id": "muadh_ibn_jabal",
    "title": "মুয়াজ ইবনে জাবাল (রাঃ)",
    "paragraphs": [
      "হযরত মুয়াজ ইবনে জাবাল (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুর রহমান মুয়াজ ইবনে জাবাল ইবনে আমর আল-খাযরাজী আল-আনসারী।",
      "তিনি ছিলেন ইসলামের অন্যতম শ্রেষ্ঠ ফকীহ ও মুয়াল্লিম (শিক্ষক)।\n\nতাঁর উপাধি ছিল আবু আব্দুর রহমান।\n\nরাসূল (সাঃ) তাঁকে 'হালাল-হারাম সম্পর্কে সবচেয়ে জ্ঞানী' সাহাবী হিসেবে প্রশংসা করেন।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন। প্রাথমিক জীবন\n\nতিনি মদীনায় ইসলাম গ্রহণের পর রাসূল (সাঃ)-এর ঘনিষ্ঠ সাহাবীদের মধ্যে স্থান পান। সামরিক ভূমিকা",
      "**তিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন।\n\nপ্রশাসনিক মিশন:** ইয়ামেনের গভর্নর\n\nরাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ইয়ামেনের শিক্ষক ও গভর্নর হিসেবে প্রেরণ করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন। ফতোয়ার পদ্ধতি",
      "**ইয়ামেনে যাওয়ার সময় রাসূল (সাঃ) তাঁকে জিজ্ঞেস করেন:** 'তুমি কীভাবে ফায়সালা করবে?' তিনি বলেন: 'প্রথমে আল্লাহর কিতাব দিয়ে, এরপর আপনার সুন্নাহ দিয়ে, এরপর ইজতিহাদ (নিজের যুক্তি) দিয়ে।\n\n' রাসূল (সাঃ) তাঁর এই জবাবে সন্তুষ্ট হন।\n\nএই ঘটনা ফিকহের উসূল (মূলনীতি)-এর ভিত্তি স্থাপন করে। জ্ঞানের মর্যাদা",
      "**রাসূল (সাঃ) তাঁকে খুব ভালোবাসতেন এবং বলেছিলেন:** 'মুয়াজ হলেন কিয়ামতের দিন আলেমদের অগ্রভাগে থাকবেন।' তিনি ছিলেন হাদিস ও ফিকহের গভীর জ্ঞানের অধিকারী। হাদিস বর্ণনায় সতর্কতা\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্ক ছিলেন। মৃত্যু",
      "**ইয়েমেনের শিক্ষক:** রাসূল তাকে ইয়েমেনে পাঠালেন শিক্ষক ও বিচারক হিসেবে।",
      "**ইজতিহাদ:** রাসূল জিজ্ঞাসা করলেন কীভাবে বিচার করবে। মুয়াজ: কুরআন, সুন্নাহ, তারপর ইজতিহাদ।",
      "**প্লেগে শাহাদাত:** ৬৩৯ সাল। সিরিয়ায় প্লেগে শহীদ। বয়স ৩৩-৩৮ বছর।",
      "**হালাল-হারামের জ্ঞানী:** রাসূল বলেছেন: মুয়াজ হালাল-হারামে সবচেয়ে জ্ঞানী।"
    ],
    "moral": "হযরত মুয়াজ ইবনে জাবাল (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানের গভীরতা এবং আল্লাহর পথে তার ব্যবহার একজন মানুষকে শ্রেষ্ঠতম আলেম ও পথপ্রদর্শক বানাতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "muadh_ibn_jabal"
  },
  {
    "id": "abu_hurairah",
    "categoryId": "sahabider_jibon",
    "title": "আবু হুরাইরা (রাঃ)",
    "paragraphs": [
      "ইয়েমেনের দাওস গোত্রে জন্ম। আসল নাম আবদুর রহমান ইবনে সাখর। ডাকনাম আবু হুরাইরা - বিড়ালছানার পিতা। কেন? ছোটবেলায় একটা বিড়ালছানা পুষতেন। দরিদ্র পরিবার। কিন্তু হবেন সবচেয়ে বেশি হাদিস বর্ণনাকারী!",
      "**ইসলাম গ্রহণ:** ৬২৮ সাল। খায়বারের যুদ্ধের সময়। তুফাইল ইবনে আমরের সাথে মদীনায় এলেন। রাসূল (সাঃ) এর সাথে দেখা। সাথে সাথে ইসলাম গ্রহণ করলেন। বয়স ৩০ বছর।",
      "**সুফফার সাথী:** মদীনায় কোথায় থাকবেন? মসজিদে নববীর সুফফায়। আহলে সুফফা - দরিদ্র মুহাজির ও আনসার যারা মসজিদে থাকতেন। আবু হুরাইরা তাদের একজন। খাবার নেই। পেট বেঁধে রাখতেন। কিন্তু রাসূলের সাথে থাকার সৌভাগ্য!",
      "**ক্ষুধার গল্প:** একদিন প্রচণ্ড ক্ষুধা। রাস্তায় পড়ে থাকা পাথরে পা দিয়ে মাড়ালেন। সাহাবীরা ভাবলেন পাগল হয়ে গেছেন। আসলে ক্ষুধায় জ্ঞান হারাচ্ছিলেন। রাসূল (সাঃ) বুঝলেন। বাড়িতে নিয়ে গিয়ে দুধ খাওয়ালেন। আবু হুরাইরা কাঁদলেন খুশিতে।",
      "**হাদিস মুখস্থ:** রাসূল (সাঃ) বললেন: তোমাদের মধ্যে কে চায় আমার কথা ভুলে না যেতে? আবু হুরাইরা চাদর বিছালেন। রাসূল (সাঃ) তাতে কিছু রাখার ভঙ্গি করলেন। আবু হুরাইরা চাদর বুকে জড়ালেন। রাসূল (সাঃ) বললেন: এখন থেকে কিছু ভুলবে না। সত্যি হল! ৫,৩৭৪টি হাদিস বর্ণনা করেছেন - সবচেয়ে বেশি!",
      "**যুদ্ধসমূহ:** খায়বার, মক্কা বিজয়, হুনায়ন, তাবুক - সব যুদ্ধে অংশ নিলেন। কিন্তু তার আসল জিহাদ ছিল হাদিস সংরক্ষণ।",
      "**বাহরাইনের গভর্নর:** উমর (রাঃ) তাকে বাহরাইনের গভর্নর বানালেন। দুই বছর পর উমর জিজ্ঞাসা করলেন: কীভাবে এত সম্পদ হল? আবু হুরাইরা বললেন: ব্যবসা ও উপহার। উমর বললেন: অর্ধেক রাষ্ট্রীয় কোষাগারে দাও। আবু হুরাইরা দিয়ে দিলেন। পদ ছেড়ে দিলেন।",
      "**শিক্ষাদান:** মদীনায় ফিরে এসে হাদিস শেখাতে লাগলেন। হাজার হাজার ছাত্র। সাঈদ ইবনুল মুসাইয়্যিব, ইবনে সিরিন, নাফি - সবাই তার ছাত্র। মসজিদে নববীতে বসে হাদিস বলতেন। মানুষ ভিড় করত।",
      "**বিনয়:** একবার বললেন: তোমরা বলো আবু হুরাইরা বেশি হাদিস বলে। কিন্তু আমার মুহাজির ভাইয়েরা ব্যবসায় ব্যস্ত ছিলেন, আনসার ভাইয়েরা চাষাবাদে। আমি রাসূলের সাথে লেগে থাকতাম, পেট বেঁধে।",
      "**ইবাদত:** রাতে তিন ভাগ করতেন। এক ভাগ নিজে নামায পড়তেন, এক ভাগ স্ত্রী, এক ভাগ দাসী। এভাবে সারা রাত ঘরে নামায হত।",
      "**মৃত্যু:** ৫৯ হিজরি, ৬৭৮ সাল। মদীনায় মৃত্যু। বয়স ৭৮ বছর। মৃত্যুর আগে কাঁদলেন। জিজ্ঞাসা করা হল কেন? বললেন: দুনিয়ার মায়ায় নয়, আখিরাতের ভয়ে। জান্নাতুল বাকীতে দাফন। সবচেয়ে বেশি হাদিস বর্ণনাকারী। রাসূলের জ্ঞানের ভাণ্ডার।"
    ],
    "moral": "হযরত আবু হুরাইরা (রাঃ)-এর জীবন প্রমাণ করে যে, জীবনের সমস্ত ভোগ-বিলাস ত্যাগ করে শুধু রাসূল (সাঃ)-এর সুন্নাহ সংরক্ষণে আত্মনিবেদন করলে আল্লাহ সর্বোচ্চ মর্যাদা দান করেন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abdullah_ibn_abbas",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে আব্বাস (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে আব্বাস (রাঃ)-এর পূর্ণ নাম হলো আবু আল-আব্বাস আব্দুল্লাহ ইবনে আল-আব্বাস ইবনে আব্দুল মুত্তালিব আল-হাশিমি। তিনি ছিলেন রাসূল (সাঃ)-এর চাচাতো ভাই এবং কুরআনের ব্যাখ্যার ক্ষেত্রে শ্রেষ্ঠতম সাহাবী। তাঁর উপাধি ছিল 'আল-হিব্রু আল-উম্মাহ' (উম্মতের পণ্ডিত) এবং 'মুফাসসিরুল কুরআন' (কুরআনের ব্যাখ্যাকার)।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি হিজরতের তিন বছর আগে মক্কায় জন্মগ্রহণ করেন। তাঁর বয়স যখন ১৩ বছর, তখন মক্কা বিজয়ের আগে তিনি তাঁর পিতার সাথে ইসলাম গ্রহণ করেন। জ্ঞানের প্রতি আগ্রহ\n\nতিনি তাঁর শৈশব থেকেই জ্ঞানের প্রতি গভীর আগ্রহ দেখান। রাসূল (সাঃ)-এর ইন্তেকালের সময় তাঁর বয়স ছিল মাত্র ১৩ বছর।",
      "**রাসূল (সাঃ)-এর দু'আ\n\nরাসূল (সাঃ) তাঁর জন্য বিশেষভাবে দু'আ করেছিলেন:** 'হে আল্লাহ! তাকে দ্বীনের জ্ঞান দান করো এবং কুরআনের ব্যাখ্যা শিক্ষা দাও।' রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি রাসূল (সাঃ)-এর জীবনের শেষ তিন বছর তাঁর সান্নিধ্যে ছিলেন এবং এই অল্প সময়েই রাসূল (সাঃ)-এর কাছ থেকে গভীর জ্ঞান লাভ করেন।",
      "**হাদিস সংগ্রহ**\n\nরাসূল (সাঃ)-এর ইন্তেকালের পর তিনি অন্যান্য সাহাবীদের কাছ থেকে জ্ঞান অর্জনের জন্য কঠোর পরিশ্রম করেন। তিনি জ্ঞান লাভের জন্য অনেক সাহাবীর দরজায় অপেক্ষা করতেন। ফিকহ ও তাফসীর\n\nতিনি ছিলেন তাঁর যুগের শ্রেষ্ঠ মুফাসসির এবং ফকীহ। তাঁর তাফসীরের পদ্ধতি ছিল হাদিস, সাহাবীদের বক্তব্য এবং আরবি ভাষার গভীর জ্ঞানের ওপর নির্ভরশীল।",
      "**তাঁর তাফসীর**\n\nতিনি কুরআনের প্রতিটি আয়াতের শাব্দিক অর্থ, ঐতিহাসিক প্রেক্ষাপট এবং ফিকহী সিদ্ধান্ত ব্যাখ্যা করতেন। ইজতিহাদ\n\nহযরত উমর (রাঃ) তাঁর প্রখর মেধার কারণে অল্প বয়সেও তাঁকে বড় বড় সাহাবীদের মজলিসে অংশগ্রহণের সুযোগ দিতেন। সামরিক ভূমিকা",
      "তিনি রাসূল (সাঃ)-এর শেষ জীবনের কিছু অভিযানে অংশগ্রহণ করেন। খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা হিসেবে ভূমিকা রাখেন।\n\nহযরত আলী (রাঃ)-এর খিলাফতকালে তিনি বসরার গভর্নর হিসেবে দায়িত্ব পালন করেন। রাজনৈতিক পরীক্ষা",
      "তিনি সিফফিনের যুদ্ধের পর খারিজিদের সাথে বিতর্কে অংশগ্রহণ করেন এবং তাঁর যুক্তি দিয়ে হাজার হাজার খারিজিকে তাদের ভুল থেকে ফিরিয়ে আনেন। জ্ঞান বিতরণ\n\nতিনি জীবনের শেষভাগে মক্কা ও তায়েফে বসবাস করে হাজার হাজার ছাত্রকে হাদিস, তাফসীর ও ফিকহের জ্ঞান দান করেন।\n\n****তাঁর ছাত্ররা****",
      "**তাঁর ছাত্রদের মধ্যে অন্যতম:** মুজাহিদ, ইকরিমা এবং সাঈদ ইবনে জুবাইর, যারা পরবর্তীতে তাফসীর ও ফিকহের ক্ষেত্রে ইমাম হিসেবে পরিচিত হন। মৃত্যু\n\nতিনি ৬৮ হিজরিতে (৬৮৭ খ্রিস্টাব্দে) তায়েফ শহরে ইন্তেকাল করেন। দাফন\n\nতাঁকে তায়েফেই দাফন করা হয়। তাঁর জীবনী",
      "**তাফসীর:** ইবনে আব্বাস তাফসীরে পারদর্শী ছিলেন। তার তাফসীর আজও অনুসরণ করা হয়।",
      "**মৃত্যু:** ৬৮৭ সাল। তায়েফে মৃত্যু। বয়স ৭১ বছর। তাফসীরের ইমাম।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে আব্বাস (রাঃ)-এর জীবন প্রমাণ করে যে, রাসূল (সাঃ)-এর দোয়ার ফলস্বরূপ জ্ঞান লাভের মাধ্যমে অল্প বয়সেই উম্মতের সর্বোচ্চ পণ্ডিত হওয়া সম্ভব।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "sahabi_id": "fatimah_bint_muhammad",
    "title": "ফাতিমা বিনতে মুহাম্মদ (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। ৬০৫ বা ৬১৫ সাল। পিতা মুহাম্মাদ (সাঃ), মা খাদিজা (রাঃ)। রাসূলের সবচেয়ে ছোট ও প্রিয় কন্যা। চার কন্যার মধ্যে একমাত্র যিনি রাসূলের মৃত্যুর পর বেঁচে ছিলেন। উপাধি: আয-যাহরা (উজ্জ্বল), আল-বাতুল (আল্লাহর ইবাদতে নিমগ্ন)।",
      "**শৈশব:** ছোটবেলা থেকে পিতার সাথে। কুরাইশরা যখন রাসূলকে কষ্ট দিত, ফাতিমা কাঁদতেন। একবার রাসূল (সাঃ) কাবায় নামায পড়ছেন। আবু জাহল উটের নাড়িভুঁড়ি এনে পিঠে চাপিয়ে দিল। ফাতিমা ছুটে এসে সরিয়ে দিলেন। রাসূলকে রক্ষা করলেন।",
      "**হিজরত:** ৬২২ সাল। রাসূল (সাঃ) মদীনায় হিজরত করলেন। কিছুদিন পর ফাতিমা, উম্মে কুলসুম ও সাওদা (রাঃ) মদীনায় এলেন। যায়িদ ইবনে হারিসা নিয়ে এলেন।",
      "**বিবাহ:** ৬২৩-৬২৫ সাল। আবু বকর ও উমর প্রস্তাব দিলেন। রাসূল (সাঃ) প্রত্যাখ্যান করলেন। আলী (রাঃ) লজ্জা পেয়ে প্রস্তাব দিতে পারছিলেন না। সাহাবীরা উৎসাহ দিলেন। আলী প্রস্তাব দিলেন। রাসূল (সাঃ) খুশি হলেন। বললেন: আল্লাহ আমাকে নির্দেশ দিয়েছেন। বিয়ে হল। মোহরানা ৪৮০ দিরহাম। আলী বর্ম বিক্রি করে দিলেন। উসমান সেই বর্ম কিনে আলীকে উপহার দিলেন।",
      "**সংসার জীবন:** অত্যন্ত সাদাসিধে জীবন। নিজে হাতে যাঁতা পিষতেন, রান্না করতেন, ঘর পরিষ্কার করতেন। হাত ফোসকা পড়ে যেত। একবার রাসূল (সাঃ) কে বললেন: একটা দাসী দিন। রাসূল (সাঃ) বললেন: আমি তোমাকে এর চেয়ে ভালো কিছু শেখাব? ঘুমানোর আগে ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদুলিল্লাহ, ৩৪ বার আল্লাহু আকবার বলো। এটা দাসীর চেয়ে ভালো। ফাতিমা সারা জীবন এটা পড়তেন।",
      "**সন্তান:** চার সন্তান। দুই ছেলে - হাসান ও হুসাইন। দুই মেয়া - যয়নাব ও উম্মে কুলসুম। রাসূল (সাঃ) হাসান-হুসাইনকে অত্যন্ত ভালোবাসতেন। বলেছেন: হাসান ও হুসাইন জান্নাতের যুবকদের সর্দার।",
      "**রাসূলের প্রিয়তমা:** রাসূল (সাঃ) বলতেন: ফাতিমা আমার অংশ। যে তাকে কষ্ট দেয় সে আমাকে কষ্ট দেয়। আয়েশা (রাঃ) বলেন: ফাতিমা ছাড়া আর কাউকে দেখিনি যে হাঁটা, কথা বলা সবকিছুতে রাসূলের মতো। ফাতিমা এলে রাসূল (সাঃ) দাঁড়িয়ে যেতেন, চুমু দিতেন, নিজের জায়গায় বসাতেন।",
      "**রাসূলের মৃত্যু:** ৬৩২ সাল। রাসূল (সাঃ) অসুস্থ। ফাতিমাকে ডেকে কিছু বললেন। ফাতিমা কাঁদলেন। আবার কিছু বললেন। ফাতিমা হাসলেন। আয়েশা (রাঃ) পরে জিজ্ঞাসা করলেন কী বলেছিলেন? ফাতিমা বললেন: প্রথমে বললেন আমি মারা যাব। তাই কাঁদলাম। তারপর বললেন: তুমি আমার পরিবারের মধ্যে প্রথম আমার সাথে মিলিত হবে। তাই হাসলাম।",
      "**ফাদাক বিষয়:** রাসূল (সাঃ) মারা গেলেন। ফাদাক জমি নিয়ে বিষয় হল। ফাতিমা দাবি করলেন এটা রাসূল (সাঃ) তাকে দিয়েছিলেন। আবু বকর বললেন: রাসূল (সাঃ) বলেছেন নবীরা উত্তরাধিকার রেখে যান না, যা রেখে যান তা সদকা। ফাতিমা মন খারাপ করলেন। আলী (রাঃ) বুঝিয়ে বললেন।",
      "**মৃত্যু:** ৬৩২ সাল, ৩ রমজান বা ১৩ রমজান। রাসূলের মৃত্যুর ৬ মাস পর। বয়স ১৮ বা ২৮ বছর। আলী (রাঃ) গোসল করালেন, দাফন করলেন। রাতে দাফন - ফাতিমার ইচ্ছা অনুযায়ী। জান্নাতুল বাকীতে। রাসূল (সাঃ) বলেছেন: ফাতিমা জান্নাতের নারীদের সর্দার। পবিত্র, ধৈর্যশীল, আল্লাহর প্রিয়।"
    ],
    "moral": "হযরত ফাতিমা (রাঃ)-এর জীবন প্রমাণ করে যে, নারীত্বের সর্বোচ্চ মর্যাদা অর্জন করা যায় পবিত্রতা, বিনয় এবং আল্লাহর প্রতি গভীর আনুগত্যের মাধ্যমে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "fatima_bint_muhammad"
  },
  {
    "id": "hamza_ibn_abd_al_muttalib",
    "categoryId": "sahabider_jibon",
    "title": "হামযা ইবনে আব্দুল মুত্তালিব (রাঃ)",
    "paragraphs": [
      "মক্কার প্রান্তরে এক বীর যোদ্ধার জন্ম হয়েছিল। হামযা ইবনে আব্দুল মুত্তালিব - যাঁর নাম ইসলামের ইতিহাসে 'আসাদুল্লাহ' (আল্লাহর সিংহ) এবং 'সাইয়্যিদুশ শুহাদা' (শহীদদের সর্দার) হিসেবে খ্যাত। তিনি ছিলেন রাসূল (সাঃ) এর চাচা - কিন্তু বয়সে মাত্র ২-৪ বছরের বড়। তাঁরা একই ধাত্রী সুয়াইবার দুধ পান করেছিলেন, তাই দুধ ভাই ছিলেন। শক্তিশালী গড়ন, অসাধারণ সাহসী, দক্ষ শিকারী - মক্কার সবচেয়ে ভয়ঙ্কর যোদ্ধা হিসেবে পরিচিত ছিলেন। তাঁর নাম শুনলেই শত্রুরা ভয় পেত।",
      "**ইসলাম গ্রহণ - ক্রোধ থেকে ঈমান:** ৬১৫ সাল। হামযা শিকার থেকে ফিরছেন - ধনুক কাঁধে, শিকার হাতে। বাড়ির সামনে এক দাসী দাঁড়িয়ে আছে। তিনি বললেন: **'হে হামযা! আপনি শিকারে ছিলেন, কিন্তু এখানে কী ঘটেছে জানেন? আবু জাহল আপনার ভাতিজা মুহাম্মাদকে কাবার কাছে গালি দিয়েছে, মারধর করেছে! আপনার ভাতিজাকে অপমান করেছে!'** হামযার চোখ আগুনের মতো জ্বলে উঠল। তিনি শিকার ফেলে ধনুক হাতে সোজা কাবার দিকে ছুটলেন। কুরাইশদের নেতারা বসে আছে। আবু জাহলও সেখানে। হামযা সিংহের মতো এগিয়ে গেলেন এবং ধনুক দিয়ে আবু জাহলের মাথায় প্রচণ্ড আঘাত করলেন! মাথা ফেটে রক্ত বের হলো। হামযা গর্জন করে বললেন: **'তুমি মুহাম্মাদকে গালি দিয়েছ? আমিও তার ধর্মে আছি! আমি সাক্ষ্য দিচ্ছি - লা ইলাহা ইল্লাল্লাহ, মুহাম্মাদুর রাসূলুল্লাহ!'** কুরাইশরা স্তব্ধ হয়ে গেল! হামযা মুসলমান হয়ে গেছেন! মুসলিমরা খুশিতে উচ্ছ্বসিত হলেন - ইসলাম পেল এক শক্তিশালী যোদ্ধা!",
      "**হিজরত:** ৬২২ সাল। মদীনায় হিজরত করলেন। রাসূল (সাঃ) তাকে সালামা ইবনে সালামার সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**বদরের যুদ্ধ:** ৬২৪ সাল। প্রথম যুদ্ধ। হামযা অসাধারণ বীরত্ব দেখালেন। উতবা ইবনে রাবিয়াকে হত্যা করলেন। শায়বা ও আসওয়াদকেও। মুসলিমদের বিজয়ে হামযার বড় ভূমিকা।",
      "**উহুদের প্রস্তুতি:** ৬২৫ সাল। কুরাইশরা প্রতিশোধ নিতে আসছে। ৩,০০০ সৈন্য। হামযা প্রস্তুত। উটপাখির পালক মাথায় বেঁধে নিলেন - যাতে যুদ্ধক্ষেত্রে চেনা যায়।",
      "**উহুদের যুদ্ধ:** হামযা যুদ্ধক্ষেত্রে সিংহের মতো লড়ছেন। একের পর এক কাফির মারছেন। হিন্দা বিনতে উতবা - যার পিতা বদরে হামযার হাতে মারা গেছে - প্রতিশোধ নিতে চায়। ওয়াহশি নামে এক আবিসিনিয়ান দাসকে বলেছে: হামযাকে মারলে তোমাকে মুক্ত করব। ওয়াহশি লুকিয়ে আছে। হামযা একজন কাফিরকে মারছেন। ওয়াহশি বর্শা ছুঁড়ল। হামযার পেটে বিঁধল। হামযা শহীদ হলেন। বয়স ৫৭-৫৯ বছর।",
      "**হিন্দার নৃশংসতা:** হিন্দা হামযার লাশের কাছে এল। পেট চিরে কলিজা বের করল। চিবাতে লাগল। কিন্তু গিলতে পারল না। থুথু ফেলে দিল। কান, নাক কেটে মালা বানাল। রাসূল (সাঃ) দেখলেন। কাঁদলেন। বললেন: হামযা শহীদদের সর্দার।",
      "**দাফন:** রাসূল (সাঃ) হামযাকে কাফন দিতে চাইলেন। কিন্তু কাপড় ছোট। মাথা ঢাকলে পা বের হয়, পা ঢাকলে মাথা বের হয়। রাসূল (সাঃ) মাথা ঢেকে পায়ে ঘাস দিলেন। হামযার সাথে আবদুল্লাহ ইবনে জাহশকেও দাফন করলেন - এক কবরে দুই শহীদ।",
      "**রাসূলের শোক:** রাসূল (সাঃ) বললেন: আমি কখনো হামযার মতো মুসিবতে পড়িনি। মক্কা বিজয়ের সময় ওয়াহশি পালিয়ে গিয়েছিল। পরে এসে ইসলাম গ্রহণ করল। রাসূল (সাঃ) মাফ করলেন কিন্তু বললেন: আমার সামনে এসো না।",
      "**উপাধি:** সাইয়্যিদুশ শুহাদা - শহীদদের সর্দার। আসাদুল্লাহ - আল্লাহর সিংহ। রাসূল (সাঃ) এর প্রিয় চাচা। ইসলামের বীর যোদ্ধা। উহুদে শাহাদাত বরণ করেন।"
    ],
    "moral": "হযরত হামযা (রাঃ)-এর জীবন প্রমাণ করে যে, সত্যের পক্ষে দাঁড়াতে এবং ইসলামকে রক্ষা করতে সর্বোচ্চ বীরত্ব ও আত্মত্যাগ অপরিহার্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "abdullah_ibn_umar",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে উমর (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে উমর (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে উমর ইবনে আল-খাত্তাব আল-কুরাইশী আল-আদাবী। তিনি ছিলেন ইসলামের দ্বিতীয় খলীফা হযরত উমর (রাঃ)-এর পুত্র এবং সুন্নাহর কঠোর অনুসারী সাহাবী। তাঁর উপাধি ছিল আব্দুর রহমান। তাঁকে 'আল-আবিদ' (অতি ইবাদতকারী) উপাধিতেও ডাকা হতো।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি নবুয়তের প্রথম বছরগুলোতে মক্কায় জন্মগ্রহণ করেন। তিনি তাঁর পিতা উমর (রাঃ)-এর সাথে শৈশবেই ইসলাম গ্রহণ করেন। শৈশবের জীবন\n\nতিনি তাঁর শৈশব রাসূল (সাঃ)-এর সান্নিধ্যে কাটান এবং অল্প বয়স থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন। সামরিক ভূমিকা",
      "তিনি উহুদের যুদ্ধে অংশগ্রহণ করতে চেয়েছিলেন, কিন্তু তখন তাঁর বয়স কম থাকায় রাসূল (সাঃ) তাঁকে অনুমতি দেননি।\n\n****প্রথম যুদ্ধে অংশগ্রহণ****\n\nতিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি সকল সামরিক অভিযানে রাসূল (সাঃ)-এর পাশে ছিলেন। হাদিস বর্ণনাকারী",
      "তিনি সর্বাধিক হাদিস বর্ণনাকারী সাহাবীদের মধ্যে অন্যতম। তাঁর মাধ্যমে প্রায় ২,৬৩০টি হাদিস বর্ণিত হয়েছে। সুন্নাহর অনুসরণ\n\nতিনি রাসূল (সাঃ)-এর প্রতিটি কাজ ও নির্দেশকে কঠোরভাবে অনুসরণ করতেন। তিনি এমনভাবে সুন্নাহ পালন করতেন, যাতে কোনো প্রকার ব্যতিক্রম না হয়।\n\n****জ্ঞানের মর্যাদা****",
      "তিনি ফিকহ, হাদিস এবং ইসলামের আইন সম্পর্কে গভীর জ্ঞান রাখতেন। তাঁর ফতোয়াগুলো মদীনার আলেমদের কাছে অত্যন্ত গুরুত্বপূর্ণ ছিল। ইজতিহাদ ও ইবাদত\n\nতিনি অতি ইবাদতগুজার ছিলেন। তিনি তাঁর জীবনের বেশিরভাগ সময় সালাত, সাওম (রোজা) এবং ইবাদতে ব্যয় করতেন। খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা হিসেবে ভূমিকা রাখেন।",
      "**ফিতনা থেকে দূরে থাকা**\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে কঠোরভাবে দূরে থাকেন। তিনি মনে করতেন, মুসলিমদের মধ্যে রক্তপাত ঘটানো আল্লাহর পছন্দ নয়। তিনি কখনোই কোনো খলীফার পদ বা সরকারি দায়িত্ব গ্রহণ করেননি, যদিও তাঁকে বারবার প্রস্তাব দেওয়া হয়েছিল।\n\n**রাজনৈতিক নিরপেক্ষতা**",
      "তিনি ছিলেন সম্পূর্ণ রাজনৈতিকভাবে নিরপেক্ষ। তিনি হযরত আলী (রাঃ) বা মুয়াবিয়া (রাঃ) কারোরই পক্ষ নেননি। মৃত্যু\n\nতিনি ৭৩ হিজরিতে (৬৯৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। জানাযা ও দাফন\n\n****তাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী****",
      "তাঁর জীবনী ইসলামের ইতিহাসে সুন্নাহর প্রতি কঠোর আনুগত্য, বিনয় এবং রাজনৈতিক ফিতনা থেকে দূরে থাকার প্রজ্ঞার এক আদর্শ উদাহরণ।",
      "**সব যুদ্ধে:** বদর, উহুদ, খন্দক - সব যুদ্ধে অংশ নিলেন।",
      "**মৃত্যু:** ৭০৯ সাল। মদীনায় মৃত্যু। বয়স ৮৭ বছর। দীর্ঘজীবী সাহাবী।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে উমর (রাঃ)-এর জীবন প্রমাণ করে যে, জীবনের প্রতিটি ক্ষেত্রে রাসূল (সাঃ)-এর সুন্নাহকে কঠোরভাবে অনুসরণ করাই একজন মুমিনের প্রধান কর্তব্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "anas_ibn_malik",
    "categoryId": "sahabider_jibon",
    "title": "আনাস ইবনে মালিক (রাঃ)",
    "paragraphs": [
      "হযরত আনাস ইবনে মালিক (রাঃ)-এর পূর্ণ নাম হলো আবু হামযা আনাস ইবনে মালিক ইবনে নযর আল-আনসারী আল-খাযরাজী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর দীর্ঘ দশ বছরের খাদেম (সেবক)। তাঁর উপাধি ছিল আবু হামযা। তিনি রাসূল (সাঃ)-এর কাছ থেকে বিশেষভাবে স্নেহ ও দু'আ লাভ করেন।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। মদীনায় হিজরতের পরপরই তাঁর মা উম্মে সুলাইম (রাঃ) তাঁকে রাসূল (সাঃ)-এর খেদমতে অর্পণ করেন। রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি মদীনায় হিজরতের পর থেকে রাসূল (সাঃ)-এর ইন্তেকাল পর্যন্ত একটানা দশ বছর তাঁর ব্যক্তিগত খাদেম হিসেবে নিয়োজিত ছিলেন।",
      "**রাসূল (সাঃ)-এর সেবা\n\nতিনি রাসূল (সাঃ)-এর সমস্ত ব্যক্তিগত কাজ, যেমন:** ওযু করানো, জুতো রাখা, খাবার পরিবেশন, ইত্যাদিতে সাহায্য করতেন। রাসূল (সাঃ)-এর দু'আ\n\nআনাস (রাঃ)-এর জন্য রাসূল (সাঃ) বিশেষভাবে দু'আ করেছিলেন: 'হে আল্লাহ! তার ধন-সম্পদ ও সন্তান-সন্ততি বাড়িয়ে দাও এবং তাকে বরকত দান করো।'",
      "এই দু'আর ফলস্বরূপ, তিনি দীর্ঘজীবন পান, তাঁর বিপুল সম্পদ হয় এবং তাঁর পুত্র-পৌত্রদের সংখ্যা প্রায় একশত বিশ জন হয়েছিল। হাদিস বর্ণনাকারী\n\nতিনি রাসূল (সাঃ)-এর জীবনের ব্যক্তিগত ও অভ্যন্তরীণ দিকগুলো সম্পর্কে সবচেয়ে বেশি জানতেন। তিনি প্রায় ২,২৮৬টি হাদিস বর্ণনা করেন। সামরিক ভূমিকা\n\nতিনি রাসূল (সাঃ)-এর সঙ্গে খন্দকের যুদ্ধ, হুদাইবিয়ার সন্ধি, মক্কা বিজয় সহ অনেক গুরুত্বপূর্ণ অভিযানে অংশগ্রহণ করেন।",
      "**জ্ঞানের মর্যাদা**\n\nতিনি তাঁর যুগের আলেমদের কাছে হাদিস, ফিকহ এবং সীরাতের একজন গুরুত্বপূর্ণ উৎস ছিলেন। জ্ঞান বিতরণ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর বসরায় হিজরত করেন এবং সেখানে হাদিস শিক্ষাদানের এক বিশাল কেন্দ্র প্রতিষ্ঠা করেন। তাঁর ছাত্রদের সংখ্যা ছিল বিপুল। তাঁর কাছ থেকে হাসান আল-বসরী এবং মুহাম্মদ ইবনে সিরীন সহ তাবেয়ীনের বহু বড় ইমাম হাদিস শিখেছেন।",
      "**ফিতনা থেকে দূরে থাকা**\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে ফিতনা থেকে দূরে থাকার চেষ্টা করেন। তিনি তাঁর জীবনের শেষ দিন পর্যন্ত হাদিস বর্ণনা ও রাসূল (সাঃ)-এর স্মৃতিচারণ করতেন। দীর্ঘ জীবন\n\nতিনি দীর্ঘজীবন লাভ করেন এবং প্রায় ১০০ বছর বেঁচে ছিলেন। তাঁর শেষ জীবন",
      "**মৃত্যুর আগে তিনি তাঁর পরিবারের সদস্যদের আল্লাহর পথে অবিচল থাকতে উপদেশ দেন। মৃত্যু**\n\nতিনি ৯৩ হিজরিতে (৭১২ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন।\n\n**দাফন**",
      "**তাঁকে বসরায় দাফন করা হয়। তাঁর জীবনী**\n\nতাঁর জীবনী রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসা, ব্যক্তিগত সেবার মাধ্যমে জ্ঞান অর্জন এবং বরকতের এক শ্রেষ্ঠ উদাহরণ।",
      "**হাদিস বর্ণনা:** ১৫৪০+ হাদিস বর্ণনা করেছেন।",
      "**মৃত্যু:** ৬৯৭ সাল। মদীনায় মৃত্যু। বয়স ৭৮ বছর।"
    ],
    "moral": "হযরত আনাস (রাঃ)-এর জীবন প্রমাণ করে যে, রাসূল (সাঃ)-এর ব্যক্তিগত সেবার মাধ্যমে জ্ঞান অর্জন করলে আল্লাহর পক্ষ থেকে জীবন ও সম্পদে বরকত লাভ হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "said_ibn_zayd",
    "categoryId": "sahabider_jibon",
    "title": "সাঈদ ইবনে যায়েদ (রাঃ)",
    "paragraphs": [
      "হযরত সাঈদ ইবনে যায়েদ (রাঃ)-এর পূর্ণ নাম হলো সাঈদ ইবনে যায়েদ ইবনে আমর ইবনে নুফায়েল আল-কুরাইশী আল-আদাবী। তিনি ছিলেন আশারায়ে মুবাশশারাহ (জান্নাতের সুসংবাদপ্রাপ্ত ১০ জন)-এর অন্যতম। তিনি ছিলেন ইসলামের দ্বিতীয় খলীফা হযরত উমর ইবনুল খাত্তাব (রাঃ)-এর ফুফুতো ভাই এবং ভগ্নিপতি।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি মক্কার বনু আদী গোত্রে জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিকের ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। নির্যাতন\n\nইসলাম গ্রহণের কারণে তিনি এবং তাঁর স্ত্রী ফাতিমা বিনতে আল-খাত্তাব (হযরত উমরের বোন) কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন।",
      "**উমরের ইসলাম গ্রহণ**\n\nহযরত উমর (রাঃ) তাঁদের ইসলাম গ্রহণের কথা জানতে পেরেই উত্তেজিত হয়ে তাঁদের বাড়িতে আক্রমণ করেন। এই ঘটনাই পরে উমর (রাঃ)-এর ইসলাম গ্রহণের কারণ হয়। হিজরত ও সান্নিধ্য\n\nতিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন।",
      "**সামরিক ভূমিকা**\n\nতিনি বদর যুদ্ধ ব্যতীত রাসূল (সাঃ)-এর সকল যুদ্ধে অংশগ্রহণ করেন। বদরের সময় তিনি রাসূল (সাঃ)-এর নির্দেশে একটি গুরুত্বপূর্ণ মিশনে নিয়োজিত ছিলেন। বদর যুদ্ধে অনুপস্থিত থাকলেও রাসূল (সাঃ) তাঁকে বদরের অংশগ্রহণকারীদের মতো গনিমত ও মর্যাদা দান করেন। আশারায়ে মুবাশশারাহর সদস্য\n\nতিনি রাসূল (সাঃ)-এর জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত সেই দশজন সাহাবীর অন্যতম।",
      "**খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা ছিলেন। সামরিক বিজয়:** সিরিয়া অভিযান\n\nহযরত উমর (রাঃ)-এর খিলাফতকালে তিনি সিরিয়া বিজয়ের অভিযানে গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন এবং মুসলিম বাহিনীর নেতৃত্ব দেন। প্রশাসনিক দায়িত্ব",
      "তিনি কুফা শহর প্রতিষ্ঠায় অংশগ্রহণ করেন। তিনি প্রশাসক হিসেবেও দায়িত্ব পালন করেন।\n\n****ফিতনা থেকে দূরে থাকা****\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার সিদ্ধান্ত নেন। তিনি মদীনা ছেড়ে সিরিয়ার আল-আকীক উপত্যকায় নির্জন জীবন যাপন করেন। জ্ঞান ও ইবাদত",
      "তিনি তাঁর জীবনকে ইবাদত ও জ্ঞান চর্চায় ব্যয় করেন এবং হাদিস বর্ণনায় সতর্কতা অবলম্বন করতেন।\n\n****তাঁর স্ত্রী****\n\nতাঁর স্ত্রী ফাতিমা বিনতে আল-খাত্তাব (রাঃ) ছিলেন একজন পুণ্যবতী ও প্রথম দিকের ইসলাম গ্রহণকারী সাহাবিয়্যা। মৃত্যু",
      "তিনি ৫০ হিজরি বা ৫১ হিজরিতে (৬৭০ খ্রিস্টাব্দে) মদীনার আল-আকীক উপত্যকায় ইন্তেকাল করেন। জানাযা ও দাফন\n\nহযরত আব্দুল্লাহ ইবনে উমর (রাঃ) তাঁর জানাযার সালাতে ইমামতি করেন। তাঁকে মদীনার কাছেই দাফন করা হয়।\n\n****তাঁর মর্যাদা****",
      "**সাঈদ:** আশারায়ে মুবাশশারার একজন। জান্নাতের সুসংবাদপ্রাপ্ত।",
      "**মৃত্যু:** ৬৭১ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত সাঈদ ইবনে যায়েদ (রাঃ)-এর জীবন প্রমাণ করে যে, কঠিনতম নির্যাতনের মুখেও ঈমানের ওপর দৃঢ় থাকা এবং রাসূল (সাঃ)-এর আনুগত্য করাই জান্নাতের পথ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abu_said_al_khudri",
    "categoryId": "sahabider_jibon",
    "title": "আবু সাঈদ আল-খুদরী (রাঃ)",
    "paragraphs": [
      "হযরত আবু সাঈদ আল-খুদরী (রাঃ)-এর পূর্ণ নাম হলো সা'দ ইবনে মালিক ইবনে সিনান আল-খুদরী আল-আনসারী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন তরুণ সাহাবী এবং অধিক হাদিস বর্ণনাকারীদের অন্যতম। তাঁর উপাধি ছিল আবু সাঈদ। তিনি মদীনার খাযরাজ গোত্রের বনু খুদরা শাখার অন্তর্ভুক্ত ছিলেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মদীনায় জন্মগ্রহণ করেন। তিনি মদীনার আনসারদের মধ্যে একজন ছিলেন এবং শৈশবেই ইসলাম গ্রহণ করেন।\n\n****প্রাথমিক জীবন****\n\nতাঁর পিতা মালিক ইবনে সিনান (রাঃ) উহুদের যুদ্ধে শহীদ হন। এই ঘটনার পর তিনি তাঁর মায়ের তত্ত্বাবধানে বেড়ে ওঠেন। সামরিক ভূমিকা",
      "তিনি তাঁর পিতাকে হারানোর পর অল্প বয়সেই উহুদের যুদ্ধে অংশগ্রহণের অনুমতি চেয়েছিলেন, কিন্তু তখন তাঁর বয়স কম থাকায় রাসূল (সাঃ) তাঁকে অনুমতি দেননি।\n\n****প্রথম যুদ্ধে অংশগ্রহণ****\n\nতিনি খন্দকের যুদ্ধে (৫ হি.) প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে তাঁর পাশে ছিলেন। হাদিস বর্ণনাকারী",
      "তিনি অধিক হাদিস বর্ণনাকারী সাহাবীদের মধ্যে অন্যতম। তাঁর মাধ্যমে প্রায় ১,১৭০টি হাদিস বর্ণিত হয়েছে। জ্ঞান অন্বেষণ\n\nতিনি রাসূল (সাঃ)-এর সান্নিধ্যে থেকে হাদিস ও ফিকহের জ্ঞান লাভ করেন এবং তাঁর জীবন উৎসর্গ করেন জ্ঞান বিতরণে।\n\n****তাঁর জ্ঞানের মর্যাদা****",
      "**তাবেয়ীনের যুগে তিনি মদীনার একজন প্রধান মুফতি এবং হাদিস শিক্ষকের ভূমিকা পালন করেন। ফিকহী অবস্থান**\n\nতিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর ফতোয়াগুলো মদীনার আলেমদের কাছে গুরুত্বপূর্ণ ছিল। হাদিস বর্ণনার পদ্ধতি\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন এবং নিশ্চিত না হয়ে কোনো হাদিস বর্ণনা করতেন না।",
      "**জিহাদে অংশগ্রহণ**\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে পরিচালিত বিভিন্ন সামরিক অভিযানে অংশগ্রহণ করেন। ফিতনা থেকে দূরে থাকা\n\nতিনি ফিতনার সময় সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার নীতি অবলম্বন করেন। মৃত্যু",
      "তিনি ৬৪ হিজরি বা ৭৪ হিজরিতে (৬৮৩/৬৯৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।\n\n****তাঁর জীবনী****",
      "তাঁর জীবনী অল্প বয়সে পিতাকে হারানোর পরও জ্ঞানার্জনের প্রতি তাঁর নিষ্ঠা এবং সুন্নাহর সংরক্ষণে তাঁর অবিচল অঙ্গীকারের এক আদর্শ উদাহরণ। তিনি তাঁর জীবনের বেশিরভাগ সময় জ্ঞান বিতরণে ব্যয় করেছেন। তাঁর বর্ণিত হাদিসগুলো ফিকহ ও আক্বীদার ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ। তাঁর ইবাদত ছিল সুপরিচিত। তাঁর জীবন\n\nতাঁর জীবন আল্লাহর সন্তুষ্টির জন্য উৎসর্গীকৃত ছিল।",
      "**খুদরী:** হাদিস বর্ণনায় পারদর্শী। ১১৭০+ হাদিস বর্ণনা করেছেন।",
      "**মৃত্যু:** ৬৯৩ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত আবু সাঈদ আল-খুদরী (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানার্জনের প্রতি নিরবচ্ছিন্ন নিষ্ঠা এবং সুন্নাহর সংরক্ষণে আত্মনিবেদন করলে আল্লাহ সর্বোচ্চ মর্যাদা দান করেন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "ubayy_ibn_kaab",
    "categoryId": "sahabider_jibon",
    "title": "উবাই ইবনে কা'ব (রাঃ)",
    "paragraphs": [
      "হযরত উবাই ইবনে কা'ব (আরবি: أُبَيّ بْن كَعْب; মৃত্যু: ৬৪২) ছিলেন একজন মহান সাহাবী এবং কুরআনের অন্যতম শ্রেষ্ঠ ক্বারী। রাসূল (সাঃ) তাঁকে 'সাইয়্যিদুল কুররা' উপাধি দিয়েছিলেন।",
      "**বংশ ও প্রাথমিক জীবন:** উবাই ইবনে কা'ব (রাঃ) মদীনার বনু নাজ্জার গোত্রে জন্মগ্রহণ করেন। তিনি ছিলেন অত্যন্ত বুদ্ধিমান এবং লেখাপড়ায় পারদর্শী। জাহেলিয়াতের যুগেও তিনি আরবি লিখতে ও পড়তে জানতেন, যা সেই সময় বিরল ছিল।",
      "**ইসলাম গ্রহণ:** আকাবার দ্বিতীয় বাইয়াতে উবাই ইবনে কা'ব (রাঃ) অংশগ্রহণ করেন এবং ইসলাম গ্রহণ করেন। তিনি ছিলেন সেই ৭৫ জন আনসারের একজন যারা রাসূল (সাঃ)-কে মদীনায় আমন্ত্রণ জানিয়েছিলেন। রাসূল (সাঃ) মদীনায় হিজরত করার পর তিনি তাঁর ঘনিষ্ঠ সাহাবীদের একজন হয়ে ওঠেন।",
      "**কুরআনের ক্বারী:** উবাই ইবনে কা'ব (রাঃ) ছিলেন কুরআনের সর্বশ্রেষ্ঠ ক্বারীদের একজন। রাসূল (সাঃ) বলেছেন: 'তাদের মধ্যে সবচেয়ে ভালো ক্বারী হলো উবাই ইবনে কা'ব।' রাসূল (সাঃ) নিজে তাঁর কাছে কুরআন শুনতেন এবং তাঁর তিলাওয়াতের প্রশংসা করতেন।",
      "একবার রাসূল (সাঃ) উবাই (রাঃ)-কে বললেন: 'আল্লাহ আমাকে আদেশ করেছেন যেন আমি তোমার কাছে কুরআন তিলাওয়াত করি।' উবাই (রাঃ) কাঁদতে কাঁদতে বললেন: 'আল্লাহ কি আমার নাম নিয়ে আপনাকে বলেছেন?' রাসূল (সাঃ) বললেন: 'হ্যাঁ।' উবাই (রাঃ) আনন্দে কাঁদতে লাগলেন।",
      "**কুরআন সংকলন:** উবাই ইবনে কা'ব (রাঃ) ছিলেন রাসূল (সাঃ)-এর ওহী লেখকদের একজন। যখনই কুরআনের আয়াত নাজিল হতো, তিনি তা লিখে রাখতেন। আবু বকর ও উমর (রাঃ)-এর খিলাফতকালে কুরআন সংকলনের কাজে তিনি গুরুত্বপূর্ণ ভূমিকা পালন করেন। উসমান (রাঃ)-এর সময় যখন কুরআনের মাসহাফ তৈরি হয়, তখনও তাঁর পরামর্শ নেওয়া হয়।",
      "**ফিকহ ও ফতোয়া:** উবাই ইবনে কা'ব (রাঃ) ছিলেন একজন বড় ফকীহ। মানুষ তাঁর কাছে কঠিন মাসআলা জিজ্ঞেস করতে আসত। উমর (রাঃ) তাঁকে অত্যন্ত সম্মান করতেন এবং গুরুত্বপূর্ণ বিষয়ে তাঁর পরামর্শ নিতেন। উমর (রাঃ) বলতেন: 'উবাই হলো আমাদের সর্দার।'",
      "**ইবাদত ও তাকওয়া:** তিনি ছিলেন অত্যন্ত ইবাদতগুজার। রাতে দীর্ঘ নামাজ পড়তেন এবং কুরআন তিলাওয়াত করতেন। তাঁর তিলাওয়াত শুনে মানুষ কাঁদত। তিনি প্রায়ই রোজা রাখতেন এবং আল্লাহর যিকিরে মশগুল থাকতেন।",
      "**চরিত্র:** উবাই ইবনে কা'ব (রাঃ) ছিলেন অত্যন্ত বিনয়ী এবং নম্র। তিনি কখনো নিজেকে বড় মনে করতেন না। তিনি ছিলেন দানশীল এবং দরিদ্রদের সাহায্য করতেন। তাঁর জ্ঞান সত্ত্বেও তিনি সর্বদা বলতেন: 'আমি যা জানি না তা আল্লাহই ভালো জানেন।'",
      "**হাদিস বর্ণনা:** উবাই ইবনে কা'ব (রাঃ) ১৬৪টি হাদিস বর্ণনা করেছেন। তাঁর বর্ণিত হাদিসগুলো সহীহ বুখারী, মুসলিম এবং অন্যান্য হাদিস গ্রন্থে সংকলিত আছে।",
      "**ইন্তেকাল:** ৬৪২ খ্রিস্টাব্দে (২২ হিজরি) মদীনায় খলিফা উমর (রাঃ)-এর শাসনামলে তিনি ইন্তেকাল করেন। উমর (রাঃ) তাঁর জানাজায় অংশ নেন এবং বলেন: 'আজ মুসলিমদের একজন বড় আলিম চলে গেলেন।' তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত উবাই ইবনে কা'ব (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর কিতাবকে মুখস্থ করা, বোঝা এবং তার সংরক্ষণে অবদান রাখাই শ্রেষ্ঠত্বের মাপকাঠি।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "zaid_ibn_thabit",
    "categoryId": "sahabider_jibon",
    "title": "যায়েদ ইবনে সাবিত (রাঃ)",
    "paragraphs": [
      "হযরত যায়েদ ইবনে সাবিত (রাঃ)-এর পূর্ণ নাম হলো যায়েদ ইবনে সাবিত ইবনে আল-দাহহাক আল-আনসারী আল-খাযরাজী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর প্রধান ওহী লেখক এবং কুরআনের সংকলক। তাঁর উপাধি ছিল 'আবূ সাঈদ'। তিনি কুরআনের জ্ঞান এবং ফিকহী সিদ্ধান্ত (বিশেষ করে ফারায়েয) সম্পর্কে গভীর জ্ঞান রাখতেন।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন। প্রাথমিক জীবন\n\n**মদীনায় হিজরতের সময় তাঁর বয়স ছিল মাত্র ১১ বছর। তিনি রাসূল (সাঃ)-এর সান্নিধ্য লাভ করেন। ওহী লেখক**",
      "তিনি ছিলেন রাসূল (সাঃ)-এর প্রধান ওহী লেখকদের মধ্যে অন্যতম। রাসূল (সাঃ) যখনই ওহী পেতেন, তখনই তাঁকে ডেকে তা লিখে রাখতে বলতেন।\n\n****ভাষাজ্ঞান****\n\nরাসূল (সাঃ)-এর নির্দেশে তিনি মাত্র সতেরো দিনে ইহুদিদের ভাষা (সিরিয়াক/হিব্রু) শিখে ফেলেন, যাতে তিনি তাদের চিঠি-পত্রের অনুবাদ করতে পারেন। সামরিক ভূমিকা",
      "তিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে তাঁর পাশে ছিলেন।\n\n****কুরআন সংকলন (প্রধান মিশন)****\n\nহযরত আবু বকর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে কুরআন সংকলন ও প্রচার কমিটির প্রধান হিসেবে তিনি কাজ করেন। এই কাজে তাঁর ভূমিকা ছিল ঐতিহাসিক। তিনি ছিলেন কুরআনের হাফিয এবং রাসূল (সাঃ)-এর শেষবার কুরআন তেলাওয়াত শোনার সাক্ষী।",
      "**ফারায়েয বিশেষজ্ঞ**\n\nতিনি ছিলেন সাহাবীদের মধ্যে ফারায়েয (উত্তরাধিকার আইন) সম্পর্কে সবচেয়ে জ্ঞানী ব্যক্তি। হযরত উমর (রাঃ) তাঁর জ্ঞানের উচ্চ মর্যাদা দিতেন। জ্ঞানের মর্যাদা\n\nহযরত উমর (রাঃ) তাঁকে মদীনার প্রধান ফকীহ এবং মুফতি হিসেবে নিযুক্ত করেন। হাদিস ও ফিকহ",
      "তিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্ক ছিলেন এবং ফিকহের ক্ষেত্রে গভীর জ্ঞান রাখতেন।\n\n****প্রশাসনিক দায়িত্ব****\n\nখুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি মদীনার কাজীর (বিচারক) এবং বাইতুল মালের প্রধান হিসেবে দায়িত্ব পালন করেন। মৃত্যু",
      "তিনি ৪৫ হিজরিতে (৬৬৫ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।\n\n****তাঁর জীবনী****",
      "তাঁর জীবনী প্রশাসনিক ক্ষেত্রে তাঁর জ্ঞান ও দক্ষতার প্রমাণ বহন করে এবং কুরআনের সংরক্ষণে তাঁর অসামান্য অবদান ইসলামের ইতিহাসে চিরস্মরণীয়।",
      "**কুরআন লেখক:** রাসূলের ওহী লেখকদের প্রধান। কুরআন সংকলনে নেতৃত্ব দিয়েছেন।",
      "**মৃত্যু:** ৬৬৫ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত যায়েদ ইবনে সাবিত (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, বিশেষত কুরআন ও সুন্নাহর জ্ঞান, একজন ব্যক্তিকে প্রশাসনিক ও ধর্মীয় উভয় ক্ষেত্রে নেতৃত্ব দেওয়ার সুযোগ করে দেয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "khalid_ibn_saeed",
    "categoryId": "sahabider_jibon",
    "title": "খালিদ ইবনে সাইদ (রাঃ)",
    "paragraphs": [
      "হযরত খালিদ ইবনে সাইদ (আরবি: خَالِد بْن سَعِيد; মৃত্যু: ৬৩৪) ছিলেন ইসলামের প্রথম দিকের একজন মহান সাহাবী এবং হাবশায় হিজরতকারীদের একজন। তিনি ছিলেন অত্যন্ত সাহসী এবং ত্যাগী মুসলিম।",
      "**বংশ ও প্রাথমিক জীবন:** খালিদ ইবনে সাইদ (রাঃ) মক্কার সম্ভ্রান্ত কুরাইশ বংশে জন্মগ্রহণ করেন। তাঁর পিতা সাইদ ইবনুল আস ছিলেন কুরাইশের নেতা এবং ইসলামের কট্টর বিরোধী। খালিদ ছিলেন অত্যন্ত বুদ্ধিমান এবং সত্যান্বেষী।",
      "**স্বপ্ন ও ইসলাম গ্রহণ:** খালিদ ইবনে সাইদ (রাঃ) একটি স্বপ্ন দেখেন যে তিনি আগুনের কিনারায় দাঁড়িয়ে আছেন এবং তাঁর পিতা তাঁকে আগুনে ঠেলে দিচ্ছেন। হঠাৎ রাসূল (সাঃ) এসে তাঁকে ধরে ফেলেন এবং আগুন থেকে বাঁচান। এই স্বপ্ন দেখে তিনি আবু বকর (রাঃ)-এর কাছে গেলেন। আবু বকর (রাঃ) বললেন: 'এটা একটি ভালো স্বপ্ন। আগুন হলো জাহান্নাম এবং মুহাম্মাদ (সাঃ) তোমাকে তা থেকে বাঁচাবেন। তুমি তাঁর দ্বীন গ্রহণ করো।'",
      "খালিদ (রাঃ) সাথে সাথে রাসূল (সাঃ)-এর কাছে গেলেন এবং ইসলাম গ্রহণ করলেন। তিনি ছিলেন পঞ্চম বা ষষ্ঠ মুসলিম। তাঁর স্ত্রী উমাইনা বিনতে খালাফও ইসলাম গ্রহণ করেন।",
      "**পিতার নির্যাতন:** যখন খালিদের পিতা সাইদ জানতে পারলেন যে তাঁর ছেলে মুসলিম হয়েছে, তখন তিনি ক্রোধে উন্মত্ত হলেন। তিনি খালিদকে মারধর করলেন এবং ঘর থেকে বের করে দিলেন। তিনি বললেন: 'তুমি আমার ছেলে নও। আমার সম্পত্তি থেকে তুমি কিছুই পাবে না।' খালিদ (রাঃ) ধৈর্যের সাথে সব সহ্য করলেন এবং ইসলামে অটল রইলেন।",
      "**হাবশায় হিজরত:** নির্যাতন বৃদ্ধি পেলে খালিদ ইবনে সাইদ (রাঃ) তাঁর স্ত্রীকে নিয়ে হাবশায় (আবিসিনিয়া) হিজরত করেন। তিনি ছিলেন প্রথম দলের হিজরতকারীদের একজন। হাবশায় তাঁদের তিন সন্তান জন্মগ্রহণ করে, সাইদ, আমা এবং উম্মে খালিদ। তাঁরা সেখানে নিরাপদে ইসলাম পালন করতেন।",
      "**মদীনায় হিজরত:** খায়বারের যুদ্ধের পর (৭ হিজরি) খালিদ ইবনে সাইদ (রাঃ) তাঁর পরিবার নিয়ে মদীনায় হিজরত করেন। রাসূল (সাঃ) তাঁকে দেখে অত্যন্ত খুশি হলেন এবং তাঁকে সম্মানের সাথে গ্রহণ করলেন। রাসূল (সাঃ) তাঁকে বিভিন্ন গুরুত্বপূর্ণ দায়িত্ব দেন।",
      "**যাকাত সংগ্রহকারী:** রাসূল (সাঃ) খালিদ ইবনে সাইদ (রাঃ)-কে ইয়েমেনে যাকাত সংগ্রহের জন্য পাঠান। তিনি সততা ও বিশ্বস্ততার সাথে এই দায়িত্ব পালন করেন এবং প্রচুর যাকাত নিয়ে মদীনায় ফিরে আসেন। রাসূল (সাঃ) তাঁর কাজে সন্তুষ্ট হন।",
      "**রাসূলের ওফাতের পর:** রাসূল (সাঃ)-এর ওফাতের পর খালিদ ইবনে সাইদ (রাঃ) আবু বকর (রাঃ)-এর খিলাফতকে সমর্থন করেন এবং রিদ্দার যুদ্ধে অংশ নেন। তিনি মুরতাদদের বিরুদ্ধে সাহসিকতার সাথে লড়াই করেন।",
      "**শাহাদাত:** ৬৩৪ খ্রিস্টাব্দে (১৩ হিজরি) সিরিয়ার মারজ আস-সুফফার যুদ্ধে রোমানদের বিরুদ্ধে লড়াই করতে গিয়ে খালিদ ইবনে সাইদ (রাঃ) শহীদ হন। তিনি বীরত্বের সাথে যুদ্ধ করেন এবং ইসলামের জন্য তাঁর জীবন উৎসর্গ করেন। তাঁকে সিরিয়ায় দাফন করা হয়।",
      "**চরিত্র:** খালিদ ইবনে সাইদ (রাঃ) ছিলেন অত্যন্ত ধৈর্যশীল, সাহসী এবং আল্লাহভীরু। পিতার নির্যাতন সত্ত্বেও তিনি ইসলামে অটল ছিলেন। তিনি ছিলেন বিশ্বস্ত এবং দায়িত্বশীল। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত খালিদ ইবনে সাইদ (রাঃ)-এর জীবন প্রমাণ করে যে, সত্যের জন্য পরিবার ও সমাজ থেকে বিচ্ছিন্ন হয়েও আল্লাহর পথে দৃঢ় থাকা অপরিহার্য।",
    "source": "ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "sahabi_id": "bilal_ibn_rabah",
    "title": "বিলাল ইবনে রাবাহ (রাঃ)",
    "paragraphs": [
      "মক্কায় এক ক্রীতদাসের জন্ম। নাম বিলাল ইবনে রাবাহ। পিতা রাবাহ, মা হামামা - দুজনেই আবিসিনিয়ান ক্রীতদাস। মালিক উমাইয়া ইবনে খালাফ - নিষ্ঠুর কাফির। কালো চামড়া, লম্বা, চিকন শরীর। কে জানত এই দাস হবেন ইসলামের প্রথম মুয়াজ্জিন!",
      "**ইসলাম গ্রহণ:** প্রথম দিকে ইসলাম গ্রহণ করলেন। আবু বকরের মাধ্যমে। মালিক জানতে পারল। রাগে ফেটে পড়ল। শুরু হল নির্যাতন।",
      "**নির্যাতন:** দুপুরের উত্তপ্ত মরুভূমি। বিলালকে উলঙ্গ করে বালুতে শুইয়ে দেওয়া হল। বুকের উপর ভারী পাথর। উমাইয়া বলল: মুহাম্মাদের ধর্ম ত্যাগ করো! বিলাল বললেন: আহাদ, আহাদ! (এক, এক - আল্লাহ এক!) আরো নির্যাতন। গলায় রশি বেঁধে মক্কার রাস্তায় টেনে নিয়ে যাওয়া হল। শিশুরা পাথর মারল। বিলাল বললেন: আহাদ, আহাদ! রাসূল (সাঃ) দূর থেকে দেখলেন। চোখে পানি। আবু বকরকে বললেন: বিলালকে মুক্ত করো।",
      "**মুক্তি:** আবু বকর উমাইয়ার কাছে গেলেন। বললেন: বিলালকে বিক্রি করবে? উমাইয়া বলল: তুমি তাকে নষ্ট করেছ, তুমিই কিনো। আবু বকর অনেক দাম দিয়ে বিলাল কিনলেন। সাথে সাথে মুক্ত করে দিলেন। বিলাল কাঁদলেন। আবু বকর বললেন: তুমি আমার ভাই।",
      "**মদীনায় হিজরত:** ৬২২ সাল। বিলাল মদীনায় হিজরত করলেন। রাসূল (সাঃ) তাকে আবু রুওয়াইহা আল-খাসামির সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**প্রথম মুয়াজ্জিন:** মসজিদে নববী তৈরি হল। নামাযের জন্য ডাকার পদ্ধতি কী হবে? কেউ বলল ঘণ্টা, কেউ বলল শিঙা। আবদুল্লাহ ইবনে যায়েদ স্বপ্নে আযান দেখলেন। রাসূল (সাঃ) বললেন: এটা সত্য স্বপ্ন। বিলালকে শেখাও, তার আওয়াজ উঁচু। বিলাল প্রথম আযান দিলেন। সেই সুমধুর কণ্ঠ! মদীনায় ছড়িয়ে গেল।",
      "**যুদ্ধসমূহ:** বদর, উহুদ, খন্দক, খায়বার, মক্কা বিজয় - সব যুদ্ধে অংশ নিলেন। বদরে উমাইয়া ইবনে খালাফ - বিলালের পুরনো মালিক। বিলাল চিৎকার করলেন: উমাইয়া! কুফরের নেতা! আমি বাঁচব না যদি সে বাঁচে! উমাইয়া নিহত হল। বিলালের প্রতিশোধ।",
      "**মক্কা বিজয়:** ৬৩০ সাল। মক্কা বিজয়। রাসূল (সাঃ) কাবায় গেলেন। বললেন: বিলাল, কাবার ছাদে উঠে আযান দাও। বিলাল কাবার ছাদে উঠলেন। আযান দিলেন। সেই দাস আজ কাবার ছাদে! আবু সুফিয়ান বলল: আল্লাহর শুকরিয়া আমার পিতা মারা গেছেন, এই দিন দেখেননি। আত্তাব ইবনে উসাইদ বলল: আল্লাহ যদি চাইতেন তাহলে বিলাল ছাড়া অন্য কাউকে দিতেন। কিন্তু আল্লাহ বিলালকেই সম্মান দিলেন!",
      "**রাসূলের মৃত্যু:** ৬৩২ সাল। রাসূল (সাঃ) মারা গেলেন। বিলাল কাঁদতে কাঁদতে বললেন: আমি আর আযান দিতে পারব না। আবু বকর বললেন: বিলাল, আযান দাও। বিলাল বললেন: আপনি যদি আমাকে মুক্ত করে থাকেন তাহলে আমাকে ছেড়ে দিন। আমি আর আযান দিতে পারব না। আবু বকর কাঁদলেন। বললেন: যাও।",
      "**শামে জিহাদ:** বিলাল শামে চলে গেলেন। জিহাদে অংশ নিলেন। একবার স্বপ্নে রাসূল (সাঃ) কে দেখলেন। রাসূল বললেন: বিলাল, এই রূক্ষতা কেন? আমার সাথে দেখা করার সময় কি হয়নি? বিলাল ঘুম থেকে উঠে মদীনায় রওনা হলেন। হাসান ও হুসাইনের সাথে দেখা। তারা বলল: বিলাল চাচা, আমাদের জন্য আযান দিন। বিলাল আযান দিলেন। মদীনাবাসী কাঁদতে লাগল। রাসূলের স্মৃতি মনে পড়ল।",
      "**ইবাদত:** রাসূল (সাঃ) বলেছেন: আমি জান্নাতে তোমার জুতার আওয়াজ শুনেছি। কারণ? বিলাল বললেন: যখনই আমার অযু ভাঙে, আমি সাথে সাথে অযু করে দুই রাকাত নফল পড়ি।",
      "**মৃত্যু:** ৬৪০ সাল। দামেস্কে মৃত্যু। বয়স ৬০ বছরের বেশি। স্ত্রী কাঁদছেন। বিলাল বললেন: কাঁদো না! আগামীকাল আমি মুহাম্মাদ ও তার সাথীদের সাথে দেখা করব! দাফন হলেন দামেস্কে। প্রথম মুয়াজ্জিন। নির্যাতিত দাস থেকে ইসলামের গর্ব। আহাদ, আহাদ - ঈমানের প্রতীক।"
    ],
    "moral": "হযরত বিলাল (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে অবিচল ধৈর্য ও ভালোবাসা জাতি-বর্ণ নির্বিশেষে সকল মানুষের জন্য মুক্তির পথ উন্মুক্ত করে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "bilal_ibn_rabah"
  },
  {
    "id": "jabir_ibn_abdullah",
    "categoryId": "sahabider_jibon",
    "title": "জাবির ইবনে আব্দুল্লাহ (রাঃ)",
    "paragraphs": [
      "হযরত জাবির ইবনে আব্দুল্লাহ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ জাবির ইবনে আব্দুল্লাহ ইবনে আমর ইবনে হারাম আল-আনসারী আল-সালামী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন তরুণ সাহাবী এবং অধিক হাদিস বর্ণনাকারীদের অন্যতম। তাঁর উপাধি ছিল আবু আব্দুল্লাহ। তিনি তাঁর জীবনকে রাসূল (সাঃ)-এর স্মৃতিচারণ এবং জ্ঞান বিতরণে ব্যয় করেন।",
      "**জন্ম ও ইসলাম গ্রহণ**\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি এবং তাঁর পিতা আব্দুল্লাহ ইবনে আমর আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী ছিলেন। পারিবারিক পটভূমি\n\nতাঁর পিতা আব্দুল্লাহ ইবনে আমর উহুদের যুদ্ধে শহীদ হন। শহীদ হওয়ার সময় তিনি তাঁর পুত্র জাবির (রাঃ)-এর ওপর তাঁর নয়জন বোনের দায়িত্ব অর্পণ করে যান।",
      "**প্রাথমিক জীবন**\n\nপিতার শাহাদাতের পর অল্প বয়সে তিনি তাঁর বোনদের লালন-পালনের দায়িত্ব নেন। রাসূল (সাঃ) তাঁর এই পারিবারিক দায়িত্বের প্রতি বিশেষভাবে খেয়াল রাখতেন। সামরিক ভূমিকা\n\nতিনি বদর ও উহুদের যুদ্ধে অংশগ্রহণ করতে চেয়েছিলেন, কিন্তু তাঁর বয়স কম থাকায় এবং পরিবারের দায়িত্বের কারণে শুরুতে অনুমতি পাননি।",
      "**প্রথম যুদ্ধে অংশগ্রহণ**\n\nতিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর প্রায় সকল সামরিক অভিযানে (১৯টির মতো) তাঁর পাশে ছিলেন। হাদিস বর্ণনাকারী\n\nতিনি রাসূল (সাঃ)-এর জীবনের শেষ আট বছরে তাঁর সান্নিধ্য লাভ করেন। তাঁর মাধ্যমে প্রায় ১,৫৪০টি হাদিস বর্ণিত হয়েছে। তাঁর জীবনের দীর্ঘতা",
      "তিনি দীর্ঘজীবন লাভ করেন এবং তাঁর বর্ণিত হাদিসগুলো ফিকহ ও সীরাতের ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ।\n\n****জ্ঞানের প্রতি আগ্রহ****\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর জ্ঞানার্জনের জন্য দূর-দূরান্তে সফর করেন। তিনি হাদিসের একটি নির্দিষ্ট অংশ শেখার জন্য মিশর পর্যন্ত ভ্রমণ করেন। জ্ঞান বিতরণ",
      "তিনি তাঁর জীবনের শেষভাগে মক্কা ও মদীনায় হাদিস শিক্ষাদানের এক বিশাল কেন্দ্র প্রতিষ্ঠা করেন। হজ ও উমরাহ\n\nতিনি রাসূল (সাঃ)-এর সঙ্গে বিদায় হজ পালন করেন এবং রাসূল (সাঃ)-এর হজের পদ্ধতি বিস্তারিতভাবে বর্ণনা করেন।\n\n****ফিতনা থেকে দূরে থাকা****",
      "তিনি ফিতনার সময় সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার নীতি অবলম্বন করেন। দারিদ্র্য দূরীকরণ\n\nএকবার তিনি তার পিতার ঋণের কারণে বিপদে পড়লে, রাসূল (সাঃ) অলৌকিকভাবে তাঁর ঋণ পরিশোধে সাহায্য করেন। তাঁর বিনয়\n\nতিনি ছিলেন অত্যন্ত বিনয়ী এবং কঠোরভাবে আল্লাহর তাকওয়াবান।",
      "**মৃত্যু**\n\nতিনি ৭৮ হিজরিতে (৬৯৭ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। তিনি ছিলেন মদীনায় ইন্তেকাল করা শেষ সাহাবীদের মধ্যে অন্যতম। দাফন\n\n**তাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী**",
      "**হাদিস বর্ণনা:** ১৫৪০+ হাদিস বর্ণনা করেছেন। দীর্ঘজীবী সাহাবী।",
      "**মৃত্যু:** ৬৯৭ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত জাবির ইবনে আব্দুল্লাহ (রাঃ)-এর জীবন প্রমাণ করে যে, পারিবারিক দায়িত্ব পালন করেও রাসূল (সাঃ)-এর সুন্নাহকে রক্ষা করা এবং জ্ঞান বিতরণে নিবেদিত হওয়া সম্ভব।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abu_musa_al_ashari",
    "categoryId": "sahabider_jibon",
    "title": "আবু মূসা আল-আশ'আরী (রাঃ)",
    "paragraphs": [
      "হযরত আবু মূসা আল-আশ'আরী (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে কায়স ইবনে সুলাইম আল-আশ'আরী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন বিশিষ্ট সাহাবী, বিচারক (কাজী) এবং প্রশাসক। তাঁর উপাধি ছিল আবু মূসা। তাঁর কুরআন তেলাওয়াতের সুমিষ্ট কণ্ঠের কারণে রাসূল (সাঃ) তাঁকে বিশেষ প্রশংসা করেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি ইয়েমেনের আশ'আর গোত্রে জন্মগ্রহণ করেন। তিনি প্রাথমিক পর্যায়েই ইসলাম গ্রহণ করেন।\n\n****হিজরত ও সান্নিধ্য****\n\nতিনি আবিসিনিয়ায় (হাবশা) হিজরতকারীদের মধ্যে ছিলেন। পরে তিনি মদীনায় হিজরত করেন। কুরআন তেলাওয়াত",
      "**তাঁর কুরআন তেলাওয়াতের কণ্ঠ ছিল অত্যন্ত সুমধুর। রাসূল (সাঃ) তাঁর তেলাওয়াত শুনে বলেছিলেন:** 'তোমাকে দাউদ (আঃ)-এর সুরের কিছু অংশ দেওয়া হয়েছে।' সামরিক ভূমিকা\n\nতিনি বদর, উহুদ সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন।\n\nপ্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ইয়েমেনের গভর্নর হিসেবে নিযুক্ত করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন। হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি বসরা এবং কুফার গভর্নর হিসেবে দায়িত্ব পালন করেন। সামরিক বিজয়\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে পারস্য এবং অন্যান্য অঞ্চলে সামরিক অভিযানে নেতৃত্ব দেন এবং গুরুত্বপূর্ণ শহর জয় করেন।\n\n****বিচারক ও মুফতি****",
      "তিনি ছিলেন সাহাবীদের মধ্যে অন্যতম শ্রেষ্ঠ বিচারক (কাজী) এবং মুফতি। তাঁর ফতোয়াগুলো খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ ছিল। আলী (রাঃ)-এর খিলাফতকাল\n\nহযরত আলী (রাঃ)-এর খিলাফতকালে সৃষ্ট ফিতনার সময় তিনি সালিশকারী হিসেবে ভূমিকা পালন করেন। সালিশের ফলাফল\n\nসিফফিনের যুদ্ধের পর তিনি হযরত আলী (রাঃ)-এর পক্ষ থেকে সালিশকারী হিসেবে নিযুক্ত হন, যদিও সালিশের ফলাফল প্রত্যাশিত ছিল না।",
      "**জ্ঞানের প্রতি আগ্রহ**\n\nতিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্ক ছিলেন এবং তাঁর জ্ঞান বিতরণে নিবেদিত ছিলেন। তাঁর ছাত্রদের সংখ্যা\n\n**তাঁর ছাত্রদের মধ্যে তাবেয়ীনের অনেক বড় ইমাম হাদিস ও ফিকহ শিখেছেন। ব্যক্তিগত চরিত্র**",
      "তিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং একজন পরিশ্রমী আলেম। মৃত্যু\n\nতিনি ৪২ বা ৪৪ হিজরিতে (৬৬২/৬৬৪ খ্রিস্টাব্দে) কুফা শহরে ইন্তেকাল করেন।\n\n****তাঁর জীবনী****",
      "তাঁর জীবনী জ্ঞান, বিচার এবং প্রশাসনের ক্ষেত্রে তাঁর দক্ষতা ও নিষ্ঠার এক আদর্শ উদাহরণ।",
      "**সুমধুর কণ্ঠ:** কুরআন তিলাওয়াতে সুমধুর কণ্ঠের অধিকারী ছিলেন।",
      "**মৃত্যু:** ৬৬২ সাল। কুফায় মৃত্যু।"
    ],
    "moral": "হযরত আবু মূসা আল-আশ'আরী (রাঃ)-এর জীবন প্রমাণ করে যে, আধ্যাত্মিক গুণাবলী (মধুর কণ্ঠস্বর) এবং জ্ঞান একজন ব্যক্তিকে প্রশাসনিক ও বিচারিক ক্ষেত্রে নেতৃত্ব দিতে সাহায্য করে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "amr_ibn_al_as",
    "categoryId": "sahabider_jibon",
    "title": "আমর ইবনুল আস (রাঃ)",
    "paragraphs": [
      "হযরত আমর ইবনুল আস (আরবি: عَمْرو بْن الْعَاص; মৃত্যু: ৬৬৪) ছিলেন একজন মহান সাহাবী, বিজয়ী সেনাপতি এবং মিসরের বিজেতা। তিনি ছিলেন অত্যন্ত বুদ্ধিমান এবং কূটনীতিক।",
      "**বংশ ও প্রাথমিক জীবন:** আমর ইবনুল আস (রাঃ) মক্কার সম্ভ্রান্ত কুরাইশ বংশে জন্মগ্রহণ করেন। তিনি ছিলেন অত্যন্ত বুদ্ধিমান এবং কূটনীতিতে পারদর্শী। জাহেলিয়াতের যুগে তিনি ছিলেন কুরাইশদের দূত এবং ব্যবসায়ী।",
      "**ইসলামের বিরোধিতা:** ইসলামের প্রথম দিকে আমর ইবনুল আস ইসলামের কট্টর বিরোধী ছিলেন। তিনি হাবশায় গিয়ে নাজাশির কাছে মুসলিমদের বিরুদ্ধে অভিযোগ করেছিলেন, কিন্তু ব্যর্থ হন। উহুদের যুদ্ধে তিনি কুরাইশদের পক্ষে যুদ্ধ করেন।",
      "**ইসলাম গ্রহণ:** হুদায়বিয়ার সন্ধির পর আমর ইবনুল আস (রাঃ) চিন্তা করতে লাগলেন। তিনি বুঝতে পারলেন যে ইসলাম সত্য। ৮ হিজরিতে (৬২৯ খ্রিস্টাব্দ) তিনি খালিদ ইবনুল ওয়ালিদ ও উসমান ইবনে তালহার সাথে মদীনায় এসে ইসলাম গ্রহণ করেন। রাসূল (সাঃ) তাঁকে দেখে অত্যন্ত খুশি হলেন এবং বললেন: 'ইসলাম পূর্ববর্তী সব পাপ মুছে দেয়।'",
      "**সেনাপতি:** রাসূল (সাঃ) আমর ইবনুল আস (রাঃ)-কে যাতুস সালাসিল অভিযানের সেনাপতি নিযুক্ত করেন। এই অভিযানে তাঁর সাথে আবু বকর ও উমর (রাঃ)ও ছিলেন। তিনি অত্যন্ত বুদ্ধিমত্তার সাথে এই অভিযান পরিচালনা করেন এবং বিজয়ী হন।",
      "**মিসর বিজয়:** উমর (রাঃ)-এর খিলাফতকালে আমর ইবনুল আস (রাঃ)-কে মিসর বিজয়ের দায়িত্ব দেওয়া হয়। ৬৪০ খ্রিস্টাব্দে তিনি মিসর আক্রমণ করেন এবং রোমানদের পরাজিত করেন। তিনি আলেকজান্দ্রিয়া দখল করেন এবং মিসরকে ইসলামী খিলাফতের অন্তর্ভুক্ত করেন। তিনি মিসরের গভর্নর নিযুক্ত হন এবং ফুসতাত শহর প্রতিষ্ঠা করেন।",
      "**কূটনীতি ও বুদ্ধিমত্তা:** আমর ইবনুল আস (রাঃ) ছিলেন অত্যন্ত বুদ্ধিমান এবং কূটনীতিক। তিনি জটিল পরিস্থিতিতে সঠিক সিদ্ধান্ত নিতে পারতেন। উমর (রাঃ) বলতেন: 'আমর হলো আরবদের বুদ্ধিমান।' রাসূল (সাঃ) বলেছিলেন: 'আমর হলো কুরাইশদের একজন সৎ ব্যক্তি।'",
      "**সিফফিনের যুদ্ধ:** আলী ও মুআবিয়া (রাঃ)-এর মধ্যে সিফফিনের যুদ্ধে আমর ইবনুল আস (রাঃ) মুআবিয়ার পক্ষে ছিলেন। তিনি সালিশি প্রস্তাব দেন যা যুদ্ধ বন্ধ করে। যদিও এই সিদ্ধান্ত বিতর্কিত ছিল, তবে তাঁর উদ্দেশ্য ছিল মুসলিমদের রক্তপাত বন্ধ করা।",
      "**মিসরে শাসন:** আমর ইবনুল আস (রাঃ) মিসরে ন্যায়বিচার প্রতিষ্ঠা করেন। তিনি খ্রিস্টান ও ইহুদিদের সাথে ভালো ব্যবহার করতেন এবং তাদের ধর্মীয় স্বাধীনতা দিতেন। তিনি মিসরে অনেক মসজিদ ও শিক্ষা প্রতিষ্ঠান নির্মাণ করেন।",
      "**ইন্তেকাল:** ৬৬৪ খ্রিস্টাব্দে (৪৩ হিজরি) মিসরে প্রায় ৯০ বছর বয়সে তিনি ইন্তেকাল করেন। তাঁকে মিসরে দাফন করা হয়। তিনি ছিলেন ইসলামের ইতিহাসে একজন মহান সেনাপতি এবং বিজয়ী। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত আমর ইবনুল আস (রাঃ)-এর জীবন প্রমাণ করে যে, রাজনৈতিক বুদ্ধিমত্তা ও দূরদর্শিতা মুসলিম উম্মাহর প্রশাসনিক বিজয়ের ক্ষেত্রে অপরিহার্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "mughira_ibn_shubah",
    "categoryId": "sahabider_jibon",
    "title": "মুগীরা ইবনে শু'বাহ (রাঃ)",
    "paragraphs": [
      "হযরত মুগীরা ইবনে শু'বাহ (আরবি: الْمُغِيرَة بْن شُعْبَة; মৃত্যু: ৬৭০) ছিলেন একজন মহান সাহাবী, বুদ্ধিমান কূটনীতিক এবং দক্ষ প্রশাসক। তিনি ছিলেন অত্যন্ত সাহসী এবং বিচক্ষণ।",
      "**বংশ ও প্রাথমিক জীবন:** মুগীরা ইবনে শু'বাহ (রাঃ) তায়েফের বনু সাকিফ গোত্রে জন্মগ্রহণ করেন। তিনি ছিলেন অত্যন্ত বুদ্ধিমান এবং কূটনীতিতে পারদর্শী। জাহেলিয়াতের যুগেও তিনি তাঁর বুদ্ধিমত্তার জন্য পরিচিত ছিলেন।",
      "**ইসলাম গ্রহণ:** হুদায়বিয়ার সন্ধির সময় (৬ হিজরি) মুগীরা ইবনে শু'বাহ (রাঃ) ইসলাম গ্রহণ করেন। তিনি রাসূল (সাঃ)-এর কাছে এসে ইসলাম গ্রহণ করেন এবং তাঁর বিশ্বস্ত সাহাবীদের একজন হয়ে ওঠেন।",
      "**হুদায়বিয়ার সন্ধি:** হুদায়বিয়ার সন্ধির সময় মুগীরা (রাঃ) রাসূল (সাঃ)-এর দেহরক্ষী হিসেবে দায়িত্ব পালন করেন। যখন কুরাইশদের প্রতিনিধিরা আসত, তখন তিনি তরবারি হাতে রাসূল (সাঃ)-এর পাশে দাঁড়িয়ে থাকতেন। তিনি সন্ধির শর্তাবলী লেখার কাজেও সাহায্য করেন।",
      "**যুদ্ধে অংশগ্রহণ:** মুগীরা (রাঃ) খায়বার, মক্কা বিজয়, হুনাইন এবং তাবুক সহ সকল যুদ্ধে রাসূল (সাঃ)-এর সাথে অংশগ্রহণ করেন। তিনি ছিলেন অত্যন্ত সাহসী যোদ্ধা এবং যুদ্ধের ময়দানে তাঁর বুদ্ধিমত্তা প্রকাশ পেত।",
      "**কূটনীতিক:** মুগীরা (রাঃ) ছিলেন একজন দক্ষ কূটনীতিক। রাসূল (সাঃ) তাঁকে বিভিন্ন গোত্রের কাছে দূত হিসেবে পাঠাতেন। তিনি তাঁর বুদ্ধিমত্তা দিয়ে অনেক জটিল সমস্যার সমাধান করতেন। উমর (রাঃ) বলতেন: 'মুগীরা হলো আরবদের একজন বুদ্ধিমান ব্যক্তি।'",
      "**প্রশাসক:** উমর (রাঃ)-এর খিলাফতকালে মুগীরা (রাঃ)-কে বসরার গভর্নর নিযুক্ত করা হয়। তিনি সেখানে ন্যায়বিচার প্রতিষ্ঠা করেন এবং শহরের উন্নয়নে কাজ করেন। পরবর্তীতে তিনি কুফার গভর্নরও হন। তিনি ছিলেন একজন দক্ষ প্রশাসক এবং মানুষের কল্যাণে কাজ করতেন।",
      "**বুদ্ধিমত্তা:** মুগীরা (রাঃ) তাঁর বুদ্ধিমত্তার জন্য বিখ্যাত ছিলেন। তিনি বলতেন: 'আমি কখনো এমন কোনো সমস্যায় পড়িনি যার সমাধান আমি খুঁজে পাইনি।' তাঁর বুদ্ধিমত্তার অনেক ঘটনা ইসলামের ইতিহাসে সংরক্ষিত আছে।",
      "**চরিত্র:** মুগীরা (রাঃ) ছিলেন সাহসী, বুদ্ধিমান এবং দক্ষ। তিনি ছিলেন দানশীল এবং মানুষের সাহায্য করতেন। তিনি ছিলেন একজন বিশ্বস্ত সাহাবী এবং ইসলামের সেবায় নিজেকে নিয়োজিত রেখেছিলেন।",
      "**ইন্তেকাল:** ৬৭০ খ্রিস্টাব্দে (৫০ হিজরি) কুফায় প্রায় ৭০ বছর বয়সে তিনি ইন্তেকাল করেন। তাঁকে কুফায় দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত মুগীরা ইবনে শু'বাহ (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, প্রজ্ঞা এবং বাকপটুতা সামরিক ও প্রশাসনিক উভয় ক্ষেত্রেই সাফল্যের চাবিকাঠি।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abdullah_ibn_amr_ibn_al_as",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে আমর ইবনুল আস (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে আমর ইবনুল আস (আরবি: عَبْدُ اللَّهِ بْنُ عَمْرو بْن الْعَاص; মৃত্যু: ৬৮৪) ছিলেন একজন মহান সাহাবী এবং অত্যন্ত জ্ঞানী আলিম। তিনি ছিলেন ইবাদতগুজার এবং হাদিস বর্ণনাকারী।",
      "**বংশ ও প্রাথমিক জীবন:** আব্দুল্লাহ ইবনে আমর (রাঃ) মক্কায় জন্মগ্রহণ করেন। তাঁর পিতা আমর ইবনুল আস (রাঃ) ছিলেন মিসরের বিজেতা এবং মহান সেনাপতি। আব্দুল্লাহ ছিলেন অত্যন্ত বুদ্ধিমান এবং জ্ঞানপিপাসু।",
      "**ইসলাম গ্রহণ:** আব্দুল্লাহ ইবনে আমর (রাঃ) তাঁর পিতার আগেই ইসলাম গ্রহণ করেন। তিনি ছিলেন যুবক বয়সে ইসলাম গ্রহণকারীদের একজন। তিনি রাসূল (সাঃ)-এর সান্নিধ্যে থেকে ইসলামী শিক্ষা গ্রহণ করেন।",
      "**অতিরিক্ত ইবাদত:** আব্দুল্লাহ ইবনে আমর (রাঃ) ছিলেন অত্যন্ত ইবাদতগুজার। তিনি প্রতিদিন রোজা রাখতেন এবং সারারাত নামাজ পড়তেন। রাসূল (সাঃ) তাঁকে বললেন: 'তোমার শরীরের উপর তোমার হক আছে, তোমার স্ত্রীর উপর তোমার হক আছে। তুমি প্রতি মাসে তিন দিন রোজা রাখো এবং রাতে কিছু সময় ঘুমাও।' কিন্তু আব্দুল্লাহ (রাঃ) আরও বেশি ইবাদত করতে চাইলেন।",
      "রাসূল (সাঃ) তাঁকে বললেন: 'তাহলে দাউদ (আঃ)-এর রোজা রাখো, একদিন রোজা, একদিন ইফতার। এবং রাতে কিছু অংশ ঘুমাও।' আব্দুল্লাহ (রাঃ) এই নিয়ম মেনে চলতেন। বৃদ্ধ বয়সে তিনি বলতেন: 'হায়! আমি যদি রাসূল (সাঃ)-এর সহজ নিয়ম মেনে নিতাম!'",
      "**হাদিস বর্ণনা:** আব্দুল্লাহ ইবনে আমর (রাঃ) ৭০০টি হাদিস বর্ণনা করেছেন। তিনি হাদিস লিখে রাখতেন, যা 'আস-সাহিফা আস-সাদিকা' নামে পরিচিত। এটি ছিল প্রথম দিকের হাদিস সংকলনগুলোর একটি।",
      "**জ্ঞান ও তাকওয়া:** তিনি ছিলেন অত্যন্ত জ্ঞানী এবং আল্লাহভীরু। তিনি তাওরাত ও ইঞ্জিল পড়েছিলেন এবং পূর্ববর্তী নবীদের ইতিহাস জানতেন। তিনি কুরআন ও হাদিসের গভীর জ্ঞান রাখতেন।",
      "**ফিতনা থেকে দূরে থাকা:** সিফফিনের যুদ্ধের সময় তাঁর পিতা মুআবিয়া (রাঃ)-এর পক্ষে ছিলেন, কিন্তু আব্দুল্লাহ (রাঃ) কোনো পক্ষ নেননি। তিনি বলতেন: 'আমি মুসলিমদের রক্তপাত চাই না।' তিনি ফিতনা থেকে দূরে থেকে ইবাদত ও ইলম চর্চায় নিজেকে নিয়োজিত রাখেন।",
      "**চরিত্র:** আব্দুল্লাহ ইবনে আমর (রাঃ) ছিলেন অত্যন্ত বিনয়ী, নম্র এবং দানশীল। তিনি দরিদ্রদের সাহায্য করতেন এবং মানুষকে ইসলামের শিক্ষা দিতেন। তিনি ছিলেন সত্যবাদী এবং আল্লাহভীরু।",
      "**ইন্তেকাল:** ৬৮৪ খ্রিস্টাব্দে (৬৫ হিজরি) মিসরে প্রায় ৭২ বছর বয়সে তিনি ইন্তেকাল করেন। তাঁকে মিসরে দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে আমর (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, বিশেষত হাদিস সংরক্ষণ এবং ইবাদতের প্রতি গভীর মনোযোগই জীবনের শ্রেষ্ঠ সম্পদ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "saad_ibn_abi_waqqas",
    "categoryId": "sahabider_jibon",
    "title": "সা'দ ইবনে আবী ওয়াক্কাস (রাঃ)",
    "paragraphs": [
      "হযরত সা'দ ইবনে আবী ওয়াক্কাস (রাঃ) ছিলেন মহানবী মুহাম্মদ (সাঃ)-এর অন্যতম প্রধান সাহাবী এবং আশারায়ে মুবাশশারাহ (জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত দশজন)-এর অন্যতম। তিনি ছিলেন তাদের মধ্যে সর্বশেষ ইন্তেকালকারী। তাঁর পুরো নাম আবু ইসহাক সা'দ এবং পিতা আবু ওয়াক্কাস মালিক। তিনি কুরাইশ বংশের বনু যুহরা শাখার সন্তান। তার মাতার নাম হামনা বিনতে সুফিয়ান।",
      "**জন্ম ও প্রারম্ভিক জীবন**\n\nতিনি মক্কায় ৫৯৫ খ্রিস্টাব্দে জন্মগ্রহণ করেন। তার পিতা আবু ওয়াক্কাস মালিক ইবনে উহাইব ছিলেন কুরাইশ গোত্রের বনু যুহরা শাখার। উহাইব ইবনে আবদ মানাফ ছিলেন রাসূল (সাঃ)-এর মা আমিনা বিনতে ওয়াহাবের চাচা। এভাবে সা'দ (রাঃ) রাসূল (সাঃ)-এর মাতৃকুলের আত্মীয় ছিলেন।",
      "**ইসলাম গ্রহণ**\n\nহযরত আবু বকর (রাঃ) ছিলেন সা'দের অন্তরঙ্গ বন্ধু। আবু বকর (রাঃ)-এর দাওয়াতেই তিনি মাত্র ১৭ বছর বয়সে ইসলাম গ্রহণ করেন এবং তিনি ছিলেন ১৭তম ইসলাম গ্রহণকারী। সা'দ (রাঃ) বলেন, 'ইসলাম গ্রহণের পর আমি নিজেকে তৃতীয় মুসলমান হিসেবে দেখতে পেলাম।' আসলে তিনি রাসূলুল্লাহর (সাঃ) নবুওয়াত প্রাপ্তির সাথে সাথে ইসলাম গ্রহণ করেন; কিন্তু অনেকের মতই তখন তিনি প্রকাশ্যে ঘোষণা দেননি।",
      "**মায়ের সাথে ঘটনা ও কুরআনের আয়াত নাযিল**\n\nসা'দের ইসলাম গ্রহণের কথা শুনে তার মা হামনা হৈ চৈ ও বিলাপ শুরু করে দিলেন। মা পরিষ্কার বলে দিলেন, 'সা'দ যতক্ষণ মুহাম্মাদের রিসালাতের অস্বীকৃতির ঘোষণা না দেবে ততক্ষণ আমি কিছু খাব না, কিছু পান করব না, রৌদ্র থেকে বাঁচার জন্য ছায়াতেও আসব না।' সা'দ (রাঃ) বড় অস্থির হয়ে পড়লেন এবং রাসূলের (সাঃ) খিদমতে হাজির হয়ে সব ঘটনা বিবৃত করলেন।",
      "**কুরআনের আয়াত নাযিল\n\nরাসূলের (সাঃ) নিকট থেকে জবাব পাওয়ার পূর্বেই সূরা আল-আনকাবুতের অষ্টম আয়াতটি নাযিল হল:** 'وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حُسْنًا ۖ وَإِن جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا' (আমি মানুষকে নির্দেশ দিয়েছি তার পিতামাতার প্রতি সদ্ব্যবহার করতে। তবে তারা যদি তোমার ওপর বল প্রয়োগ করে আমার সাথে এমন কিছু শরীক করতে বলে যার সম্পর্কে তোমার কোন জ্ঞান নেই, তুমি তাদের মেনো না।) - সূরা আনকাবুত: ৮",
      "**মায়ের কাছে দৃঢ় অবস্থান**\n\nতার মা তিনদিন পর্যন্ত কিছু মুখে দিলেন না। বার বার তিনি মার কাছে এসে বুঝাবার চেষ্টা করলেন; কিন্তু মায়ের একই কথা। অবশেষে তিনি মার মুখের ওপর বলে দিতে বাধ্য হলেন, 'মা, আপনার মতো হাজারটি মাও যদি আমার ইসলাম ত্যাগ করার ব্যাপারে জিদ করে পানাহার ছেড়ে দেয় এবং প্রাণ বিসর্জন দেয়, তবুও সত্য দ্বীন পরিত্যাগ করা আমার পক্ষে সম্ভব নয়।' সা'দের এ চরম সত্য কথাটি তার মার অন্তরে দাগ কাটে এবং অবশেষে তিনিও ইসলাম গ্রহণ করেন।",
      "**মদীনায় হিজরত**\n\nহযরত মুসআব ইবন উমাইর (রাঃ) ও ইবন উম্মে মাকতুমের মক্কা থেকে মদীনায় হিজরতের পর যে চার ব্যক্তি মদীনায় হিজরত করেন তাঁদের একজন সা'দ ইবন আবী ওয়াক্কাস। সহীহ বুখারীতে বারা ইবন আযিব (রাঃ) থেকে বর্ণিত, 'সর্বপ্রথম আমাদের নিকট আগমণ করেন মুসআব ইবন উমাইর ও ইবন উম্মে মাকতুম। অতঃপর বিলাল, সা'দ ও আম্মার বিন ইয়াসির আগমন করেন।'",
      "**তীরন্দাজ হিসেবে খ্যাতি**\n\nহযরত সা'দ (রাঃ) ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ তীরন্দাজ। রাসূল (সাঃ) উহুদের যুদ্ধে তাঁকে বলেছিলেন, 'ارْمِ سَعْدُ فِدَاكَ أَبِي وَأُمِّي' (তীর ছোড়ো সা'দ! আমার পিতা-মাতা তোমার জন্য কুরবান!) এটি ছিল রাসূল (সাঃ)-এর পক্ষ থেকে সর্বোচ্চ সম্মান। রাসূল (সাঃ) তাঁর জন্য পিতা-মাতা উভয়কে উৎসর্গ করার কথা বলেছিলেন, যা অন্য কারো জন্য বলেননি।",
      "**পারস্য বিজয় ও আল-কাদিসিয়্যার যুদ্ধ**\n\n৬৩৬ খ্রিস্টাব্দে হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি পারস্য সাম্রাজ্যের বিরুদ্ধে আল-কাদিসিয়্যার যুদ্ধে মুসলিম বাহিনীর সর্বাধিনায়ক ছিলেন। এই যুদ্ধে তিনি পারস্যের বিশাল বাহিনীকে পরাজিত করেন এবং পারস্য সাম্রাজ্যের পতন ঘটান। এই বিজয়ের মাধ্যমে ইরাক ও পারস্য মুসলিমদের অধীনে আসে।",
      "**চীন ও বাংলায় ইসলাম প্রচার**\n\n৬৪৬ ও ৬৫১ খ্রিস্টাব্দে তাঁকে কূটনৈতিক দায়িত্ব দিয়ে চীন পাঠানো হয়। ধারণা করা হয় যে, নৌ রুটে চীন যাওয়ার পথে তিনি চট্টগ্রাম বন্দরে থেমেছিলেন এবং বাংলাকে ইসলামের সাথে পরিচয় করানোয় তাঁর অবদান রয়েছে। ধারণা করা হয়, তিনি ৬৪৮ খ্রিস্টাব্দে বাংলাদেশের লালমনিরহাটে একটি মসজিদ নির্মাণ করেন, যা স্থানীয়ভাবে আবু আক্কাস মসজিদ নামে পরিচিত।",
      "**স্বভাব ও চরিত্র\n\nইবনে ইসহাক বর্ণনা করেন, রাসূলুল্লাহর (সাঃ) সাহাবীদের মধ্যে চারজন ছিলেন সর্বাধিক কঠোর:** উমর, আলী, যুবাইর এবং সা'দ (রাঃ)। হযরত সা'দের মধ্যে কাব্য প্রতিভাও ছিল। প্রাচীন সূত্রগুলিতে তার কিছু কবিতা সংকলিত হয়েছে। তিনি ছিলেন অত্যন্ত সাহসী, দৃঢ়চেতা এবং আল্লাহভীরু।",
      "**কবুল হওয়া দোয়া**\n\nরাসূল (সাঃ) তাঁর সম্পর্কে বলেছেন, 'اللَّهُمَّ اسْتَجِبْ لِسَعْدٍ إِذَا دَعَاكَ' (হে আল্লাহ! সা'দ যখন তোমার কাছে দোয়া করবে, তখন তা কবুল করো।) এই কারণে তাঁর দোয়া সর্বদা কবুল হতো। রাসূল (সাঃ) আরও বলেছেন, 'هَذَا خَالِي فَلْيُرِنِي امْرُؤٌ خَالَهُ' (এই আমার মামা, কেউ যদি তার মামা দেখাতে পারে!) - কারণ সা'দ (রাঃ) ছিলেন রাসূল (সাঃ)-এর মাতৃকুলের।",
      "**ইন্তেকাল**\n\nহযরত সা'দ (রাঃ) মদীনা থেকে দশ মাইল দূরে আকীক উপত্যকায় কিছুদিন অসুস্থ থাকার পর হিজরী ৫৫ সনে ৮৫ বছর বয়সে ইন্তেকাল করেন। গোসল ও কাফনের পর লাশ মদীনায় আনা হয়। মদীনার তৎকালীন গভর্নর মারওয়ান জানাযার ইমামতি করেন। উম্মুল মু'মিনীন হযরত আয়িশা (রাঃ) ও অন্যান্য আযওয়াজে মুতাহহারাহ তাঁর জানাযায় অংশগ্রহণ করেন।",
      "**মরণকালের ঘটনা**\n\nমরণকালে হযরত সা'দ (রাঃ) বহু অর্থ-সম্পদের অধিকারী ছিলেন। তা সত্ত্বেও তিনি একটি অতি পুরাতন পশমী জুব্বা চেয়ে নিয়ে বলেন, 'এ দিয়েই তোমরা আমাকে কাফন দেবে। এ জুব্বা পরেই আমি বদর যুদ্ধে কাফিরদের বিরুদ্ধে লড়েছি। আমার ইচ্ছা, এটা নিয়েই আমি আল্লাহর দরবারে উপস্থিত হই।' তাঁর ছেলে মুসআব বলেন, তাঁর মুমূর্ষ অবস্থায় তিনি বলেন, 'আমার জন্য কেঁদো না। আল্লাহ কক্ষণো আমাকে শাস্তি দেবেন না, আমি জান্নাতবাসী।'",
      "**বদরের বীর:** বদরের যুদ্ধে অসাধারণ বীরত্ব দেখিয়েছেন।",
      "**মৃত্যু:** ৬৭৪ সাল। মদীনায় মৃত্যু। আশারায়ে মুবাশশারার একজন।"
    ],
    "moral": "হযরত সা'দ (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে দৃঢ়তা, সামরিক দক্ষতা এবং মায়ের চেয়েও ঈমানকে প্রাধান্য দেওয়া একজন মুসলিমকে মহান বিজয়ের নায়ক এবং জান্নাতবাসী বানাতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; তিরমিযী; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; হায়াতুস সাহাবা"
  },
  {
    "id": "salman_farsi",
    "categoryId": "sahabider_jibon",
    "title": "সালমান ফারসি (রাঃ)",
    "paragraphs": [
      "হযরত সালমান আল-ফারসি (রাঃ) ছিলেন রাসূল মুহাম্মদ (সাঃ)-এর একজন মহান সাহাবী। তিনি পারস্যে জন্মগ্রহণ করেন এবং সত্যের সন্ধানে বিভিন্ন ধর্ম অনুসরণ করার পর ইসলাম গ্রহণ করেন।",
      "**জন্ম ও প্রারম্ভিক জীবন**\n\nসালমান ৫৩১-৫৭০ খ্রিস্টাব্দের মধ্যে পারস্যের ফার্স বা ইসপাহান প্রদেশে জন্মগ্রহণ করেন। তিনি জরথুস্ট্রিয়ান পরিবারে বেড়ে ওঠেন এবং ষোল বছর পুরোহিত হওয়ার জন্য অধ্যয়ন করেন।",
      "**খ্রিস্টধর্মে আকৃষ্ট**\n\n৫৮৭ সালে তিনি নেস্টোরিয়ান খ্রিস্টানদের সাথে সাক্ষাৎ করেন এবং তাদের দ্বারা প্রভাবিত হন। পিতার ইচ্ছার বিরুদ্ধে গিয়ে তিনি পরিবার ত্যাগ করেন। পরিবার তাকে বন্দী করলেও তিনি পালিয়ে যান।",
      "**সত্যের অন্বেষণ**\n\nসত্যের সন্ধানে তিনি মধ্যপ্রাচ্যে ঘুরে ঘুরে পুরোহিত ও পণ্ডিতদের সাক্ষাৎ করেন। সিরিয়ায় তিনি শেষ নবীর আগমনের ভবিষ্যদ্বাণী শুনেন। আরবে যাওয়ার পথে তাকে দাস হিসেবে বিক্রি করা হয় এবং মদীনার এক ইহুদীর কাছে নিয়ে যাওয়া হয়।",
      "**ইসলাম গ্রহণ**\n\nরাসূল (সাঃ)-এর সাথে সাক্ষাতের পর তিনি নবীর লক্ষণগুলি চিনতে পারেন এবং ইসলাম গ্রহণ করেন। রাসূল (সাঃ)-এর সাহায্যে তিনি স্বাধীনতা লাভ করেন। তিনি ছিলেন প্রথম ইরানি যিনি ইসলাম গ্রহণ করেন।",
      "**খন্দকের যুদ্ধ**\n\nখন্দকের যুদ্ধে ১০,০০০ কুরাইশ সৈন্য মদীনা আক্রমণ করলে সালমানের পরামর্শে মদিনার চারপাশে পরিখা খনন করা হয়। এটি ছিল সাসানীয় সামরিক কৌশল। এই কৌশলের মাধ্যমে মুসলিমরা বিজয়ী হন।",
      "**আহলে বাইত\n\nমুহাজির ও আনসার উভয়েই দাবি করেন সালমান তাদের দলভুক্ত। রাসূল (সাঃ) বলেন:** سَلْمَانُ مِنَّا أَهْلَ الْبَيْتِ (সালমান আমাদের আহলে বাইতের একজন।) এটি ছিল সর্বোচ্চ সম্মান।",
      "**মর্যাদা**\n\nআবু হুরায়রা (রাঃ) তাকে 'আবু আল-কিতাবায়েন' (দুই বইয়ের জনক - বাইবেল ও কুরআন) বলেন। আলী (রাঃ) তাকে 'লুকমান আল-হাকিম' (জ্ঞানী) বলে সম্মান করেন।",
      "**পারস্য বিজয়**\n\nতিনি পারস্য বিজয়ে অংশ নেন এবং উমর (রাঃ)-এর সময়ে চেটেসিফোনের প্রথম গভর্নর হন। পরে আলী (রাঃ) তাকে আল-মাদাইনের গভর্নর নিযুক্ত করেন।",
      "**কুরআন অনুবাদ**\n\nতিনি ফার্সি ভাষায় কুরআনের অনুবাদ করেন। তিনি ইতিহাসে প্রথম ব্যক্তি যিনি কুরআনকে বিদেশী ভাষায় অনুবাদ করেন।",
      "**খন্দকের পরিখা:** খন্দকের যুদ্ধে পরিখা খননের পরামর্শ দিয়েছিলেন।",
      "**মৃত্যু:** ৬৫৬ সাল। মাদায়েনে মৃত্যু। বয়স ৮৮ বছর।"
    ],
    "moral": "সালমান ফারসি (রাঃ)-এর জীবন প্রমাণ করে যে সত্যের সন্ধানে যে কেউ যেকোনো দূরত্ব অতিক্রম করতে পারে এবং আল্লাহ তাকে হেদায়েত দান করেন।",
    "source": "সহীহ বুখারী; সীরাতে ইবনে হিশাম"
  },
  {
    "id": "abdur_rahman_ibn_auf",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুর রহমান ইবনে আউফ (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুর রহমান ইবনে আউফ (রাঃ) (মৃত্যু: ৩১ হিজরি/৬৫২ খ্রিষ্টাব্দ) ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং ইসলামের ইতিহাসের অন্যতম ধনী ও দানশীল সাহাবী।",
      "**নাম পরিবর্তন**\n\nজাহিলী যুগে তার নাম ছিল 'আবদু আমর' (আমরের দাস)। ইসলাম গ্রহণের পর রাসূল (সাঃ) তার নাম রাখেন 'আব্দুর রহমান' (সবচেয়ে দয়াবানের দাস)। তিনি যুহরা গোত্রের সন্তান।",
      "**ইসলাম গ্রহণ**\n\nআবু বকর (রাঃ)-এর দাওয়াতে তিনি ইসলাম গ্রহণ করেন। তিনি ছিলেন ইসলাম গ্রহণকারী প্রথম ৮ জনের অন্যতম।",
      "**আবিসিনিয়ায় হিজরত**\n\n৬১৪ সালে কুরাইশদের নির্যাতন বৃদ্ধি পেলে তিনি আবিসিনিয়ায় হিজরত করেন। নাজাশি তাদের নিরাপত্তা প্রদান করেন। ৬১৯-৬২০ সালে তিনি মক্কায় ফিরে আসেন।",
      "**মদীনায় হিজরত\n\n৬২২ সালে তিনি মদিনায় হিজরত করেন। রাসূল (সাঃ) তাকে সা'দ ইবনে রাবী' (রাঃ)-এর সাথে ভ্রাতৃত্ব বন্ধনে আবদ্ধ করেন। সা'দ সম্পদের অর্ধেক দিতে চাইলে তিনি বলেন:** আমাকে শুধু বাজারের পথ দেখিয়ে দিন। তিনি ব্যবসা শুরু করেন এবং সফল হন।",
      "**দুমাতুল জান্দাল অভিযান**\n\n৬২৬ সালে রাসূল (সাঃ) তাকে দুমাতুল জান্দালের কালব গোত্রের উপর অভিযান চালনার নির্দেশ দেন। তিনি ৩ দিন দাওয়াত দেন এবং কালব গোত্র মুসলমান হয়। রাসূল (সাঃ)-এর নির্দেশে তিনি গোত্রপতির কন্যা তুমারিযকে বিয়ে করেন।",
      "**দানশীলতা\n\nতিনি ৫০০ ঘোড়া ও ৫০০ উট আল্লাহর রাস্তায় দান করেন। তাবুক যুদ্ধে বিশাল অর্থ দান করেন। রাসূল (সাঃ) বলেন:** عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فِي الْجَنَّةِ (আব্দুর রহমান ইবনে আউফ জান্নাতে।)",
      "**খিলাফত নির্বাচন**\n\n৬৪৪ সালে উমর (রাঃ) মৃত্যুর আগে ছয় সদস্যের বোর্ড গঠন করেন। এই বোর্ডে আব্দুর রহমানও ছিলেন এবং তিনি উসমান (রাঃ)-কে খলিফা নির্বাচনে ভূমিকা রাখেন।",
      "**মৃত্যু**\n\nতিনি হিজরি ৩২ সনে ৭২-৭৫ বছর বয়সে ইন্তেকাল করেন। উসমান (রাঃ) বা যুবাইর (রাঃ) জানাযার ইমামতি করেন। তাকে মদীনার বাকী' গোরস্থানে দাফন করা হয়। মৃত্যুকালে তিনি বিশাল সম্পদের অধিকারী ছিলেন কিন্তু অত্যন্ত বিনয়ী ছিলেন।",
      "**দানশীল:** অত্যন্ত ধনী ও দানশীল ছিলেন। সম্পদের বড় অংশ দান করতেন।",
      "**মৃত্যু:** ৬৫২ সাল। মদীনায় মৃত্যু। আশারায়ে মুবাশশারার একজন।"
    ],
    "moral": "আব্দুর রহমান ইবনে আউফ (রাঃ)-এর জীবন প্রমাণ করে যে সততা ও দানশীলতার সাথে সম্পদ অর্জন এবং আল্লাহর পথে ব্যয় করা একজন মুসলিমের শ্রেষ্ঠ গুণ।",
    "source": "সহীহ বুখারী; তিরমিযী"
  },
  {
    "id": "usman_ibn_talha",
    "categoryId": "sahabider_jibon",
    "title": "উসমান ইবনে তালহা (রাঃ)",
    "paragraphs": [
      "মক্কার বনু আবদুদ দার গোত্রে জন্ম। নাম উসমান ইবনে তালহা ইবনে আবি তালহা। পিতা তালহা ইবনে আবি তালহা, মা সুলাফা বিনতে সাদ। এই পরিবারের বিশেষত্ব - তারা বংশ পরম্পরায় কাবা শরিফের চাবির রক্ষক। জাহেলি যুগ থেকেই এই দায়িত্ব তাদের। কুসাই ইবনে কিলাব যখন মক্কার নেতৃত্ব পান, তখন তিনি বনু আবদুদ দার গোত্রকে কাবার চাবির দায়িত্ব দেন। সেই থেকে এই পরিবার কাবার দারোয়ান। উসমান ছিলেন সেই ঐতিহ্যের উত্তরাধিকারী। লম্বা, শক্তিশালী যুবক। কুরাইশদের মধ্যে সম্মানিত। কে জানত এই চাবির রক্ষক একদিন ইসলামের বীর হবেন!",
      "**ইসলামের শত্রু:** ৬১০ সাল। মুহাম্মাদ নবুয়ত ঘোষণা করলেন। কুরাইশরা বিরোধিতা শুরু করল। উসমান ইবনে তালহাও ইসলামের বিরোধী ছিলেন। কারণ তিনি ভাবতেন - নতুন ধর্ম মানে পুরনো ঐতিহ্য নষ্ট হবে। কাবার মর্যাদা কমবে। তাই তিনি মুসলিমদের বিরুদ্ধে ছিলেন। মুসলিমদের কষ্ট দিতেন। রাসূলকে গালি দিতেন। ৬২৫ সাল। উহুদের যুদ্ধ। কুরাইশরা প্রতিশোধ নিতে এসেছে। উসমানের পিতা তালহা ইবনে আবি তালহা ছিলেন কুরাইশদের পতাকাবাহী। পিতা শহীদ হলেন। উসমান পতাকা তুলে নিলেন। বীরত্বের সাথে লড়লেন মুসলিমদের বিরুদ্ধে। কিন্তু আল্লাহর পরিকল্পনা ছিল ভিন্ন।",
      "**ইসলাম গ্রহণ:** ৬২৯ সাল, সফর মাস। হুদাইবিয়ার সন্ধির পর পরিস্থিতি বদলাতে শুরু করল। মুসলিমরা নিরাপদে ইসলাম প্রচার করতে পারছেন। অনেক কুরাইশ ইসলাম সম্পর্কে ভাবতে শুরু করল। খালিদ ইবনে ওয়ালিদ ও আমর ইবনুল আস - দুই মহাবীর - ইসলাম গ্রহণের সিদ্ধান্ত নিলেন। তারা উসমান ইবনে তালহার কাছে এলেন। বললেন: উসমান, আমরা ইসলাম গ্রহণ করব। তুমিও চলো। উসমান অবাক হলেন। খালিদ ও আমর - এই দুই বীর মুসলমান হচ্ছেন! উসমান ভাবলেন: নিশ্চয়ই মুহাম্মাদ সত্য নবী। নইলে এরা কেন ইসলাম গ্রহণ করবেন? উসমান রাজি হলেন। তিনজন একসাথে মদীনার উদ্দেশ্যে রওনা হলেন। মদীনায় পৌঁছে রাসূলের কাছে গেলেন। রাসূল তাদের দেখে অত্যন্ত খুশি হলেন। বললেন: মক্কা তার কলিজার টুকরো আমাদের কাছে পাঠিয়ে দিয়েছে! তিনজনেই ইসলাম গ্রহণ করলেন।",
      "**কাবার চাবি:** ৬৩০ সাল, রমজান মাস। মক্কা বিজয়। রাসূল দশ হাজার সৈন্য নিয়ে মক্কায় এলেন। বিনা রক্তপাতে মক্কা বিজয়। রাসূল কাবা শরিফে গেলেন। তিনশত ষাটটি মূর্তি ভাঙলেন। তারপর কাবার ভিতরে যেতে চাইলেন। কিন্তু দরজা বন্ধ। চাবি কার কাছে? উসমান ইবনে তালহার কাছে। রাসূল বললেন: উসমানকে ডেকে আনো। উসমান এলেন। হাতে কাবার চাবি। রাসূলকে দিলেন। রাসূল কাবা খুললেন। ভিতরে গেলেন। দুই রাকাত নামায পড়লেন। বের হয়ে এলেন। আলী চাবি চাইলেন। আব্বাসও চাইলেন। উসমান ভাবলেন: হয়তো চাবি চলে যাবে। হঠাৎ ওহী নাযিল হল: আমানত মালিকদের ফিরিয়ে দাও। রাসূল উসমানকে ডাকলেন। চাবি ফিরিয়ে দিলেন। বললেন: এই চাবি তোমার। তোমার পরিবারের। চিরকালের জন্য। কিয়ামত পর্যন্ত। কেউ এটা তোমাদের কাছ থেকে নিতে পারবে না। শুধু জালিম ছাড়া। উসমান কাঁদলেন। বললেন: ইয়া রাসূলাল্লাহ! আমি আপনার বিরুদ্ধে লড়েছি। অথচ আপনি এই সম্মান দিলেন! রাসূল বললেন: ইসলাম পূর্বের পাপ মুছে দেয়। তুমি এখন আমার ভাই।",
      "**আজও চাবি তাদের হাতে:** আজ দুই হাজার পঁচিশ সাল। চৌদ্দশত বছর পার হয়ে গেছে। কিন্তু কাবার চাবি এখনও উসমান ইবনে তালহার বংশধরদের হাতে। তারা বনু শায়বা নামে পরিচিত। সৌদি সরকার তাদের সম্মান করে। প্রতিবার কাবা খোলার সময় তারাই চাবি দেয়। রাসূলের ওয়াদা আজও বাস্তব। এটা আল্লাহর নিদর্শন। উসমান হুনায়ন ও তাবুক অভিযানে অংশ নিলেন। প্রতিটি যুদ্ধে বীরত্ব দেখালেন। রাসূল তাকে বিশ্বাস করতেন। উনষাট হিজরিতে মক্কায় মৃত্যু। বয়স আশির বেশি। জীবনের শেষ দিন পর্যন্ত কাবার চাবির রক্ষক ছিলেন। মক্কায় দাফন হলেন। কাবার কাছেই। যে কাবার সেবা করেছেন সারা জীবন।"
    ]
  },
  {
    "id": "abdullah_ibn_rawaha",
    "categoryId": "sahabider_jibon",
    "title": "আবদুল্লাহ ইবনে রাওয়াহা (রাঃ)",
    "paragraphs": [
      "হযরত আবদুল্লাহ ইবনে রাওয়াহা (আরবি: عَبْدُ اللَّهِ بْنُ رَوَاحَة; মৃত্যু: ৬২৯) ছিলেন একজন মহান সাহাবী, কবি এবং মুতার যুদ্ধের তিন সেনাপতির একজন। তিনি ছিলেন অত্যন্ত সাহসী যোদ্ধা এবং ইসলামী কবিতার অন্যতম পথিকৃৎ।",
      "**বংশ ও প্রাথমিক জীবন:** আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) মদীনার বনু খাযরাজ গোত্রে জন্মগ্রহণ করেন। ইসলামের আগমনের পূর্বে তিনি ছিলেন মদীনার অন্যতম শ্রেষ্ঠ কবি। তাঁর কবিতা ছিল অত্যন্ত প্রভাবশালী এবং মানুষের হৃদয় স্পর্শ করত।",
      "**ইসলাম গ্রহণ:** আকাবার দ্বিতীয় বাইয়াতে (৬২২ খ্রিস্টাব্দ) আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) অংশগ্রহণ করেন এবং ইসলাম গ্রহণ করেন। তিনি ছিলেন সেই ৭৫ জন আনসারের একজন যারা রাসূল (সাঃ)-কে মদীনায় আমন্ত্রণ জানিয়েছিলেন এবং তাঁকে রক্ষা করার শপথ নিয়েছিলেন।",
      "**কবি ও যোদ্ধা:** ইসলাম গ্রহণের পর আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) তাঁর কবিতার প্রতিভা ইসলামের সেবায় নিয়োজিত করেন। তিনি হাসসান ইবনে সাবিত ও কা'ব ইবনে মালিকের সাথে মিলে ইসলামের পক্ষে কবিতা রচনা করতেন। রাসূল (সাঃ) তাঁর কবিতা শুনে খুশি হতেন এবং তাঁকে উৎসাহিত করতেন।",
      "**যুদ্ধে অংশগ্রহণ:** আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) বদর, উহুদ, খন্দক এবং অন্যান্য সকল যুদ্ধে রাসূল (সাঃ)-এর সাথে অংশগ্রহণ করেন। তিনি ছিলেন অত্যন্ত সাহসী এবং যুদ্ধের ময়দানে তাঁর কবিতা আবৃত্তি করে মুসলিমদের উৎসাহিত করতেন।",
      "**মুতার যুদ্ধ, তিন সেনাপতি:** ৮ হিজরিতে (৬২৯ খ্রিস্টাব্দ) রাসূল (সাঃ) রোমান সাম্রাজ্যের বিরুদ্ধে মুতার যুদ্ধের জন্য ৩,০০০ সৈন্যের একটি বাহিনী পাঠান। রাসূল (সাঃ) তিনজন সেনাপতি নিয়োগ করেন: প্রথম যায়েদ ইবনে হারিসা (রাঃ), তিনি শহীদ হলে জাফর ইবনে আবি তালিব (রাঃ), তিনি শহীদ হলে আবদুল্লাহ ইবনে রাওয়াহা (রাঃ)।",
      "যুদ্ধের ময়দানে যায়েদ (রাঃ) শহীদ হলেন, তারপর জাফর (রাঃ) শহীদ হলেন। এবার আবদুল্লাহ ইবনে রাওয়াহা (রাঃ)-এর পালা। তিনি এক মুহূর্তের জন্য দ্বিধাগ্রস্ত হলেন, সামনে ২,০০,০০০ রোমান সৈন্য, আর তাঁর মাত্র ৩,০০০। তিনি নিজেকে বললেন:",
      "'يَا نَفْسُ، إِلَّا تُقْتَلِي تَمُوتِي، وَهَذَا مَا كُنْتِ تَمَنَّيْنَ (হে আমার আত্মা! তুমি যদি হত্যা না হও, তবুও মরবে। আর এটাই তো তুমি চেয়েছিলে, শাহাদাত!)' তারপর তিনি ঘোড়া থেকে নেমে এসে যুদ্ধে ঝাঁপিয়ে পড়লেন এবং বীরত্বের সাথে লড়াই করে শহীদ হলেন। [সহীহ বুখারী]",
      "**রাসূলের শোক:** মদীনায় রাসূল (সাঃ) মসজিদে বসে ছিলেন। তিনি সাহাবীদের বললেন: 'আমি তোমাদের ভাইদের সম্পর্কে সংবাদ দেব। যায়েদ পতাকা নিয়ে এগিয়ে গেল এবং শহীদ হলো। তারপর জাফর পতাকা নিল এবং শহীদ হলো। তারপর ইবনে রাওয়াহা পতাকা নিল এবং শহীদ হলো।' এই কথা বলতে বলতে রাসূল (সাঃ)-এর চোখ থেকে অশ্রু ঝরছিল। [সহীহ বুখারী]",
      "**কবিতা ও ইবাদত:** আবদুল্লাহ ইবনে রাওয়াহা (রাঃ) শুধু কবি ও যোদ্ধাই ছিলেন না, তিনি ছিলেন অত্যন্ত ইবাদতগুজার। তিনি রাতে দীর্ঘ নামাজ পড়তেন এবং কুরআন তিলাওয়াত করতেন। তাঁর স্ত্রী বলেন: 'তিনি রাতে উঠে নামাজ পড়তেন এবং কাঁদতেন।'",
      "**চরিত্র ও গুণাবলী:** তিনি ছিলেন অত্যন্ত সত্যবাদী, সাহসী এবং আল্লাহভীরু। তাঁর কবিতায় ইসলামের প্রশংসা, রাসূল (সাঃ)-এর মহব্বত এবং জিহাদের উৎসাহ থাকত। তিনি ছিলেন এমন একজন সাহাবী যিনি কথা ও কাজে সমান ছিলেন।",
      "**শাহাদাত:** ৬২৯ খ্রিস্টাব্দে মুতার যুদ্ধে তিনি শাহাদাত বরণ করেন। তাঁকে মুতায় (বর্তমান জর্ডানে) দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "zayd_ibn_haritha",
    "categoryId": "sahabider_jibon",
    "title": "যায়িদ ইবনে হারিসা (রাঃ)",
    "paragraphs": [
      "সিরিয়ার কালব গোত্রে জন্ম। নাম যায়িদ ইবনে হারিসা। পিতা হারিসা ইবনে শারাহিল। মা সুদা বিনতে সালাবা। সুখী পরিবার। কিন্তু ভাগ্য বদলে যাবে।",
      "**শৈশবে অপহরণ:** মাত্র ৮ বছর বয়স। মায়ের সাথে আত্মীয়ের বাড়ি গিয়েছিলেন। হঠাৎ দস্যুদের আক্রমণ। যায়িদকে ধরে নিয়ে গেল। মা কাঁদতে কাঁদতে বললেন: আমার ছেলে! কিন্তু দস্যুরা শুনল না। যায়িদকে দাস হিসেবে বিক্রি করল উকাজের বাজারে।",
      "**খাদিজার কেনা:** হাকিম ইবনে হিযাম - খাদিজা (রাঃ) এর ভাতিজা - যায়িদকে কিনলেন। খাদিজা (রাঃ) কে উপহার দিলেন। খাদিজা (রাঃ) যায়িদকে দেখলেন। বুদ্ধিমান, সৎ ছেলে। তাকে ভালোবাসলেন।",
      "**মুহাম্মাদের উপহার:** খাদিজা (রাঃ) মুহাম্মাদ (সাঃ) কে বিয়ে করলেন। যায়িদকে উপহার দিলেন স্বামীকে। রাসূল (সাঃ) যায়িদকে দেখলেন। তার চরিত্র দেখে মুগ্ধ হলেন। যায়িদও রাসূলকে ভালোবাসলেন। পিতা-পুত্রের সম্পর্ক গড়ে উঠল।",
      "**পিতার খোঁজ:** যায়িদের পিতা হারিসা ছেলেকে খুঁজছেন। বছরের পর বছর। কবিতা লিখছেন শোকে। একদিন কালব গোত্রের কিছু লোক মক্কায় এল। যায়িদকে দেখল। চিনে ফেলল। ফিরে গিয়ে হারিসাকে বলল: তোমার ছেলে মক্কায়! মুহাম্মাদ ইবনে আবদুল্লাহর কাছে!",
      "**পিতার আগমন:** হারিসা ও ভাই কা'ব মক্কায় এলেন। প্রচুর মুক্তিপণ নিয়ে। রাসূল (সাঃ) এর কাছে গেলেন। বললেন: হে আবদুল মুত্তালিবের পুত্র! তোমরা হারামের প্রতিবেশী, বন্দীদের মুক্ত করো, ক্ষুধার্তদের খাওয়াও। আমরা এসেছি আমাদের ছেলেকে নিতে। যা চাও দাম দাও।",
      "**যায়িদের সিদ্ধান্ত:** রাসূল (সাঃ) বললেন: যায়িদকে ডাকো। তাকে জিজ্ঞাসা করো। সে যদি তোমাদের সাথে যেতে চায়, যাক। আমি কোনো মুক্তিপণ চাই না। যায়িদ এলেন। পিতাকে দেখলেন। হারিসা বললেন: বেটা! আমি তোমার পিতা, এ তোমার চাচা। চলো বাড়ি যাই। যায়িদ বললেন: আমি মুহাম্মাদের সাথে থাকব। হারিসা অবাক: কী বলছ? দাসত্ব পছন্দ করছ স্বাধীনতার চেয়ে? যায়িদ বললেন: আমি এই মানুষের মধ্যে এমন কিছু দেখেছি যা আমি কখনো ছাড়ব না।",
      "**দত্তক পুত্র ঘোষণা:** রাসূল (সাঃ) যায়িদের কথা শুনে মুগ্ধ হলেন। তাকে নিয়ে কাবায় গেলেন। ঘোষণা করলেন: হে কুরাইশ! সাক্ষী থাকো। আজ থেকে যায়িদ আমার পুত্র। সে আমার উত্তরাধিকারী, আমি তার। হারিসা খুশি হয়ে ফিরে গেলেন। ছেলে ভালো হাতে আছে। সেদিন থেকে সবাই ডাকত: যায়িদ ইবনে মুহাম্মাদ।",
      "**প্রথম মুসলিম:** ৬১০ সাল। রাসূল (সাঃ) নবুয়ত পেলেন। প্রথম ঈমান আনলেন খাদিজা (রাঃ)। তারপর আলী (রাঃ) - ১০ বছর বয়সী। তারপর আবু বকর (রাঃ)। আর যায়িদ (রাঃ)। তৃতীয় বা চতুর্থ মুসলিম। প্রাপ্তবয়স্ক পুরুষদের মধ্যে প্রথম দিকে।",
      "**নির্যাতন সহ্য:** কুরাইশরা মুসলিমদের নির্যাতন শুরু করল। যায়িদও নির্যাতিত হলেন। কিন্তু ঈমান ছাড়লেন না। রাসূলের পাশে থাকলেন।",
      "**হিজরত:** ৬২২ সাল। রাসূল (সাঃ) মদীনায় হিজরত করলেন। যায়িদও গেলেন। রাসূল (সাঃ) মুহাজির ও আনসারদের ভ্রাতৃত্ব বন্ধন করালেন। যায়িদকে হামযা (রাঃ) এর সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**বিবাহ:** রাসূল (সাঃ) এর চাচাতো বোন যয়নাব বিনতে জাহশ। সম্ভ্রান্ত পরিবার। রাসূল (সাঃ) চাইলেন যায়িদের সাথে যয়নাবের বিয়ে হোক। যয়নাব ও তার ভাই রাজি ছিলেন না। কুরআনে আয়াত নাযিল হল: আল্লাহ ও তার রাসূল কোনো বিষয়ে সিদ্ধান্ত নিলে মুমিনের অন্য কোনো এখতিয়ার নেই। (সূরা আহযাব: ৩৬) বিয়ে হল। কিন্তু সংসার সুখের হল না। যয়নাব যায়িদকে ছোট মনে করতেন।",
      "**তালাক:** কিছুদিন পর যায়িদ রাসূল (সাঃ) কে বললেন: আমি তালাক দিতে চাই। রাসূল (সাঃ) বললেন: স্ত্রীকে রাখো, আল্লাহকে ভয় করো। কিন্তু সংসার চলল না। তালাক হল। পরে আল্লাহর নির্দেশে রাসূল (সাঃ) যয়নাবকে বিয়ে করলেন। এই ঘটনায় দত্তক প্রথা রহিত হল।",
      "**দত্তক প্রথা রহিত:** কুরআনে আয়াত নাযিল হল: তাদের পিতাদের নামে ডাকো। এটাই আল্লাহর কাছে ন্যায়সঙ্গত। (সূরা আহযাব: ৫) সেদিন থেকে যায়িদ ইবনে মুহাম্মাদ নয়, যায়িদ ইবনে হারিসা। কিন্তু রাসূলের ভালোবাসা কমেনি। যায়িদ রইলেন রাসূলের প্রিয়তম।",
      "**বদরের যুদ্ধ:** ৬২৪ সাল। প্রথম যুদ্ধ। যায়িদ বীরত্বের সাথে লড়লেন। মুসলিমদের বিজয়।",
      "**উহুদের যুদ্ধ:** ৬২৫ সাল। যায়িদ রাসূল (সাঃ) কে রক্ষা করলেন। আহত হলেন কিন্তু হার মানলেন না।",
      "**সামরিক অভিযানের নেতা:** রাসূল (সাঃ) যায়িদকে অনেক ছোট অভিযানের নেতা বানাতেন। কারণ তার বিচক্ষণতা ও সাহসিকতা। যায়িদ ৭-৮টি অভিযানে নেতৃত্ব দিয়েছেন। সবগুলোতে সফল।",
      "**পুত্র উসামা:** যায়িদের পুত্র উসামা ইবনে যায়িদ। রাসূল (সাঃ) উসামাকে অত্যন্ত ভালোবাসতেন। বলতেন: যায়িদ ও উসামা আমার সবচেয়ে প্রিয়।",
      "**মুতার অভিযান:** ৬২৯ সাল, জমাদিউল আউয়াল। রোমান সাম্রাজ্যের বিরুদ্ধে অভিযান। রাসূল (সাঃ) ৩,০০০ সৈন্য পাঠালেন। সেনাপতি নিয়োগ করলেন তিনজন: প্রথম যায়িদ ইবনে হারিসা। যায়িদ শহীদ হলে জাফর ইবনে আবি তালিব। জাফর শহীদ হলে আবদুল্লাহ ইবনে রাওয়াহা। সাদা পতাকা দিলেন যায়িদের হাতে।",
      "**বিদায়:** মদীনা থেকে বিদায়। রাসূল (সাঃ) সৈন্যদের সাথে কিছুদূর হেঁটে গেলেন। যায়িদকে জড়িয়ে ধরলেন। দোয়া করলেন। যায়িদ জানতেন না এটাই শেষ দেখা।",
      "**মুতার যুদ্ধক্ষেত্র:** সিরিয়ার মুতা। রোমান সাম্রাজ্যের ২,০০,০০০ সৈন্য! মুসলিম মাত্র ৩,০০০। ১:৬৭ অনুপাত! সাহাবীরা চিন্তিত। কিন্তু যায়িদ বললেন: আমরা সংখ্যা বা শক্তিতে লড়ি না। আমরা লড়ি ঈমানে। আল্লাহ আমাদের সাথে।",
      "**শাহাদাত:** যুদ্ধ শুরু হল। যায়িদ সাদা পতাকা হাতে সামনে। বীরত্বের সাথে লড়ছেন। একের পর এক শত্রু মারছেন। হঠাৎ একটি বর্শা এসে বুকে বিঁধল। যায়িদ মাটিতে পড়ে গেলেন। শাহাদাত বরণ করলেন। বয়স ৫৫ বছর। পতাকা পড়ে গেল। জাফর তুলে নিলেন।",
      "**রাসূলের শোক:** মদীনায় রাসূল (সাঃ)। জিবরীল (আঃ) খবর দিলেন। রাসূল (সাঃ) মসজিদে গেলেন। কাঁদতে কাঁদতে বললেন: আমার ভাই, আমার প্রিয় যায়িদ শহীদ হয়েছে। তারপর জাফর শহীদ হয়েছে। তারপর আবদুল্লাহ শহীদ হয়েছে। চোখ দিয়ে অশ্রু ঝরছে। সাহাবীরাও কাঁদলেন।",
      "**যায়িদের পরিবার:** যায়িদের বাড়িতে গেলেন। যায়িদের মেয়ে কাঁদছে। রাসূল (সাঃ) ও কাঁদলেন। সাদ ইবনে উবাদা বললেন: ইয়া রাসূলাল্লাহ! এ কী? রাসূল (সাঃ) বললেন: এ হল প্রিয়জনের জন্য প্রিয়জনের কান্না।",
      "**মর্যাদা:** রাসূল (সাঃ) বলেছেন: যায়িদ আমার মাওলা (প্রিয়জন, মুক্তিদাতা)। যায়িদ আমার প্রিয়তম। একমাত্র সাহাবী যাকে কুরআনে নাম ধরে উল্লেখ করা হয়েছে: যায়িদ যখন তার (যয়নাবের) সাথে সম্পর্ক ছিন্ন করল... (সূরা আহযাব: ৩৭)",
      "**উত্তরাধিকার:** পুত্র উসামা ইবনে যায়িদ। রাসূল (সাঃ) এর মৃত্যুর আগে উসামাকে সিরিয়ার অভিযানের সেনাপতি বানিয়েছিলেন। মাত্র ১৮ বছর বয়সে। অনেক বয়স্ক সাহাবী আপত্তি করলেন। রাসূল (সাঃ) বললেন: তোমরা তার পিতার নেতৃত্বেও আপত্তি করেছিলে। যায়িদ ছিল নেতৃত্বের যোগ্য, উসামাও।",
      "**স্মরণ:** দাস থেকে প্রিয়তম। অপহৃত শিশু থেকে সেনাপতি। যায়িদ ইবনে হারিসা (রাঃ) - রাসূলের প্রিয়, ইসলামের বীর, মুতার শহীদ। যার ভালোবাসা দাসত্বকে স্বাধীনতার চেয়ে প্রিয় করেছিল। যিনি পিতার ডাক ছেড়ে রাসূলের সাথে থাকা বেছে নিয়েছিলেন। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন।"
    ]
  },
  {
    "id": "jafar_ibn_abi_talib",
    "categoryId": "sahabider_jibon",
    "title": "জাফর ইবনে আবি তালিব (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। নাম জাফর ইবনে আবি তালিব ইবনে আবদুল মুত্তালিব। পিতা আবু তালিব, মা ফাতিমা বিনতে আসাদ। আলীর বড় ভাই। রাসূলের চাচাতো ভাই। রাসূলের চেয়ে দশ বছরের ছোট। লম্বা, সুদর্শন। রাসূলের সাথে চেহারায় অনেক মিল ছিল। রাসূল বলতেন: জাফর চরিত্রে ও চেহারায় আমার সবচেয়ে কাছের।",
      "**ইসলাম গ্রহণ ও নির্যাতন:** প্রথম দিকে ইসলাম গ্রহণ করলেন। ভাই আলীর পরে। স্ত্রী আসমা বিনতে উমাইস - বিখ্যাত সাহাবিয়া। তিন ছেলে: আবদুল্লাহ, মুহাম্মাদ, আউন। মক্কায় মুসলিমদের উপর নির্যাতন বাড়ছে। কুরাইশরা কষ্ট দিচ্ছে। জাফরও নির্যাতিত হলেন। কিন্তু ঈমান ছাড়লেন না।",
      "**আবিসিনিয়ায় হিজরত:** ছয়শত পনেরো সাল। রাসূল বললেন: আবিসিনিয়ায় যাও। সেখানে ন্যায়পরায়ণ বাদশাহ আছেন। নাজাশি। তিনি তোমাদের আশ্রয় দেবেন। জাফর নেতৃত্ব দিলেন। তিরাশি জন মুসলিম গেলেন। পুরুষ আঠারো জন, নারী এগারো জন। লোহিত সাগর পার হলেন। আবিসিনিয়ায় পৌঁছলেন। নাজাশি তাদের আশ্রয় দিলেন। বললেন: তোমরা নিরাপদ। আমার রাজ্যে কেউ তোমাদের কষ্ট দিতে পারবে না।",
      "**নাজাশির দরবারে:** কুরাইশরা রাগে ফেটে পড়ল। প্রতিনিধি পাঠাল: মুসলিমদের ফেরত দাও। আমর ইবনুল আস ও আবদুল্লাহ ইবনে রাবিয়া এল। উপহার নিয়ে। চামড়া, সুগন্ধি, মূল্যবান জিনিস। নাজাশি জাফরকে ডাকলেন। বললেন: তোমরা কারা? কেন এসেছ? তোমাদের ধর্ম কী? জাফর দাঁড়ালেন। চমৎকার বক্তৃতা দিলেন।",
      "**জাফরের বক্তৃতা:** বললেন: হে বাদশাহ! আমরা জাহেলিয়াতে ছিলাম। মূর্তি পূজা করতাম। মদ পান করতাম। জুয়া খেলতাম। মেয়েদের জীবন্ত কবর দিতাম। দুর্বলদের কষ্ট দিতাম। আল্লাহ আমাদের মধ্য থেকে একজন নবী পাঠালেন। আমরা তাকে চিনি। তিনি সত্যবাদী, আমানতদার। তিনি আমাদের এক আল্লাহর ইবাদত শেখালেন। মূর্তি ভাঙতে বললেন। সত্য বলতে বললেন। আত্মীয়তা রক্ষা করতে বললেন। নাজাশি বললেন: তোমাদের কাছে আল্লাহর কোনো বাণী আছে? জাফর বললেন: হ্যাঁ। তারপর সূরা মারিয়াম তিলাওয়াত করলেন। মারিয়াম ও ঈসার কথা।",
      "**নাজাশির কান্না:** নাজাশি কাঁদলেন। চোখ দিয়ে অশ্রু ঝরছে। বললেন: এই আর ঈসার বাণী একই উৎস থেকে। আল্লাহর কাছ থেকে। তোমরা নিরাপদ। আমি তোমাদের রক্ষা করব। আমর ইবনুল আস ব্যর্থ হলেন। মুসলিমদের ফেরত পেলেন না। রাগ করে ফিরে গেলেন। জাফর ও সাথীরা আবিসিনিয়ায় থাকলেন। এগারো বছর আবিসিনিয়ায় ছিলেন। মুসলিমদের নেতা। নাজাশির কাছে সম্মানিত। কুরাইশরা দুইবার প্রতিনিধি পাঠাল। দুইবারই ব্যর্থ হল।",
      "**খায়বারে ফিরে আসা:** ছয়শত আটাশ সাল। খায়বার বিজয়ের সময় আবিসিনিয়া থেকে ফিরলেন। ষোলজন সাথী নিয়ে। রাসূল খায়বার থেকে ফিরছেন। পথে জাফরের সাথে দেখা। রাসূল এত খুশি হলেন যে জাফরকে জড়িয়ে ধরলেন। কপালে চুমু দিলেন। বললেন: আল্লাহর কসম! জানি না কোনটায় বেশি খুশি - জাফরের আগমনে না খায়বার বিজয়ে! সাহাবীরা তাকবীর দিলেন। উপাধি দিলেন - জাফর আত-তাইয়ার। উড়ন্ত জাফর। কারণ জান্নাতে তার দুই ডানা আছে বলে রাসূল বলেছেন।",
      "**মুতার অভিযান:** ছয়শত ঊনত্রিশ সাল। রোমান সাম্রাজ্যের বিরুদ্ধে মুতার অভিযান। রাসূল তিনজন সেনাপতি নিয়োগ করলেন। প্রথম যায়িদ। যায়িদ শহীদ হলে জাফর। জাফর শহীদ হলে আবদুল্লাহ ইবনে রাওয়াহা। সিরিয়ার মুতা। রোমান সাম্রাজ্যের দুই লক্ষ সৈন্য! মুসলিম মাত্র তিন হাজার। এক থেকে সাতষট্টি অনুপাত! যুদ্ধ শুরু হল। যায়িদ সাদা পতাকা হাতে সামনে। বীরত্বের সাথে লড়লেন। শহীদ হলেন। পতাকা পড়ে গেল।",
      "**জাফরের বীরত্ব:** জাফর পতাকা তুলে নিলেন। চিৎকার করলেন: আল্লাহু আকবার! সামনে এগিয়ে গেলেন। ঘোড়ায় চড়ে ছিলেন। ঘোড়া থেকে লাফ দিয়ে নামলেন। ঘোড়াকে জবাই করলেন - যাতে পালানোর চিন্তা না আসে। বললেন: আজ জান্নাত না হয় শাহাদাত! ডান হাতে পতাকা। তলোয়ার চালাচ্ছেন। একটি তলোয়ার এসে ডান হাত কেটে ফেলল। রক্ত ঝরছে। কিন্তু জাফর থামলেন না। বাম হাতে পতাকা ধরলেন। আবার লড়তে লাগলেন। আরেকটি তলোয়ার এসে বাম হাতও কেটে ফেলল। দুই হাত কাটা গেল।",
      "**শাহাদাত:** দুই বাহু দিয়ে পতাকা বুকে জড়িয়ে ধরলেন। লড়তে লাগলেন। পতাকা ফেলবেন না। পতাকা রক্ষা করতে হবে। একটি তলোয়ার এসে শরীর দুই ভাগ করে ফেলল। জাফর মাটিতে পড়ে গেলেন। শাহাদাত বরণ করলেন। শরীরে নব্বইয়ের বেশি আঘাত। সব সামনে থেকে। পেছনে একটিও না। বয়স একচল্লিশ বছর।",
      "**রাসূলের শোক:** মদীনায় রাসূল। জিবরীল খবর দিলেন। রাসূল মসজিদে গেলেন। কাঁদতে কাঁদতে বললেন: আমার ভাই যায়িদ শহীদ হয়েছে। তারপর জাফর শহীদ হয়েছে। তারপর আবদুল্লাহ শহীদ হয়েছে। জাফরের বাড়িতে গেলেন। আসমা কাঁদছেন। তিন ছেলে কাঁদছে। রাসূল তাদের সান্ত্বনা দিলেন। বললেন: জাফর জান্নাতে। আল্লাহ তাকে দুটি ডানা দিয়েছেন। রাসূল বললেন: আল্লাহ জাফরকে দুটি ডানা দিয়েছেন। জান্নাতে ফেরেশতাদের সাথে উড়ে বেড়ায়। জাফর আত-তাইয়ার। উড়ন্ত জাফর। মুতার শহীদ। জান্নাতের বাসিন্দা। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "sad_ibn_muadh",
    "categoryId": "sahabider_jibon",
    "title": "সা'দ ইবনে মুয়াজ (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। নাম সাদ ইবনে মুয়াজ ইবনে নুমান। পিতা মুয়াজ ইবনে নুমান। আউস গোত্রের নেতা। লম্বা, সুদর্শন, শক্তিশালী। মদীনার সবচেয়ে প্রভাবশালী নেতাদের একজন। মানুষ তাকে সম্মান করত। তার কথা শুনত।",
      "**ইসলাম গ্রহণ:** মুসআব ইবনে উমাইর মদীনায় ইসলাম প্রচার করছেন। আসআদ ইবনে যুরারার বাড়িতে থাকছেন। মানুষদের ইসলামের দাওয়াত দিচ্ছেন। সাদ রাগ করে এলেন। বললেন: কে তুমি? কেন আমাদের এখানে এসে ধর্ম প্রচার করছ? আমাদের দুর্বলদের বোকা বানাচ্ছ? মুসআব শান্ত স্বরে বললেন: বসুন। শুনুন। পছন্দ না হলে চলে যাব। সাদ বসলেন। মুসআব কুরআন তিলাওয়াত করলেন। সাদ শুনলেন। হৃদয় নরম হল। চেহারা বদলে গেল। বললেন: এটা কী? মুসআব বললেন: আল্লাহর বাণী। সাদ বললেন: আমি সাক্ষ্য দিচ্ছি লা ইলাহা ইল্লাল্লাহ। সাথে সাথে ইসলাম গ্রহণ করলেন।",
      "**গোত্রকে মুসলিম করা:** গোত্রে ফিরে বললেন: হে বনু আবদুল আশহাল! তোমরা আমাকে কেমন মনে করো? বললেন: আমাদের নেতা, আমাদের সেরা। সাদ বললেন: তাহলে শোনো। আজ থেকে তোমাদের সাথে কথা বলব না যতক্ষণ না ইসলাম গ্রহণ করো। সন্ধ্যার মধ্যে পুরো গোত্র মুসলিম হল! এক মানুষের প্রভাব!",
      "**বদরের বীরত্ব:** ছয়শত চব্বিশ সাল। বদরের যুদ্ধ। রাসূল পরামর্শ চাইলেন। মুহাজিররা বলল: আমরা আপনার সাথে আছি। কিন্তু রাসূল আনসারদের মত জানতে চাইলেন। কারণ তারা শুধু মদীনায় রক্ষার প্রতিশ্রুতি দিয়েছিল। বাইরে যুদ্ধের নয়। সাদ দাঁড়িয়ে বললেন: ইয়া রাসূলাল্লাহ! মনে হয় আপনি আমাদের কথা জানতে চাচ্ছেন। রাসূল বললেন: হ্যাঁ। সাদ বললেন: আমরা আপনার প্রতি ঈমান এনেছি। সত্য বলে স্বীকার করেছি। সাক্ষ্য দিয়েছি। প্রতিশ্রুতি দিয়েছি শুনব ও মানব। ইয়া রাসূলাল্লাহ! আপনি যা চান করুন। আল্লাহর কসম! আপনি যদি আমাদের নিয়ে সমুদ্রে ঝাঁপ দিতে বলেন, আমরা ঝাঁপ দেব। আপনি যদি পাহাড়ে চড়তে বলেন, আমরা চড়ব। আমরা আপনার সাথে আছি। রাসূল খুশি হলেন। বললেন: চলো, আল্লাহ আমাদের বিজয় দেবেন।",
      "**খন্দকে আহত:** ছয়শত সাতাশ সাল। খন্দকের যুদ্ধ। দশ হাজার কাফির মদীনা ঘেরাও করেছে। একটি তীর সাদের হাতে বিঁধল। হিব্বান ইবনে আরিকা ছুঁড়েছিল। রগ কেটে গেল। রক্তপাত বন্ধ হচ্ছে না। সাদ বললেন: হে আল্লাহ! যদি কুরাইশদের সাথে আরও যুদ্ধ বাকি থাকে, তবে আমাকে বাঁচিয়ে রাখো। আর যদি শেষ হয়ে যায়, তবে এই ক্ষত দিয়ে আমাকে শহীদ করো। কিন্তু বনু কুরাইযার বিচার দেখার আগে না।",
      "**বনু কুরাইযার বিচার:** যুদ্ধ শেষ। বনু কুরাইযা ইহুদিরা চুক্তি ভেঙেছে। মুসলিমদের সাথে বিশ্বাসঘাতকতা করেছে। রাসূল বললেন: সাদ বিচার করবে। সাদকে ডাকা হল। গাধায় চড়ে এলেন। হাত বাঁধা। রক্ত ঝরছে। রাসূল বললেন: তোমার ভাইদের বিচার করো। সাদ বললেন: যোদ্ধাদের হত্যা করা হবে। নারী ও শিশুদের বন্দী করা হবে। সম্পদ বণ্টন করা হবে। রাসূল বললেন: তুমি আল্লাহর ফয়সালা করেছ। সাত আসমানের উপর থেকে আল্লাহ এই ফয়সালা করেছেন।",
      "**শাহাদাত:** ক্ষত থেকে রক্তপাত চলছিল। এক মাস পর শহীদ হলেন। বয়স সাঁইত্রিশ বছর। রাসূল বললেন: সাদের মৃত্যুতে আল্লাহর আরশ কেঁপে উঠেছে! সত্তর হাজার ফেরেশতা তার জানাযায় এসেছিল। কবরে প্রথম চাপ পড়েছিল। রাসূল বললেন: সাদও চাপ থেকে রেহাই পায়নি। আনসারদের নেতা। আরশ কাঁপানো শহীদ। জান্নাতের বাসিন্দা। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "usayd_ibn_hudayr",
    "categoryId": "sahabider_jibon",
    "title": "উসাইদ ইবনে হুদাইর (রাঃ)",
    "paragraphs": [
      "হযরত উসাইদ ইবনে হুদাইর (আরবি: أُسَيْد بْن حُضَيْر; মৃত্যু: ৬৪৫) ছিলেন একজন মহান আনসারী সাহাবী এবং মদীনার অন্যতম নেতা। তিনি ছিলেন অত্যন্ত বুদ্ধিমান, সাহসী এবং কুরআন তিলাওয়াতকারী।",
      "**বংশ ও প্রাথমিক জীবন:** উসাইদ (রাঃ) মদীনার বনু আবদুল আশহাল গোত্রে জন্মগ্রহণ করেন। তাঁর পিতা হুদাইর ছিলেন জাহেলিয়াতের যুগে মদীনার একজন প্রভাবশালী নেতা। উসাইদ (রাঃ) ছিলেন অত্যন্ত সম্মানিত এবং তাঁর গোত্রের লোকেরা তাঁকে অত্যন্ত ভালোবাসত।",
      "**ইসলাম গ্রহণ:** মুসআব ইবনে উমাইর (রাঃ) যখন মদীনায় ইসলামের দাওয়াত দিচ্ছিলেন, তখন উসাইদ (রাঃ) তাঁর কাছে গেলেন এবং বললেন: 'তুমি কেন আমাদের দুর্বলদের বিভ্রান্ত করছ? যদি তোমার জীবন প্রিয় হয়, তাহলে এখান থেকে চলে যাও!' মুসআব (রাঃ) বললেন: 'আপনি কি বসে আমার কথা শুনবেন? যদি পছন্দ হয়, গ্রহণ করবেন, না হলে আমি চলে যাব।'",
      "উসাইদ (রাঃ) বললেন: 'ঠিক আছে, বলো।' মুসআব (রাঃ) কুরআন তিলাওয়াত করলেন। উসাইদ (রাঃ)-এর চেহারা উজ্জ্বল হয়ে গেল এবং তিনি বললেন: 'এটা কত সুন্দর! ইসলামে প্রবেশ করতে কী করতে হয়?' মুসআব (রাঃ) তাঁকে শিখালেন এবং তিনি সাথে সাথে ইসলাম গ্রহণ করলেন। এরপর তিনি তাঁর গোত্রের নেতা সা'দ ইবনে মুয়াজ (রাঃ)-কে ডেকে আনলেন এবং তিনিও ইসলাম গ্রহণ করলেন। সেদিন পুরো বনু আবদুল আশহাল গোত্র ইসলাম গ্রহণ করে।",
      "**কুরআন তিলাওয়াত ও ফেরেশতা:** একবার উসাইদ (রাঃ) রাতে কুরআন তিলাওয়াত করছিলেন এবং তাঁর ঘোড়া কাছেই বাঁধা ছিল। হঠাৎ ঘোড়া লাফাতে শুরু করল। তিনি থামলেন এবং ঘোড়া শান্ত হলো। আবার তিলাওয়াত শুরু করলে ঘোড়া আবার লাফাতে লাগল। তাঁর ছেলে ইয়াহইয়া ঘোড়ার কাছে ছিল। তিনি ভয় পেয়ে তিলাওয়াত বন্ধ করলেন।",
      "সকালে তিনি রাসূল (সাঃ)-কে ঘটনা বললেন। রাসূল (সাঃ) বললেন: 'اقْرَأْ يَا ابْنَ حُضَيْرٍ، اقْرَأْ يَا ابْنَ حُضَيْرٍ (পড়তে থাকো হে হুদাইরের পুত্র!)' উসাইদ (রাঃ) বললেন: 'আমি ইয়াহইয়ার জন্য ভয় পেয়েছিলাম।' রাসূল (সাঃ) বললেন: 'তুমি যদি পড়তে থাকতে, তাহলে ফেরেশতারা সকাল পর্যন্ত তোমার উপর ছায়া দিত এবং মানুষ তাদের দেখতে পেত।' [সহীহ বুখারী]",
      "**যুদ্ধে অংশগ্রহণ:** উসাইদ (রাঃ) বদর, উহুদ, খন্দক এবং অন্যান্য সকল যুদ্ধে রাসূল (সাঃ)-এর সাথে অংশগ্রহণ করেন। উহুদের যুদ্ধে তিনি অসাধারণ বীরত্ব প্রদর্শন করেন এবং রাসূল (সাঃ)-কে রক্ষা করেন।",
      "**বুদ্ধিমত্তা ও পরামর্শ:** উসাইদ (রাঃ) ছিলেন অত্যন্ত বুদ্ধিমান এবং দূরদর্শী। রাসূল (সাঃ) গুরুত্বপূর্ণ বিষয়ে তাঁর পরামর্শ নিতেন। ইফকের ঘটনায় তিনি রাসূল (সাঃ)-কে সঠিক পরামর্শ দিয়েছিলেন। খলিফাদের যুগেও তাঁর পরামর্শ অত্যন্ত মূল্যবান ছিল।",
      "**রাসূলের ভালোবাসা:** রাসূল (সাঃ) উসাইদ (রাঃ)-কে অত্যন্ত ভালোবাসতেন। তিনি বলতেন: 'نِعْمَ الرَّجُلُ أُسَيْدُ بْنُ حُضَيْرٍ (কত ভালো মানুষ উসাইদ ইবনে হুদাইর!)' আয়েশা (রাঃ) বলেন: 'উসাইদ, সা'দ ইবনে মুয়াজ এবং আব্বাদ ইবনে বিশর ছিলেন আনসারদের মধ্যে সর্বশ্রেষ্ঠ তিনজন।'",
      "**চরিত্র:** উসাইদ (রাঃ) ছিলেন অত্যন্ত হাস্যোজ্জ্বল এবং মিষ্টভাষী। তিনি মানুষকে হাসাতে পছন্দ করতেন কিন্তু সর্বদা সত্য কথা বলতেন। তিনি ছিলেন দানশীল এবং অতিথিপরায়ণ। তাঁর ঘরে সর্বদা মেহমান থাকত।",
      "**ইন্তেকাল:** ৬৪৫ খ্রিস্টাব্দে (২০ হিজরি) মদীনায় খলিফা উমর (রাঃ)-এর শাসনামলে তিনি ইন্তেকাল করেন। উমর (রাঃ) তাঁর জানাজায় অংশ নেন এবং বলেন: 'আনসারদের একজন নেতা চলে গেলেন।' তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "anas_ibn_malik_extended_full",
    "categoryId": "sahabider_jibon",
    "title": "আনাস ইবনে মালিক (রাঃ) এর পূর্ণাঙ্গ জীবনী",
    "paragraphs": [
      "**প্রারম্ভিক জীবন ও বংশ পরিচয়:** মদীনার খাযরাজ গোত্রের বনু আন-নাজ্জার শাখায় রাসূল (সাঃ)-এর হিজরতের প্রায় ১০ বছর পূর্বে (আনুমানিক ৬১২ খ্রিষ্টাব্দে) জন্ম। পূর্ণ নাম আনাস ইবনে মালিক ইবনে নাদর আল-খাযরাজী আল-আনসারী। তাঁর উপনাম ছিল আবূ হামযা। তাঁর মা ছিলেন বিশিষ্ট সাহাবিয়া উম্মে সুলাইম বিনতে মিলহান (রাঃ), যিনি ইসলামের প্রথম দিকেই ইসলাম গ্রহণ করেন। তাঁর পিতা মালিক ইবনে নাদর ইসলাম গ্রহণ করেননি এবং মা ইসলাম গ্রহণ করায় ক্ষুব্ধ হয়ে মদীনা ত্যাগ করে শামে ইন্তেকাল করেন। পিতার মৃত্যুর পর মা দ্বিতীয় বিবাহ করেন বিখ্যাত সাহাবী আবু তালহা (রাঃ)-কে। আনাস (রাঃ) তাঁর মায়ের মাধ্যমেই শৈশবে ইসলাম গ্রহণ করেন এবং সৎপিতা আবু তালহার তত্ত্বাবধানে লালিত-পালিত হন।",
      "**রাসূলের (সাঃ) খাদেম ও সান্নিধ্য:** যখন রাসূল (সাঃ) মদীনায় হিজরত করে আগমন করেন, তখন আনাস (রাঃ)-এর বয়স ছিল মাত্র দশ বছর। তাঁর মা উম্মে সুলাইম তাঁকে নিয়ে এসে রাসূল (সাঃ)-এর সেবার জন্য পেশ করেন। রাসূল (সাঃ) তাঁকে সাদরে গ্রহণ করেন। এরপর থেকে একটানা দশ বছর (৬২২-৬৩২ খ্রিষ্টাব্দ) তিনি রাসূল (সাঃ)-এর একান্ত খাদেম হিসেবে দায়িত্ব পালন করেন। তিনি বলেন: 'আমি দশ বছর ধরে রাসূল (সাঃ)-এর খেদমত করেছি। তিনি কখনো আমাকে 'উহ্‌' পর্যন্ত বলেননি। কখনো বলেননি, কেন এটা করেছ বা কেন এটা করোনি।' এই দশ বছর তিনি রাসূল (সাঃ)-এর অত্যন্ত ঘনিষ্ঠ সান্নিধ্যে কাটান, যা তাঁকে বিপুল জ্ঞান ও অনুপম চরিত্রের শিক্ষা লাভে সহায়তা করে।",
      "**রাসূলের (সাঃ) দোয়া ও তার প্রভাব:** রাসূল (সাঃ) তাঁর এই প্রিয় খাদেমের জন্য বিশেষ দোয়া করেছিলেন। দোয়ায় তিনি বলেন: 'হে আল্লাহ! তাঁর সম্পদ ও সন্তান বাড়াও, তাতে বরকত দাও এবং তাঁকে দীর্ঘায়ু দাও।' এই দোয়ার বরকতে আনাস (রাঃ) অত্যন্ত দীর্ঘ জীবন লাভ করেন এবং প্রায় ১২০-এরও বেশি সন্তানের জনক হয়েছিলেন। এটাও বর্ণিত আছে যে, তাঁর বাগানে বছরে একবারের পরিবর্তে দুইবার ফলন হতো, যা রাসূলের (সাঃ) দোয়ার বরকতেরই নিদর্শন ছিল।",
      "**জিহাদে অংশগ্রহণ:** বাল্য বয়সের কারণে বদর ও উহুদ যুদ্ধে অংশ নিতে না পারলেও তিনি উভয় যুদ্ধের সময় রাসূল (সাঃ)-এর খেদমতে উপস্থিত ছিলেন। পরবর্তীতে ইসলাম ও রাসূলের প্রতিরক্ষায় প্রায় সকল গুরুত্বপূর্ণ যুদ্ধে তিনি সক্রিয়ভাবে অংশগ্রহণ করেন। এর মধ্যে রয়েছে খন্দক, খায়বার বিজয়, মক্কা বিজয়, হুনায়ন, এবং তাবুক। উহুদ যুদ্ধের কঠিন পরিস্থিতিতেও তিনি সাহসিকতার সাথে রাসূল (সাঃ)-কে রক্ষা করার জন্য লড়ে যান।",
      "**খেলাফতের যুগে দায়িত্ব:** রাসূল (সাঃ)-এর ইন্তেকালের পর তিনি মদীনার ইলমী কেন্দ্র থেকে বসরা নগরীতে চলে যান এবং সেখানেই স্থায়ীভাবে বসবাস শুরু করেন। খলীফা আবু বকর (রাঃ)-এর শাসনামলে তাঁকে বাহরাইনের গভর্নর নিযুক্ত করা হয়। পরবর্তীতে খলীফা উমর (রাঃ)-এর খেলাফতের সময় বসরা নগরীতে ফিকহ ও ইলমুল হাদীসের শিক্ষক (মুয়াল্লিম) হিসেবে নিযুক্ত হন। তিনি বসরাকে হাদীস চর্চার অন্যতম কেন্দ্রে পরিণত করতে গুরুত্বপূর্ণ ভূমিকা পালন করেন। খিলাফতের দীর্ঘ সময় তিনি ইলম ও দাওয়াতের কাজ নিরলসভাবে চালিয়ে যান।",
      "**হাদীস বর্ণনা ও ইলমী মর্যাদা:** রাসূল (সাঃ)-এর দীর্ঘ সান্নিধ্যের ফলস্বরূপ তিনি বিপুল সংখ্যক হাদীস বর্ণনা করেছেন। তাঁর বর্ণিত হাদীসের সংখ্যা প্রায় ২,৮৬০টি, যা তাঁকে অন্যতম বহুল হাদীস বর্ণনাকারী সাহাবী হিসেবে পরিচিত করেছে। তিনি সাহাবী, তাবেয়ী ও পরবর্তী প্রজন্মের মাঝে রাসূলের (সাঃ) সুন্নাহ পৌঁছে দিয়েছেন। তাঁর শিষ্যদের মধ্যে প্রখ্যাত তাবেয়ীগণ অন্তর্ভুক্ত ছিলেন। তিনি একজন জ্ঞানী, গুণী, ফকীহ (ইসলামী আইন বিশেষজ্ঞ), মুফতি ও মুহাদ্দিস সাহাবী হিসেবে পরিচিত ছিলেন।",
      "**দীর্ঘ জীবন ও ইন্তেকাল:** তিনি ছিলেন সাহাবীদের মধ্যে অন্যতম দীর্ঘজীবী। রাসূলের (সাঃ) দোয়ার বরকতে তিনি প্রায় ১০৩ বছর (মতান্তরে ৯৩ বছর) বেঁচে ছিলেন। হিজরি ৯৩ সনে (৭০৯/৭১২ খ্রিষ্টাব্দ) তিনি বসরা নগরীতে ইন্তেকাল করেন। বসরায় ইন্তেকালকারী সাহাবীদের মধ্যে তিনিই ছিলেন সর্বশেষ। তাঁর মৃত্যুর মাধ্যমে সাহাবীদের যুগের একটি গুরুত্বপূর্ণ অধ্যায়ের সমাপ্তি ঘটে। তিনি সারা জীবন রাসূল (সাঃ)-এর প্রিয় খাদেমের উপাধিতে পরিচিত ছিলেন। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন।"
    ]
  },
  {
    "id": "abdullah_ibn_umar_extended",
    "categoryId": "sahabider_jibon",
    "title": "আবদুল্লাহ ইবনে উমর (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। নাম আবদুল্লাহ ইবনে উমর ইবনুল খাত্তাব। পিতা উমর, মা যয়নাব বিনতে মাযউন। ইসলামের প্রথম দিকে জন্ম। পিতার সাথে হিজরত করেন। মদীনায় বড় হন। রাসূলের সান্নিধ্যে।",
      "**যুদ্ধে অংশগ্রহণ:** তেরো বছর বয়সে উহুদে যেতে চেয়েছিলেন। রাসূল বয়স কম বলে পাঠাননি। পনেরো বছর বয়সে খন্দক থেকে সব যুদ্ধে অংশ নিয়েছেন। খায়বার, মক্কা বিজয়, হুনায়ন, তাবুক - সব যুদ্ধে। বীরত্বের সাথে লড়েছেন।",
      "**রাসূলের অনুসরণ ও ইবাদত:** রাসূলের প্রতিটি কাজ অনুসরণ করতেন। যেখানে রাসূল বসতেন সেখানে বসতেন। যেখানে রাসূল নামায পড়তেন সেখানে পড়তেন। অত্যন্ত ইবাদতগুজার। রাতে নামায, দিনে রোযা। কুরআন তিলাওয়াত। হজ্জ করতেন প্রতি বছর।",
      "**ফিতনা থেকে দূরে:** আলী ও মুয়াবিয়ার যুদ্ধে কোনো পক্ষ নেননি। নিরপেক্ষ থেকেছেন। বলতেন: আমি মুসলিমদের রক্ত ঝরাতে চাই না। দুই হাজার ছয়শত ত্রিশটি হাদিস বর্ণনা করেছেন। দ্বিতীয় সর্বোচ্চ। তিয়াত্তর হিজরি, ছয়শত বিরানব্বই সাল। মক্কায় মৃত্যু। বয়স চুরাশি বছর। উমরের যোগ্য পুত্র। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "aisha_bint_abu_bakr",
    "categoryId": "sahabider_jibon",
    "title": "আয়েশা বিনতে আবু বকর (রাঃ)",
    "paragraphs": [
      "হযরত আয়েশা বিনতে আবু বকর (আরবি: عَائِشَة بِنْت أَبِي بَكْر; জন্ম: ৬১৪ – মৃত্যু: ৬৭৮) ছিলেন ইসলামের নবী মুহাম্মাদ (সাঃ)-এর সবচেয়ে প্রিয় স্ত্রী এবং প্রথম খলিফা আবু বকর সিদ্দিক (রাঃ)-এর কন্যা। তিনি ছিলেন অত্যন্ত জ্ঞানী, বুদ্ধিমতী এবং ইসলামী শিক্ষার এক উজ্জ্বল নক্ষত্র।",
      "**বংশ ও জন্ম:** আয়েশা (রাঃ) নবুয়তের চতুর্থ বা পঞ্চম বছরে (৬১৪ খ্রিস্টাব্দ) মক্কায় জন্মগ্রহণ করেন। তাঁর পিতা আবু বকর সিদ্দিক (রাঃ) ছিলেন রাসূল (সাঃ)-এর সবচেয়ে ঘনিষ্ঠ সাহাবী এবং প্রথম খলিফা। মা উম্মে রুমান (রাঃ) ছিলেন একজন মহীয়সী নারী। আয়েশা (রাঃ) ইসলামী পরিবেশে বেড়ে উঠেছিলেন এবং শৈশব থেকেই ইসলামের শিক্ষায় প্রশিক্ষিত হয়েছিলেন।",
      "**বিবাহ:** রাসূল (সাঃ)-এর প্রিয় স্ত্রী খাদিজা (রাঃ)-এর মৃত্যুর পর, খাওলা বিনতে হাকিম (রাঃ) রাসূল (সাঃ)-কে বললেন: 'হে আল্লাহর রাসূল! আপনি কি বিয়ে করবেন না?' রাসূল (সাঃ) জিজ্ঞেস করলেন: 'কাকে?' খাওলা বললেন: 'যদি আপনি চান, কুমারী, আয়েশা বিনতে আবু বকর। অথবা বিধবা, সাওদা বিনতে যামআ।' রাসূল (সাঃ) বললেন: 'তাহলে তুমি আমার পক্ষ থেকে তাদের উভয়ের কাছে প্রস্তাব নিয়ে যাও।'",
      "খাওলা আবু বকর (রাঃ)-এর কাছে গেলেন। আবু বকর (রাঃ) বললেন: 'তুমি অপেক্ষা করো, আমি উম্মে রুমানকে জিজ্ঞেস করি।' উম্মে রুমান খুশিতে বললেন: 'এর চেয়ে বড় সম্মান আর কী হতে পারে!' এভাবে নবুয়তের দশম বছরে (৬২০ খ্রিস্টাব্দ) আয়েশা (রাঃ)-এর সাথে রাসূল (সাঃ)-এর বিয়ে হয়। তখন আয়েশার বয়স ছিল ছয় বছর। হিজরতের পর মদীনায় শাওয়াল মাসে নয় বছর বয়সে বাসর হয়।",
      "**রাসূলের প্রিয় স্ত্রী:** আয়েশা (রাঃ) ছিলেন রাসূল (সাঃ)-এর সবচেয়ে প্রিয় স্ত্রী। আমর ইবনুল আস (রাঃ) একবার রাসূল (সাঃ)-কে জিজ্ঞেস করলেন: 'হে আল্লাহর রাসূল! আপনার কাছে সবচেয়ে প্রিয় কে?' রাসূল (সাঃ) বললেন: 'عَائِشَةُ (আয়েশা)।' আমর বললেন: 'পুরুষদের মধ্যে?' রাসূল (সাঃ) বললেন: 'তার পিতা (আবু বকর)।' [সহীহ বুখারী]",
      "আয়েশা (রাঃ) বলেন: 'রাসূল (সাঃ) আমাকে 'হুমাইরা' (লাল রঙের অধিকারী) বলে ডাকতেন।' তিনি আরও বলেন: 'আল্লাহর কসম! আমি জানি যে, রাসূল (সাঃ) আমাকে ভালোবাসতেন। যখন তিনি আমার কাছে থাকতেন, তখন জিবরাঈল (আঃ) আসতেন। আর যখন অন্য স্ত্রীদের কাছে থাকতেন, তখন আসতেন না।'",
      "**ইফকের ঘটনা, মিথ্যা অপবাদ:** বনু মুসতালিক যুদ্ধ থেকে ফেরার পথে এক বিরাট পরীক্ষা এলো। আয়েশা (রাঃ) তাঁর হার খুঁজতে গিয়ে কাফেলা থেকে পিছিয়ে পড়েন। সাহাবী সাফওয়ান ইবনুল মুআত্তাল (রাঃ) তাঁকে খুঁজে পেয়ে উটে তুলে দেন এবং মদীনায় পৌঁছে দেন। এই ঘটনা নিয়ে মুনাফিকরা মিথ্যা অপবাদ রটাতে শুরু করল।",
      "আয়েশা (রাঃ) বলেন: 'আমি এত কাঁদলাম যে, আমার চোখের পানি শুকিয়ে গেল। রাসূল (সাঃ) আমার কাছে এসে বললেন: 'হে আয়েশা! আমার কাছে তোমার সম্পর্কে এমন কথা পৌঁছেছে। যদি তুমি নির্দোষ হও, তাহলে আল্লাহ তোমার নির্দোষিতা প্রকাশ করবেন। আর যদি তুমি কোনো ভুল করে থাকো, তাহলে আল্লাহর কাছে ক্ষমা চাও।'",
      "আয়েশা (রাঃ) বললেন: 'আল্লাহর কসম! আমি যদি বলি আমি নির্দোষ, তবে আপনারা বিশ্বাস করবেন না। আর যদি স্বীকার করি, তবে আল্লাহ জানেন আমি নির্দোষ। আমি শুধু ইয়াকুব (আঃ)-এর কথা বলতে পারি: فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ (ধৈর্যই উত্তম এবং আল্লাহই সাহায্যকারী)।'",
      "এরপর আল্লাহ তায়ালা সূরা নূরের আয়াত নাজিল করলেন:\n\nإِنَّ الَّذِينَ جَاءُوا بِالْإِفْكِ عُصْبَةٌ مِّنكُمْ ۚ لَا تَحْسَبُوهُ شَرًّا لَّكُم ۖ بَلْ هُوَ خَيْرٌ لَّكُمْ\n\nঅর্থ: যারা এই মিথ্যা অপবাদ রটনা করেছে তারা তোমাদেরই একটি দল। তোমরা একে তোমাদের জন্য মন্দ মনে করো না, বরং এটা তোমাদের জন্য কল্যাণকর। [সূরা নূর: ১১]। এভাবে আল্লাহ তায়ালা কুরআনে আয়েশা (রাঃ)-এর নির্দোষিতা ঘোষণা করলেন। রাসূল (সাঃ) খুশিতে হেসে বললেন: 'হে আয়েশা! সুসংবাদ! আল্লাহ তোমার নির্দোষিতা প্রকাশ করেছেন।' আয়েশার মা বললেন: 'উঠে রাসূলকে ধন্যবাদ দাও।' আয়েশা (রাঃ) বললেন: 'আল্লাহর কসম! আমি শুধু আল্লাহর প্রশংসা করব, কারণ তিনিই আমার নির্দোষিতা প্রকাশ করেছেন।' [সহীহ বুখারী]",
      "**জ্ঞান ও হাদিস বর্ণনা:** আয়েশা (রাঃ) ছিলেন অত্যন্ত জ্ঞানী এবং তীক্ষ্ণ বুদ্ধিসম্পন্ন। তিনি ২,২১০টি হাদিস বর্ণনা করেছেন, যার মধ্যে ১৭৪টি সহীহ বুখারী ও মুসলিম উভয়ে বর্ণিত। সাহাবীরা কঠিন মাসআলা বুঝতে না পারলে তাঁর কাছে আসতেন। উরওয়া ইবনে যুবাইর বলেন: 'আমি কুরআন, ফারায়েজ (উত্তরাধিকার), হালাল-হারাম, কবিতা, চিকিৎসা এবং আরবের ইতিহাসে আয়েশার চেয়ে বেশি জ্ঞানী কাউকে দেখিনি।'",
      "মুআবিয়া (রাঃ) বলেন: 'আল্লাহর কসম! আমি আয়েশার চেয়ে বেশি ফাসিহ (বিশুদ্ধ আরবি ভাষায় কথা বলা) এবং বালিগ (সুন্দর বক্তা) কাউকে শুনিনি।' আবু মূসা আশআরী (রাঃ) বলেন: 'যখনই আমরা সাহাবীরা কোনো হাদিসে সন্দেহে পড়তাম, আয়েশার কাছে জিজ্ঞেস করলেই তার সমাধান পেতাম।'",
      "**রাসূলের শেষ মুহূর্ত:** রাসূল (সাঃ)-এর অসুস্থতার সময় তিনি তাঁর স্ত্রীদের কাছে জিজ্ঞেস করলেন: 'আমি আগামীকাল কোথায় থাকব?' তাঁরা বুঝতে পারলেন যে, তিনি আয়েশার ঘরে থাকতে চান। তাঁরা সবাই সম্মতি দিলেন। আয়েশা (রাঃ) বলেন: 'রাসূল (সাঃ) আমার ঘরে, আমার পালার দিনে, আমার বুকে মাথা রেখে ইন্তেকাল করেছেন। আল্লাহ আমার লালা তাঁর লালার সাথে মিশিয়ে দিয়েছেন।'",
      "তিনি বলেন: 'আবদুর রহমান ইবনে আবু বকর (আমার ভাই) একটি মিসওয়াক নিয়ে এলো। রাসূল (সাঃ) সেদিকে তাকালেন। আমি বুঝলাম তিনি মিসওয়াক চান। আমি মিসওয়াকটি নিয়ে নরম করে তাঁকে দিলাম। তিনি মিসওয়াক করলেন। এরপর তাঁর হাত নিচে নেমে গেল এবং তিনি বললেন: 'আর-রাফিকুল আ'লা' (সর্বোচ্চ বন্ধু, আল্লাহ)। এভাবে তিনি ইন্তেকাল করলেন।' [সহীহ বুখারী]",
      "**জামালের যুদ্ধ:** রাসূল (সাঃ)-এর ইন্তেকালের পর, উসমান (রাঃ)-এর হত্যার বিচার নিয়ে মতবিরোধ দেখা দিলে আয়েশা (রাঃ) বিচারের দাবিতে বসরা গমন করেন। ৬৫৬ খ্রিস্টাব্দে তালহা ও যুবাইর (রাঃ)-এর সাথে তিনি আলী (রাঃ)-এর বিরুদ্ধে অবস্থান নেন। এই যুদ্ধে তিনি একটি উটের হাওদায় ছিলেন, তাই এটি 'জামালের যুদ্ধ' (উটের যুদ্ধ) নামে পরিচিত।",
      "যুদ্ধে তালহা ও যুবাইর (রাঃ) শহীদ হন এবং আলী (রাঃ) বিজয়ী হন। আলী (রাঃ) আয়েশা (রাঃ)-কে সম্মানের সাথে মদীনায় ফেরত পাঠান। পরবর্তীতে আয়েশা (রাঃ) এই যুদ্ধে অংশগ্রহণের জন্য অনুতপ্ত হয়েছিলেন এবং বলতেন: 'হায়! আমি যদি সেদিন ঘরে বসে থাকতাম!'",
      "**শিক্ষাদান ও ইবাদত:** আয়েশা (রাঃ) তাঁর জীবনের বাকি সময় মদীনায় শিক্ষাদান ও ইবাদতে কাটিয়েছেন। তাঁর ঘরে একটি পর্দার আড়ালে বসে তিনি পুরুষ ও নারী উভয়কে শিক্ষা দিতেন। তাঁর বিখ্যাত ছাত্রদের মধ্যে ছিলেন উরওয়া ইবনে যুবাইর, কাসিম ইবনে মুহাম্মাদ, আমরা বিনতে আবদুর রহমান এবং আরও অনেকে।",
      "তিনি অত্যন্ত দানশীল ছিলেন। একবার তাঁকে এক লক্ষ দিরহাম দেওয়া হলো। তিনি সব রোজা রেখে বিতরণ করে দিলেন। সন্ধ্যায় তাঁর দাসী বলল: 'আপনি কি আমাদের জন্য এক দিরহাম রাখতে পারতেন না?' আয়েশা (রাঃ) বললেন: 'তুমি যদি আমাকে মনে করিয়ে দিতে, তাহলে আমি রাখতাম।'",
      "**ইন্তেকাল:** ৬৭৮ খ্রিস্টাব্দের ১৭ রমজান (মতান্তরে শাওয়াল), মঙ্গলবার রাতে ৬৪ বছর বয়সে আয়েশা (রাঃ) মদীনায় ইন্তেকাল করেন। তাঁর ইচ্ছা অনুযায়ী তাঁকে রাতেই জান্নাতুল বাকীতে দাফন করা হয়। আবু হুরায়রা (রাঃ) তাঁর জানাজার নামাজ পড়ান। হাজার হাজার মানুষ তাঁর জানাজায় অংশ নেয়। তাঁর মৃত্যুতে পুরো মদীনা শোকে মুহ্যমান হয়ে পড়ে। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "hafsa_bint_umar_fullest_life_final",
    "categoryId": "sahabider_jibon",
    "title": "উম্মুল মুমিনীন হাফসা বিনতে উমর (রাঃ): পূর্ণাঙ্গ জীবনচরিত",
    "paragraphs": [
      "**জন্ম, পরিবার ও প্রাথমিক জীবন:** হযরত হাফসা বিনতে উমর (রাঃ) আনুমানিক **৬০৫ খ্রিষ্টাব্দে** মক্কায় জন্মগ্রহণ করেন। এই সময়ে কুরাইশরা কাবাঘর পুনর্নির্মাণে ব্যস্ত ছিল। তিনি ছিলেন ইসলামের দ্বিতীয় খলিফা **হযরত উমর ইবনুল খাত্তাব (রাঃ)** এবং তাঁর প্রথম স্ত্রী **হযরত যয়নাব বিনতে মাযউনের (রাঃ)** শ্রদ্ধেয় কন্যা। শৈশব থেকেই তিনি তাঁর পিতা উমর (রাঃ)-এর মতোই **দৃঢ়চেতা, স্পষ্টভাষী ও আত্মমর্যাদাবোধসম্পন্ন** ছিলেন। তিনি তাঁর পরিবারের সাথে ইসলামের প্রথম দিকেই ইসলাম গ্রহণ করেন।",
      "**প্রথম বিবাহ এবং সম্মানজনক ইদ্দত:** হাফসা (রাঃ)-এর প্রথম বিবাহ সম্পন্ন হয় সম্মানিত সাহাবী **হযরত খুনাইস ইবনে হুযাফা আস-সাহমী (রাঃ)**-এর সাথে। খুনাইস (রাঃ) ছিলেন ইসলামের প্রথম দিকের মুমিন এবং মক্কা থেকে মদীনায় **দুইবার হিজরতকারী** সাহাবীদের অন্তর্ভুক্ত। মদীনায় হিজরতের পর তিনি **বদরের যুদ্ধে** অংশগ্রহণ করেন এবং এই যুদ্ধে গুরুতরভাবে আহত হন। সেই আঘাতের ফলে হিজরি ৩য় সনে (৬২৪ খ্রিষ্টাব্দে) তিনি **শাহাদাতবরণ করেন**। তাঁর শাহাদাতের পর হাফসা (রাঃ) মাত্র ১৮-২০ বছর বয়সে **সম্মানজনকভাবে ইদ্দত পালন** করেন। তাঁর পিতা উমর (রাঃ) তাঁর জন্য উপযুক্ত জীবনসঙ্গী খুঁজতে শুরু করেন এবং যথাক্রমে আবু বকর (রাঃ) এবং উসমান (রাঃ)-এর কাছে বিবাহের প্রস্তাব দেন।",
      "**রাসূলুল্লাহর (সাঃ) সাথে বিবাহ ও উম্মুল মুমিনীন পদমর্যাদা:** হযরত উমর (রাঃ)-এর গভীর চিন্তার মুহূর্তে, স্বয়ং **রাসূলুল্লাহ (সাঃ) হাফসা (রাঃ)-কে বিবাহের প্রস্তাব পাঠান**। হিজরি ৩য় সনের শাবান মাসে (৬২৫ খ্রিষ্টাব্দে) রাসূল (সাঃ)-এর সাথে তাঁর বিবাহ সম্পন্ন হয় এবং তিনি **উম্মুল মুমিনীন** (বিশ্বাসীদের জননী) হওয়ার মহান মর্যাদায় ভূষিত হন। এই পবিত্র বন্ধনের মাধ্যমে রাসূল (সাঃ) তাঁর দুই প্রধান সহযোগী (আবু বকর ও উমর)-এর সাথে সম্পর্ককে আরও সুদৃঢ় করেন।",
      "**ইবাদত, জ্ঞান ও দাম্পত্য জীবন:** হাফসা (রাঃ) ছিলেন অত্যন্ত **ইবাদতগুজার**। তাঁকে **'সাউওয়ামাহ ও ক্বাওওয়ামাহ'** (বেশি রোযা পালনকারী ও বেশি রাত্রি জাগরণকারী) হিসেবে আখ্যায়িত করা হতো। তিনি **লিখতে ও পড়তে জানতেন**, যা সেই যুগে মহিলাদের জন্য বিরল ছিল। রাসূল (সাঃ)-এর নির্দেশে নারী সাহাবী শিফা বিনতে আবদুল্লাহ (রাঃ) তাঁকে লেখাপড়া ও রোগ নিরাময়ের জ্ঞান শিক্ষা দেন। দাম্পত্য জীবনে একবার মনোমালিন্যের কারণে রাসূল (সাঃ) তাঁকে একবার তালাক দিলেও, **জিবরাইল (আঃ)-এর নির্দেশনা** অনুসারে তিনি তাঁকে ফিরিয়ে নেন। জিবরাইল (আঃ) রাসূলকে (সাঃ) বলেছিলেন যে হাফসা (রাঃ) **খুব বেশি রোযা রাখেন ও বেশি বেশি নামায পড়েন এবং তিনি জান্নাতেও তাঁর (রাসূলের) স্ত্রী থাকবেন**।",
      "**কুরআনের ঐতিহাসিক সংরক্ষক:** ইসলামের ইতিহাসে তাঁর সর্বশ্রেষ্ঠ অবদান হলো, প্রথম খলিফা হযরত আবু বকর (রাঃ)-এর নির্দেশে সংকলিত **পবিত্র কুরআনের মূল পাণ্ডুলিপিটি (সহীফা)** তাঁর কাছে **আমানত হিসেবে সংরক্ষিত** রাখা। এই কারণে তিনি **'কুরআনের সংরক্ষক'** হিসেবে মুসলিম উম্মাহর কাছে সুপরিচিত। তৃতীয় খলিফা হযরত উসমান (রাঃ) যখন কুরআনের প্রামাণ্য কপি তৈরি করেন, তখন এই মূল কপিটিই ভিত্তি হিসেবে ব্যবহৃত হয়। তিনি রাসূল (সাঃ) এবং তাঁর পিতা উমর (রাঃ)-এর নিকট থেকে **৬০টিরও অধিক হাদীস** বর্ণনা করেছেন।",
      "**ইন্তেকাল:** উম্মুল মুমিনীন হাফসা বিনতে উমর (রাঃ) হিজরি ৪৫ সনের শাবান মাসে (অক্টোবর/নভেম্বর ৬৬৫ খ্রিষ্টাব্দ) মদীনাতে ইন্তেকাল করেন। মৃত্যুকালে তাঁর বয়স হয়েছিল আনুমানিক **৬০ থেকে ৬৩ বছর**। তিনি মৃত্যুর পূর্বে তাঁর সমস্ত সম্পত্তি আল্লাহর সন্তুষ্টির জন্য **ওয়াকফ** করার উপদেশ দেন। তাঁকে মদীনার **জান্নাতুল বাকী** কবরস্থানে দাফন করা হয়। তাঁর ইন্তেকালের পর, মারওয়ান ইবনে আল-হাকাম তাঁর কাছে রক্ষিত কুরআনের মূল পাণ্ডুলিপিটি নিয়ে পুড়িয়ে দেন, যাতে এটি ভবিষ্যতে মতভেদের কারণ না হয়। তিনি আজীবন তাঁর জ্ঞান, ইবাদত এবং কুরআনের সংরক্ষণের মাধ্যমে মুসলিম উম্মাহর জন্য এক উজ্জ্বল দৃষ্টান্ত স্থাপন করে গেছেন। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "khadija_bint_khuwaylid",
    "categoryId": "sahabider_jibon",
    "title": "খাদিজা বিনতে খুওয়াইলিদ (রাঃ)",
    "paragraphs": [
      "হযরত খাদিজা (রাঃ) বিনতে খুওয়াইলিদ (আরবি: خَدِيجَة بِنْت خُوَيْلِد; জন্ম: আনু. ৫৫৫ – মৃত্যু: ৬২০) ছিলেন ইসলামের নবী মুহাম্মাদ (সাঃ)-এর প্রথম স্ত্রী এবং প্রথম ইসলাম গ্রহণকারী ব্যক্তি। তিনি সাধারণত খাদিজা (রাঃ) বা খাদিজা (রাঃ)তুল কুবরা নামে পরিচিত।",
      "**বংশ ও উপাধি:** খাদিজা (রাঃ) হস্তীবর্ষের ১৫ বছর পূর্বে, আনুমানিক ৫৫৫ খ্রিস্টাব্দে মক্কার সম্ভ্রান্ত কুরাইশ বংশে জন্মগ্রহণ করেন। তাঁর পিতা খুওয়াইলিদ ইবনে আসাদ ছিলেন কুরাইশের নেতা ও বিখ্যাত বণিক। জাহেলিয়াতের যুগেই মানুষ তাঁকে 'তাহিরা' (পবিত্রা) ও 'আমিরাতু কুরাইশ' (কুরাইশের রাজকুমারী) উপাধিতে ডাকত। তিনি ছিলেন বুদ্ধিমতী, সৎ এবং চরিত্রবান।",
      "**ব্যবসায়ী জীবন:** খাদিজা (রাঃ) ছিলেন মক্কার সবচেয়ে সফল ব্যবসায়ী মহিলা। তাঁর ব্যবসায়িক কাফেলা সিরিয়া, ইয়েমেন, বাহরাইন পর্যন্ত যেত। ইবনে সা'দ বলেছেন: কুরাইশদের সকল বাণিজ্য কাফেলা একত্রিত করলে যা হতো, খাদিজা (রাঃ)র একার কাফেলা তার সমান ছিল! মক্কার অনেক সম্ভ্রান্ত পুরুষ তাঁকে বিয়ের প্রস্তাব দিয়েছিল, তিনি সবাইকে প্রত্যাখ্যান করেছিলেন।",
      "**আল-আমিনের সাথে পরিচয়:** একদিন খাদিজা (রাঃ) মুহাম্মাদ ইবনে আবদুল্লাহ সম্পর্কে শুনলেন, যিনি 'আল-আমিন' (বিশ্বস্ত) নামে পরিচিত। তিনি মুহাম্মাদকে তাঁর ব্যবসায়ের দায়িত্ব দিয়ে সিরিয়ায় পাঠালেন। সাথে দিলেন তাঁর বিশ্বস্ত দাস মাইসারাকে। ব্যবসায়ে অভূতপূর্ব লাভ হলো, দ্বিগুণেরও বেশি!",
      "সিরিয়া থেকে ফিরে এসে মাইসারা খাদিজা (রাঃ)কে বলল: 'হে আমার মনিব! আমি এমন সৎ, বিশ্বস্ত ও বরকতময় মানুষ কখনো দেখিনি! পথে এক পাদ্রী আমাকে বলেছেন, এই গাছের নিচে নবী ছাড়া কেউ বসে না। আর আমি নিজ চোখে দেখেছি, আকাশে দুটি ফেরেশতা তাঁকে ছায়া দিচ্ছিল!'",
      "**বিবাহ:** খাদিজা (রাঃ) মুগ্ধ হলেন। তিনি তাঁর বান্ধবী নাফিসা বিনতে মানিয়্যাকে ডেকে বললেন: 'তুমি মুহাম্মাদের কাছে গিয়ে আমার পক্ষ থেকে বিয়ের প্রস্তাব দাও।' নাফিসা গেলেন এবং মুহাম্মাদ (সাঃ) সম্মতি দিলেন। ৫৯৫ খ্রিস্টাব্দে বিয়ে হলো। খাদিজা (রাঃ)র বয়স তখন চল্লিশ, মুহাম্মাদের পঁচিশ। চাচা আবু তালিব খুতবা পড়লেন এবং মোহরানা ধার্য হলো ৫০০ স্বর্ণমুদ্রা। এই বিয়ে ২৫ বছর স্থায়ী হয়েছিল এবং খাদিজা (রাঃ)র জীবদ্দশায় রাসূল (সাঃ) অন্য কোনো বিয়ে করেননি।",
      "**সন্তান:** রাসূল (সাঃ) এর ঘরে খাদিজা (রাঃ)র ছয় সন্তান জন্মগ্রহণ করে। প্রথম সন্তান কাসিম, যার নামে রাসূলের কুনিয়াত 'আবুল কাসিম'। কাসিম শৈশবেই মারা যান। এরপর চার কন্যা, যয়নাব, রুকাইয়া, উম্মে কুলসুম ও ফাতিমা (রাঃ)। সবশেষে আবদুল্লাহ, যাকে 'তাইয়্যেব' ও 'তাহির' উপাধি দেওয়া হয়েছিল। আবদুল্লাহও শৈশবে মারা যান। দুই পুত্রের মৃত্যুতে খাদিজা (রাঃ) ধৈর্য ধরেছিলেন এবং রাসূল (সাঃ) কে সান্ত্বনা দিয়েছিলেন।",
      "**প্রথম ঈমান, হেরা গুহার ঘটনা:** ৬১০ সাল, রমজান মাস। রাসূল (সাঃ) হেরা গুহায় ধ্যানমগ্ন ছিলেন। হঠাৎ ফেরেশতা জিবরাঈল (আঃ) এসে তাঁকে জড়িয়ে ধরে বললেন: 'পড়ুন!'। রাসূল (সাঃ) বললেন: 'আমি পড়তে জানি না'। তিনবার এভাবে হলো। তারপর জিবরাঈল (আঃ) কুরআনের প্রথম আয়াত শোনালেন:",
      "اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ",
      "অর্থাৎ, পড়ুন আপনার রবের নামে, যিনি সৃষ্টি করেছেন। [সূরা আলাক: ১]",
      "রাসূল (সাঃ) ভয়ে কাঁপতে কাঁপতে ঘরে ফিরলেন এবং খাদিজা (রাঃ)কে বললেন: 'যাম্মিলুনি! যাম্মিলুনি!' (আমাকে আবৃত করো! আমাকে আবৃত করো!)। খাদিজা (রাঃ) তাঁকে কম্বল দিয়ে ঢেকে দিলেন। ভয় কমে গেলে রাসূল (সাঃ) পুরো ঘটনা বললেন এবং বললেন: 'আমি আমার জীবনের আশঙ্কা করছি।'",
      "খাদিজা (রাঃ) এক মুহূর্তও দ্বিধা করলেন না। তিনি দৃঢ়তার সাথে বললেন: 'كَلَّا وَاللَّهِ لَا يُخْزِيكَ اللَّهُ أَبَدًا (কখনো না! আল্লাহর কসম, আল্লাহ আপনাকে কখনো লাঞ্ছিত করবেন না!)'। তারপর তিনি রাসূলের গুণাবলী গুনে বললেন: 'إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَصْدُقُ الْحَدِيثَ، وَتَحْمِلُ الْكَلَّ، وَتَكْسِبُ الْمَعْدُومَ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ (আপনি আত্মীয়তার বন্ধন রক্ষা করেন, সত্য কথা বলেন, দরিদ্রদের বোঝা বহন করেন, নিঃস্বদের সাহায্য করেন, মেহমানদারি করেন এবং বিপদগ্রস্তদের সাহায্য করেন।' [সহীহ বুখারী]",
      "তারপর খাদিজা (রাঃ) রাসূলকে নিয়ে গেলেন তাঁর চাচাতো ভাই ওয়ারাকা ইবনে নওফলের কাছে, যিনি ছিলেন খ্রিস্টান পণ্ডিত। ওয়ারাকা সব শুনে বললেন: 'এ তো সেই নামুস (জিবরাঈল) যিনি মূসা (আঃ) এর কাছে এসেছিলেন! হায়! আমি যদি সেদিন জীবিত থাকতাম যেদিন তোমার কওম তোমাকে বের করে দেবে!' এভাবে খাদিজা (রাঃ) হলেন প্রথম মুসলিম, নারী-পুরুষ নির্বিশেষে সর্বপ্রথম যিনি ইসলাম গ্রহণ করেন।",
      "**ইসলাম প্রচারে অবদান:** খাদিজা (রাঃ) তাঁর সমস্ত সম্পদ, সময় ও জীবন ইসলামের জন্য উৎসর্গ করেছিলেন। তিনি তাঁর বিশাল ব্যবসায়িক সম্পদ রাসূল (সাঃ) এর হাতে তুলে দিলেন। রাসূল (সাঃ) বলতেন: 'খাদিজা (রাঃ)র সম্পদ আমার সবচেয়ে বেশি উপকারে এসেছে।' সেই সম্পদ দিয়ে রাসূল (সাঃ) দরিদ্র মুসলিমদের সাহায্য করতেন, ক্রীতদাস মুক্ত করতেন। যখন কুরাইশরা মুসলিমদের নির্যাতন করত, খাদিজা (রাঃ) তাঁর প্রভাব খাটিয়ে তাদের রক্ষা করতেন।",
      "**শিয়াবে আবু তালিব, তিন বছরের অবরোধ:** নবুয়তের সপ্তম বছর (৬১৬ সাল)। কুরাইশরা মুসলিমদের সম্পূর্ণ বয়কট করল। বনু হাশিম ও বনু মুত্তালিব গোত্রের সবাইকে 'শিয়াবে আবু তালিব' নামক উপত্যকায় বন্দী করা হলো। খাদিজা (রাঃ)ও সেখানে ছিলেন, তখন তাঁর বয়স ৬০ এর কাছাকাছি। তিন বছর ধরে চলল এই অবরোধ। খাবারের চরম অভাব, পানির সংকট, রোগ-ব্যাধি, সব কিছু সহ্য করতে হলো। কখনো গাছের পাতা খেয়ে দিন কাটাতে হয়েছে। কখনো চামড়া সিদ্ধ করে খেতে হয়েছে। শিশুদের কান্নার শব্দ মক্কা পর্যন্ত পৌঁছাত। কিন্তু খাদিজা (রাঃ) কখনো অভিযোগ করেননি। তিনি ধৈর্য ধরেছিলেন এবং রাসূল (সাঃ) কে সান্ত্বনা দিতেন।",
      "**মৃত্যু:** তিন বছরের অবরোধের কষ্ট খাদিজা (রাঃ)র শরীরে প্রভাব ফেলেছিল। তিনি অসুস্থ হয়ে পড়লেন। নবুয়তের দশম বছর, রমজান মাস (৬২০ সাল)। ৬৫ বছর বয়সে খাদিজা (রাঃ) মক্কায় ইন্তেকাল করেন। তখনও জানাযার বিধান নাজিল হয়নি। রাসূল (সাঃ) নিজেই তাঁর লাশ গোসল দিলেন এবং কবরে নামালেন। তাঁকে জান্নাতুল মুয়াল্লায় দাফন করা হলো।",
      "**আমুল হুযন, দুঃখের বছর:** রাসূল (সাঃ) এত শোকাহত হলেন যে এই বছরকে 'আমুল হুযন' (দুঃখের বছর) বলা হয়। কারণ এই বছরেই চাচা আবু তালিবও মারা যান। রাসূল (সাঃ) বলেছিলেন: 'আমি কখনো খাদিজা (রাঃ)র চেয়ে উত্তম স্ত্রী পাইনি। যখন সবাই আমাকে মিথ্যাবাদী বলেছিল, তখন সে আমাকে সত্য বলে মেনে নিয়েছে। যখন সবাই আমাকে অবিশ্বাস করেছিল, তখন সে আমাকে বিশ্বাস করেছে। যখন কেউ আমার সাহায্যে এগিয়ে আসেনি, তখন সে তার সম্পদ দিয়ে আমাকে সাহায্য করেছে। আল্লাহ তাঁর মাধ্যমে আমাকে সন্তান দান করেছেন।'",
      "**চিরস্থায়ী ভালোবাসা:** খাদিজা (রাঃ)র মৃত্যুর পরও রাসূল (সাঃ) তাঁকে কখনো ভুলতে পারেননি। বাড়িতে ভালো খাবার রান্না হলে তিনি খাদিজা (রাঃ)র বান্ধবীদের কাছে পাঠাতেন। আয়েশা (রাঃ) বলেন: 'আমি খাদিজা (রাঃ)কে দেখিনি, তবুও তাঁর প্রতি আমার ঈর্ষা হতো। কারণ রাসূল (সাঃ) সবসময় তাঁর কথা স্মরণ করতেন।' একবার আয়েশা (রাঃ) বললেন: 'আল্লাহ আপনাকে তাঁর চেয়ে উত্তম স্ত্রী দিয়েছেন।' রাসূল (সাঃ) রাগান্বিত হয়ে বললেন: 'কখনো না! আল্লাহর কসম, আল্লাহ আমাকে তাঁর চেয়ে উত্তম কাউকে দেননি।' [সহীহ বুখারী]",
      "**মর্যাদা:** রাসূল (সাঃ) বলেছেন: 'পৃথিবীর সর্বশ্রেষ্ঠ চার নারী হলেন: মরিয়ম বিনতে ইমরান, আসিয়া বিনতে মুযাহিম (ফেরাউনের স্ত্রী), খাদিজা (রাঃ) বিনতে খুওয়াইলিদ এবং ফাতিমা বিনতে মুহাম্মাদ।' [সহীহ বুখারী]। একবার জিবরাঈল (আঃ) এসে বললেন: 'হে আল্লাহর রাসূল! খাদিজা (রাঃ) আসছেন। তাঁর হাতে খাবারের পাত্র আছে। তাঁকে আল্লাহর সালাম জানাবেন এবং জান্নাতে মণি-মুক্তার তৈরি একটি প্রাসাদের সুসংবাদ দিবেন, যেখানে কোনো শোরগোল নেই, কোনো কষ্ট নেই।' [সহীহ বুখারী]। খাদিজা (রাঃ) ছিলেন উম্মুল মুমিনীন, প্রথম মুসলিম, ইসলামের প্রথম দাঈ এবং জান্নাতের নারীদের সর্দার।"
    ]
  },
  {
    "id": "safiya_bint_abdul_muttalib",
    "categoryId": "sahabider_jibon",
    "title": "সাফিয়্যা বিনতে আব্দুল মুত্তালিব (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। নাম সাফিয়্যা বিনতে আব্দুল মুত্তালিব। রাসূলের ফুফু। হামযার বোন। আব্বাসের বোন। সম্ভ্রান্ত পরিবার। হারিস ইবনে হারবের সাথে বিয়ে হয়েছিল। পুত্র যুবাইর ইবনুল আওয়াম। প্রথম দিকে ইসলাম গ্রহণ করেন। ভাতিজা মুহাম্মাদ নবী হয়েছেন শুনে খুশি হলেন। সাথে সাথে ঈমান আনলেন। মক্কায় নির্যাতন সহ্য করেন। মদীনায় হিজরত করেন।",
      "**উহুদের শোক ও খন্দকের বীরত্ব:** উহুদের যুদ্ধ। ভাই হামযা শহীদ হলেন। লাশ দেখতে চাইলেন। রাসূল বারণ করলেন। কারণ লাশ বিকৃত করা হয়েছিল। সাফিয়্যা ধৈর্য ধরলেন। কাঁদলেন কিন্তু সবর করলেন। খন্দকের যুদ্ধ। নারী ও শিশুরা দুর্গে ছিল। হাসসান ইবনে সাবিত পাহারায়। একজন ইহুদি গুপ্তচর এল। হাসসান ভয় পেলেন। সাফিয়্যা তাঁবুর খুঁটি তুলে নিলেন। গুপ্তচরকে মেরে ফেললেন! মাথা কেটে দুর্গের বাইরে ফেলে দিলেন। ইহুদিরা ভয় পেয়ে গেল। সাহসী নারী! পুত্র যুবাইর - আশারায়ে মুবাশশারার একজন। জান্নাতের সুসংবাদপ্রাপ্ত। সাফিয়্যা তাকে ইসলামী শিক্ষা দিয়েছেন। বীর যোদ্ধা বানিয়েছেন। বিশ হিজরি, ছয়শত একচল্লিশ সাল। মদীনায় মৃত্যু। বয়স সত্তর বছর। সাহসী সাহাবিয়া। রাসূলের ফুফু। জান্নাতের বাসিন্দা। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "safiyya_bint_huyayy",
    "categoryId": "sahabider_jibon",
    "title": "সাফিয়্যা বিনতে হুয়াই (রাঃ)",
    "paragraphs": [
      "হযরত সাফিয়্যা বিনতে হুয়াই (আরবি: صَفِيَّة بِنْت حُيَيّ; জন্ম: ৬১০ – মৃত্যু: ৬৭০) ছিলেন উম্মুল মুমিনীন এবং রাসূলুল্লাহ (সাঃ)-এর স্ত্রী। তিনি ছিলেন ইহুদি বংশোদ্ভূত একজন মহান মুসলিম মহিলা যিনি তাঁর জ্ঞান, ধৈর্য এবং চরিত্রের জন্য বিখ্যাত ছিলেন।",
      "**বংশ ও প্রাথমিক জীবন:** সাফিয়্যা (রাঃ) বনু নাদির গোত্রের সম্ভ্রান্ত ইহুদি পরিবারে জন্মগ্রহণ করেন। তাঁর পিতা হুয়াই ইবনে আখতাব ছিলেন বনু নাদিরের নেতা এবং মা বাররা বিনতে সামুয়াল ছিলেন বনু কুরাইযার বংশধর। তিনি ছিলেন অত্যন্ত সুন্দরী এবং বুদ্ধিমতী। প্রথমে তাঁর বিয়ে হয় সাল্লাম ইবনে মিশকামের সাথে এবং পরে কিনানা ইবনে আবিল হুকাইকের সাথে।",
      "**স্বপ্ন:** সাফিয়্যা (রাঃ) বলেন: 'আমি আমার পিতার সবচেয়ে প্রিয় সন্তান ছিলাম। কিন্তু রাসূলুল্লাহ (সাঃ) মদীনায় আসার পর আমার পিতা ও চাচা তাঁর কাছে গেলেন এবং ফিরে এসে আমার দিকে তাকালেন না। আমি তাদের কথা শুনলাম। চাচা বললেন: তিনিই কি সেই ব্যক্তি? পিতা বললেন: হ্যাঁ, আল্লাহর কসম! চাচা বললেন: তুমি তাঁকে চিনতে পেরেছ? পিতা বললেন: হ্যাঁ। চাচা বললেন: তাহলে তোমার মনোভাব কী? পিতা বললেন: আল্লাহর কসম! যতদিন বেঁচে থাকব তাঁর শত্রুতা করব।'",
      "সাফিয়্যা (রাঃ) আরও বলেন: 'একদিন আমি স্বপ্ন দেখলাম যে, চাঁদ আকাশ থেকে নেমে এসে আমার কোলে পড়ল। আমি আমার স্বামী কিনানাকে স্বপ্নটি বললাম। সে রেগে গিয়ে আমার মুখে এমন জোরে চড় মারল যে আমার চোখে কালশিটে পড়ে গেল। সে বলল: তুমি কি ইয়াসরিবের (মদীনার) রাজাকে বিয়ে করতে চাও? আমি তখন বুঝতে পারিনি যে এই স্বপ্নের অর্থ কী।'",
      "**খায়বারের যুদ্ধ:** ৭ হিজরিতে (৬২৮ খ্রিস্টাব্দ) খায়বারের যুদ্ধে মুসলিমরা বিজয়ী হন। সাফিয়্যা (রাঃ)-এর স্বামী কিনানা যুদ্ধে নিহত হয় এবং তিনি যুদ্ধবন্দী হন। দিহইয়া কালবি (রাঃ) রাসূল (সাঃ)-এর কাছে এসে একজন দাসী চাইলেন। রাসূল (সাঃ) বললেন: 'যাও, একজন দাসী নিয়ে নাও।' দিহইয়া সাফিয়্যা (রাঃ)-কে নিয়ে আসলেন।",
      "একজন সাহাবী রাসূল (সাঃ)-কে বললেন: 'হে আল্লাহর রাসূল! বনু নাদির ও বনু কুরাইযার নেতার কন্যা দিহইয়ার জন্য উপযুক্ত নয়। তিনি শুধু আপনার জন্যই উপযুক্ত।' রাসূল (সাঃ) বললেন: 'তাকে ডেকে আনো।' দিহইয়া তাঁকে নিয়ে এলেন। রাসূল (সাঃ) সাফিয়্যা (রাঃ)-কে দেখে বললেন: 'তুমি নিজের জন্য অন্য একজন দাসী নিয়ে নাও।'",
      "**ইসলাম গ্রহণ ও বিবাহ:** রাসূল (সাঃ) সাফিয়্যা (রাঃ)-কে বললেন: 'আমি তোমাকে দুটি পথের একটি বেছে নেওয়ার সুযোগ দিচ্ছি: হয় তুমি ইসলাম গ্রহণ করো এবং আমি তোমাকে বিয়ে করব, অথবা তুমি তোমার ধর্মে থাকো এবং আমি তোমাকে মুক্ত করে তোমার পরিবারের কাছে পাঠিয়ে দেব।' সাফিয়্যা (রাঃ) বললেন: 'হে আল্লাহর রাসূল! আমি আপনাকে দেখার আগেই ইসলাম ও আপনার প্রতি আকৃষ্ট হয়েছিলাম। আমার ইহুদি ধর্মে কোনো আগ্রহ নেই এবং আমার কোনো পিতা বা ভাই নেই। আপনি আমাকে কুফর ও ইসলামের মধ্যে বেছে নেওয়ার সুযোগ দিয়েছেন। আল্লাহ ও তাঁর রাসূল আমার কাছে অন্য সব কিছুর চেয়ে প্রিয়।'",
      "এভাবে সাফিয়্যা (রাঃ) ইসলাম গ্রহণ করেন এবং রাসূল (সাঃ) তাঁকে মুক্ত করে বিয়ে করেন। তাঁর মুক্তিই ছিল তাঁর মোহরানা। বিয়ের ওলিমায় রাসূল (সাঃ) খেজুর ও ছাতু (যবের আটা) দিয়ে খাবার পরিবেশন করেন। [সহীহ বুখারী]",
      "**অন্যদের কটূক্তি ও রাসূলের সান্ত্বনা:** সাফিয়্যা (রাঃ) ইহুদি বংশোদ্ভূত হওয়ায় কখনো কখনো অন্য স্ত্রীরা তাঁকে কটূক্তি করতেন। একবার তিনি কাঁদতে কাঁদতে রাসূল (সাঃ)-এর কাছে এলেন। রাসূল (সাঃ) জিজ্ঞেস করলেন: 'কী হয়েছে?' সাফিয়্যা (রাঃ) বললেন: 'হাফসা আমাকে বলেছে যে আমি ইহুদির মেয়ে।'",
      "রাসূল (সাঃ) বললেন: 'তুমি তো নবীর কন্যা (হারুন আঃ-এর বংশধর), তোমার চাচা নবী (মূসা আঃ) এবং তোমার স্বামী নবী (আমি)। তাহলে সে তোমার চেয়ে কীভাবে শ্রেষ্ঠ হতে পারে?' তারপর তিনি হাফসা (রাঃ)-কে বললেন: 'হে হাফসা! আল্লাহকে ভয় করো।' [তিরমিযী]",
      "**ধৈর্য ও সহনশীলতা:** সাফিয়্যা (রাঃ) ছিলেন অত্যন্ত ধৈর্যশীল এবং সহনশীল। তিনি কখনো কারো কটূক্তির জবাব দিতেন না বরং ধৈর্য ধরতেন। তিনি রাসূল (সাঃ)-কে অত্যন্ত ভালোবাসতেন এবং তাঁর সেবায় নিজেকে নিয়োজিত রাখতেন।",
      "**রাসূলের অসুস্থতায় সেবা:** রাসূল (সাঃ)-এর শেষ অসুস্থতার সময় সাফিয়্যা (রাঃ) বললেন: 'হে আল্লাহর রাসূল! আমি চাই আপনার কষ্ট আমার উপর এসে পড়ুক।' অন্য স্ত্রীরা একে অপরের দিকে তাকিয়ে চোখ টিপলেন (যেন বলছেন তিনি মিথ্যা বলছেন)। রাসূল (সাঃ) তা দেখে বললেন: 'তোমরা কুলি করো।' তাঁরা বললেন: 'কেন?' রাসূল (সাঃ) বললেন: 'তোমরা সাফিয়্যার প্রতি যে ইশারা করলে তার জন্য। আল্লাহর কসম! সে সত্য বলেছে।' [মুসনাদে আহমাদ]",
      "**দানশীলতা:** সাফিয়্যা (রাঃ) অত্যন্ত দানশীল ছিলেন। তিনি তাঁর সম্পদ দরিদ্রদের মধ্যে বিতরণ করতেন এবং আত্মীয়দের সাহায্য করতেন। তিনি তাঁর ভাইয়ের সন্তানদের লালন-পালন করেছিলেন এবং তাদের জন্য ব্যয় করেছিলেন।",
      "**ইন্তেকাল:** ৬৭০ খ্রিস্টাব্দে (৫০ হিজরি) মদীনায় খলিফা মুআবিয়া (রাঃ)-এর শাসনামলে প্রায় ৬০ বছর বয়সে তিনি ইন্তেকাল করেন। তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। তিনি তাঁর সম্পত্তির এক-তৃতীয়াংশ তাঁর ভাইয়ের সন্তানদের জন্য এবং বাকি অংশ দাতব্য কাজের জন্য ওসিয়ত করে যান। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "সাফিয়্যা (রাঃ)-এর জীবন প্রমাণ করে যে, ইসলাম সকল বংশ ও জাতির ঊর্ধ্বে। প্রকৃত মর্যাদা আল্লাহভীতি ও সৎকর্মে নিহিত।",
    "source": "সহীহ বুখারী; তিরমিযী; মুসনাদে আহমাদ; ইবনে সা'দ"
  },
  {
    "id": "umm_salama",
    "categoryId": "sahabider_jibon",
    "title": "উম্মে সালামা (রাঃ)",
    "paragraphs": [
      "হযরত উম্মে সালামা (আরবি: أُمّ سَلَمَة; পূর্ণ নাম: হিন্দ বিনতে আবি উমাইয়া; মৃত্যু: ৬৮১) ছিলেন উম্মুল মুমিনীন এবং রাসূলুল্লাহ (সাঃ)-এর অন্যতম জ্ঞানী ও বুদ্ধিমতী স্ত্রী। তিনি ছিলেন অত্যন্ত ধৈর্যশীল এবং দূরদর্শী মহিলা।",
      "**বংশ ও প্রাথমিক জীবন:** উম্মে সালামা (রাঃ) মক্কার সম্ভ্রান্ত কুরাইশ বংশে জন্মগ্রহণ করেন। তাঁর পিতা আবু উমাইয়া ইবনে মুগীরা ছিলেন মক্কার অন্যতম ধনী ও প্রভাবশালী ব্যক্তি। তাঁর প্রকৃত নাম ছিল হিন্দ, কিন্তু তাঁর পুত্র সালামার নামে তিনি 'উম্মে সালামা' নামে পরিচিত হন।",
      "**প্রথম স্বামী আবু সালামা:** ইসলামের প্রথম দিকে উম্মে সালামা (রাঃ) আবু সালামা (রাঃ)-কে বিয়ে করেন। তাঁরা উভয়েই প্রথম দিকে ইসলাম গ্রহণ করেছিলেন এবং কুরাইশদের নির্যাতনের শিকার হয়েছিলেন। তাঁরা হাবশায় (আবিসিনিয়া) হিজরত করেন এবং সেখানে তাঁদের পুত্র সালামার জন্ম হয়।",
      "**মদীনায় হিজরত, বিচ্ছেদের কষ্ট:** মক্কা থেকে মদীনায় হিজরতের সময় উম্মে সালামা (রাঃ)-এর পরিবার এক মর্মান্তিক ঘটনার সম্মুখীন হয়। তিনি বলেন: 'যখন আবু সালামা মদীনায় হিজরতের সিদ্ধান্ত নিলেন, তখন তিনি আমাকে এবং আমার ছেলে সালামাকে উটে তুলে নিলেন। কিন্তু আমার গোত্রের লোকেরা এসে বলল: তুমি যেতে পারো, কিন্তু আমাদের মেয়েকে নিয়ে যেতে পারবে না!'",
      "তাঁরা জোর করে উম্মে সালামা (রাঃ)-কে উট থেকে নামিয়ে দিল। এরপর আবু সালামার গোত্র এসে বলল: 'আমাদের ছেলেকেও তোমরা রাখতে পারবে না!' তাঁরা শিশু সালামাকে টেনে নিয়ে গেল। এভাবে স্বামী মদীনায়, স্ত্রী মক্কায় এবং সন্তান অন্য জায়গায়, তিনজন তিন জায়গায় বিচ্ছিন্ন হয়ে গেল। উম্মে সালামা (রাঃ) বলেন: 'আমি প্রতিদিন মক্কার বাইরে গিয়ে কাঁদতাম এবং আল্লাহর কাছে দোয়া করতাম।' এক বছর পর আল্লাহর রহমতে তাঁদের পুনর্মিলন হয় এবং তাঁরা মদীনায় হিজরত করেন।",
      "**আবু সালামার শাহাদাত:** উহুদের যুদ্ধে আবু সালামা (রাঃ) আহত হন। কিছুদিন পর তাঁর ক্ষত সেরে যায়। কিন্তু পরবর্তীতে বনু আসাদ অভিযানে তাঁর পুরনো ক্ষত আবার খুলে যায় এবং তিনি শহীদ হন। মৃত্যুর আগে তিনি উম্মে সালামা (রাঃ)-কে বললেন: 'আমি রাসূল (সাঃ)-কে বলতে শুনেছি: যখন কোনো মুসিবত আসে, তখন বলো: إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا (আমরা আল্লাহর জন্য এবং তাঁর কাছেই ফিরে যাব। হে আল্লাহ! আমাকে এই মুসিবতে সওয়াব দাও এবং এর চেয়ে উত্তম বিনিময় দাও)।'",
      "উম্মে সালামা (রাঃ) বলেন: 'আবু সালামা মারা গেলে আমি এই দোয়া পড়লাম। কিন্তু মনে মনে ভাবলাম: আবু সালামার চেয়ে উত্তম কে হতে পারে?' কিন্তু আল্লাহ তাঁকে রাসূলুল্লাহ (সাঃ)-এর সাথে বিয়ে দিয়ে এর উত্তর দিলেন। [সহীহ মুসলিম]",
      "**রাসূলের সাথে বিবাহ:** আবু সালামার মৃত্যুর পর আবু বকর ও উমর (রাঃ) উম্মে সালামা (রাঃ)-কে বিয়ের প্রস্তাব দেন, কিন্তু তিনি প্রত্যাখ্যান করেন। এরপর রাসূলুল্লাহ (সাঃ) নিজে প্রস্তাব পাঠান। উম্মে সালামা (রাঃ) বললেন: 'হে আল্লাহর রাসূল! আমার তিনটি সমস্যা আছে: আমি অত্যন্ত ঈর্ষাপরায়ণ, আমার অনেক সন্তান আছে এবং আমি বয়স্কা।' রাসূল (সাঃ) বললেন: 'ঈর্ষার ব্যাপারে আমি আল্লাহর কাছে দোয়া করব। সন্তানদের দায়িত্ব আল্লাহ ও তাঁর রাসূলের। আর বয়সের ব্যাপারে, আমিও তো বয়স্ক।' এভাবে ৪ হিজরিতে তাঁদের বিয়ে হয়।",
      "**জ্ঞান ও বুদ্ধিমত্তা:** উম্মে সালামা (রাঃ) ছিলেন অত্যন্ত জ্ঞানী এবং বুদ্ধিমতী। তিনি ৩৭৮টি হাদিস বর্ণনা করেছেন। মহিলারা তাঁর কাছে ইসলামী বিধান জিজ্ঞাসা করতে আসত। হুদায়বিয়ার সন্ধির সময় তাঁর পরামর্শ ইসলামের ইতিহাসে অত্যন্ত গুরুত্বপূর্ণ ছিল।",
      "**হুদায়বিয়ার সন্ধি, বুদ্ধিমত্তার পরামর্শ:** হুদায়বিয়ার সন্ধির পর রাসূল (সাঃ) সাহাবীদের বললেন: 'তোমরা কুরবানি করো এবং মাথা মুণ্ডন করো।' কিন্তু সাহাবীরা সন্ধির শর্তে মর্মাহত হয়ে কেউ উঠলেন না। রাসূল (সাঃ) তিনবার বললেন, কিন্তু কেউ সাড়া দিলেন না। রাসূল (সাঃ) দুঃখিত হয়ে উম্মে সালামা (রাঃ)-এর তাঁবুতে গেলেন এবং ঘটনা বললেন।",
      "উম্মে সালামা (রাঃ) বললেন: 'হে আল্লাহর রাসূল! আপনি তাদের সাথে কথা না বলে নিজেই বাইরে গিয়ে কুরবানি করুন এবং মাথা মুণ্ডন করুন। তাহলে তারা আপনাকে দেখে নিজেরাই করবে।' রাসূল (সাঃ) এই পরামর্শ মেনে নিলেন এবং বাইরে গিয়ে কুরবানি করলেন ও মাথা মুণ্ডন করলেন। সাহাবীরা তাঁকে দেখে সাথে সাথে কুরবানি ও মাথা মুণ্ডন করতে শুরু করলেন। এভাবে উম্মে সালামা (রাঃ)-এর বুদ্ধিমত্তা একটি বড় সমস্যার সমাধান করল। [সহীহ বুখারী]",
      "**ধৈর্য ও সবর:** উম্মে সালামা (রাঃ) ছিলেন অত্যন্ত ধৈর্যশীল। স্বামী-সন্তান বিচ্ছেদ, স্বামীর মৃত্যু, সব কিছুতে তিনি ধৈর্য ধরেছিলেন এবং আল্লাহর উপর ভরসা রেখেছিলেন। তাঁর জীবন ধৈর্য ও সবরের এক উজ্জ্বল দৃষ্টান্ত।",
      "**ইন্তেকাল:** ৬৮১ খ্রিস্টাব্দে (৬১ হিজরি) মদীনায় প্রায় ৮৪ বছর বয়সে তিনি ইন্তেকাল করেন। তিনি ছিলেন রাসূল (সাঃ)-এর স্ত্রীদের মধ্যে সর্বশেষ ইন্তেকালকারী। তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "উম্মে সালামা (রাঃ)-এর জীবন প্রমাণ করে যে ধৈর্য, বুদ্ধিমত্তা এবং আল্লাহর উপর ভরসা যেকোনো কঠিন পরিস্থিতি থেকে মুক্তি দেয়। তাঁর হিজরতের কষ্ট এবং হুদাইবিয়ার পরামর্শ মুসলিম নারীদের জন্য অনুকরণীয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; সীরাতে ইবনে হিশাম; তাবাকাতে ইবনে সাদ।"
  },
  {
    "id": "hassan_ibn_thabit",
    "categoryId": "sahabider_jibon",
    "title": "হাসসান ইবনে সাবিত (রাঃ)",
    "paragraphs": [
      "হযরত হাসসান ইবনে সাবিত (আরবি: حَسَّان بْن ثَابِت; জন্ম: ৫৬৩ – মৃত্যু: ৬৭৪) ছিলেন রাসূলুল্লাহ (সাঃ)-এর বিশেষ কবি এবং ইসলামের প্রচারক। তিনি 'শায়িরুর রাসূল' (রাসূলের কবি) উপাধিতে ভূষিত ছিলেন।",
      "**বংশ ও প্রাথমিক জীবন:** হাসসান (রাঃ) ৫৬৩ খ্রিস্টাব্দে মদীনায় বনু খাযরাজ গোত্রে জন্মগ্রহণ করেন। ইসলামের আগমনের পূর্বে তিনি ছিলেন আরবের অন্যতম শ্রেষ্ঠ কবি। তিনি গাসসানী ও হিমইয়ারী রাজাদের দরবারে তাঁর কবিতা আবৃত্তি করতেন এবং পুরস্কার পেতেন।",
      "**ইসলাম গ্রহণ:** রাসূলুল্লাহ (সাঃ) মদীনায় হিজরত করার পর হাসসান (রাঃ) ইসলাম গ্রহণ করেন। তিনি তখন প্রায় ৬০ বছর বয়সী ছিলেন। ইসলাম গ্রহণের পর তিনি তাঁর কবিতার প্রতিভা ইসলামের সেবায় নিয়োজিত করেন এবং কাফিরদের বিরুদ্ধে কবিতার মাধ্যমে প্রতিরোধ গড়ে তোলেন।",
      "**রাসূলের কবি:** রাসূলুল্লাহ (সাঃ) হাসসানকে 'শায়িরুর রাসূল' উপাধি দেন। মক্কার কাফিররা যখন রাসূল (সাঃ) ও ইসলামের বিরুদ্ধে কুৎসা রটাত, হাসসান তখন তাদের জবাব দিতেন কবিতার মাধ্যমে। রাসূলুল্লাহ (সাঃ) তাঁকে বললেন: 'يَا حَسَّانُ، اهْجُهُمْ وَجِبْرِيلُ مَعَكَ (হে হাসসান! তুমি তাদের কবিতায় আক্রমণ করো। জিবরীল তোমার সাথে আছে)।' [সহীহ বুখারী]",
      "**মসজিদে নববীতে মিম্বর:** রাসূলুল্লাহ (সাঃ) মসজিদে নববীতে হাসসানের জন্য একটি বিশেষ মিম্বর স্থাপন করেছিলেন যেখানে দাঁড়িয়ে তিনি ইসলামের পক্ষে এবং কাফিরদের বিরুদ্ধে কবিতা আবৃত্তি করতেন। রাসূল (সাঃ) বলতেন: 'إِنَّ رُوحَ الْقُدُسِ لَا يَزَالُ يُؤَيِّدُكَ (রূহুল কুদুস সর্বদা তোমাকে সাহায্য করবে)।' [সহীহ মুসলিম]",
      "রাসূল (সাঃ) আরও বলতেন: 'لَسَانُ حَسَّانَ أَشَدُّ عَلَى الْكُفَّارِ مِنْ وَقْعِ السِّهَامِ (হাসসানের জিহ্বা কাফিরদের উপর তীরের আঘাতের চেয়ে বেশি কার্যকর)।'",
      "**ইফকের ঘটনা ও তওবা:** দুর্ভাগ্যবশত, হাসসান (রাঃ) ইফকের ঘটনায় মুনাফিকদের প্ররোচনায় পড়ে অংশ নিয়েছিলেন। যখন কুরআনে আয়াত নাজিল হয়ে আয়েশা (রাঃ)-এর নির্দোষিতা প্রমাণিত হলো, তখন হাসসান (রাঃ) গভীরভাবে অনুতপ্ত হন এবং আন্তরিকভাবে তওবা করেন। তিনি আয়েশা (রাঃ)-এর কাছে ক্ষমা চান এবং তাঁর প্রশংসায় অনেক কবিতা রচনা করেন। আয়েশা (রাঃ) তাঁকে ক্ষমা করে দেন।",
      "**কাব্য প্রতিভা:** হাসসানের কবিতা ছিল অত্যন্ত শক্তিশালী এবং প্রভাবশালী। তাঁর কবিতায় রাসূল (সাঃ)-এর প্রশংসা, ইসলামের মহিমা এবং কাফিরদের নিন্দা থাকত। তাঁর কবিতা আরবদের হৃদয়ে গভীর প্রভাব ফেলত এবং অনেকে তাঁর কবিতা শুনে ইসলাম গ্রহণ করেছিল।",
      "**দীর্ঘ জীবন:** হাসসান (রাঃ) অত্যন্ত দীর্ঘজীবী ছিলেন। তিনি প্রায় ১২০ বছর বেঁচে ছিলেন, ৬০ বছর জাহেলিয়াতে এবং ৬০ বছর ইসলামে। রাসূলুল্লাহ (সাঃ)-এর ওফাতের পর তিনি আবু বকর, উমর, উসমান এবং আলী (রাঃ)-এর খিলাফত দেখেছেন এবং ইসলামের সেবা অব্যাহত রেখেছেন।",
      "**ইন্তেকাল:** ৬৭৪ খ্রিস্টাব্দে (৫৪ হিজরি) মদীনায় ১২০ বছর বয়সে তিনি ইন্তেকাল করেন এবং জান্নাতুল বাকীতে দাফন করা হয়। তিনি ইসলামের ইতিহাসে 'শায়িরুল ইসলাম' হিসেবে চিরস্মরণীয় হয়ে আছেন। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হাসসান ইবনে সাবিত (রাঃ)-এর জীবন প্রমাণ করে যে প্রতিটি প্রতিভা ইসলামের সেবায় ব্যবহার করা যায়। তাঁর তওবা এবং ক্ষমা প্রার্থনা শেখায় যে ভুল হলে আন্তরিকভাবে তওবা করা উচিত।",
    "source": "সহীহ বুখারী (৬১৫৩); সহীহ মুসলিম; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "abdullah_ibn_abbas_extended",
    "categoryId": "sahabider_jibon",
    "title": "আবদুল্লাহ ইবনে আব্বাস (রাঃ)",
    "paragraphs": [
      "হযরত আবদুল্লাহ ইবনে আব্বাস (আরবি: عَبْدُ اللَّهِ بْنُ عَبَّاسٍ; জন্ম: ৬১৯ – মৃত্যু: ৬৮৭) ছিলেন রাসূলুল্লাহ (সাঃ)-এর চাচাতো ভাই এবং ইসলামের সর্বশ্রেষ্ঠ তাফসীরকারক। তিনি 'তুরজুমানুল কুরআন' (কুরআনের ব্যাখ্যাকারী) এবং 'হিবরুল উম্মাহ' (উম্মতের পণ্ডিত) উপাধিতে ভূষিত ছিলেন।",
      "**বংশ ও জন্ম:** আবদুল্লাহ ইবনে আব্বাস (রাঃ) হিজরতের তিন বছর আগে (৬১৯ খ্রিস্টাব্দ) মক্কায় জন্মগ্রহণ করেন। তাঁর পিতা আব্বাস ইবনে আবদুল মুত্তালিব ছিলেন রাসূলুল্লাহ (সাঃ)-এর চাচা এবং মা উম্মুল ফাদল লুবাবা ছিলেন প্রথম দিকের মুসলিম মহিলাদের একজন। তিনি শৈশব থেকেই রাসূল (সাঃ)-এর সান্নিধ্যে বড় হয়েছেন।",
      "**রাসূলের দোয়া:** একদিন রাসূল (সাঃ) ইবনে আব্বাস (রাঃ)-এর মাথায় হাত রেখে দোয়া করলেন: 'اللَّهُمَّ فَقِّهْهُ فِي الدِّينِ وَعَلِّمْهُ التَّأْوِيلَ (হে আল্লাহ! তাকে দ্বীনের জ্ঞান দান করো এবং তাকে তাবীল শেখাও)।' [সহীহ বুখারী]। এই দোয়ার বরকতে তিনি কুরআনের সর্বশ্রেষ্ঠ ব্যাখ্যাকারক হয়েছিলেন।",
      "ইবনে আব্বাস (রাঃ) বলেন: 'একবার আমি রাসূল (সাঃ)-এর পেছনে ছিলাম। তিনি আমাকে বললেন: يَا غُلَامُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ: احْفَظِ اللَّهَ يَحْفَظْكَ (হে যুবক! আমি তোমাকে কিছু কথা শেখাচ্ছি: আল্লাহকে রক্ষা করো, আল্লাহ তোমাকে রক্ষা করবেন)।' [তিরমিযী]",
      "**জ্ঞানের পিপাসা:** রাসূল (সাঃ)-এর ইন্তেকালের পর ইবনে আব্বাস (রাঃ) সাহাবীদের কাছ থেকে হাদিস সংগ্রহ করতেন। তিনি দুপুরের গরমে সাহাবীদের দরজায় অপেক্ষা করতেন এবং তাঁরা ঘুম থেকে উঠলে হাদিস জিজ্ঞাসা করতেন। একবার এক সাহাবী বললেন: 'হে রাসূলের চাচাতো ভাই! আপনি আমাকে ডাকলেন না কেন?' ইবনে আব্বাস (রাঃ) বললেন: 'জ্ঞান অর্জনকারীই জ্ঞানীর কাছে যায়।'",
      "**তাফসীরের ইমাম:** হযরত উমর (রাঃ) তাঁকে বয়োজ্যেষ্ঠ সাহাবীদের সাথে পরামর্শ সভায় ডাকতেন। একবার সূরা নাসরের তাফসীর জিজ্ঞেস করলে ইবনে আব্বাস (রাঃ) বললেন: 'এটি রাসূল (সাঃ)-এর মৃত্যুর সংকেত।' উমর (রাঃ) বললেন: 'ইবনে আব্বাস কুরআনের ব্যাপারে আমাদের সবার চেয়ে বেশি জ্ঞানী।'",
      "**আলী (রাঃ)-এর সাথে:** হযরত আলী (রাঃ)-এর খিলাফতকালে ইবনে আব্বাস (রাঃ) তাঁর প্রধান উপদেষ্টা এবং বসরার গভর্নর ছিলেন। তিনি আলী (রাঃ)-এর পক্ষে খারিজিদের সাথে বিতর্ক করেছিলেন। তাঁর যুক্তিতে প্রায় ৪,০০০ খারিজি ইসলামে ফিরে এসেছিল। আলী (রাঃ) বলতেন: 'ইবনে আব্বাস হলো সমুদ্রের মতো, যতই নাও ততই পাবে।'",
      "**শিক্ষাদান:** ইবনে আব্বাস (রাঃ) মক্কা ও তায়েফে নিয়মিত শিক্ষা দিতেন। তাঁর হাজার হাজার ছাত্র ছিল। তাঁর বিখ্যাত ছাত্রদের মধ্যে ছিলেন মুজাহিদ, ইকরিমা, সাঈদ ইবনে জুবাইর এবং আরও অনেকে। উরওয়া ইবনে যুবাইর বলেন: 'আমি কুরআন, ফারায়েজ, হালাল-হারাম, কবিতা এবং আরবের ইতিহাসে ইবনে আব্বাসের চেয়ে বেশি জ্ঞানী কাউকে দেখিনি।'",
      "**হাদিস বর্ণনা:** ইবনে আব্বাস (রাঃ) ১,৬৬০টি হাদিস বর্ণনা করেছেন। সহীহ বুখারী ও মুসলিমে তাঁর বর্ণিত অসংখ্য হাদিস রয়েছে। আবু মূসা আশআরী (রাঃ) বলেন: 'যখনই আমরা সাহাবীরা কোনো হাদিসে সন্দেহে পড়তাম, ইবনে আব্বাসের কাছে জিজ্ঞেস করলেই তার সমাধান পেতাম।'",
      "**অন্ধত্ব ও ধৈর্য:** জীবনের শেষ দিকে তিনি অন্ধ হয়ে যান। কিন্তু এতে তাঁর জ্ঞান চর্চা বন্ধ হয়নি। তিনি ধৈর্যের সাথে শিক্ষাদান অব্যাহত রাখেন এবং বলতেন: 'যদি আল্লাহ আমার চোখের আলো নিয়ে নেন, তবে তিনি আমার হৃদয়ের আলো রেখে দিয়েছেন।'",
      "**ইন্তেকাল:** ৬৮৭ খ্রিস্টাব্দে (৬৮ হিজরি) তায়েফে ৬৮ বছর বয়সে তিনি ইন্তেকাল করেন। তাঁর জানাজায় মুহাম্মাদ ইবনুল হানাফিয়া বলেছিলেন: 'আজ কুরআনের ব্যাখ্যাকারক চলে গেলেন। আজ উম্মতের পণ্ডিত চলে গেলেন।' তাঁকে তায়েফে দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "ইবনে আব্বাস (রাঃ)-এর জীবন প্রমাণ করে যে জ্ঞানের পিপাসা এবং নিরলস পরিশ্রম মানুষকে মহান করে তোলে। তাঁর বিনয় এবং শিক্ষাদানের প্রতি নিবেদন প্রতিটি জ্ঞান অন্বেষীর জন্য অনুকরণীয়।",
    "source": "সহীহ বুখারী (৭৫); সহীহ মুসলিম; তাবাকাতে ইবনে সাদ; তাফসীরে ইবনে কাসীর।"
  },
  {
    "id": "ubada_ibn_samit",
    "categoryId": "sahabider_jibon",
    "title": "উবাদা ইবনে সামিত (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। উবাদা ইবনে সামিত। খাযরাজ গোত্র। লম্বা, শক্তিশালী।",
      "**আকাবার শপথ:** দুই আকাবার শপথেই অংশ নিয়েছেন। প্রথম দিকের আনসার।",
      "**বদরের বীর:** বদরের যুদ্ধে অসাধারণ বীরত্ব দেখিয়েছেন।",
      "**সব যুদ্ধে:** উহুদ, খন্দক, খায়বার - সব যুদ্ধে অংশ নিয়েছেন।",
      "**শিক্ষক:** কুরআন শেখাতেন। মদীনায় শিক্ষক হিসেবে বিখ্যাত ছিলেন।",
      "**শামে:** উমরের খিলাফতে শামে গিয়ে কুরআন শেখাতেন।",
      "**মৃত্যু:** ৩৪ হিজরি, ৬৫৪ সাল। শামে। কুরআনের শিক্ষক।"
    ]
  },
  {
    "id": "abdullah_ibn_masud_extended",
    "categoryId": "sahabider_jibon",
    "title": "আবু যর আল-গিফারি (রাঃ)",
    "paragraphs": [
      "হযরত আবু যর আল-গিফারি (আরবি: أَبُو ذَرّ الْغِفَارِيّ; পূর্ণ নাম: জুনদুব ইবনে জুনাদা; মৃত্যু: ৬৫২) ছিলেন ইসলামের প্রথম দিকের একজন মহান সাহাবী, যিনি সত্যবাদিতা, সাদাসিধে জীবনযাপন এবং সামাজিক ন্যায়বিচারের জন্য বিখ্যাত ছিলেন।",
      "**বংশ ও প্রাথমিক জীবন:** আবু যর (রাঃ) গিফার গোত্রে জন্মগ্রহণ করেন, যা ছিল মক্কার উত্তরে অবস্থিত একটি দস্যু গোত্র। তাঁর প্রকৃত নাম ছিল জুনদুব ইবনে জুনাদা। জাহেলিয়াতের যুগেও তিনি মূর্তিপূজা করতেন না এবং এক আল্লাহর প্রতি বিশ্বাস রাখতেন। তিনি ছিলেন অত্যন্ত সত্যবাদী এবং সাহসী।",
      "**ইসলাম গ্রহণ, মক্কায় গোপন সফর:** যখন আবু যর (রাঃ) শুনলেন যে মক্কায় একজন নবী এসেছেন যিনি মূর্তিপূজা নিষিদ্ধ করছেন এবং এক আল্লাহর ইবাদতের দাওয়াত দিচ্ছেন, তখন তিনি তাঁর ভাই উনাইসকে বললেন: 'তুমি মক্কায় যাও এবং সেই ব্যক্তির কথা শুনে এসো।' উনাইস গিয়ে ফিরে এসে বলল: 'আমি তাঁকে দেখেছি। তিনি মানুষকে সৎ চরিত্র ও নৈতিকতার শিক্ষা দেন।'",
      "আবু যর (রাঃ) বললেন: 'তুমি আমার কৌতূহল মেটাতে পারোনি। আমি নিজেই যাব।' তিনি মক্কায় পৌঁছে কাবার কাছে রাসূল (সাঃ)-কে খুঁজতে লাগলেন। আলী (রাঃ) তাঁকে দেখে বুঝলেন যে তিনি বহিরাগত এবং রাসূল (সাঃ)-কে খুঁজছেন। আলী (রাঃ) তাঁকে রাসূল (সাঃ)-এর কাছে নিয়ে গেলেন।",
      "রাসূল (সাঃ) জিজ্ঞেস করলেন: 'তুমি কে?' আবু যর (রাঃ) বললেন: 'আমি গিফার গোত্রের লোক।' রাসূল (সাঃ) বললেন: 'তুমি কী চাও?' আবু যর (রাঃ) বললেন: 'আমি শুনেছি আপনি নবী। আমি আপনার কাছ থেকে ইসলাম সম্পর্কে জানতে চাই।' রাসূল (সাঃ) তাঁকে ইসলামের শিক্ষা দিলেন এবং কুরআন তিলাওয়াত করে শোনালেন। আবু যর (রাঃ) সাথে সাথে বললেন: 'أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ (আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া কোনো উপাস্য নেই এবং মুহাম্মাদ আল্লাহর রাসূল)।' এভাবে তিনি চতুর্থ বা পঞ্চম মুসলিম হলেন।",
      "**কাবায় প্রকাশ্য ঘোষণা:** ইসলাম গ্রহণের পরপরই আবু যর (রাঃ) রাসূল (সাঃ)-কে বললেন: 'হে আল্লাহর রাসূল! আমি কাবায় গিয়ে প্রকাশ্যে ইসলামের ঘোষণা দেব।' রাসূল (সাঃ) বললেন: 'আমি তোমার জন্য ভয় করছি। তারা তোমাকে মেরে ফেলতে পারে।' আবু যর (রাঃ) বললেন: 'আল্লাহর কসম! আমি অবশ্যই যাব।'",
      "পরদিন সকালে তিনি কাবায় গিয়ে উচ্চস্বরে ঘোষণা করলেন: 'أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ!' কুরাইশরা তাঁকে ঘিরে ধরে প্রচণ্ড মারধর করল। আব্বাস (রাঃ) এসে তাঁকে বাঁচালেন এবং বললেন: 'তোমরা কি জানো না যে, এই লোক গিফার গোত্রের? তোমাদের বাণিজ্য কাফেলা তাদের এলাকা দিয়ে যায়!' পরদিন আবু যর (রাঃ) আবার একই কাজ করলেন এবং আবার মার খেলেন। রাসূল (সাঃ) তাঁকে বললেন: 'এখন তুমি তোমার গোত্রে ফিরে যাও এবং যখন আমার বিজয়ের খবর শুনবে, তখন আমার কাছে আসবে।'",
      "**মদীনায় হিজরত:** আবু যর (রাঃ) তাঁর গোত্রে ফিরে গিয়ে ইসলামের দাওয়াত দিলেন এবং তাঁর অর্ধেক গোত্র ইসলাম গ্রহণ করল। খন্দকের যুদ্ধের সময় তিনি মদীনায় এসে রাসূল (সাঃ)-এর সাথে মিলিত হলেন। রাসূল (সাঃ) তাঁকে দেখে অত্যন্ত খুশি হলেন এবং বললেন: 'আবু যর! তুমি একাকী চলবে, একাকী মরবে এবং একাকী পুনরুত্থিত হবে।' [তিরমিযী]",
      "**সত্যবাদিতা ও সরলতা:** আবু যর (রাঃ) ছিলেন অত্যন্ত সত্যবাদী এবং সরল জীবনযাপনকারী। রাসূল (সাঃ) বলেছেন: 'আসমানের নিচে এবং জমিনের উপরে আবু যরের চেয়ে বেশি সত্যবাদী কেউ নেই।' [তিরমিযী]। তিনি দুনিয়ার প্রতি কোনো আকর্ষণ রাখতেন না এবং সম্পদ জমা করাকে ঘৃণা করতেন।",
      "**সম্পদ জমা করার বিরোধিতা:** খলিফা উসমান (রাঃ)-এর সময়ে আবু যর (রাঃ) সিরিয়ায় ছিলেন। তিনি দেখলেন যে, কিছু মুসলিম সম্পদ জমা করছে এবং বিলাসবহুল জীবনযাপন করছে। তিনি তাদের সতর্ক করে বললেন: 'যারা সোনা-রুপা জমা করে এবং আল্লাহর পথে খরচ করে না, তাদের কঠিন শাস্তির সুসংবাদ দাও।' [সূরা তাওবা: ৩৪]",
      "এই কারণে গভর্নর মুআবিয়া (রাঃ) উসমান (রাঃ)-এর কাছে অভিযোগ করলেন। উসমান (রাঃ) আবু যর (রাঃ)-কে মদীনায় ডেকে পাঠালেন এবং তাঁকে বললেন: 'আপনি রাবাযায় (মদীনার বাইরে একটি স্থান) চলে যান এবং সেখানে শান্তিতে থাকুন।' আবু যর (রাঃ) সম্মতি দিলেন এবং রাবাযায় চলে গেলেন।",
      "**রাবাযায় নির্বাসন ও মৃত্যু:** আবু যর (রাঃ) রাবাযায় অত্যন্ত সাদাসিধে জীবনযাপন করতে লাগলেন। তাঁর সাথে ছিল শুধু তাঁর স্ত্রী এবং একটি দাসী। ৬৫২ খ্রিস্টাব্দে (৩২ হিজরি) তিনি অসুস্থ হয়ে পড়লেন। মৃত্যুর সময় তাঁর স্ত্রী কাঁদতে লাগলেন। আবু যর (রাঃ) বললেন: 'কেন কাঁদছ?' স্ত্রী বললেন: 'আপনার কাফনের জন্য কোনো কাপড় নেই।' আবু যর (রাঃ) হেসে বললেন: 'কাঁদো না। রাসূল (সাঃ) আমাকে বলেছিলেন যে, আমি একাকী মরব। কিন্তু ইরাক থেকে কিছু মুমিন এদিক দিয়ে যাবে। তারা আমার জানাজা পড়বে এবং দাফন করবে।'",
      "কিছুক্ষণ পর আবদুল্লাহ ইবনে মাসউদ (রাঃ) সহ কিছু সাহাবী ইরাক থেকে মদীনা যাচ্ছিলেন। তাঁরা রাবাযায় এসে আবু যর (রাঃ)-কে মৃত্যুশয্যায় দেখলেন। আবু যর (রাঃ) তাঁদের দেখে হেসে বললেন: 'রাসূল (সাঃ) সত্য বলেছিলেন!' এরপর তিনি ইন্তেকাল করলেন। আবদুল্লাহ ইবনে মাসউদ (রাঃ) কাঁদতে কাঁদতে তাঁর জানাজা পড়ালেন এবং বললেন: 'রাসূল (সাঃ) সত্য বলেছিলেন, তুমি একাকী চলবে, একাকী মরবে এবং একাকী পুনরুত্থিত হবে।' তাঁকে রাবাযায় দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "miqdad_ibn_aswad",
    "categoryId": "sahabider_jibon",
    "title": "মিকদাদ ইবনুল আসওয়াদ (রাঃ)",
    "paragraphs": [
      "হযরত মিকদাদ ইবনুল আসওয়াদ (আরবি: الْمِقْدَاد بْن الْأَسْوَد; পূর্ণ নাম: মিকদাদ ইবনে আমর; মৃত্যু: ৬৫৩) ছিলেন ইসলামের প্রথম দিকের একজন মহান সাহাবী এবং বদরের যুদ্ধে অংশগ্রহণকারী একমাত্র অশ্বারোহী মুসলিম যোদ্ধা।",
      "**বংশ ও প্রাথমিক জীবন:** মিকদাদ (রাঃ) ইয়েমেনের বাহরা গোত্রে জন্মগ্রহণ করেন। তাঁর প্রকৃত নাম ছিল মিকদাদ ইবনে আমর আল-বাহরানি। যৌবনে একটি ঘটনায় তিনি একজনকে হত্যা করে ফেলেন এবং মক্কায় পালিয়ে আসেন। সেখানে আসওয়াদ ইবনে আবদে ইয়াগুস নামক এক ব্যক্তি তাঁকে পালক পুত্র হিসেবে গ্রহণ করেন। এজন্য তিনি 'মিকদাদ ইবনুল আসওয়াদ' নামে পরিচিত হন।",
      "**ইসলাম গ্রহণ:** রাসূল (সাঃ)-এর দাওয়াতের প্রথম দিকেই মিকদাদ (রাঃ) ইসলাম গ্রহণ করেন। তিনি ছিলেন প্রথম দিকের সাতজন মুসলিমের একজন যারা প্রকাশ্যে ইসলাম ঘোষণা করেছিলেন। কুরাইশরা তাঁকে নির্যাতন করত, কিন্তু তিনি ধৈর্যের সাথে সব সহ্য করতেন।",
      "**হাবশায় হিজরত:** নির্যাতন বৃদ্ধি পেলে মিকদাদ (রাঃ) প্রথম দলের সাথে হাবশায় (আবিসিনিয়া) হিজরত করেন। সেখানে নাজাশির সুরক্ষায় তিনি নিরাপদে ইবাদত করতে পারতেন। পরবর্তীতে তিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ) তাঁর এবং খারিজা ইবনে যায়েদ আনসারির মধ্যে ভ্রাতৃত্ব বন্ধন স্থাপন করেন।",
      "**বদরের যুদ্ধ, একমাত্র অশ্বারোহী:** ৬২৪ সালে বদরের যুদ্ধে মিকদাদ (রাঃ) ছিলেন মুসলিম বাহিনীর একমাত্র অশ্বারোহী যোদ্ধা। যুদ্ধের আগে রাসূল (সাঃ) সাহাবীদের পরামর্শ চাইলেন। আবু বকর ও উমর (রাঃ) তাঁদের মতামত দিলেন। তারপর মিকদাদ (রাঃ) দাঁড়িয়ে বললেন:",
      "'হে আল্লাহর রাসূল! আল্লাহ যেদিকে আপনাকে নির্দেশ দিয়েছেন, সেদিকে এগিয়ে যান। আমরা আপনার সাথে আছি। আল্লাহর কসম! আমরা আপনাকে সেই কথা বলব না যা বনি ইসরাইল মূসা (আঃ)-কে বলেছিল: فَاذْهَبْ أَنتَ وَرَبُّكَ فَقَاتِلَا إِنَّا هَاهُنَا قَاعِدُونَ (তুমি এবং তোমার রব গিয়ে যুদ্ধ করো, আমরা এখানে বসে আছি)। বরং আমরা বলছি: আপনি এবং আপনার রব যান এবং যুদ্ধ করুন, আমরা আপনাদের সাথে যুদ্ধ করব। আল্লাহর কসম! আপনি যদি আমাদের নিয়ে বারকুল গিমাদ (ইয়েমেনের একটি দূরবর্তী স্থান) পর্যন্ত যান, তবুও আমরা আপনার সাথে যুদ্ধ করব!' [সহীহ বুখারী]",
      "এই কথা শুনে রাসূল (সাঃ)-এর চেহারা উজ্জ্বল হয়ে গেল এবং তিনি মিকদাদ (রাঃ)-এর জন্য দোয়া করলেন। বদরের যুদ্ধে মিকদাদ (রাঃ) অসাধারণ বীরত্ব প্রদর্শন করেন এবং তাঁর ঘোড়ায় চড়ে শত্রুদের মধ্যে আতঙ্ক সৃষ্টি করেন।",
      "**অন্যান্য যুদ্ধ:** মিকদাদ (রাঃ) উহুদ, খন্দক, খায়বার, মক্কা বিজয়, হুনাইন এবং তাবুক সহ সকল যুদ্ধে রাসূল (সাঃ)-এর সাথে অংশগ্রহণ করেন। প্রতিটি যুদ্ধে তিনি অসাধারণ সাহসিকতা ও বীরত্ব প্রদর্শন করেন। রাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন এবং তাঁর সাহসিকতার প্রশংসা করতেন।",
      "**রাসূলের প্রশংসা:** রাসূল (সাঃ) বলেছেন: 'আল্লাহ আমাকে চারজন ব্যক্তিকে ভালোবাসার নির্দেশ দিয়েছেন এবং আমাকে জানিয়েছেন যে তিনিও তাদের ভালোবাসেন।' সাহাবীরা জিজ্ঞেস করলেন: 'তারা কারা, হে আল্লাহর রাসূল?' রাসূল (সাঃ) বললেন: 'আলী ইবনে আবি তালিব, আবু যর আল-গিফারি, মিকদাদ ইবনুল আসওয়াদ এবং সালমান আল-ফারসি।' [তিরমিযী]",
      "**খলিফাদের যুগ:** রাসূল (সাঃ)-এর ইন্তেকালের পর মিকদাদ (রাঃ) আবু বকর, উমর এবং উসমান (রাঃ)-এর খিলাফতকাল দেখেছেন। তিনি সর্বদা ন্যায় ও সত্যের পক্ষে কথা বলতেন। উমর (রাঃ)-এর সময় তিনি বিভিন্ন যুদ্ধে অংশগ্রহণ করেন এবং ইসলামের বিজয়ে অবদান রাখেন।",
      "**চরিত্র ও গুণাবলী:** মিকদাদ (রাঃ) ছিলেন অত্যন্ত সাহসী, সত্যবাদী এবং আল্লাহভীরু। তিনি কখনো অন্যায়ের সাথে আপস করতেন না। তাঁর শারীরিক গঠন ছিল মজবুত এবং তিনি ছিলেন দক্ষ অশ্বারোহী। তিনি দানশীল ছিলেন এবং দরিদ্রদের সাহায্য করতেন।",
      "**ইন্তেকাল:** ৬৫৩ খ্রিস্টাব্দে (৩৩ হিজরি) মদীনার কাছে 'জুরফ' নামক স্থানে ৭০ বছর বয়সে মিকদাদ (রাঃ) ইন্তেকাল করেন। খলিফা উসমান (রাঃ) তাঁর জানাজার নামাজ পড়ান এবং তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। তাঁর মৃত্যুতে পুরো মদীনা শোকে মুহ্যমান হয়ে পড়ে। তিনি ছিলেন বদরের যুদ্ধে অংশগ্রহণকারী শেষ সাহাবীদের একজন। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  }
]