[
  {
    "id": "abu_bakr_siddiq",
    "categoryId": "sahabider_jibon",
    "title": "আবু বকর সিদ্দিক (রাঃ)",
    "paragraphs": [
      "হযরত আবু বকর (আরবি: أبو بكر الصديق; জন্ম: ২৭ অক্টোবর ৫৭৩ – মৃত্যু: ২৩ আগস্ট ৬৩৪) ছিলেন একজন আরব রাজনৈতিক ও ধর্মীয় নেতা যিনি রাশিদুন খিলাফত প্রতিষ্ঠা করেন এবং ৬৩২ সাল থেকে ৬৩৪ সাল পর্যন্ত ইসলামের প্রথম খলিফা হিসেবে শাসন করেন।",
      "**বংশ ও উপাধি:** আবু বকরের পূর্ণ নাম ছিল আব্দুল্লাহ ইবনে আবি কুহাফা। আরবী ভাষায় আব্দুল্লাহ (আরবি: عَبْدُ ٱللهِ) নামের অর্থ 'আল্লাহর বান্দা।' শৈশবে উটের প্রতি বিশেষ ভালোবাসার কারণে তাকে 'আবু বকর' ডাকনাম দেওয়া হয় যার অর্থ উটের বাছুরের পিতা।",
      "**উপাধি:** ইসলাম গ্রহণের আগে তার উপাধি ছিল আতিক (আরবি: عتيق) যার অর্থ 'রক্ষাকারী'। লাইলাতুল মেরাজের ঘটনায় রাসূল (সাঃ)-কে বিশ্বাস করার পর রাসূল তাকে আল-সিদ্দিক (আরবি: الصديق) উপাধি দেন যার অর্থ 'সত্যবাদী'।",
      "**জন্ম ও প্রারম্ভিক জীবন:** আবু বকর ৫৭৩ খ্রিস্টাব্দে মক্কায় কুরাইশ উপজাতির বনু তাইম শাখায় একটি ধনী পরিবারে জন্মগ্রহণ করেন। তার পিতা ছিলেন উসমান (লাকাব আবু কুহাফা) এবং মা ছিলেন সালমা বিনতে শাখার (উম্মে উল-খায়ের)।",
      "**বংশতালিকাবিদ:** আবু বকর ছিলেন তার সময়ের প্রসিদ্ধ আরব বংশতালিকাবিদ। শুধু কুরাইশের ইতিহাসই নয়, অন্যান্য আরব গোত্রের ইতিহাস সম্পর্কেও তার বিশেষজ্ঞ জ্ঞান ছিল। রাসূল (সাঃ) বলেছেন: 'নিশ্চয়ই আবু বকর কুরাইশদের বংশ সম্পর্কে সবচেয়ে জ্ঞানী।'",
      "**প্রাথমিক জীবন:** ইসলাম গ্রহণের আগে আবু বকর হানিফ ধর্মকে অনুশীলন করতেন এবং কখনও প্রতিমা পূজা করতেন না। তিনি একজন ধনী ব্যবসায়ী ছিলেন এবং মক্কার সম্মানিত ব্যক্তি ছিলেন।",
      "**ইসলাম গ্রহণ:** আবু বকর ব্যবসায়ী হওয়ায় তিনি সিরিয়া সফর করতেন। একটি যাত্রার সময় এক বৃদ্ধ তাকে একজন নবীর আগমনের কথা বলেন। রাসূল (সাঃ) নবুয়ত ঘোষণা করলে আবু বকর তাৎক্ষণিকভাবে ইসলাম গ্রহণ করেন। তিনি ছিলেন ইসলাম গ্রহণকারী প্রথম স্বাধীন পুরুষ।",
      "**দাস মুক্তি:** আবু বকর দাসদের প্রতি সহানুভূতি অনুভব করতেন। তিনি বিলাল ইবনে রাবাহ, আবু ফুকাইয়া, আম্মার ইবনে ইয়াসির সহ আটজন দাস-দাসী কিনে মুক্ত করেন এবং তাদের স্বাধীনতার জন্য ৪০,০০০ দিনার ব্যয় করেন। তার পিতা জিজ্ঞাসা করেন কেন তিনি শক্তিশালী দাস মুক্ত করেননি। আবু বকর উত্তর দেন: 'আমি ঈশ্বরের জন্য দাসদের মুক্ত করছি, নিজের জন্য নয়।'",
      "**কুরাইশদের নিপীড়ন:** ৬১৩ সালে রাসূল (সাঃ) প্রকাশ্যে ইসলামের দাওয়াত দিতে শুরু করলে আবু বকর প্রথম প্রকাশ্য ভাষণ দেন। কুরাইশ যুবকরা তাকে মারধর করে জ্ঞান হারিয়ে ফেলা পর্যন্ত। এই ঘটনার পর তার মা ইসলাম গ্রহণ করেন।",
      "**আবিসিনিয়ায় হিজরত:** ৬১৪ সালে নির্যাতন বৃদ্ধি পেলে তিনি আবিসিনিয়ায় হিজরত করেন। নাজাশি তাদের নিরাপত্তা দেন। ৬১৯-৬২০ সালে তিনি মক্কায় ফিরে আসেন।",
      "**মদিনায় হিজরত:** ৬২২ সালে কুরাইশরা রাসূল (সাঃ)-কে হত্যার চেষ্টা করে। রাসূল আবু বকরকে সাথে নিয়ে জাবাল থাওয়ারের গুহায় আশ্রয় নেন। তিন দিন তিন রাত গুহায় থাকার পর তারা মদিনায় যাত্রা করেন। এ সময় কুরআনের আয়াত নাযিল হয়: 'যদি তোমরা তাকে সাহায্য না করো, তবে আল্লাহ তাকে সাহায্য করেছেন যখন তিনি ছিলেন দুজনের মধ্যে দ্বিতীয়, যখন তারা গুহায় ছিলেন।' (সূরা তাওবা: ৪০)",
      "**মদিনায় জীবন:** মদিনায় রাসূল (সাঃ) মসজিদে নববী নির্মাণের সিদ্ধান্ত নেন এবং জমির দাম আবু বকর প্রদান করেন। আবু বকরের সাথে খায়েরিজাহ বিন জাইদ আনসারির সাথে ভ্রাতৃত্ব বন্ধন করা হয়। তিনি মদিনায় কাপড়ের ব্যবসা শুরু করেন। ৬২৩ সালে তার কন্যা আয়েশা (রাঃ) রাসূল (সাঃ)-এর সাথে বিবাহবন্ধনে আবদ্ধ হন।",
      "**বদরের যুদ্ধ:** ৬২৪ সালে আবু বকর বদরের যুদ্ধে রাসূল (সাঃ)-এর তাঁবুর রক্ষী হিসেবে কাজ করেন। আলী (রাঃ) বলেন: 'আবু বকর সবচেয়ে সাহসী, টানা তলোয়ার নিয়ে রাসূলকে রক্ষা করেন।'",
      "**উহুদ ও খন্দকের যুদ্ধ:** ৬২৫ সালে উহুদের যুদ্ধে তিনি অংশ নেন এবং আহত হন। যুদ্ধ শুরু হওয়ার আগে, তার ছেলে আব্দুর রহমান, সেই সময় এখনও অমুসলিম এবং কুরাইশদের পক্ষে লড়াই করতে এগিয়ে আসে। ৬২৭ সালে তিনি খন্দকের যুদ্ধে অংশ নেন এবং পরিখা খননে সহায়তা করেন।",
      "**হুদায়বিয়ার সন্ধি:** ৬২৮ সালে তিনি হুদায়বিয়ার সন্ধিতে অংশ নেন এবং সাক্ষী হিসেবে এতে স্বাক্ষর করেন। উমর সন্ধির শর্তে অসন্তুষ্ট হয়ে আবু বকরের কাছে আসেন। আবু বকর তাকে বোঝান এবং বলেন: 'তিনি আল্লাহর রাসূল এবং তিনি তাঁর রবের অবাধ্য নন।'",
      "**মক্কা বিজয়:** ৬৩০ সালে মক্কা বিজয়ের সময় আবু বকর রাসূল (সাঃ)-এর সাথে ছিলেন। তার পিতা আবু কুহাফা তখনও অমুসলিম ছিলেন। রাসূল (সাঃ) বলেন: 'আপনি আপনার পিতাকে তাঁর ঘরে রেখে আসতে পারতেন, আমি নিজেই তাঁর কাছে যেতাম।' আবু কুহাফা ইসলাম গ্রহণ করেন এবং আবু বকর খুশিতে কাঁদেন।",
      "**তাবুক অভিযান:** ৬৩০ সালে তাবুক অভিযানে আবু বকর তার সমস্ত সম্পদ দান করেন। রাসূল (সাঃ) জিজ্ঞাসা করেন: 'তুমি তোমার পরিবারের জন্য কী রেখে এসেছ?' আবু বকর উত্তর দেন: 'আমি তাদের জন্য আল্লাহ ও তাঁর রাসূলকে রেখে এসেছি।'",
      "**আমির-উল-হজ্জ:** ৬৩১ সালে রাসূল (সাঃ) আবু বকরকে আমির-উল-হজ্জ (হজ্জের নেতা) হিসেবে নিযুক্ত করেন এবং তিনশ মুসলমানের একটি প্রতিনিধিদল নিয়ে মক্কায় পাঠান। আবু বকর হজ্জ অনুষ্ঠানে সভাপতিত্ব করেন এবং আলী রাসূল (সাঃ)-এর পক্ষ থেকে সূরা তাওবাহর একটি অংশ ঘোষণা করেন।",
      "**রাসূলের শেষ দিন:** রাসূল (সাঃ)-এর শেষ দিনগুলিতে তিনি আবু বকরকে নামাযের ইমামতি করতে বলেন। রাসূল বলেন: 'আবু বকরের দরজা ছাড়া মসজিদের দিকে যাওয়ার সমস্ত দরজা বন্ধ করে দাও, কারণ আমি তার চেয়ে ভাল বন্ধু আর কেউ নেই।'",
      "**রাসূলের মৃত্যু:** রাসূল (সাঃ)-এর মৃত্যুর পর মুসলিম সম্প্রদায় গভীর ধাক্কা খায়। উমর বিশেষভাবে প্রভাবিত হন এবং ঘোষণা করেন যে রাসূল মারা যাননি। আবু বকর মদিনায় ফিরে এসে উমরকে শান্ত করেন এবং মসজিদে সমবেত ব্যক্তিদের উদ্দেশে বলেন: 'কেউ যদি মুহাম্মাদের উপাসনা করে, তবে মুহাম্মাদ মারা গেছেন। যদি কেউ আল্লাহর উপাসনা করে, আল্লাহ জীবিত, অমর।'",
      "**কুরআনের আয়াত:** এরপর তিনি কুরআন থেকে তিলাওয়াত করেন: 'মুহাম্মাদ একজন রাসুল ছাড়া আর কিছুই নন এবং তার পূর্বে অনেক রাসুল মারা গেছেন।' (সূরা আল ইমরান: ১৪৪)",
      "**সাকীফায় নির্বাচন:** রাসূল (সাঃ)-এর মৃত্যুর পর সাকীফায় সমাবেশ অনুষ্ঠিত হয়। আনসাররা তাদের মধ্য থেকে নেতা নির্বাচন করতে চাইলে আবু বকর ও উমর সেখানে যান। আবু বকর বলেন যে উত্তরাধিকার কুরাইশদের মধ্য থেকে হতে হবে। উমর আবু বকরের প্রতি আনুগত্যের শপথ নেন এবং সবাই অনুসরণ করেন।",
      "**খলিফার শপথ:** খলিফার দায়িত্ব গ্রহণের পর আবু বকর বলেন: 'আমি তোমাদের মধ্যে সেরা নই। আমি যদি ভাল করি, আমাকে সাহায্য করো; আর আমি যদি অন্যায় করি, তাহলে আমাকে ঠিক করিয়ে দাও। যতক্ষণ আমি আল্লাহ ও তাঁর রাসূলের আনুগত্য করি ততক্ষণ আমার আনুগত্য করো।'",
      "**রিদ্দার যুদ্ধ:** আবু বকরের নির্বাচনের পর বেশ কয়েকটি আরব উপজাতি বিদ্রোহ শুরু করে এবং যাকাত দিতে অস্বীকার করে। আবু বকর দৃঢ়তার সাথে বলেন: 'যারা নামায ও যাকাতের মধ্যে পার্থক্য করে, আমি তাদের বিরুদ্ধে যুদ্ধ করব।'",
      "**কুরআন সংরক্ষণ:** ইয়ামামার যুদ্ধে অনেক হাফিয শহীদ হওয়ায় উমর আবু বকরকে কুরআন লিখিত আকারে সংকলনের পরামর্শ দেন। আবু বকর প্রথমে দ্বিধাগ্রস্ত ছিলেন কিন্তু পরে রাজি হন এবং যায়েদ ইবনে সাবিতকে এই কাজের দায়িত্ব দেন।",
      "**পারস্য ও সিরিয়ায় অভিযান:** আরব একত্রিত হওয়ার পর আবু বকর বাইজেন্টাইন ও সাসানীয় সাম্রাজ্যে অভিযান পাঠান। ৬৩৩ সালে ইরাক ও ফিলিস্তিনে বাহিনী প্রেরণ করা হয় যা বেশ কয়েকটি শহর দখল করে।",
      "**মৃত্যু:** ৬৩৪ সালের ২৩ আগস্ট আবু বকর অসুস্থ হয়ে পড়েন এবং তার প্রচণ্ড জ্বর হয়। মৃত্যুর আগে তিনি আলী (রাঃ)-কে অনুরোধ করেন যেন তিনি তার গোসল করান। তিনি উমর (রাঃ)-কে তার উত্তরসূরি হিসেবে মনোনীত করেন এবং উসমান (রাঃ)-কে দিয়ে তার শেষ ইচ্ছা লিখিয়ে নেন।",
      "**দাফন:** উমর তার জানাযার নামাযের নেতৃত্ব দেন এবং তাকে রাসূল (সাঃ)-এর কবরের পাশে সমাহিত করা হয়।"
    ],
    "moral": "আবু বকর (রাঃ)-এর জীবন প্রমাণ করে যে সত্যের পথে দৃঢ়তা, ত্যাগ, দানশীলতা এবং রাসূলের প্রতি ভালোবাসা সর্বোচ্চ মর্যাদা এনে দেয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর"
  },
  {
    "id": "umar_ibn_khattab",
    "categoryId": "sahabider_jibon",
    "title": "উমর ইবনুল খাত্তাব (রাঃ)",
    "paragraphs": [
      "মক্কার উত্তপ্ত বালুতে একটি শিশুর জন্ম হয় ৫৮৪ সালে। নাম রাখা হয় উমর। পিতা খাত্তাব ইবনে নুফায়েল, মা হানতামা বিনতে হিশাম। কুরাইশ বংশের বনু আদি গোত্রের এই পরিবার ছিল মক্কায় সম্মানিত। কে জানত এই শিশুটিই একদিন হবে আল-ফারুক!",
      "**কঠিন শৈশব ও শিক্ষা:** ছোট উমরের জীবন ছিল কঠোর পরিশ্রমে ভরা। মরুভূমিতে পিতার উট চরাতে হতো। পিতা খাত্তাব ছিলেন কঠোর মানুষ। উমর বলেছেন: 'আমার বাবা কঠোর পরিশ্রম করাতেন। না করলে মারধর করতেন।' এই কঠিন জীবনই তাকে বানিয়েছিল লৌহমানব। সেই যুগে পুরো কুরাইশে মাত্র ১৭ জন লিখতে পারতেন। উমর ছিলেন তাদের একজন। কবিতা ছিল তার প্রিয়। তীরন্দাজি, অশ্বারোহণ, কুস্তি - সবেতেই পারদর্শী। ৬ ফুট ৩ ইঞ্চি লম্বা, শক্তিশালী গড়ন। মক্কার সবচেয়ে ভয়ঙ্কর যোদ্ধা।",
      "**ব্যবসায়ী জীবন:** যুবক উমর হলেন সফল বণিক। চামড়া আর কাপড়ের ব্যবসা। সিরিয়া, ইরাক, ইয়েমেন - সব জায়গায় বাণিজ্য। রোমান, পারসিক সাম্রাজ্যে যেতেন। মক্কায় তিনি ছিলেন বিচারক, সালিশকারী। মানুষ বিশ্বাস করত তার ন্যায়বিচারে।",
      "**ইসলাম গ্রহণ:** ৬১৬ সাল। ৩৯ বছর বয়সী উমর তলোয়ার নিয়ে বেরিয়ে পড়লেন - লক্ষ্য মুহাম্মাদকে হত্যা! ইবনে সাদ, ইবনে হিশাম, দারকুতনী ও ইবনে আসীরের বর্ণনা অনুযায়ী, পথে বন্ধু নাইম ইবনে আবদুল্লাহর সাথে দেখা। নাইম গোপনে মুসলমান হয়েছিলেন কিন্তু উমর জানতেন না।\n\n'কোথায় যাচ্ছ উমর?' নাইম জিজ্ঞাসা করলেন।\n'মুহাম্মাদকে হত্যা করতে!' উমর দৃঢ়স্বরে জবাব দিলেন।\n'তুমি কি মনে করো বনু হাশিম ও বনু যুহরা তোমাকে ছেড়ে দেবে? আগে নিজের ঘরের খবর নাও। তোমার বোন ফাতিমা আর ভগ্নিপতি সাঈদ মুসলমান হয়ে গেছে!'\n\nউমরের চোখ জ্বলে উঠল রাগে। ঘুরিয়ে নিলেন পা বোনের বাড়ির দিকে।\n\nবাড়িতে পৌঁছে শুনলেন কুরআন তিলাওয়াতের শব্দ। খাব্বাব ইবনুল আরাত সূরা তাহা পড়াচ্ছিলেন। উমরের পদশব্দে খাব্বাব লুকিয়ে গেলেন। ফাতিমা পাণ্ডুলিপি লুকিয়ে ফেললেন।\n\nউমর ঘরে ঢুকে গর্জন করলেন: 'এই গুনগুন কিসের শব্দ?'\n'কিছু না ভাই, আমরা শুধু কথা বলছিলাম।' ফাতিমা বললেন।\n'মিথ্যা বলো না! শুনেছি তোমরা মুহাম্মাদের ধর্ম নিয়েছ!'\n\nএই বলে সাঈদের উপর ঝাঁপিয়ে পড়লেন। ফাতিমা স্বামীকে বাঁচাতে এগিয়ে এলেন। উমর তাকেও আঘাত করলেন। ফাতিমার মুখ দিয়ে রক্ত ঝরতে লাগল।\n\nবোনের রক্ত দেখে উমরের মন কেঁপে উঠল। লজ্জিত হলেন। কিন্তু ফাতিমা সাহসের সাথে বললেন: 'হ্যাঁ উমর! আমরা মুসলমান হয়েছি। আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান এনেছি। তুমি যা ইচ্ছা করো, আমরা ইসলাম ছাড়ব না!'\n\nউমর নরম স্বরে বললেন: 'তোমরা যা পড়ছিলে সেই লেখা আমাকে দেখাও।'\n'তুমি অপবিত্র অবস্থায় আছ। এটা আল্লাহর পবিত্র কালাম। আগে গোসল করো, তবেই দেখতে পারবে।' ফাতিমা বললেন।\n\nউমর গোসল করলেন। পবিত্র হলেন। হাতে নিলেন সূরা তাহার পাণ্ডুলিপি। পড়তে শুরু করলেন:\n\nطه ما أنزلنا عليك القرآن لتشقى\n'তা-হা। আমি তোমার প্রতি কুরআন এজন্য নাযিল করিনি যে তুমি কষ্ট পাবে।'\n\nإن الساعة آتية أكاد أخفيها لتجزى كل نفس بما تسعى\n'নিশ্চয়ই কিয়ামত আসবে। আমি তা গোপন রাখতে চাই যাতে প্রত্যেককে তার কর্মের ফল দেওয়া যায়।'\n\nفلا يصدنك عنها من لا يؤمن بها واتبع هواه فتردى\n'যে এতে বিশ্বাস করে না এবং নিজ প্রবৃত্তির অনুসরণ করে, সে যেন তোমাকে এ থেকে বিরত না রাখে। নইলে তুমি ধ্বংস হয়ে যাবে।'\n\nপড়তে পড়তে উমরের চোখ ভিজে এলো। হৃদয় কাঁপল। তিনি বললেন: 'সুবহানাল্লাহ! এ কেমন সুন্দর ও মহৎ বাণী! এটা মানুষের রচিত নয়, এটা আল্লাহর বাণী! আমাকে মুহাম্মাদের কাছে নিয়ে চলো!'\n\nখাব্বাব লুকানো জায়গা থেকে বেরিয়ে এলেন। বললেন: 'উমর, সুসংবাদ! গতকাল রাসূল (সাঃ) দোয়া করেছেন: \"হে আল্লাহ, আবু জাহল অথবা উমর ইবনুল খাত্তাব - এই দুজনের মধ্যে যে তোমার কাছে বেশি প্রিয় তাকে দিয়ে ইসলামকে শক্তিশালী করো!\" আল্লাহ তোমাকে বেছে নিয়েছেন!'\n\nউমর সোজা চললেন দারুল আরকামে। যেখানে রাসূল (সাঃ) সাহাবীদের সাথে ছিলেন। তলোয়ার হাতে উমরকে আসতে দেখে সাহাবীরা ভয় পেলেন। হামযা (রাঃ) দরজায় দাঁড়িয়ে বললেন: 'যদি সে ভালো উদ্দেশ্যে আসে তবে ঠিক আছে। আর যদি খারাপ উদ্দেশ্যে আসে, তবে তার নিজের তলোয়ার দিয়েই তার মাথা কেটে ফেলব!'\n\nকিন্তু রাসূল (সাঃ) শান্ত স্বরে বললেন: 'তাকে আসতে দাও।'\n\nউমর ঘরে ঢুকলেন। রাসূল (সাঃ) তার কাপড়ের কলার ধরে জোরে টান দিলেন এবং জিজ্ঞাসা করলেন: 'উমর ইবনুল খাত্তাব! কেন এসেছ? কখন থামবে তুমি?'\n\nউমর কাঁপা গলায় বললেন: 'ইয়া রাসূলাল্লাহ! আমি সাক্ষ্য দিচ্ছি যে লা ইলাহা ইল্লাল্লাহ এবং আপনি আল্লাহর রাসূল!'\n\nরাসূল (সাঃ) এত খুশি হলেন যে উচ্চস্বরে তাকবীর দিলেন: 'আল্লাহু আকবার!' তাঁর তাকবীর ধ্বনি দারুল আরকামের বাইরে পর্যন্ত শোনা গেল। সাহাবীরা বুঝলেন - ইসলাম শক্তিশালী হয়েছে! রাসূল (সাঃ) উমরকে 'আল-ফারুক' উপাধি দিলেন।\n\nতবে আহমদ ইবনে হাম্বল ও ইবনে হিশামের আরেকটি বর্ণনা রয়েছে। সেই বর্ণনা অনুযায়ী, এক রাতে উমর রাসূল (সাঃ)-কে কাবার প্রাঙ্গণে নামাজরত অবস্থায় অনুসরণ করছিলেন। তখন তাঁর মুখে কুরআনের বাণী শুনে উমরের মনে হলো: 'এটি মানব রচিত নয়, আল্লাহ রচিত বাণী!' তখনই তিনি রাসূলকে জানালেন যে ইসলাম তার অন্তরে প্রবেশ করেছে।\n\nইসলাম গ্রহণের পর উমর প্রথমে ভীত ছিলেন। লোকচক্ষুর আড়ালে থাকতেন। কিন্তু যখন স্থানীয় জনগণ তার ধর্মান্তরিত হওয়া জানতে পেরে তাকে মারতে আসল, তখন আল-আস ইবনে ওয়াইল তাকে রক্ষা করেন।\n\nকিন্তু উমর বেশিদিন লুকিয়ে থাকতে পারলেন না। তিনি সোজা গেলেন ইসলামের সবচেয়ে কঠোর শত্রু আবু জাহলের কাছে। বললেন: 'আবু জাহল, জেনে রাখো - আমি মুসলমান হয়েছি!' আবু জাহল রাগে ফেটে পড়লেন কিন্তু কিছু করতে পারলেন না।\n\nএরপর উমর ও হামযা (রাঃ) দুই সারিতে মুসলিমদের নিয়ে প্রকাশ্যে কাবা প্রাঙ্গণে গেলেন। প্রথমবার মুসলিমরা প্রকাশ্যে কাবায় নামায পড়লেন। কুরাইশরা বাধা দিতে সাহস পেল না।\n\nআবদুল্লাহ ইবনে মাসউদ (রাঃ) পরে বলেছেন: 'উমর মুসলিম হওয়ার আগে আমরা গোপনে ইবাদত করতাম। উমর মুসলিম হওয়ার পর আমরা শক্তিশালী হয়েছি এবং মান-সম্মানের সাথে বসবাস করতে পেরেছি। সেদিন থেকে আমরা প্রকাশ্যে নামায পড়তে পেরেছি।'\n\nসকল বর্ণনাকারী এ ব্যাপারে একমত যে উমরের ইসলাম গ্রহণে মুসলমানদের মনোবল যথেষ্ট বৃদ্ধি পায়। ইসলাম পেল নতুন শক্তি, নতুন সাহস!",
      "**হিজরত ও মদীনা:** ৬২২ সাল। সবাই রাতে গোপনে হিজরত করছেন। কিন্তু উমর দিনের বেলায় কাবায় গেলেন। কুরাইশদের বললেন: 'কে আছো মোকাবেলা করবে?' ২০ জন সাহাবীসহ প্রকাশ্যে মদীনায় গেলেন। রাসূল (সাঃ) উমরকে মুহাম্মাদ ইবনে মাসলামার সাথে ভ্রাতৃত্বে আবদ্ধ করলেন। ৬২৫ সালে উমরের কন্যা হাফসা (রাঃ) রাসূলকে বিয়ে করলেন।",
      "**যুদ্ধসমূহ:** বদর (৬২৪), উহুদ (৬২৫), খন্দক (৬২৭), খায়বার, মক্কা বিজয় (৬৩০), হুনায়ন, তাবুক - সব যুদ্ধে উমর। তাবুকে সম্পদের অর্ধেক দান করলেন। আবু বকর সব দান করলেন! উমর বললেন: 'আমি কখনও আবু বকরকে ছাড়িয়ে যেতে পারব না।'",
      "**রাসূলের মৃত্যু ও খিলাফত:** ৬৩২ সাল। রাসূল (সাঃ) মৃত্যুবরণ করলেন। উমর বিশ্বাস করলেন না। তলোয়ার হাতে বললেন: 'যে বলবে নবি মারা গেছেন আমি তার হাত-পা কাটব!' আবু বকর তিলাওয়াত করলেন: 'মুহাম্মাদ একজন রাসুল। তার পূর্বে সকল রাসুল গত হয়েছেন।' (সূরা আল ইমরান: ১৪৪) উমর সত্য বুঝলেন। সাকীফায় উমর আবু বকরের হাত ধরলেন: 'আমি বাইয়াত করছি।' ইসলামী খিলাফত প্রতিষ্ঠিত হল। উমর ছিলেন প্রধান উপদেষ্টা। কুরআন সংকলনের পরামর্শ দিলেন। আবু বকর উমরকে উত্তরসূরি মনোনীত করলেন।",
      "**খলিফা হিসেবে দায়িত্ব:** ২২ আগস্ট ৬৩৪। উমর খলিফা হলেন। প্রথম ভাষণ: 'যদি ফোরাতের তীরে একটি কুকুর না খেয়ে মারা যায়, উমর দায়ী থাকবে!' এককেন্দ্রিক সরকার গড়লেন। প্রদেশ, জেলা, গভর্নর। প্রথম চালু করলেন: পুলিশ বাহিনী, গোয়েন্দা বিভাগ, প্রশাসনিক আদালত। হিজরি বর্ষপঞ্জি প্রণয়ন। বাইতুল মাল স্থাপন। মসজিদ সম্প্রসারণ। বসরা ও কুফা শহর নির্মাণ।",
      "**জেরুজালেম ও সংস্কার:** ৬৩৮ সাল। উমর নিজে জেরুজালেমে গেলেন। 'উমরের চুক্তি' স্বাক্ষর করলেন। খ্রিস্টানদের নিরাপত্তা দিলেন। ইহুদিদের ফিরে আসার অনুমতি দিলেন। হারাম আল শরিফ নিজে হাতে পরিষ্কার করলেন। খালিদ ইবনে ওয়ালিদকে পদচ্যুত করলেন - বোঝাতে চাইলেন বিজয় আল্লাহর!",
      "**দুর্ভিক্ষ ও বিজয়:** ৬৩৮ সাল। ভয়াবহ দুর্ভিক্ষ। উমর মাংস, ঘি, দুধ খাওয়া বন্ধ করলেন। লক্ষাধিক মানুষ বাঁচলেন। ৬৩৯ সাল। প্লেগে আবু উবাইদা সহ ২৫,০০০ মুসলিম শহীদ হলেন। উমরের খিলাফতকালে লেভান্ট, মিশর, সম্পূর্ণ সাসানীয় সাম্রাজ্য, পারস্য, আজারবাইজান, আর্মেনিয়া বিজয়। পশ্চিমে লিবিয়া থেকে পূর্বে সিন্ধু নদ পর্যন্ত! মাত্র ১০ বছরে ২২ লক্ষ বর্গমাইল!",
      "**সাধারণ জীবন:** মাটির ঘরে বাস। রাতে ছদ্মবেশে জনগণের অবস্থা দেখতেন। একবার এক বিধবার জন্য নিজে পিঠে খাদ্য বহন করলেন। নিজে রান্না করে দিলেন। যব রুটি ও খেজুর খেতেন। ১২ জায়গায় ছেঁড়া গাউন পরতেন। বাইজেন্টাইন দূতরা তাকে গাছের নিচে ঘুমাতে দেখে বললেন: 'তুমি ন্যায়বিচার করেছ তাই নিরাপদে ঘুমাও।'",
      "**শাহাদাত:** ৬৪৪ সাল। পার্সিয়ান দাস পিরুজ ফজরের নামাযে উমরকে ৬ বার ছুরি দিয়ে আঘাত করল। উমর বললেন: 'নামায শেষ করো।' তিন দিন পর শহীদ হলেন। ৬ সদস্যের কমিটি গঠন করলেন: আবদুর রহমান, সাদ, তালহা, উসমান, আলী, যুবাইর। রাসূল ও আবু বকরের পাশে দাফন হলেন। ৭ নভেম্বর ৬৪৪। উসমান তৃতীয় খলিফা হলেন। উমরের খিলাফত: ১০ বছর। ন্যায়বিচার, সাম্য, দরিদ্র কল্যাণ। আমিরুল মুমিনীন। আশারায়ে মুবাশশারা।"
    ],
    "moral": "উমর (রাঃ)-এর জীবন প্রমাণ করে যে ন্যায়বিচার, দৃঢ়তা, সাধারণ জীবনযাপন এবং দরিদ্রদের প্রতি দয়া একজন শাসককে মহান করে তোলে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর"
  },
  {
    "id": "uthman_ibn_affan",
    "categoryId": "sahabider_jibon",
    "title": "উসমান ইবনে আফফান (রাঃ)",
    "paragraphs": [
      "মক্কার ধনী বণিক পরিবারে জন্ম নেওয়া এক যুবক। নাম উসমান ইবনে আফফান। বনু উমাইয়া গোত্রের সন্তান। জন্ম ৫৭৩ বা ৫৭৬ সাল। পিতা আফফান ইবনে আবি আল-আস, মা আরওয়া বিনতে কুরাইয়েজ। মায়ের দিক থেকে রাসূল (সাঃ)-এর চাচাতো ভাই। লাজুক, ভদ্র, সুদর্শন যুবক। কে জানত এই যুবকটি হবেন তৃতীয় খলিফা!",
      "**ধনী ব্যবসায়ী:** অল্প বয়সে পিতা মারা গেলেন। রেখে গেলেন বিশাল সম্পত্তি। উসমান সেই সম্পদ ব্যবসায় বিনিয়োগ করলেন। সিরিয়া, ইয়েমেন, আবিসিনিয়া - সব জায়গায় ব্যবসা। অসাধারণ বুদ্ধিমত্তায় হয়ে উঠলেন কুরাইশদের সবচেয়ে ধনী ব্যবসায়ীদের একজন। কিন্তু সম্পদ তাকে অহংকারী করেনি। ছিলেন বিনয়ী, ভদ্র, দানশীল। মক্কার মানুষ তাকে সম্মান করত।",
      "**ইসলাম গ্রহণ:** ৬১১ সাল। সিরিয়া থেকে ব্যবসায়িক সফর শেষে মক্কায় ফিরলেন। শুনলেন মুহাম্মাদ (সাঃ) নবুয়ত ঘোষণা করেছেন। বন্ধু আবু বকরের সাথে আলোচনা করলেন। আবু বকর বললেন: এসো রাসূলের কাছে যাই। রাসূলের সাথে দেখা। কথা শুনলেন। হৃদয় কাঁপল। সাথে সাথে ইসলাম গ্রহণ করলেন। হলেন প্রথম দিকের মুসলিমদের একজন। ২২ জন মক্কাবাসীর মধ্যে একজন যারা লিখতে জানতেন। চাচা হাকাম ইবনে আবি আল-আস রাগে ফেটে পড়লেন। নির্যাতন শুরু হল।",
      "**আবিসিনিয়ায় হিজরত:** ৬১৫ সাল, এপ্রিল। নির্যাতন বাড়ছে। রাসূল (সাঃ) বললেন: আবিসিনিয়ায় চলে যাও। সেখানে ন্যায়পরায়ণ বাদশাহ আছেন। উসমান ও তার স্ত্রী রুকাইয়া (রাসূলের কন্যা) ১০ জন পুরুষ ও ৩ জন মহিলা সহ হিজরত করলেন। রাসূল (সাঃ) বলেছেন: উসমান ও রুকাইয়া লুত (আঃ) এর পর প্রথম যারা আল্লাহর পথে হিজরত করেছেন। আবিসিনিয়ায় ব্যবসা চালিয়ে গেলেন। সফল হলেন। চার বছর পর খবর এল - কুরাইশরা ইসলাম গ্রহণ করেছে! উসমান ও ৩৯ জন মুসলিম মক্কায় ফিরলেন। কিন্তু খবর ছিল মিথ্যা! তবুও মক্কায় থেকে গেলেন। আবার ব্যবসা শুরু করলেন।",
      "**মদীনায় হিজরত:** ৬২২ সাল। তৃতীয় দলের সাথে মদীনায় হিজরত করলেন। প্রথমে আবু তালহা ইবনে সাবিতের বাড়িতে থাকলেন। তারপর নিজের বাড়ি কিনলেন। মদীনায় বেশিরভাগ মুসলিম ছিলেন কৃষক। ব্যবসায়ে আগ্রহ কম। ইহুদিরা ব্যবসা করত। উসমান বুঝলেন - এখানে ব্যবসার সুযোগ আছে। পরিশ্রম ও সততায় ব্যবসা ফুলে ফেঁপে উঠল। হয়ে উঠলেন মদীনার ধনীতম ব্যক্তিদের একজন।",
      "**যুন-নূরাইন:** রাসূলের দুই কন্যাকে বিয়ে করার সৌভাগ্য হয়েছিল উসমানের। প্রথমে রুকাইয়া (রাঃ)। বদরের যুদ্ধের সময় রুকাইয়া অসুস্থ ছিলেন। রাসূল (সাঃ) উসমানকে বললেন: তুমি মদীনায় থাকো, স্ত্রীর সেবা করো। বদরে যাওয়ার সওয়াব ও গনিমত তোমার জন্য আছে। রুকাইয়া মারা গেলেন। উসমান শোকে মুহ্যমান। রাসূল (সাঃ) তার আরেক কন্যা উম্মে কুলসুম (রাঃ) কে উসমানের সাথে বিয়ে দিলেন। এজন্য তাকে দেওয়া হল বিশেষ উপাধি - যুন-নূরাইন (দুই আলোর অধিকারী)। আরেক উপাধি গনি - অত্যন্ত দানশীল।",
      "**দানশীলতা:** তাবুকের যুদ্ধ। মুসলিম বাহিনীর অর্থ সংকট। রাসূল (সাঃ) বললেন: কে আল্লাহর পথে দান করবে? উসমান ১০০০ উট, ৭০টি ঘোড়া ও ১০০০ দিনার দান করলেন! রাসূল (সাঃ) হাত তুলে দোয়া করলেন: আজকের পর উসমান যা করুক তাতে কোনো ক্ষতি নেই! মদীনায় পানির সংকট। রুমা কূপের মালিক ইহুদি। চড়া দামে পানি বিক্রি করত। উসমান ৩৫,০০০ দিরহাম দিয়ে কূপ কিনে মুসলিমদের জন্য ওয়াক্ফ করে দিলেন। মসজিদে নববী সম্প্রসারণের জন্য জমি কিনে দান করলেন।",
      "**যুদ্ধসমূহ:** বদর ছাড়া সব যুদ্ধে অংশ নিয়েছেন। উহুদ, খন্দক, খায়বার, মক্কা বিজয়, হুনায়ন, তাবুক। গাতাফান ও যাত আল-রিকা অভিযানে রাসূল উসমানকে মদীনার দায়িত্ব দিয়ে গিয়েছিলেন। ৬৩২ সালে বিদায় হজ্জেও ছিলেন উসমান।",
      "**আবু বকর ও উমরের যুগ:** আবু বকর খলিফা হলে উসমান প্রথম বাইয়াত করলেন উমরের পরে। রিদ্দার যুদ্ধে মদীনায় থেকে আবু বকরকে পরামর্শ দিতেন। আবু বকর মৃত্যুশয্যায় উসমান ও ইবনে আউফকে ডেকে অসিয়ত লিখালেন - উমর হবেন পরবর্তী খলিফা। উমরের খিলাফতকালে উসমান ছিলেন প্রধান উপদেষ্টাদের একজন।",
      "**তৃতীয় খলিফা:** ৬৪৪ সাল। উমর শহীদ হলেন। ৬ সদস্যের কমিটি: আলী, উসমান, আবদুর রহমান, সাদ, যুবাইর, তালহা। তিন দিন আলোচনা। আবদুর রহমান আলীকে জিজ্ঞাসা করলেন: কুরআন, সুন্নাহ এবং আবু বকর ও উমরের নীতি অনুসরণ করবেন? আলী: কুরআন ও সুন্নাহ অনুসরণ করব। উসমানকে একই প্রশ্ন। উসমান: হ্যাঁ, সব শর্ত মানব। আবদুর রহমান উসমানের হাতে বাইয়াত করলেন। উসমান হলেন তৃতীয় খলিফা। বয়স ৭০ বছর।",
      "**কুরআন সংকলন:** ৬৫০ সাল। ইসলাম ছড়িয়ে পড়েছে পারস্য, শাম, উত্তর আফ্রিকায়। হুযাইফা ইবনুল ইয়ামান উসমানকে বললেন: আমিরুল মুমিনীন! কুরআন তিলাওয়াতে পার্থক্য দেখা দিচ্ছে। এক এলাকার মানুষ বলছে আমাদের তিলাওয়াত সঠিক, অন্যরা ভুল! উসমান চিন্তিত হলেন। সিদ্ধান্ত নিলেন। যায়িদ ইবনে সাবিত, আবদুল্লাহ ইবনে যুবাইর, সাঈদ ইবনে আল-আস ও আবদুর রহমান ইবনে হারিসকে নিয়ে কমিটি গঠন করলেন। আবু বকরের সংকলিত কপি ব্যবহার করে প্রমিত কুরআন তৈরি করা হল। কুরাইশ উচ্চারণে লেখা হল। সেই কপি থেকে ৭টি অনুলিপি তৈরি করে মক্কা, শাম, ইয়েমেন, বাহরাইন, বসরা, কুফা ও মদীনায় পাঠানো হল। অন্য সব সংস্করণ পুড়িয়ে ফেলার নির্দেশ দিলেন। এভাবে কুরআন সংরক্ষিত হল। উসমানের সবচেয়ে বড় অবদান।",
      "**বিদ্রোহ ও শাহাদাত:** ১২ বছর শাসনের পর কিছু লোক অসন্তুষ্ট হল। অভিযোগ - আত্মীয়দের গভর্নর বানাচ্ছেন। মিশর, কুফা, বসরা থেকে বিদ্রোহীরা এল। ৬৫৬ সালের জুন। বিদ্রোহীরা উসমানের বাড়ি ঘেরাও করল। সাহাবীরা রক্ষা করতে চাইলেন। আলী (রাঃ) তার দুই ছেলে হাসান ও হুসাইনকে পাঠালেন। উসমান বললেন: না, রক্তপাত চাই না। যে আমার পক্ষে লড়বে সে আমার আনুগত্য থেকে মুক্ত। সবাইকে ফিরিয়ে দিলেন। ১৭ জুন। বিদ্রোহীরা প্রতিবেশীর বাড়ি থেকে লাফ দিয়ে ঢুকল। উসমান কুরআন তিলাওয়াত করছিলেন। রোজা রেখেছিলেন। একজন তার দাড়ি ধরে টানল। উসমান বললেন: আমার দাড়ি ছেড়ে দাও। তোমার পিতা এই দাড়িকে সম্মান করত। বিদ্রোহী ছুরি দিয়ে মাথায় আঘাত করল। স্ত্রী নায়িলা বাঁচাতে এগিয়ে এলেন। তার আঙুল কেটে গেল। আরেক আঘাতে উসমান শহীদ হলেন। বয়স ৮২ বছর। খিলাফত ১২ বছর। কুরআনের পাতায় রক্ত পড়ল। সেই আয়াত: فَسَيَكْفِيكَهُمُ اللَّهُ আল্লাহই তোমার জন্য যথেষ্ট। (সূরা বাকারা: ১৩৭) জান্নাতুল বাকীতে দাফন হলেন। লাজুক, দানশীল, ধৈর্যশীল খলিফা। কুরআন সংরক্ষণকারী।"
    ],
    "moral": "হযরত উসমান (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা চরম প্রতিকূলতা এবং ফিতনার মধ্যেও ধৈর্য এবং বিনয় বজায় রেখে আল্লাহর পথে দৃঢ় থাকতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "ali_ibn_abi_talib",
    "categoryId": "sahabider_jibon",
    "title": "আলী ইবনে আবী তালিব (রাঃ)",
    "paragraphs": [
      "মক্কার কাবা ঘরে এক অলৌকিক জন্ম। ৬০০ সাল, ১৩ রজব। পিতা আবু তালিব ইবনে আব্দুল মুত্তালিব, মা ফাতিমা বিনতে আসাদ। কাবার ভিতরে জন্ম নেওয়ার সৌভাগ্য শুধু আলীর! বনু হাশিম গোত্রের সন্তান। আবু তালিব ছিলেন মুহাম্মাদ (সাঃ)-এর চাচা। পাঁচ বছর বয়সে আবু তালিব দারিদ্র্যে পড়লে মুহাম্মাদ (সাঃ) ও খাদিজা (রাঃ) আলীকে নিজেদের কাছে নিয়ে নেন। বড় হলেন রাসূলের ঘরে।",
      "**প্রথম মুসলিম:** ৬১০ সাল। মুহাম্মাদ (সাঃ) নবুয়ত পেলেন। মাত্র ১১ বছর বয়সী আলী প্রথম দিকে ইসলাম গ্রহণ করলেন। খাদিজা (রাঃ) এর পরেই। ছেলেদের মধ্যে প্রথম। তিন বছর পর রাসূল (সাঃ) আত্মীয়দের দাওয়াত দিলেন। বললেন: কে আমাকে সাহায্য করবে? মাত্র ১৪ বছর বয়সী আলী দাঁড়িয়ে বললেন: আমি! রাসূল (সাঃ) বললেন: আলী আমার ভাই এবং আমার উত্তরসূরি। ইতিহাসবিদ তাবারি এই ঘটনা লিখেছেন।",
      "**হিজরতের রাত:** ৬২২ সাল। কুরাইশরা রাসূলকে হত্যার পরিকল্পনা করল। রাসূল (সাঃ) মদীনায় হিজরত করবেন। কিন্তু কে থাকবে মক্কায়? কে ঝুঁকি নেবে? আলী বললেন: আমি আপনার বিছানায় শুয়ে থাকব। রাসূল (সাঃ) নিজের সবুজ চাদর আলীকে দিলেন। রাতে কুরাইশরা ঘেরাও করল। ভোরে দেখল - আলী! রাসূল পালিয়েছেন! এই ঘটনায় কুরআনের আয়াত নাযিল হয়: আর মানুষের মধ্যে কেউ কেউ আল্লাহর সন্তুষ্টির জন্য নিজের জীবন বিক্রয় করে দেয়। (সূরা বাকারা: ২০৭) আলী আমানত ফেরত দিয়ে তিন দিন পর মদীনায় হিজরত করলেন।",
      "**বিবাহ:** মদীনায় রাসূল (সাঃ) মুসলিমদের ভ্রাতৃত্ব বন্ধন করালেন। আলীকে নিজের ভাই বানালেন। ৬২৩-৬২৫ সাল। আবু বকর ও উমর রাসূলের কন্যা ফাতিমাকে বিয়ের প্রস্তাব দিলেন। রাসূল (সাঃ) প্রত্যাখ্যান করলেন। আলী লজ্জা পেয়ে প্রস্তাব দিতে পারছিলেন না। সাহাবীরা উৎসাহ দিলেন। আলী প্রস্তাব দিলেন। রাসূল (সাঃ) খুশি হলেন। বললেন: আল্লাহ আমাকে নির্দেশ দিয়েছেন ফাতিমাকে আলীর সাথে বিয়ে দিতে। বিয়ে হল। মোহরানা ছিল ৪৮০ দিরহাম। আলী তার বর্ম বিক্রি করে মোহরানা দিলেন। উসমান সেই বর্ম কিনে আলীকে উপহার দিলেন। দুই ছেলে হাসান ও হুসাইন, দুই মেয়ে যয়নাব ও উম্মে কুলসুম। রাসূল (সাঃ) বলেছেন: হাসান ও হুসাইন জান্নাতের যুবকদের সর্দার।",
      "**মুবাহালার ঘটনা:** ৬৩২ সাল। নাজরান থেকে খ্রিস্টান প্রতিনিধি দল এল। ঈসা (আঃ) সম্পর্কে বিতর্ক হল। কুরআনের আয়াত নাযিল হল: এসো, আমরা আমাদের পুত্রদের ও তোমাদের পুত্রদের, আমাদের নারীদের ও তোমাদের নারীদের এবং আমাদের নিজেদের ও তোমাদের নিজেদের ডাকি, তারপর মুবাহালা করি। (সূরা আলে ইমরান: ৬১) রাসূল (সাঃ) মুবাহালার জন্য বের হলেন। সাথে নিলেন আলী, ফাতিমা, হাসান ও হুসাইনকে। খ্রিস্টানরা দেখে ভয় পেল। বলল: এরা আল্লাহর প্রিয় মানুষ। মুবাহালা করলে আমরা ধ্বংস হব। তারা সন্ধি করল।",
      "**সামরিক বীরত্ব:** তাবুক ছাড়া সব যুদ্ধে অংশ নিয়েছেন। তাবুকে রাসূল (সাঃ) আলীকে মদীনার দায়িত্ব দিয়ে গেলেন। আলী মন খারাপ করলেন। রাসূল (সাঃ) বললেন: তুমি কি খুশি নও যে, তুমি আমার কাছে সেই স্থানে আছ যেখানে হারুন ছিলেন মূসার কাছে? তবে আমার পরে কোনো নবী নেই। (সহীহ বুখারী ও মুসলিম) বদরের যুদ্ধে পতাকাবাহী। উহুদে রাসূলকে রক্ষা করলেন। খন্দকে আমর ইবনে আবদ উদকে পরাজিত করলেন। খায়বারে দুর্গের লোহার দরজা উপড়ে ফেললেন! ইহুদি বীর মারহাবকে হত্যা করলেন। রাসূল (সাঃ) বলেছেন: আগামীকাল আমি এমন একজনকে পতাকা দেব যে আল্লাহ ও তার রাসূলকে ভালোবাসে এবং আল্লাহ ও তার রাসূল তাকে ভালোবাসেন। পরদিন আলীকে পতাকা দিলেন। উহুদে আল্লাহর পক্ষ থেকে আওয়াজ এল: লা সাইফা ইল্লা যুলফিকার, ওয়া লা ফাতা ইল্লা আলী - যুলফিকার ছাড়া কোনো তলোয়ার নেই, আলী ছাড়া কোনো বীর নেই!",
      "**রাসূলের মৃত্যু:** ৬৩২ সাল। রাসূল (সাঃ) মারা গেলেন। আলী শোকে ভেঙে পড়লেন। রাসূলের গোসল, কাফন, দাফন - সব আলী করলেন। সাকিফায় খিলাফত নির্বাচন হচ্ছিল। আলী রাসূলের দাফনে ব্যস্ত ছিলেন। আবু বকর খলিফা হলেন। আলী পরে বাইয়াত করলেন। ফাতিমা (রাঃ) ৬ মাস পর মারা গেলেন। আলী একাকী হয়ে গেলেন।",
      "**আবু বকর ও উমরের যুগ:** আলী ছিলেন প্রধান উপদেষ্টা। কুরআন ও হাদিসের জ্ঞানে অতুলনীয়। উমর বলতেন: আলী না থাকলে উমর ধ্বংস হত! কঠিন মামলায় আলীর পরামর্শ নিতেন। রাসূল (সাঃ) বলেছেন: আমি জ্ঞানের শহর, আলী তার দরজা। উসমানের খিলাফতকালেও উপদেষ্টা ছিলেন।",
      "**চতুর্থ খলিফা:** ৬৫৬ সাল। উসমান শহীদ হলেন। মুসলিমরা আলীর কাছে এল। বলল: আপনি খলিফা হন। আলী রাজি হলেন না। বললেন: আমাকে ছেড়ে দাও। আমি উপদেষ্টা হতে চাই। কিন্তু মুহাজির ও আনসাররা জোর করল। আলী বললেন: তাহলে মসজিদে বাইয়াত হতে হবে, গোপনে নয়। মসজিদে নববীতে বাইয়াত হল। আলী হলেন চতুর্থ খলিফা। বয়স ৫৬ বছর।",
      "**উটের যুদ্ধ:** ৬৫৬ সাল। আয়েশা (রাঃ), তালহা ও যুবাইর বসরায় গেলেন। দাবি - উসমানের হত্যাকারীদের বিচার করো। আলী বললেন: আগে শান্তি ফিরুক, তারপর বিচার। যুদ্ধ হল। তালহা ও যুবাইর শহীদ হলেন। আয়েশা (রাঃ) উটের হাওদায় ছিলেন। আলী সম্মানের সাথে তাকে মদীনায় পাঠালেন।",
      "**সিফফিনের যুদ্ধ:** ৬৫৭ সাল। মুয়াবিয়া শামে খলিফা মানলেন না। সিফফিনে যুদ্ধ হল। আলীর বাহিনী জিতছিল। হঠাৎ মুয়াবিয়ার সৈন্যরা বর্শার মাথায় কুরআন তুলল। বলল: কুরআনের ফয়সালা চাই! আলী বুঝলেন এটা ফাঁদ। কিন্তু সৈন্যরা যুদ্ধ বন্ধ করল। সালিশি হল। আলী ক্ষতিগ্রস্ত হলেন।",
      "**খারিজিদের বিদ্রোহ:** কিছু সৈন্য বলল: সালিশি মানি না! শুধু আল্লাহর হুকুম! তারা আলী থেকে আলাদা হয়ে গেল। নাম হল খারিজি। নাহরাওয়ানে যুদ্ধ হল। খারিজিরা পরাজিত হল। কিন্তু তারা প্রতিশোধ নিতে চাইল।",
      "**শাহাদাত:** ৬৬১ সাল, ১৯ রমজান। ফজরের নামাযের জন্য মসজিদে গেলেন। খারিজি আবদুর রহমান ইবনে মুলজাম বিষাক্ত তলোয়ার দিয়ে মাথায় আঘাত করল। আলী বললেন: কাবার রবের শপথ, আমি সফল হয়েছি! দুই দিন পর ২১ রমজান শহীদ হলেন। বয়স ৬১ বছর। খিলাফত ৫ বছর। নাজাফে দাফন হলেন। উপাধি: আসাদুল্লাহ (আল্লাহর সিংহ), হায়দার (সিংহ), আবুল হাসান। জ্ঞান, বীরত্ব, ন্যায়পরায়ণতার প্রতীক। রাসূল (সাঃ) বলেছেন: আমি জ্ঞানের শহর, আলী তার দরজা।"
    ],
    "moral": "হযরত আলী (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা জ্ঞান, শক্তি ও সাহসিকতাকে ইসলামের পথে ব্যবহার করে চরম প্রতিকূলতার মধ্যেও ন্যায়ের ওপর অটল থাকতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "talha_ibn_ubaydullah",
    "categoryId": "sahabider_jibon",
    "title": "তালহা ইবনে উবাইদুল্লাহ (রাঃ)",
    "paragraphs": [
      "মক্কার বনু তাইম গোত্রে জন্ম। নাম তালহা ইবনে উবাইদুল্লাহ। পিতা উবাইদুল্লাহ ইবনে উসমান, মা সাবা বিনতে হাদরামি। ধনী ব্যবসায়ী পরিবার। জন্ম ৫৯৪ সাল। সুদর্শন, লম্বা, ফর্সা চেহারা। চুল ঘন ও কোঁকড়ানো। শক্তিশালী গড়ন। তীরন্দাজিতে পারদর্শী। মক্কার যুবকদের মধ্যে সম্মানিত। কে জানত এই যুবক হবেন আশারায়ে মুবাশশারার একজন!",
      "**ব্যবসায়ী জীবন:** পিতার মতো তালহাও ব্যবসায়ী হলেন। সিরিয়া, ইরাক, ইয়েমেন - সব জায়গায় বাণিজ্য করতেন। সৎ ব্যবসায়ী হিসেবে পরিচিত ছিলেন। অল্প বয়সেই সফল হয়ে উঠলেন। মক্কায় তার ব্যবসার সুনাম ছিল। মানুষ তাকে বিশ্বাস করত।",
      "**ইসলাম গ্রহণ:** ৬১০ সাল। তালহা সিরিয়ায় ব্যবসায়িক সফরে গিয়েছিলেন। বসরা শহরের বাজারে একজন খ্রিস্টান পাদ্রী ছিলেন। নাম বাহিরা। বয়স্ক, জ্ঞানী মানুষ। তিনি আরব বণিকদের সাথে কথা বলতেন। একদিন তালহার সাথে কথা হল। বাহিরা জিজ্ঞাসা করলেন: তুমি কোথা থেকে এসেছ? তালহা: মক্কা থেকে। বাহিরা: মক্কায় কি কোনো নতুন ঘটনা ঘটেছে? তালহা: না তো, কিছু শুনিনি। বাহিরা গম্ভীর স্বরে বললেন: তাহলে শোনো। হারাম শরিফে একজন নবীর আবির্ভাব হয়েছে। তার নাম আহমাদ। তিনি শেষ নবী। তাওরাত ও ইঞ্জিলে তার ভবিষ্যদ্বাণী আছে। তুমি মক্কায় ফিরে তাকে খুঁজে বের করো এবং তার অনুসরণ করো। তালহার মনে গভীর প্রভাব পড়ল। তাড়াতাড়ি ব্যবসা শেষ করে মক্কায় ফিরলেন।",
      "**আবু বকরের সাথে দেখা:** মক্কায় ফিরে শুনলেন মুহাম্মাদ ইবনে আবদুল্লাহ নবুয়ত দাবি করেছেন। তালহার মনে পড়ল বাহিরার কথা। কিন্তু কীভাবে যাবেন? তখন বন্ধু আবু বকরের সাথে দেখা। আবু বকর ইতিমধ্যে মুসলমান হয়ে গেছেন। তালহাকে বললেন: চলো, আমি তোমাকে নবীর কাছে নিয়ে যাই। দুজনে গেলেন রাসূল (সাঃ) এর কাছে। রাসূল (সাঃ) ইসলামের দাওয়াত দিলেন। কুরআন তিলাওয়াত করলেন। তালহার হৃদয় কেঁপে উঠল। সাথে সাথে ঈমান আনলেন। হলেন অষ্টম মুসলিম। প্রথম দিকের মুসলিমদের একজন। রাসূল (সাঃ) খুশি হলেন।",
      "**নির্যাতন:** ইসলাম গ্রহণের খবর ছড়িয়ে পড়ল। চাচা নাওফাল ইবনে খুওয়াইলিদ - খাদিজা (রাঃ) এর চাচাতো ভাই - রাগে ফেটে পড়লেন। তিনি ছিলেন কুরাইশদের শক্তিশালী নেতা। একদিন তালহা ও আবু বকর একসাথে ছিলেন। নাওফাল তাদের ধরে ফেললেন। দুজনকে একসাথে শক্ত করে বেঁধে ফেললেন। মারধর করলেন। বললেন: তোমরা মুহাম্মাদের ধর্ম ছাড়ো! তালহা ও আবু বকর দুজনেই অস্বীকার করলেন। নাওফাল তাদের সারাদিন বেঁধে রাখলেন। সন্ধ্যায় ছেড়ে দিলেন কিন্তু হুমকি দিলেন। এই ঘটনার পর তালহার একটি বিশেষ উপাধি হল - 'কারিনুল আবু বকর' অর্থাৎ আবু বকরের সাথী। কারণ তারা একসাথে নির্যাতিত হয়েছিলেন।",
      "**মক্কায় ধৈর্য:** নির্যাতন চলতে লাগল। কিন্তু তালহা ঈমান ছাড়লেন না। গোপনে রাসূল (সাঃ) এর সাথে দেখা করতেন। অন্যান্য মুসলিমদের সাহায্য করতেন। নিজের সম্পদ দিয়ে দরিদ্র মুসলিমদের সাহায্য করতেন। ধৈর্যের সাথে কষ্ট সহ্য করতেন।",
      "**মদীনায় হিজরত:** ৬২২ সাল। রাসূল (সাঃ) মদীনায় হিজরত করলেন। তালহাও হিজরত করলেন। কিন্তু একটি বিশেষ ঘটনা ঘটল। তালহা ব্যবসায়িক কাজে সিরিয়ায় গিয়েছিলেন। ফেরার পথে মদীনায় পৌঁছলেন। শুনলেন রাসূল (সাঃ) বদরের যুদ্ধে গেছেন। তালহা দ্রুত যেতে চাইলেন কিন্তু পৌঁছতে পারলেন না। যুদ্ধ শেষ হয়ে গিয়েছিল। তালহা অত্যন্ত দুঃখিত হলেন যে বদরে অংশ নিতে পারলেন না। কিন্তু রাসূল (সাঃ) তাকে সান্ত্বনা দিয়ে বললেন: তুমি ব্যবসায়িক কাজে ছিলে, এটা তোমার দোষ নয়। তোমার জন্য বদরের সওয়াব আছে এবং গনিমতের অংশও আছে। তালহা খুশি হলেন। রাসূল (সাঃ) তালহাকে কা'ব ইবনে মালিকের সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**উহুদের বীরত্ব:** ৬২৫ সাল, শাওয়াল মাস। উহুদের যুদ্ধ। এই যুদ্ধে তালহার অসাধারণ বীরত্ব প্রকাশ পেল। যুদ্ধ শুরু হল। প্রথমে মুসলিমরা জয়ী হচ্ছিলেন। কিন্তু তীরন্দাজরা পাহাড় ছেড়ে চলে গেলে খালিদ ইবনে ওয়ালিদ পেছন থেকে আক্রমণ করলেন। মুসলিমরা বিক্ষিপ্ত হয়ে গেলেন। রাসূল (সাঃ) আহত হলেন। মুখে আঘাত লাগল। দাঁত ভেঙে গেল। শিরস্ত্রাণের কড়া মুখে ঢুকে গেল। কাফিররা চারদিক থেকে রাসূলকে ঘিরে ফেলল। এই মুহূর্তে তালহা এগিয়ে এলেন। রাসূলের সামনে ঢাল হয়ে দাঁড়ালেন। তীর এলে নিজের শরীর দিয়ে আটকালেন। তলোয়ার এলে হাত দিয়ে আটকালেন। ডান হাত কেটে গেল। আঙুল অবশ হয়ে গেল। কিন্তু তালহা পিছু হটলেন না। রাসূলকে রক্ষা করতে থাকলেন। মুসআব ইবনে উমাইর শহীদ হলেন। আবু উবাইদা, আবু বকর, আলী - সবাই রাসূলকে রক্ষা করছেন। কিন্তু তালহার বীরত্ব ছিল অতুলনীয়। তার শরীরে ৭০টিরও বেশি আঘাত লাগল। তীর, তলোয়ার, বর্শা - সব ধরনের আঘাত। কিন্তু তিনি রাসূলকে ছাড়লেন না। রাসূল (সাঃ) পরে বলেছেন: 'উহুদের দিন যে জান্নাত দেখতে চায়, সে যেন তালহার দিকে তাকায়।' আরেকটি বর্ণনায় আছে: 'তালহা সেদিন শহীদদের মর্যাদা অর্জন করেছে।' আবু বকর (রাঃ) বলেছেন: 'সেদিন তালহা ছিল আমাদের সবার চেয়ে ভালো।'",
      "**উপাধি:** উহুদের বীরত্বের জন্য তালহাকে বিশেষ উপাধি দেওয়া হল। 'তালহাতুল খায়ের' - ভালো তালহা। 'তালহাতুল ফাইয়্যাদ' - দানশীল তালহা। কারণ তিনি শুধু যুদ্ধেই নয়, দানশীলতায়ও অসাধারণ ছিলেন। নিজের সম্পদ আল্লাহর পথে ব্যয় করতেন।",
      "**খন্দক ও পরবর্তী যুদ্ধ:** ৬২৭ সাল। খন্দকের যুদ্ধে তালহা পরিখা খননে অংশ নিলেন। যুদ্ধে বীরত্ব দেখালেন। ৬২৮ সাল। হুদাইবিয়ার সন্ধিতে উপস্থিত ছিলেন। ৬২৯ সাল। খায়বার বিজয়ে অংশ নিলেন। ৬৩০ সাল। মক্কা বিজয়ে রাসূলের সাথে ছিলেন। হুনায়ন ও তাবুক অভিযানেও অংশ নিলেন। প্রতিটি যুদ্ধে তালহা ছিলেন সামনের সারিতে।",
      "**দানশীলতা:** তালহা ছিলেন অত্যন্ত ধনী। কিন্তু সম্পদ তাকে আল্লাহ থেকে দূরে রাখেনি। বরং আল্লাহর পথে খরচ করতেন। একবার হাদরামাউত থেকে ৭০০,০০০ দিরহাম আয় হল। সারারাত ঘুমাতে পারলেন না। ভাবলেন: এত সম্পদ নিয়ে আল্লাহর কাছে যাব কীভাবে? সকালে আত্মীয়-স্বজন ও দরিদ্রদের মধ্যে সব বিতরণ করে দিলেন। স্ত্রী বললেন: আমাদের জন্য কিছু রাখলেন না? তালহা হেসে বললেন: আল্লাহ আরো দেবেন।",
      "**রাসূলের মৃত্যুর পর:** ৬৩২ সাল। রাসূল (সাঃ) মৃত্যুবরণ করলেন। তালহা গভীরভাবে শোকাহত হলেন। আবু বকর খলিফা হলে তালহা তার প্রধান সমর্থকদের একজন ছিলেন। রিদ্দার যুদ্ধে অংশ নিলেন। উমরের খিলাফতকালেও গুরুত্বপূর্ণ ভূমিকা পালন করলেন। উমর শহীদ হলে ৬ সদস্যের কমিটিতে ছিলেন তালহা। উসমান খলিফা নির্বাচিত হলেন।",
      "**উসমানের খিলাফত:** উসমানের খিলাফতকালে তালহা কুফায় ছিলেন। সেখানে ইসলাম প্রচার ও শিক্ষাদান করতেন। উসমানের শেষ দিকে ফিতনা শুরু হল। বিদ্রোহীরা উসমানকে ঘেরাও করল। তালহা মদীনায় ছিলেন না। ফিরে এসে শুনলেন উসমান শহীদ হয়েছেন। তালহা অত্যন্ত দুঃখিত হলেন।",
      "**আলীর খিলাফত:** আলী (রাঃ) খলিফা হলেন। তালহা ও যুবাইর প্রথমে বাইয়াত করলেন। কিন্তু পরে তারা চাইলেন উসমানের হত্যাকারীদের দ্রুত বিচার হোক। আলী বললেন: এখন পরিস্থিতি নিয়ন্ত্রণে আনতে হবে। বিচার পরে হবে। তালহা ও যুবাইর সন্তুষ্ট হলেন না। আয়েশা (রাঃ) ও একই মত পোষণ করলেন। তারা বসরায় গেলেন।",
      "**উটের যুদ্ধ:** ৬৫৬ সাল, জমাদিউস সানি। বসরায় উটের যুদ্ধ হল। আয়েশা (রাঃ) উটে ছিলেন বলে এই নাম। তালহা ও যুবাইর এক পক্ষে, আলী অন্য পক্ষে। কিন্তু কেউই যুদ্ধ চাননি। উভয় পক্ষ আলোচনা করছিলেন। কিন্তু আবদুল্লাহ ইবনে সাবা নামক মুনাফিকদের দল রাতে গোপনে আক্রমণ শুরু করল। উভয় পক্ষ ভাবল অন্য পক্ষ আক্রমণ করেছে। যুদ্ধ শুরু হয়ে গেল।",
      "**শাহাদাত:** যুদ্ধক্ষেত্রে তালহা ঘোড়ায় চড়ে ছিলেন। আলী (রাঃ) এর পক্ষের একজন সৈনিক - মারওয়ান ইবনুল হাকাম - তালহাকে লক্ষ্য করে তীর ছুঁড়ল। তীর তালহার পায়ে বিঁধল। রগ কেটে গেল। রক্তপাত শুরু হল। তালহা ঘোড়া থেকে পড়ে গেলেন। সাথীরা তাকে বসরা শহরে নিয়ে গেলেন। কিন্তু রক্তপাত বন্ধ হল না। তালহা বুঝলেন শেষ সময় এসে গেছে। শেষ কথা বললেন: আমি সাক্ষ্য দিচ্ছি লা ইলাহা ইল্লাল্লাহ। মুহাম্মাদ রাসূলুল্লাহ। শাহাদাত বরণ করলেন। বয়স ৬২-৬৪ বছর। বসরায় দাফন করা হল।",
      "**আলীর শোক:** আলী (রাঃ) তালহার শাহাদাতের খবর শুনে কাঁদলেন। বললেন: তালহা জান্নাতে। রাসূল (সাঃ) তাকে জান্নাতের সুসংবাদ দিয়েছেন। এই যুদ্ধ আমরা কেউই চাইনি। মুনাফিকরা এই ফিতনা সৃষ্টি করেছে। তালহার লাশের কাছে গিয়ে দোয়া করলেন। বললেন: হে আল্লাহ! তালহাকে ক্ষমা করো। সে তোমার রাসূলের সাথী ছিল। বদরী সাহাবী না হলেও বদরের সওয়াব পেয়েছিল। উহুদে রাসূলকে রক্ষা করেছিল। আশারায়ে মুবাশশারার একজন ছিল।",
      "**মর্যাদা:** তালহা ইবনে উবাইদুল্লাহ (রাঃ) - আশারায়ে মুবাশশারা, জান্নাতের সুসংবাদপ্রাপ্ত। উহুদের বীর। দানশীল সাহাবী। আবু বকরের সাথী। রাসূলের প্রিয়। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "moral": "হযরত তালহা (রাঃ)-এর জীবন প্রমাণ করে যে, চরম সাহসিকতা ও দানশীলতার মাধ্যমে একজন ব্যক্তি জান্নাতের সুসংবাদপ্রাপ্ত হতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "zubayr_ibn_al_awwam",
    "categoryId": "sahabider_jibon",
    "title": "যুবাইর ইবনুল আওয়াম (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। যুবাইর ইবনুল আওয়াম। বনু আসাদ গোত্র। রাসূল (সাঃ) এর ফুফাতো ভাই। মা সাফিয়্যা - রাসূলের ফুফু। খাদিজা (রাঃ) এর ভাগ্নে। প্রথম দিকে ইসলাম গ্রহণকারী - চতুর্থ বা পঞ্চম জন। বয়স মাত্র ১৫-১৬ বছর।",
      "**নির্যাতন:** চাচা তাকে রশি দিয়ে বেঁধে ধোঁয়া দিতেন। বলতেন: ইসলাম ত্যাগ করো। যুবাইর বলতেন: না, কখনো না। চাচা হার মানলেন।",
      "**প্রথম তলোয়ার:** একবার গুজব ছড়াল - রাসূল (সাঃ) কে মেরে ফেলা হয়েছে। ১৬ বছর বয়সী যুবাইর তলোয়ার নিয়ে বের হলেন। রাসূল (সাঃ) এর সাথে দেখা। রাসূল (সাঃ) জিজ্ঞাসা করলেন: কোথায় যাচ্ছ? যুবাইর বললেন: যে আপনাকে মেরেছে তাকে মারতে। রাসূল (সাঃ) দোয়া করলেন। বললেন: ইসলামে তলোয়ার উঁচু করা প্রথম ব্যক্তি যুবাইর।",
      "**হাওয়ারী:** রাসূল (সাঃ) বলেছেন: প্রত্যেক নবীর হাওয়ারী (বিশেষ সাথী) থাকে। আমার হাওয়ারী যুবাইর। খন্দকের যুদ্ধে রাসূল (সাঃ) বললেন: কে বনু কুরাইযার খবর আনবে? যুবাইর স্বেচ্ছায় গেলেন। দুইবার গেলেন। রাসূল (সাঃ) বললেন: আমার পিতা-মাতা যুবাইরের জন্য কুরবান।",
      "**সব যুদ্ধে:** বদর, উহুদ, খন্দক, খায়বার, মক্কা বিজয় - সব যুদ্ধে বীরত্ব দেখিয়েছেন। খায়বারে দুর্গের প্রাচীর বেয়ে উঠেছিলেন।",
      "**আশারায়ে মুবাশশারা:** দশজন জান্নাতের সুসংবাদপ্রাপ্ত সাহাবীর একজন।",
      "**উটের যুদ্ধ:** তালহার সাথে বসরায় গেলেন। যুদ্ধক্ষেত্রে আলী (রাঃ) তাকে ডাকলেন। বললেন: রাসূল (সাঃ) কি বলেননি তুমি আমার বিরুদ্ধে অন্যায়ভাবে লড়বে? যুবাইর মনে পড়ল। যুদ্ধক্ষেত্র ছেড়ে চলে গেলেন।",
      "**শাহাদাত:** ফেরার পথে ঘুমিয়ে ছিলেন। আমর ইবনে জুরমুজ নামে এক মুনাফিক এসে হত্যা করল। বয়স ৬৭ বছর। আলী (রাঃ) শুনে কাঁদলেন। বললেন: হত্যাকারী জাহান্নামে যাবে। রাসূল (সাঃ) বলেছিলেন: যুবাইরের হত্যাকারী জাহান্নামে। বীর যোদ্ধা, রাসূলের হাওয়ারী।"
    ],
    "moral": "হযরত যুবাইর (রাঃ)-এর জীবন প্রমাণ করে যে, একজন মুজাহিদ তাঁর বীরত্ব এবং রাসূল (সাঃ)-এর প্রতি আনুগত্যের মাধ্যমে সর্বকালে সম্মানিত হন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "ammar_ibn_yasir",
    "categoryId": "sahabider_jibon",
    "title": "আম্মার ইবনে ইয়াসির (রাঃ)",
    "paragraphs": [
      "হযরত আম্মার ইবনে ইয়াসির (রাঃ)-এর পূর্ণ নাম হলো আম্মার ইবনে ইয়াসির ইবনে আমির আল-আনাসী। তিনি ছিলেন ইসলামের প্রথম দিককার নির্যাতিত সাহাবীদের অন্যতম এবং শাহাদাতের জন্য বিখ্যাত। তাঁর উপাধি ছিল 'আবুল ইয়াকযান'। তিনি রাসূল (সাঃ)-এর কাছে অত্যন্ত প্রিয় ছিলেন এবং তাঁর সততা ও নিষ্ঠা ছিল সর্বজনস্বীকৃত।",
      "জন্ম ও বংশ পরিচয়\n\nতিনি মক্কায় জন্মগ্রহণ করেন। তাঁর পরিবার ইয়ামেন থেকে মক্কায় এসেছিল এবং কুরাইশ গোত্রের মিত্র ছিল, কিন্তু তারা ছিল দুর্বল ও রক্ষকহীন। ইসলাম গ্রহণ\n\nতিনি ছিলেন ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। তিনি প্রায় ১১ জনের পরে ইসলাম গ্রহণ করেন।",
      "নির্যাতন\n\nতাঁর পুরো পরিবার—আম্মার (রাঃ), তাঁর পিতা ইয়াসির (রাঃ) এবং তাঁর মা সুমাইয়্যা (রাঃ) কুরাইশদের হাতে অকথ্য নির্যাতনের শিকার হন। তাঁদেরকে মক্কার গরম বালিতে দিনের পর দিন নির্যাতন করা হতো। শাহাদাতের মর্যাদা\n\nতাঁর মা সুমাইয়্যা (রাঃ) ছিলেন ইসলামের প্রথম শহীদ, যাঁকে আবু জাহল নির্মমভাবে হত্যা করে। তাঁর পিতা ইয়াসির (রাঃ)-ও নির্যাতনে শহীদ হন।",
      "রাসূল (সাঃ)-এর সান্ত্বনা\n\nরাসূল (সাঃ) তাঁদের নির্যাতন সহ্য করতে দেখে বলেছিলেন: 'ধৈর্য ধারণ করো, হে ইয়াসিরের পরিবার, তোমাদের জন্য জান্নাতের ওয়াদা দেওয়া হলো।' আম্মারের পরীক্ষা ও মুক্তি\n\nআম্মার (রাঃ)-কে চরম নির্যাতনের মুখে রাসূল (সাঃ) ও ইসলামকে অস্বীকার করতে বাধ্য করা হয়েছিল। যদিও তিনি বাহ্যিকভাবে তা করেছিলেন, কিন্তু তাঁর হৃদয়ে ঈমান অটুট ছিল।",
      "আল্লাহর ক্ষমা\n\nআম্মার (রাঃ) আল্লাহর কাছে ক্ষমা প্রার্থনা করলে, আল্লাহ তা'আলা ওহী নাযিল করে তাঁর জন্য ক্ষমা ঘোষণা করেন (সূরা নাহল, ১৬:১০৬), যেখানে চরম পরিস্থিতিতে বাধ্য হয়ে কুফরী কথা বলার বৈধতা দেওয়া হয়। হিজরত ও মদীনার জীবন\n\nতিনি মদীনায় হিজরত করেন এবং প্রথম মসজিদ, মসজিদে নববী নির্মাণের কাজে সক্রিয়ভাবে অংশগ্রহণ করেন।",
      "নির্মাণ কাজে ভূমিকা\n\nমসজিদে নববী নির্মাণের সময় তাঁকে দ্বিগুণ ভার বহন করতে দেখা যায়। রাসূল (সাঃ) তাঁর মাথায় লেগে থাকা ধুলো ঝেড়ে দেন এবং তাঁর প্রতি বিশেষ স্নেহ প্রকাশ করেন। সামরিক ভূমিকা\n\nতিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল যুদ্ধে অংশগ্রহণ করেন এবং তাঁর বীরত্ব ও নিষ্ঠা ছিল অতুলনীয়। জ্ঞানের মর্যাদা",
      "হযরত উমর (রাঃ) তাঁকে কুফার গভর্নর নিযুক্ত করেন। তিনি ফিকহ ও জ্ঞান বিতরণেও অবদান রাখেন।\n\nআলী (রাঃ)-এর পক্ষে\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি হযরত আলী (রাঃ)-এর পক্ষ অবলম্বন করেন। শাহাদাতের ভবিষ্যদ্বাণী",
      "রাসূল (সাঃ) তাঁর সম্পর্কে ভবিষ্যদ্বাণী করেছিলেন: 'আফসোসের বিষয় আম্মারের জন্য! তোমাকে একটি বিদ্রোহী দল হত্যা করবে। তুমি তাদের জান্নাতের দিকে আহ্বান করবে, আর তারা তোমাকে জাহান্নামের দিকে আহ্বান করবে।'\n\nশাহাদাত\n\n৩৭ হিজরিতে (৬৫৮ খ্রিস্টাব্দে) সিফফিনের যুদ্ধে তিনি মুয়াবিয়া (রাঃ)-এর পক্ষের বিদ্রোহী দলের হাতে শহীদ হন। ভবিষ্যদ্বাণীর প্রমাণ",
      "**আলীর পক্ষে:** উসমান শহীদ হলেন। আম্মার আলীর পক্ষ নিলেন। সিফফিনের যুদ্ধে অংশ নিলেন।",
      "**শাহাদাত:** ৬৫৭ সাল। সিফফিনে শহীদ হলেন। বয়স ৯০+ বছর। রাসূলের ভবিষ্যদ্বাণী সত্য হল।"
    ],
    "moral": "হযরত আম্মার (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে চরম নিপীড়ন ও নির্যাতনের মুখেও ঈমানের ওপর অটল থাকলেই জান্নাতের ওয়াদা পূরণ হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "khalid_ibn_al_walid",
    "categoryId": "sahabider_jibon",
    "title": "খালিদ ইবনে ওয়ালিদ (রাঃ)",
    "paragraphs": [
      "মক্কার বনু মাখযুম গোত্রে জন্ম। নাম খালিদ ইবনে ওয়ালিদ। জন্ম ৫৮৫ সাল। পিতা ওয়ালিদ ইবনুল মুগিরা - কুরাইশদের নেতা। ছোটবেলা থেকে তীরন্দাজি, তলোয়ার চালনা, অশ্বারোহণে দক্ষ। কুরাইশদের সেরা যোদ্ধা।",
      "**ইসলামের শত্রু:** উহুদের যুদ্ধ, ৬২৫ সাল। খালিদ তখন কাফির। মুসলিম তীরন্দাজরা পাহাড় ছেড়ে চলে গেলে খালিদ পেছন থেকে আক্রমণ করলেন। মুসলিমরা পরাজিত হলেন। খালিদের কৌশল!",
      "**ইসলাম গ্রহণ:** ৬২৯ সাল। হুদাইবিয়ার সন্ধির পর। খালিদ ভাবলেন: মুহাম্মাদ সত্যিই নবী। রাসূল বললেন: খালিদের মতো বুদ্ধিমান মানুষ ইসলাম থেকে দূরে থাকতে পারে না। খালিদ আমর ইবনুল আস ও উসমান ইবনে তালহার সাথে মদীনায় গেলেন। রাসূল খুশি হয়ে বললেন: মক্কা তার কলিজার টুকরো আমাদের কাছে পাঠিয়ে দিয়েছে!",
      "**মুতার যুদ্ধ:** ৬২৯ সাল। রোমান সাম্রাজ্যের বিরুদ্ধে যুদ্ধ। মুসলিম ৩,০০০, শত্রু ২,০০,০০০! যায়িদ শহীদ হলেন। জাফর শহীদ হলেন। আবদুল্লাহ শহীদ হলেন। খালিদ পতাকা তুলে নিলেন। অসাধারণ কৌশলে সেনাবাহিনী নিরাপদে ফিরিয়ে আনলেন। রাসূল বললেন: খালিদ আল্লাহর তলোয়ার! সেদিন থেকে উপাধি - সাইফুল্লাহ।",
      "**মক্কা বিজয়:** ৬৩০ সাল। খালিদ এক দলের নেতৃত্ব দিলেন। বিনা রক্তপাতে মক্কা বিজয়। হুনায়ন ও তায়েফের যুদ্ধেও নেতৃত্ব দিলেন।",
      "**রিদ্দার যুদ্ধ:** ৬৩২ সাল। রাসূল মারা গেলেন। আরবের বিভিন্ন গোত্র ইসলাম ত্যাগ করল। আবু বকর খালিদকে পাঠালেন। মুসাইলিমা কাযযাব - মিথ্যা নবী। ৪০,০০০ সৈন্য। ইয়ামামার যুদ্ধ। ভয়াবহ যুদ্ধ। ৭০০ হাফিজ শহীদ হলেন। খালিদ মুসাইলিমাকে হত্যা করলেন।",
      "**ইরাক বিজয়:** ৬৩৩ সাল। পারস্য সাম্রাজ্যের বিরুদ্ধে যুদ্ধ। উল্লাইস, হিরা, আনবার - একের পর এক বিজয়। ৪ মাসে ইরাকের বেশিরভাগ অংশ বিজয়!",
      "**শামে অভিযান:** ৬৩৪ সাল। আবু বকর খালিদকে শামে পাঠালেন। ইরাক থেকে শাম - ৫ দিনে মরুভূমি পার! অসম্ভব যাত্রা। বসরা, দামেস্ক - একের পর এক বিজয়।",
      "**ইয়ারমুকের যুদ্ধ:** ৬৩৬ সাল। ইসলামের ইতিহাসে সবচেয়ে গুরুত্বপূর্ণ যুদ্ধ। রোমান সাম্রাজ্য ২,৪০,০০০ সৈন্য। মুসলিম ৪০,০০০। খালিদ সেনাপতি। ৬ দিন যুদ্ধ। খালিদের কৌশল অতুলনীয়। রোমানরা পরাজিত। শাম মুসলিমদের হাতে।",
      "**পদচ্যুতি:** উমর খলিফা হলেন। খালিদকে সেনাপতি পদ থেকে সরিয়ে দিলেন। কেন? উমর ভয় পেলেন - মানুষ খালিদকে নিয়ে গর্ব করবে, আল্লাহকে ভুলে যাবে। খালিদ কিছু বললেন না। সাধারণ সৈনিক হয়ে যুদ্ধ চালিয়ে গেলেন। আনুগত্যের অনন্য উদাহরণ!",
      "**মৃত্যু:** ৬৪২ সাল। হিমস বা মদীনায় মৃত্যু। বয়স ৫৭ বছর। মৃত্যুশয্যায় বললেন: আমি ১০০টিরও বেশি যুদ্ধে লড়েছি। আমার শরীরে এমন কোনো জায়গা নেই যেখানে তলোয়ার বা তীরের আঘাত নেই। অথচ আমি বিছানায় মরছি উটের মতো। কাপুরুষদের চোখে ঘুম আসুক না! ১০০+ যুদ্ধ, একটিও পরাজয় নেই! সাইফুল্লাহ - আল্লাহর তলোয়ার।"
    ],
    "moral": "হযরত খালিদ ইবনে ওয়ালিদ (রাঃ)-এর জীবন প্রমাণ করে যে, একজন শ্রেষ্ঠ সামরিক কমান্ডার তাঁর জীবনের সমস্ত দক্ষতা ব্যক্তিগত খ্যাতি নয়, বরং আল্লাহর পথে উৎসর্গ করতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "sahabi_id": "abu_ubaydah_ibn_al_jarrah",
    "title": "আবু উবাইদাহ ইবনুল জাররাহ (রাঃ)",
    "paragraphs": [
      "হযরত আবু উবাইদাহ (রাঃ)-এর পূর্ণ নাম হলো আমের ইবনে আব্দুল্লাহ ইবনে আল-জাররাহ আল-ফিহরী আল-কুরাইশী। তিনি ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং ইসলামের একজন শ্রেষ্ঠ সেনাপতি। তাঁর উপাধি ছিল 'আমীনুল উম্মাহ' (উম্মতের আমানতদার), যা রাসূল (সাঃ) তাঁকে প্রদান করেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় কুরাইশ গোত্রের বনু ফিহর শাখায় জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিকের ইসলাম গ্রহণকারী।\n\nনির্যাতন\n\nইসলাম গ্রহণের কারণে তিনিও কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন। হিজরত ও সান্নিধ্য",
      "তিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন। সামরিক ভূমিকা: উহুদ যুদ্ধ\n\nউহুদের যুদ্ধে তিনি চরম বীরত্ব প্রদর্শন করেন। যখন রাসূল (সাঃ)-এর চেহারা মুবারকে লৌহবর্মের দুটি কড়া ঢুকে গিয়েছিল, তখন আবু উবাইদাহ (রাঃ) নিজের দাঁত দিয়ে সেগুলো টেনে বের করেন।\n\nএই সময় তিনি নিজের দুটি দাঁত হারান, যা তাঁর গভীর ভালোবাসা ও আত্মত্যাগের প্রমাণ। আমীনুল উম্মাহ উপাধি",
      "নবী (সাঃ) একবার নাজরানের খ্রিস্টানদের প্রতিনিধি দলকে তাঁর সম্পর্কে বলেন: 'আমি তোমাদের এমন একজনকে পাঠাব, যিনি আমানতদারিতে অতুলনীয়।' পরে তিনি আবু উবাইদাহ (রাঃ)-কে প্রেরণ করেন এবং তাঁকে আমীনুল উম্মাহ উপাধি দেন।\n\nখিলাফতের ভূমিকা\n\nহযরত আবু বকর (রাঃ) এবং উমর (রাঃ)-এর খিলাফতকালে তিনি সিরিয়ার মুসলিম বাহিনীর প্রধান সেনাপতি ছিলেন। সামরিক বিজয়: সিরিয়া বিজয়",
      "তিনি রোমানদের বিরুদ্ধে পরিচালিত যুদ্ধে নেতৃত্ব দেন এবং সিরিয়ার বিস্তীর্ণ অঞ্চল, বিশেষ করে দামেস্ক, জর্দান এবং ফিলিস্তিন বিজয় সম্পন্ন করেন।\n\nইয়ারমুকের যুদ্ধ\n\nইয়ারমুকের যুদ্ধের আগে হযরত উমর (রাঃ) খালিদ ইবনে ওয়ালিদ (রাঃ)-এর বদলে তাঁকে প্রধান সেনাপতির দায়িত্ব দেন। তিনি অত্যন্ত বিনয়ের সাথে সেই দায়িত্ব গ্রহণ করেন। পদমর্যাদা",
      "তিনি সামরিক কমান্ডার হিসেবে তাঁর প্রজ্ঞা ও দক্ষতার জন্য সুপরিচিত ছিলেন। ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত বিনয়ী, দুনিয়াবিমুখ এবং কঠোরভাবে আল্লাহর তাকওয়াবান। তিনি তাঁর সৈন্যদের সাথে মিশে থাকতেন।\n\nমৃত্যু",
      "১৮ হিজরিতে (৬৩৯ খ্রিস্টাব্দে) সিরিয়ায় আমওয়াস (Amwas) মহামারীতে তিনি আক্রান্ত হন। নেতৃত্ব\n\nমহামারীর সময় তিনি মুসলিম সৈন্যদের সুস্থতা নিশ্চিত করতে সর্বোচ্চ চেষ্টা করেন। শাহাদাত\n\nএই মহামারীতেই তিনি ইন্তেকাল করেন। তাঁকে জর্ডানের কাছে দাফন করা হয়। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে শ্রেষ্ঠ আমানতদারী, বিনয় এবং রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসার এক আদর্শ উদাহরণ।",
      "**সিরিয়ার সেনাপতি:** উমরের খিলাফতে সিরিয়ার সেনাপতি। খালিদকে সম্মান করতেন।",
      "**প্লেগে মৃত্যু:** ৬৩৯ সাল। আমওয়াসের প্লেগে শহীদ। বয়স ৫৮ বছর। আমিনুল উম্মাহ।"
    ],
    "moral": "হযরত আবু উবাইদাহ (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা বিনয়, আমানতদারী এবং ব্যক্তিগত ত্যাগের মাধ্যমে উম্মতের ভালোবাসা ও আস্থা অর্জন করতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "abu_ubaidah_ibn_al_jarrah"
  },
  {
    "sahabi_id": "abdullah_ibn_masud",
    "title": "আব্দুল্লাহ ইবনে মাসউদ (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে মাসউদ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুর রহমান আব্দুল্লাহ ইবনে মাসউদ ইবনে গাফিল আল-হুযালী। তিনি ছিলেন ইসলামের ইতিহাসের প্রথম দিকের অন্যতম শ্রেষ্ঠ কুরআন পাঠক ও ফকীহ সাহাবী। তাঁর উপাধি ছিল 'আব্দুল্লাহ'। তাঁকে 'সাহাবীদের মধ্যে ফিকহের ইমাম' বলা হতো। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় জন্মগ্রহণ করেন। তিনি ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী এবং ইসলাম গ্রহণকারী ষষ্ঠ ব্যক্তি।\n\nপ্রথম তেলাওয়াত\n\nতিনি মক্কার কাফেরদের সামনে প্রকাশ্যে প্রথম কুরআন তেলাওয়াত করা সাহাবী। এর জন্য তিনি কাফেরদের হাতে মার খেয়েছিলেন। কুরআনের শ্রেষ্ঠ পাঠক",
      "রাসূল (সাঃ) তাঁর তেলাওয়াতের প্রশংসা করতেন। রাসূল (সাঃ) বলেছিলেন: 'যে ব্যক্তি কুরআনকে ঠিক যেভাবে নাযিল হয়েছে, সেভাবে পড়তে চায়, সে যেন ইবনে উম্মে আবদ (আব্দুল্লাহ ইবনে মাসউদ)-এর কিরাআতে পড়ে।'\n\nইলমের উৎস\n\nতিনি সরাসরি রাসূল (সাঃ)-এর কাছ থেকে ৭০টিরও বেশি সূরা শিখেছিলেন। তিনি রাসূল (সাঃ)-এর জুতো ও মিসওয়াক বহন করতেন। জ্ঞানের মর্যাদা",
      "হযরত উমর (রাঃ) তাঁর জ্ঞানের গভীরতার কারণে তাঁকে অত্যন্ত শ্রদ্ধা করতেন। ফতোয়া\n\nতিনি ফিকহী মাসআলায় অত্যন্ত গভীর জ্ঞান রাখতেন। তাঁর ফতোয়াগুলোই পরবর্তীতে হানাফি ফিকহের ভিত্তির অন্যতম উৎস হিসেবে কাজ করেছে।\n\nকুফার শিক্ষক",
      "হযরত উমর (রাঃ) তাঁকে কুফায় শিক্ষক ও কাজীর (বিচারক) দায়িত্ব দিয়ে প্রেরণ করেন। সেখানে তিনি হাজার হাজার ছাত্র তৈরি করেন, যাঁরা পরবর্তীতে কুফার ফিকহী ধারাকে সমৃদ্ধ করেন। প্রশাসনিক ভূমিকা (শিক্ষক)\n\nকুফায় তাঁর শিক্ষকতা ছিল একটি গুরুত্বপূর্ণ প্রশাসনিক মিশন। তিনি তাঁর ছাত্রদের হাদিসের সনদ এবং ফিকহের জ্ঞান প্রদান করেন।\n\nসামরিক ভূমিকা",
      "তিনি বদর, উহুদ সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। বদরের যুদ্ধে অবদান\n\nবদরের যুদ্ধের পর তিনি আবু জাহলকে হত্যা করেন এবং তার মাথা নিয়ে আসেন। ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন খুবই বিনয়ী এবং দুনিয়াবিমুখ (যাহিদ)। তাঁর ছাত্ররা",
      "তাঁর ছাত্রদের মধ্যে অন্যতম: আলকামা ইবনে কায়স এবং মাসরুক ইবনে আল-আজদা', যারা ইরাকের ফিকহের ভিত্তিস্থাপন করেন।\n\nহাদিস বর্ণনায় সতর্কতা\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন, যাতে রাসূল (সাঃ)-এর কোনো কথা ভুলভাবে বর্ণিত না হয়। খিলাফতের ভূমিকা",
      "তিনি হযরত উসমান (রাঃ)-এর খিলাফতকাল পর্যন্ত জীবিত ছিলেন। মৃত্যু\n\nতিনি ৩২ বা ৩৩ হিজরিতে (৬৫৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।",
      "**কুফার শিক্ষক:** উমর তাকে কুফায় পাঠালেন। হাজার হাজার ছাত্র তৈরি করলেন।",
      "**মৃত্যু:** ৬৫৩ সাল। মদীনায় মৃত্যু। কুরআনের শ্রেষ্ঠ পাঠক।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে মাসউদ (রাঃ)-এর জীবন প্রমাণ করে যে, প্রকৃত মর্যাদা শারীরিক শক্তি বা সম্পদ দ্বারা আসে না, বরং কুরআন ও সুন্নাহর গভীর জ্ঞানের মাধ্যমে অর্জিত হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা",
    "id": "abdullah_ibn_masud"
  },
  {
    "sahabi_id": "muadh_ibn_jabal",
    "title": "মুয়াজ ইবনে জাবাল (রাঃ)",
    "paragraphs": [
      "হযরত মুয়াজ ইবনে জাবাল (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুর রহমান মুয়াজ ইবনে জাবাল ইবনে আমর আল-খাযরাজী আল-আনসারী।",
      "তিনি ছিলেন ইসলামের অন্যতম শ্রেষ্ঠ ফকীহ ও মুয়াল্লিম (শিক্ষক)।\n\nতাঁর উপাধি ছিল আবু আব্দুর রহমান।\n\nরাসূল (সাঃ) তাঁকে 'হালাল-হারাম সম্পর্কে সবচেয়ে জ্ঞানী' সাহাবী হিসেবে প্রশংসা করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন। প্রাথমিক জীবন\n\nতিনি মদীনায় ইসলাম গ্রহণের পর রাসূল (সাঃ)-এর ঘনিষ্ঠ সাহাবীদের মধ্যে স্থান পান। সামরিক ভূমিকা",
      "তিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন।\n\nপ্রশাসনিক মিশন: ইয়ামেনের গভর্নর\n\nরাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ইয়ামেনের শিক্ষক ও গভর্নর হিসেবে প্রেরণ করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন। ফতোয়ার পদ্ধতি",
      "ইয়ামেনে যাওয়ার সময় রাসূল (সাঃ) তাঁকে জিজ্ঞেস করেন: 'তুমি কীভাবে ফায়সালা করবে?' তিনি বলেন: 'প্রথমে আল্লাহর কিতাব দিয়ে, এরপর আপনার সুন্নাহ দিয়ে, এরপর ইজতিহাদ (নিজের যুক্তি) দিয়ে।\n\n' রাসূল (সাঃ) তাঁর এই জবাবে সন্তুষ্ট হন।\n\nএই ঘটনা ফিকহের উসূল (মূলনীতি)-এর ভিত্তি স্থাপন করে। জ্ঞানের মর্যাদা",
      "রাসূল (সাঃ) তাঁকে খুব ভালোবাসতেন এবং বলেছিলেন: 'মুয়াজ হলেন কিয়ামতের দিন আলেমদের অগ্রভাগে থাকবেন।' তিনি ছিলেন হাদিস ও ফিকহের গভীর জ্ঞানের অধিকারী। হাদিস বর্ণনায় সতর্কতা\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্ক ছিলেন। মৃত্যু",
      "**ইয়েমেনের শিক্ষক:** রাসূল তাকে ইয়েমেনে পাঠালেন শিক্ষক ও বিচারক হিসেবে।",
      "**ইজতিহাদ:** রাসূল জিজ্ঞাসা করলেন কীভাবে বিচার করবে। মুয়াজ: কুরআন, সুন্নাহ, তারপর ইজতিহাদ।",
      "**প্লেগে শাহাদাত:** ৬৩৯ সাল। সিরিয়ায় প্লেগে শহীদ। বয়স ৩৩-৩৮ বছর।",
      "**হালাল-হারামের জ্ঞানী:** রাসূল বলেছেন: মুয়াজ হালাল-হারামে সবচেয়ে জ্ঞানী।"
    ],
    "moral": "হযরত মুয়াজ ইবনে জাবাল (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানের গভীরতা এবং আল্লাহর পথে তার ব্যবহার একজন মানুষকে শ্রেষ্ঠতম আলেম ও পথপ্রদর্শক বানাতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "muadh_ibn_jabal"
  },
  {
    "id": "abu_hurairah",
    "categoryId": "sahabider_jibon",
    "title": "আবু হুরাইরা (রাঃ)",
    "paragraphs": [
      "ইয়েমেনের দাওস গোত্রে জন্ম। আসল নাম আবদুর রহমান ইবনে সাখর। ডাকনাম আবু হুরাইরা - বিড়ালছানার পিতা। কেন? ছোটবেলায় একটা বিড়ালছানা পুষতেন। দরিদ্র পরিবার। কিন্তু হবেন সবচেয়ে বেশি হাদিস বর্ণনাকারী!",
      "**ইসলাম গ্রহণ:** ৬২৮ সাল। খায়বারের যুদ্ধের সময়। তুফাইল ইবনে আমরের সাথে মদীনায় এলেন। রাসূল (সাঃ) এর সাথে দেখা। সাথে সাথে ইসলাম গ্রহণ করলেন। বয়স ৩০ বছর।",
      "**সুফফার সাথী:** মদীনায় কোথায় থাকবেন? মসজিদে নববীর সুফফায়। আহলে সুফফা - দরিদ্র মুহাজির ও আনসার যারা মসজিদে থাকতেন। আবু হুরাইরা তাদের একজন। খাবার নেই। পেট বেঁধে রাখতেন। কিন্তু রাসূলের সাথে থাকার সৌভাগ্য!",
      "**ক্ষুধার গল্প:** একদিন প্রচণ্ড ক্ষুধা। রাস্তায় পড়ে থাকা পাথরে পা দিয়ে মাড়ালেন। সাহাবীরা ভাবলেন পাগল হয়ে গেছেন। আসলে ক্ষুধায় জ্ঞান হারাচ্ছিলেন। রাসূল (সাঃ) বুঝলেন। বাড়িতে নিয়ে গিয়ে দুধ খাওয়ালেন। আবু হুরাইরা কাঁদলেন খুশিতে।",
      "**হাদিস মুখস্থ:** রাসূল (সাঃ) বললেন: তোমাদের মধ্যে কে চায় আমার কথা ভুলে না যেতে? আবু হুরাইরা চাদর বিছালেন। রাসূল (সাঃ) তাতে কিছু রাখার ভঙ্গি করলেন। আবু হুরাইরা চাদর বুকে জড়ালেন। রাসূল (সাঃ) বললেন: এখন থেকে কিছু ভুলবে না। সত্যি হল! ৫,৩৭৪টি হাদিস বর্ণনা করেছেন - সবচেয়ে বেশি!",
      "**যুদ্ধসমূহ:** খায়বার, মক্কা বিজয়, হুনায়ন, তাবুক - সব যুদ্ধে অংশ নিলেন। কিন্তু তার আসল জিহাদ ছিল হাদিস সংরক্ষণ।",
      "**বাহরাইনের গভর্নর:** উমর (রাঃ) তাকে বাহরাইনের গভর্নর বানালেন। দুই বছর পর উমর জিজ্ঞাসা করলেন: কীভাবে এত সম্পদ হল? আবু হুরাইরা বললেন: ব্যবসা ও উপহার। উমর বললেন: অর্ধেক রাষ্ট্রীয় কোষাগারে দাও। আবু হুরাইরা দিয়ে দিলেন। পদ ছেড়ে দিলেন।",
      "**শিক্ষাদান:** মদীনায় ফিরে এসে হাদিস শেখাতে লাগলেন। হাজার হাজার ছাত্র। সাঈদ ইবনুল মুসাইয়্যিব, ইবনে সিরিন, নাফি - সবাই তার ছাত্র। মসজিদে নববীতে বসে হাদিস বলতেন। মানুষ ভিড় করত।",
      "**বিনয়:** একবার বললেন: তোমরা বলো আবু হুরাইরা বেশি হাদিস বলে। কিন্তু আমার মুহাজির ভাইয়েরা ব্যবসায় ব্যস্ত ছিলেন, আনসার ভাইয়েরা চাষাবাদে। আমি রাসূলের সাথে লেগে থাকতাম, পেট বেঁধে।",
      "**ইবাদত:** রাতে তিন ভাগ করতেন। এক ভাগ নিজে নামায পড়তেন, এক ভাগ স্ত্রী, এক ভাগ দাসী। এভাবে সারা রাত ঘরে নামায হত।",
      "**মৃত্যু:** ৫৯ হিজরি, ৬৭৮ সাল। মদীনায় মৃত্যু। বয়স ৭৮ বছর। মৃত্যুর আগে কাঁদলেন। জিজ্ঞাসা করা হল কেন? বললেন: দুনিয়ার মায়ায় নয়, আখিরাতের ভয়ে। জান্নাতুল বাকীতে দাফন। সবচেয়ে বেশি হাদিস বর্ণনাকারী। রাসূলের জ্ঞানের ভাণ্ডার।"
    ],
    "moral": "হযরত আবু হুরাইরা (রাঃ)-এর জীবন প্রমাণ করে যে, জীবনের সমস্ত ভোগ-বিলাস ত্যাগ করে শুধু রাসূল (সাঃ)-এর সুন্নাহ সংরক্ষণে আত্মনিবেদন করলে আল্লাহ সর্বোচ্চ মর্যাদা দান করেন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abdullah_ibn_abbas",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে আব্বাস (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে আব্বাস (রাঃ)-এর পূর্ণ নাম হলো আবু আল-আব্বাস আব্দুল্লাহ ইবনে আল-আব্বাস ইবনে আব্দুল মুত্তালিব আল-হাশিমি। তিনি ছিলেন রাসূল (সাঃ)-এর চাচাতো ভাই এবং কুরআনের ব্যাখ্যার ক্ষেত্রে শ্রেষ্ঠতম সাহাবী। তাঁর উপাধি ছিল 'আল-হিব্রু আল-উম্মাহ' (উম্মতের পণ্ডিত) এবং 'মুফাসসিরুল কুরআন' (কুরআনের ব্যাখ্যাকার)।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি হিজরতের তিন বছর আগে মক্কায় জন্মগ্রহণ করেন। তাঁর বয়স যখন ১৩ বছর, তখন মক্কা বিজয়ের আগে তিনি তাঁর পিতার সাথে ইসলাম গ্রহণ করেন। জ্ঞানের প্রতি আগ্রহ\n\nতিনি তাঁর শৈশব থেকেই জ্ঞানের প্রতি গভীর আগ্রহ দেখান। রাসূল (সাঃ)-এর ইন্তেকালের সময় তাঁর বয়স ছিল মাত্র ১৩ বছর।",
      "রাসূল (সাঃ)-এর দু'আ\n\nরাসূল (সাঃ) তাঁর জন্য বিশেষভাবে দু'আ করেছিলেন: 'হে আল্লাহ! তাকে দ্বীনের জ্ঞান দান করো এবং কুরআনের ব্যাখ্যা শিক্ষা দাও।' রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি রাসূল (সাঃ)-এর জীবনের শেষ তিন বছর তাঁর সান্নিধ্যে ছিলেন এবং এই অল্প সময়েই রাসূল (সাঃ)-এর কাছ থেকে গভীর জ্ঞান লাভ করেন।",
      "হাদিস সংগ্রহ\n\nরাসূল (সাঃ)-এর ইন্তেকালের পর তিনি অন্যান্য সাহাবীদের কাছ থেকে জ্ঞান অর্জনের জন্য কঠোর পরিশ্রম করেন। তিনি জ্ঞান লাভের জন্য অনেক সাহাবীর দরজায় অপেক্ষা করতেন। ফিকহ ও তাফসীর\n\nতিনি ছিলেন তাঁর যুগের শ্রেষ্ঠ মুফাসসির এবং ফকীহ। তাঁর তাফসীরের পদ্ধতি ছিল হাদিস, সাহাবীদের বক্তব্য এবং আরবি ভাষার গভীর জ্ঞানের ওপর নির্ভরশীল।",
      "তাঁর তাফসীর\n\nতিনি কুরআনের প্রতিটি আয়াতের শাব্দিক অর্থ, ঐতিহাসিক প্রেক্ষাপট এবং ফিকহী সিদ্ধান্ত ব্যাখ্যা করতেন। ইজতিহাদ\n\nহযরত উমর (রাঃ) তাঁর প্রখর মেধার কারণে অল্প বয়সেও তাঁকে বড় বড় সাহাবীদের মজলিসে অংশগ্রহণের সুযোগ দিতেন। সামরিক ভূমিকা",
      "তিনি রাসূল (সাঃ)-এর শেষ জীবনের কিছু অভিযানে অংশগ্রহণ করেন। খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা হিসেবে ভূমিকা রাখেন।\n\nহযরত আলী (রাঃ)-এর খিলাফতকালে তিনি বসরার গভর্নর হিসেবে দায়িত্ব পালন করেন। রাজনৈতিক পরীক্ষা",
      "তিনি সিফফিনের যুদ্ধের পর খারিজিদের সাথে বিতর্কে অংশগ্রহণ করেন এবং তাঁর যুক্তি দিয়ে হাজার হাজার খারিজিকে তাদের ভুল থেকে ফিরিয়ে আনেন। জ্ঞান বিতরণ\n\nতিনি জীবনের শেষভাগে মক্কা ও তায়েফে বসবাস করে হাজার হাজার ছাত্রকে হাদিস, তাফসীর ও ফিকহের জ্ঞান দান করেন।\n\nতাঁর ছাত্ররা",
      "তাঁর ছাত্রদের মধ্যে অন্যতম: মুজাহিদ, ইকরিমা এবং সাঈদ ইবনে জুবাইর, যারা পরবর্তীতে তাফসীর ও ফিকহের ক্ষেত্রে ইমাম হিসেবে পরিচিত হন। মৃত্যু\n\nতিনি ৬৮ হিজরিতে (৬৮৭ খ্রিস্টাব্দে) তায়েফ শহরে ইন্তেকাল করেন। দাফন\n\nতাঁকে তায়েফেই দাফন করা হয়। তাঁর জীবনী",
      "**তাফসীর:** ইবনে আব্বাস তাফসীরে পারদর্শী ছিলেন। তার তাফসীর আজও অনুসরণ করা হয়।",
      "**মৃত্যু:** ৬৮৭ সাল। তায়েফে মৃত্যু। বয়স ৭১ বছর। তাফসীরের ইমাম।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে আব্বাস (রাঃ)-এর জীবন প্রমাণ করে যে, রাসূল (সাঃ)-এর দোয়ার ফলস্বরূপ জ্ঞান লাভের মাধ্যমে অল্প বয়সেই উম্মতের সর্বোচ্চ পণ্ডিত হওয়া সম্ভব।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "sahabi_id": "fatimah_bint_muhammad",
    "title": "ফাতিমা বিনতে মুহাম্মদ (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। ৬০৫ বা ৬১৫ সাল। পিতা মুহাম্মাদ (সাঃ), মা খাদিজা (রাঃ)। রাসূলের সবচেয়ে ছোট ও প্রিয় কন্যা। চার কন্যার মধ্যে একমাত্র যিনি রাসূলের মৃত্যুর পর বেঁচে ছিলেন। উপাধি: আয-যাহরা (উজ্জ্বল), আল-বাতুল (আল্লাহর ইবাদতে নিমগ্ন)।",
      "**শৈশব:** ছোটবেলা থেকে পিতার সাথে। কুরাইশরা যখন রাসূলকে কষ্ট দিত, ফাতিমা কাঁদতেন। একবার রাসূল (সাঃ) কাবায় নামায পড়ছেন। আবু জাহল উটের নাড়িভুঁড়ি এনে পিঠে চাপিয়ে দিল। ফাতিমা ছুটে এসে সরিয়ে দিলেন। রাসূলকে রক্ষা করলেন।",
      "**হিজরত:** ৬২২ সাল। রাসূল (সাঃ) মদীনায় হিজরত করলেন। কিছুদিন পর ফাতিমা, উম্মে কুলসুম ও সাওদা (রাঃ) মদীনায় এলেন। যায়িদ ইবনে হারিসা নিয়ে এলেন।",
      "**বিবাহ:** ৬২৩-৬২৫ সাল। আবু বকর ও উমর প্রস্তাব দিলেন। রাসূল (সাঃ) প্রত্যাখ্যান করলেন। আলী (রাঃ) লজ্জা পেয়ে প্রস্তাব দিতে পারছিলেন না। সাহাবীরা উৎসাহ দিলেন। আলী প্রস্তাব দিলেন। রাসূল (সাঃ) খুশি হলেন। বললেন: আল্লাহ আমাকে নির্দেশ দিয়েছেন। বিয়ে হল। মোহরানা ৪৮০ দিরহাম। আলী বর্ম বিক্রি করে দিলেন। উসমান সেই বর্ম কিনে আলীকে উপহার দিলেন।",
      "**সংসার জীবন:** অত্যন্ত সাদাসিধে জীবন। নিজে হাতে যাঁতা পিষতেন, রান্না করতেন, ঘর পরিষ্কার করতেন। হাত ফোসকা পড়ে যেত। একবার রাসূল (সাঃ) কে বললেন: একটা দাসী দিন। রাসূল (সাঃ) বললেন: আমি তোমাকে এর চেয়ে ভালো কিছু শেখাব? ঘুমানোর আগে ৩৩ বার সুবহানাল্লাহ, ৩৩ বার আলহামদুলিল্লাহ, ৩৪ বার আল্লাহু আকবার বলো। এটা দাসীর চেয়ে ভালো। ফাতিমা সারা জীবন এটা পড়তেন।",
      "**সন্তান:** চার সন্তান। দুই ছেলে - হাসান ও হুসাইন। দুই মেয়া - যয়নাব ও উম্মে কুলসুম। রাসূল (সাঃ) হাসান-হুসাইনকে অত্যন্ত ভালোবাসতেন। বলেছেন: হাসান ও হুসাইন জান্নাতের যুবকদের সর্দার।",
      "**রাসূলের প্রিয়তমা:** রাসূল (সাঃ) বলতেন: ফাতিমা আমার অংশ। যে তাকে কষ্ট দেয় সে আমাকে কষ্ট দেয়। আয়েশা (রাঃ) বলেন: ফাতিমা ছাড়া আর কাউকে দেখিনি যে হাঁটা, কথা বলা সবকিছুতে রাসূলের মতো। ফাতিমা এলে রাসূল (সাঃ) দাঁড়িয়ে যেতেন, চুমু দিতেন, নিজের জায়গায় বসাতেন।",
      "**রাসূলের মৃত্যু:** ৬৩২ সাল। রাসূল (সাঃ) অসুস্থ। ফাতিমাকে ডেকে কিছু বললেন। ফাতিমা কাঁদলেন। আবার কিছু বললেন। ফাতিমা হাসলেন। আয়েশা (রাঃ) পরে জিজ্ঞাসা করলেন কী বলেছিলেন? ফাতিমা বললেন: প্রথমে বললেন আমি মারা যাব। তাই কাঁদলাম। তারপর বললেন: তুমি আমার পরিবারের মধ্যে প্রথম আমার সাথে মিলিত হবে। তাই হাসলাম।",
      "**ফাদাক বিষয়:** রাসূল (সাঃ) মারা গেলেন। ফাদাক জমি নিয়ে বিষয় হল। ফাতিমা দাবি করলেন এটা রাসূল (সাঃ) তাকে দিয়েছিলেন। আবু বকর বললেন: রাসূল (সাঃ) বলেছেন নবীরা উত্তরাধিকার রেখে যান না, যা রেখে যান তা সদকা। ফাতিমা মন খারাপ করলেন। আলী (রাঃ) বুঝিয়ে বললেন।",
      "**মৃত্যু:** ৬৩২ সাল, ৩ রমজান বা ১৩ রমজান। রাসূলের মৃত্যুর ৬ মাস পর। বয়স ১৮ বা ২৮ বছর। আলী (রাঃ) গোসল করালেন, দাফন করলেন। রাতে দাফন - ফাতিমার ইচ্ছা অনুযায়ী। জান্নাতুল বাকীতে। রাসূল (সাঃ) বলেছেন: ফাতিমা জান্নাতের নারীদের সর্দার। পবিত্র, ধৈর্যশীল, আল্লাহর প্রিয়।"
    ],
    "moral": "হযরত ফাতিমা (রাঃ)-এর জীবন প্রমাণ করে যে, নারীত্বের সর্বোচ্চ মর্যাদা অর্জন করা যায় পবিত্রতা, বিনয় এবং আল্লাহর প্রতি গভীর আনুগত্যের মাধ্যমে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "fatima_bint_muhammad"
  },
  {
    "id": "hamza_ibn_abd_al_muttalib",
    "categoryId": "sahabider_jibon",
    "title": "হামযা ইবনে আব্দুল মুত্তালিব (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। হামযা ইবনে আব্দুল মুত্তালিব। রাসূল (সাঃ) এর চাচা। কিন্তু বয়সে মাত্র ২-৪ বছরের বড়। দুধ ভাই - একই ধাত্রী সুয়াইবা দুধ পান করিয়েছেন। শক্তিশালী, সাহসী, শিকারী। মক্কার সবচেয়ে ভয়ঙ্কর যোদ্ধা।",
      "**ইসলাম গ্রহণ:** ৬১৫ সাল। হামযা শিকার থেকে ফিরছেন। এক দাসী বলল: আবু জাহল আপনার ভাতিজা মুহাম্মাদকে গালি দিয়েছে, মারধর করেছে। হামযার চোখ জ্বলে উঠল। সোজা কাবায় গেলেন। আবু জাহল বসে আছে। হামযা ধনুক দিয়ে আবু জাহলের মাথায় আঘাত করলেন। বললেন: তুমি মুহাম্মাদকে গালি দিয়েছ? আমিও তার ধর্মে আছি! আবু জাহল ভয়ে চুপ। হামযা ইসলাম গ্রহণ করলেন। মুসলিমরা শক্তিশালী হলেন।",
      "**হিজরত:** ৬২২ সাল। মদীনায় হিজরত করলেন। রাসূল (সাঃ) তাকে সালামা ইবনে সালামার সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**বদরের যুদ্ধ:** ৬২৪ সাল। প্রথম যুদ্ধ। হামযা অসাধারণ বীরত্ব দেখালেন। উতবা ইবনে রাবিয়াকে হত্যা করলেন। শায়বা ও আসওয়াদকেও। মুসলিমদের বিজয়ে হামযার বড় ভূমিকা।",
      "**উহুদের প্রস্তুতি:** ৬২৫ সাল। কুরাইশরা প্রতিশোধ নিতে আসছে। ৩,০০০ সৈন্য। হামযা প্রস্তুত। উটপাখির পালক মাথায় বেঁধে নিলেন - যাতে যুদ্ধক্ষেত্রে চেনা যায়।",
      "**উহুদের যুদ্ধ:** হামযা যুদ্ধক্ষেত্রে সিংহের মতো লড়ছেন। একের পর এক কাফির মারছেন। হিন্দা বিনতে উতবা - যার পিতা বদরে হামযার হাতে মারা গেছে - প্রতিশোধ নিতে চায়। ওয়াহশি নামে এক আবিসিনিয়ান দাসকে বলেছে: হামযাকে মারলে তোমাকে মুক্ত করব। ওয়াহশি লুকিয়ে আছে। হামযা একজন কাফিরকে মারছেন। ওয়াহশি বর্শা ছুঁড়ল। হামযার পেটে বিঁধল। হামযা শহীদ হলেন। বয়স ৫৭-৫৯ বছর।",
      "**হিন্দার নৃশংসতা:** হিন্দা হামযার লাশের কাছে এল। পেট চিরে কলিজা বের করল। চিবাতে লাগল। কিন্তু গিলতে পারল না। থুথু ফেলে দিল। কান, নাক কেটে মালা বানাল। রাসূল (সাঃ) দেখলেন। কাঁদলেন। বললেন: হামযা শহীদদের সর্দার।",
      "**দাফন:** রাসূল (সাঃ) হামযাকে কাফন দিতে চাইলেন। কিন্তু কাপড় ছোট। মাথা ঢাকলে পা বের হয়, পা ঢাকলে মাথা বের হয়। রাসূল (সাঃ) মাথা ঢেকে পায়ে ঘাস দিলেন। হামযার সাথে আবদুল্লাহ ইবনে জাহশকেও দাফন করলেন - এক কবরে দুই শহীদ।",
      "**রাসূলের শোক:** রাসূল (সাঃ) বললেন: আমি কখনো হামযার মতো মুসিবতে পড়িনি। মক্কা বিজয়ের সময় ওয়াহশি পালিয়ে গিয়েছিল। পরে এসে ইসলাম গ্রহণ করল। রাসূল (সাঃ) মাফ করলেন কিন্তু বললেন: আমার সামনে এসো না।",
      "**উপাধি:** সাইয়্যিদুশ শুহাদা - শহীদদের সর্দার। আসাদুল্লাহ - আল্লাহর সিংহ। রাসূল (সাঃ) এর প্রিয় চাচা। ইসলামের বীর যোদ্ধা। উহুদে শাহাদাত বরণ করেন।"
    ],
    "moral": "হযরত হামযা (রাঃ)-এর জীবন প্রমাণ করে যে, সত্যের পক্ষে দাঁড়াতে এবং ইসলামকে রক্ষা করতে সর্বোচ্চ বীরত্ব ও আত্মত্যাগ অপরিহার্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "abdullah_ibn_umar",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে উমর (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে উমর (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে উমর ইবনে আল-খাত্তাব আল-কুরাইশী আল-আদাবী। তিনি ছিলেন ইসলামের দ্বিতীয় খলীফা হযরত উমর (রাঃ)-এর পুত্র এবং সুন্নাহর কঠোর অনুসারী সাহাবী। তাঁর উপাধি ছিল আব্দুর রহমান। তাঁকে 'আল-আবিদ' (অতি ইবাদতকারী) উপাধিতেও ডাকা হতো।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি নবুয়তের প্রথম বছরগুলোতে মক্কায় জন্মগ্রহণ করেন। তিনি তাঁর পিতা উমর (রাঃ)-এর সাথে শৈশবেই ইসলাম গ্রহণ করেন। শৈশবের জীবন\n\nতিনি তাঁর শৈশব রাসূল (সাঃ)-এর সান্নিধ্যে কাটান এবং অল্প বয়স থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন। সামরিক ভূমিকা",
      "তিনি উহুদের যুদ্ধে অংশগ্রহণ করতে চেয়েছিলেন, কিন্তু তখন তাঁর বয়স কম থাকায় রাসূল (সাঃ) তাঁকে অনুমতি দেননি।\n\nপ্রথম যুদ্ধে অংশগ্রহণ\n\nতিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি সকল সামরিক অভিযানে রাসূল (সাঃ)-এর পাশে ছিলেন। হাদিস বর্ণনাকারী",
      "তিনি সর্বাধিক হাদিস বর্ণনাকারী সাহাবীদের মধ্যে অন্যতম। তাঁর মাধ্যমে প্রায় ২,৬৩০টি হাদিস বর্ণিত হয়েছে। সুন্নাহর অনুসরণ\n\nতিনি রাসূল (সাঃ)-এর প্রতিটি কাজ ও নির্দেশকে কঠোরভাবে অনুসরণ করতেন। তিনি এমনভাবে সুন্নাহ পালন করতেন, যাতে কোনো প্রকার ব্যতিক্রম না হয়।\n\nজ্ঞানের মর্যাদা",
      "তিনি ফিকহ, হাদিস এবং ইসলামের আইন সম্পর্কে গভীর জ্ঞান রাখতেন। তাঁর ফতোয়াগুলো মদীনার আলেমদের কাছে অত্যন্ত গুরুত্বপূর্ণ ছিল। ইজতিহাদ ও ইবাদত\n\nতিনি অতি ইবাদতগুজার ছিলেন। তিনি তাঁর জীবনের বেশিরভাগ সময় সালাত, সাওম (রোজা) এবং ইবাদতে ব্যয় করতেন। খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা হিসেবে ভূমিকা রাখেন।",
      "ফিতনা থেকে দূরে থাকা\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে কঠোরভাবে দূরে থাকেন। তিনি মনে করতেন, মুসলিমদের মধ্যে রক্তপাত ঘটানো আল্লাহর পছন্দ নয়। তিনি কখনোই কোনো খলীফার পদ বা সরকারি দায়িত্ব গ্রহণ করেননি, যদিও তাঁকে বারবার প্রস্তাব দেওয়া হয়েছিল।\n\nরাজনৈতিক নিরপেক্ষতা",
      "তিনি ছিলেন সম্পূর্ণ রাজনৈতিকভাবে নিরপেক্ষ। তিনি হযরত আলী (রাঃ) বা মুয়াবিয়া (রাঃ) কারোরই পক্ষ নেননি। মৃত্যু\n\nতিনি ৭৩ হিজরিতে (৬৯৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। জানাযা ও দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে সুন্নাহর প্রতি কঠোর আনুগত্য, বিনয় এবং রাজনৈতিক ফিতনা থেকে দূরে থাকার প্রজ্ঞার এক আদর্শ উদাহরণ।",
      "**সব যুদ্ধে:** বদর, উহুদ, খন্দক - সব যুদ্ধে অংশ নিলেন।",
      "**মৃত্যু:** ৭০৯ সাল। মদীনায় মৃত্যু। বয়স ৮৭ বছর। দীর্ঘজীবী সাহাবী।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে উমর (রাঃ)-এর জীবন প্রমাণ করে যে, জীবনের প্রতিটি ক্ষেত্রে রাসূল (সাঃ)-এর সুন্নাহকে কঠোরভাবে অনুসরণ করাই একজন মুমিনের প্রধান কর্তব্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "anas_ibn_malik",
    "categoryId": "sahabider_jibon",
    "title": "আনাস ইবনে মালিক (রাঃ)",
    "paragraphs": [
      "হযরত আনাস ইবনে মালিক (রাঃ)-এর পূর্ণ নাম হলো আবু হামযা আনাস ইবনে মালিক ইবনে নযর আল-আনসারী আল-খাযরাজী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর দীর্ঘ দশ বছরের খাদেম (সেবক)। তাঁর উপাধি ছিল আবু হামযা। তিনি রাসূল (সাঃ)-এর কাছ থেকে বিশেষভাবে স্নেহ ও দু'আ লাভ করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। মদীনায় হিজরতের পরপরই তাঁর মা উম্মে সুলাইম (রাঃ) তাঁকে রাসূল (সাঃ)-এর খেদমতে অর্পণ করেন। রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি মদীনায় হিজরতের পর থেকে রাসূল (সাঃ)-এর ইন্তেকাল পর্যন্ত একটানা দশ বছর তাঁর ব্যক্তিগত খাদেম হিসেবে নিয়োজিত ছিলেন।",
      "রাসূল (সাঃ)-এর সেবা\n\nতিনি রাসূল (সাঃ)-এর সমস্ত ব্যক্তিগত কাজ, যেমন: ওযু করানো, জুতো রাখা, খাবার পরিবেশন—ইত্যাদিতে সাহায্য করতেন। রাসূল (সাঃ)-এর দু'আ\n\nআনাস (রাঃ)-এর জন্য রাসূল (সাঃ) বিশেষভাবে দু'আ করেছিলেন: 'হে আল্লাহ! তার ধন-সম্পদ ও সন্তান-সন্ততি বাড়িয়ে দাও এবং তাকে বরকত দান করো।'",
      "এই দু'আর ফলস্বরূপ, তিনি দীর্ঘজীবন পান, তাঁর বিপুল সম্পদ হয় এবং তাঁর পুত্র-পৌত্রদের সংখ্যা প্রায় একশত বিশ জন হয়েছিল। হাদিস বর্ণনাকারী\n\nতিনি রাসূল (সাঃ)-এর জীবনের ব্যক্তিগত ও অভ্যন্তরীণ দিকগুলো সম্পর্কে সবচেয়ে বেশি জানতেন। তিনি প্রায় ২,২৮৬টি হাদিস বর্ণনা করেন। সামরিক ভূমিকা\n\nতিনি রাসূল (সাঃ)-এর সঙ্গে খন্দকের যুদ্ধ, হুদাইবিয়ার সন্ধি, মক্কা বিজয় সহ অনেক গুরুত্বপূর্ণ অভিযানে অংশগ্রহণ করেন।",
      "জ্ঞানের মর্যাদা\n\nতিনি তাঁর যুগের আলেমদের কাছে হাদিস, ফিকহ এবং সীরাতের একজন গুরুত্বপূর্ণ উৎস ছিলেন। জ্ঞান বিতরণ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর বসরায় হিজরত করেন এবং সেখানে হাদিস শিক্ষাদানের এক বিশাল কেন্দ্র প্রতিষ্ঠা করেন। তাঁর ছাত্রদের সংখ্যা ছিল বিপুল। তাঁর কাছ থেকে হাসান আল-বসরী এবং মুহাম্মদ ইবনে সিরীন সহ তাবেয়ীনের বহু বড় ইমাম হাদিস শিখেছেন।",
      "ফিতনা থেকে দূরে থাকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে ফিতনা থেকে দূরে থাকার চেষ্টা করেন। তিনি তাঁর জীবনের শেষ দিন পর্যন্ত হাদিস বর্ণনা ও রাসূল (সাঃ)-এর স্মৃতিচারণ করতেন। দীর্ঘ জীবন\n\nতিনি দীর্ঘজীবন লাভ করেন এবং প্রায় ১০০ বছর বেঁচে ছিলেন। তাঁর শেষ জীবন",
      "মৃত্যুর আগে তিনি তাঁর পরিবারের সদস্যদের আল্লাহর পথে অবিচল থাকতে উপদেশ দেন। মৃত্যু\n\nতিনি ৯৩ হিজরিতে (৭১২ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন।\n\nদাফন",
      "তাঁকে বসরায় দাফন করা হয়। তাঁর জীবনী\n\nতাঁর জীবনী রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসা, ব্যক্তিগত সেবার মাধ্যমে জ্ঞান অর্জন এবং বরকতের এক শ্রেষ্ঠ উদাহরণ।",
      "**হাদিস বর্ণনা:** ১৫৪০+ হাদিস বর্ণনা করেছেন।",
      "**মৃত্যু:** ৬৯৭ সাল। মদীনায় মৃত্যু। বয়স ৭৮ বছর।"
    ],
    "moral": "হযরত আনাস (রাঃ)-এর জীবন প্রমাণ করে যে, রাসূল (সাঃ)-এর ব্যক্তিগত সেবার মাধ্যমে জ্ঞান অর্জন করলে আল্লাহর পক্ষ থেকে জীবন ও সম্পদে বরকত লাভ হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "said_ibn_zayd",
    "categoryId": "sahabider_jibon",
    "title": "সাঈদ ইবনে যায়েদ (রাঃ)",
    "paragraphs": [
      "হযরত সাঈদ ইবনে যায়েদ (রাঃ)-এর পূর্ণ নাম হলো সাঈদ ইবনে যায়েদ ইবনে আমর ইবনে নুফায়েল আল-কুরাইশী আল-আদাবী। তিনি ছিলেন আশারায়ে মুবাশশারাহ (জান্নাতের সুসংবাদপ্রাপ্ত ১০ জন)-এর অন্যতম। তিনি ছিলেন ইসলামের দ্বিতীয় খলীফা হযরত উমর ইবনুল খাত্তাব (রাঃ)-এর ফুফুতো ভাই এবং ভগ্নিপতি।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কার বনু আদী গোত্রে জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিকের ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। নির্যাতন\n\nইসলাম গ্রহণের কারণে তিনি এবং তাঁর স্ত্রী ফাতিমা বিনতে আল-খাত্তাব (হযরত উমরের বোন) কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন।",
      "উমরের ইসলাম গ্রহণ\n\nহযরত উমর (রাঃ) তাঁদের ইসলাম গ্রহণের কথা জানতে পেরেই উত্তেজিত হয়ে তাঁদের বাড়িতে আক্রমণ করেন। এই ঘটনাই পরে উমর (রাঃ)-এর ইসলাম গ্রহণের কারণ হয়। হিজরত ও সান্নিধ্য\n\nতিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন।",
      "সামরিক ভূমিকা\n\nতিনি বদর যুদ্ধ ব্যতীত রাসূল (সাঃ)-এর সকল যুদ্ধে অংশগ্রহণ করেন। বদরের সময় তিনি রাসূল (সাঃ)-এর নির্দেশে একটি গুরুত্বপূর্ণ মিশনে নিয়োজিত ছিলেন। বদর যুদ্ধে অনুপস্থিত থাকলেও রাসূল (সাঃ) তাঁকে বদরের অংশগ্রহণকারীদের মতো গনিমত ও মর্যাদা দান করেন। আশারায়ে মুবাশশারাহর সদস্য\n\nতিনি রাসূল (সাঃ)-এর জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত সেই দশজন সাহাবীর অন্যতম।",
      "খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা ছিলেন। সামরিক বিজয়: সিরিয়া অভিযান\n\nহযরত উমর (রাঃ)-এর খিলাফতকালে তিনি সিরিয়া বিজয়ের অভিযানে গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন এবং মুসলিম বাহিনীর নেতৃত্ব দেন। প্রশাসনিক দায়িত্ব",
      "তিনি কুফা শহর প্রতিষ্ঠায় অংশগ্রহণ করেন। তিনি প্রশাসক হিসেবেও দায়িত্ব পালন করেন।\n\nফিতনা থেকে দূরে থাকা\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার সিদ্ধান্ত নেন। তিনি মদীনা ছেড়ে সিরিয়ার আল-আকীক উপত্যকায় নির্জন জীবন যাপন করেন। জ্ঞান ও ইবাদত",
      "তিনি তাঁর জীবনকে ইবাদত ও জ্ঞান চর্চায় ব্যয় করেন এবং হাদিস বর্ণনায় সতর্কতা অবলম্বন করতেন।\n\nতাঁর স্ত্রী\n\nতাঁর স্ত্রী ফাতিমা বিনতে আল-খাত্তাব (রাঃ) ছিলেন একজন পুণ্যবতী ও প্রথম দিকের ইসলাম গ্রহণকারী সাহাবিয়্যা। মৃত্যু",
      "তিনি ৫০ হিজরি বা ৫১ হিজরিতে (৬৭০ খ্রিস্টাব্দে) মদীনার আল-আকীক উপত্যকায় ইন্তেকাল করেন। জানাযা ও দাফন\n\nহযরত আব্দুল্লাহ ইবনে উমর (রাঃ) তাঁর জানাযার সালাতে ইমামতি করেন। তাঁকে মদীনার কাছেই দাফন করা হয়।\n\nতাঁর মর্যাদা",
      "**সাঈদ:** আশারায়ে মুবাশশারার একজন। জান্নাতের সুসংবাদপ্রাপ্ত।",
      "**মৃত্যু:** ৬৭১ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত সাঈদ ইবনে যায়েদ (রাঃ)-এর জীবন প্রমাণ করে যে, কঠিনতম নির্যাতনের মুখেও ঈমানের ওপর দৃঢ় থাকা এবং রাসূল (সাঃ)-এর আনুগত্য করাই জান্নাতের পথ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abu_said_al_khudri",
    "categoryId": "sahabider_jibon",
    "title": "আবু সাঈদ আল-খুদরী (রাঃ)",
    "paragraphs": [
      "হযরত আবু সাঈদ আল-খুদরী (রাঃ)-এর পূর্ণ নাম হলো সা'দ ইবনে মালিক ইবনে সিনান আল-খুদরী আল-আনসারী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন তরুণ সাহাবী এবং অধিক হাদিস বর্ণনাকারীদের অন্যতম। তাঁর উপাধি ছিল আবু সাঈদ। তিনি মদীনার খাযরাজ গোত্রের বনু খুদরা শাখার অন্তর্ভুক্ত ছিলেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মদীনায় জন্মগ্রহণ করেন। তিনি মদীনার আনসারদের মধ্যে একজন ছিলেন এবং শৈশবেই ইসলাম গ্রহণ করেন।\n\nপ্রাথমিক জীবন\n\nতাঁর পিতা মালিক ইবনে সিনান (রাঃ) উহুদের যুদ্ধে শহীদ হন। এই ঘটনার পর তিনি তাঁর মায়ের তত্ত্বাবধানে বেড়ে ওঠেন। সামরিক ভূমিকা",
      "তিনি তাঁর পিতাকে হারানোর পর অল্প বয়সেই উহুদের যুদ্ধে অংশগ্রহণের অনুমতি চেয়েছিলেন, কিন্তু তখন তাঁর বয়স কম থাকায় রাসূল (সাঃ) তাঁকে অনুমতি দেননি।\n\nপ্রথম যুদ্ধে অংশগ্রহণ\n\nতিনি খন্দকের যুদ্ধে (৫ হি.) প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে তাঁর পাশে ছিলেন। হাদিস বর্ণনাকারী",
      "তিনি অধিক হাদিস বর্ণনাকারী সাহাবীদের মধ্যে অন্যতম। তাঁর মাধ্যমে প্রায় ১,১৭০টি হাদিস বর্ণিত হয়েছে। জ্ঞান অন্বেষণ\n\nতিনি রাসূল (সাঃ)-এর সান্নিধ্যে থেকে হাদিস ও ফিকহের জ্ঞান লাভ করেন এবং তাঁর জীবন উৎসর্গ করেন জ্ঞান বিতরণে।\n\nতাঁর জ্ঞানের মর্যাদা",
      "তাবেয়ীনের যুগে তিনি মদীনার একজন প্রধান মুফতি এবং হাদিস শিক্ষকের ভূমিকা পালন করেন। ফিকহী অবস্থান\n\nতিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর ফতোয়াগুলো মদীনার আলেমদের কাছে গুরুত্বপূর্ণ ছিল। হাদিস বর্ণনার পদ্ধতি\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন এবং নিশ্চিত না হয়ে কোনো হাদিস বর্ণনা করতেন না।",
      "জিহাদে অংশগ্রহণ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে পরিচালিত বিভিন্ন সামরিক অভিযানে অংশগ্রহণ করেন। ফিতনা থেকে দূরে থাকা\n\nতিনি ফিতনার সময় সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার নীতি অবলম্বন করেন। মৃত্যু",
      "তিনি ৬৪ হিজরি বা ৭৪ হিজরিতে (৬৮৩/৬৯৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।\n\nতাঁর জীবনী",
      "তাঁর জীবনী অল্প বয়সে পিতাকে হারানোর পরও জ্ঞানার্জনের প্রতি তাঁর নিষ্ঠা এবং সুন্নাহর সংরক্ষণে তাঁর অবিচল অঙ্গীকারের এক আদর্শ উদাহরণ। তিনি তাঁর জীবনের বেশিরভাগ সময় জ্ঞান বিতরণে ব্যয় করেছেন। তাঁর বর্ণিত হাদিসগুলো ফিকহ ও আক্বীদার ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ। তাঁর ইবাদত ছিল সুপরিচিত। তাঁর জীবন\n\nতাঁর জীবন আল্লাহর সন্তুষ্টির জন্য উৎসর্গীকৃত ছিল।",
      "**খুদরী:** হাদিস বর্ণনায় পারদর্শী। ১১৭০+ হাদিস বর্ণনা করেছেন।",
      "**মৃত্যু:** ৬৯৩ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত আবু সাঈদ আল-খুদরী (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানার্জনের প্রতি নিরবচ্ছিন্ন নিষ্ঠা এবং সুন্নাহর সংরক্ষণে আত্মনিবেদন করলে আল্লাহ সর্বোচ্চ মর্যাদা দান করেন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "ubayy_ibn_kaab",
    "categoryId": "sahabider_jibon",
    "title": "উবাই ইবনে কা'ব (রাঃ)",
    "paragraphs": [
      "হযরত উবাই ইবনে কা'ব (রাঃ)-এর পূর্ণ নাম হলো উবাই ইবনে কা'ব ইবনে কায়স আল-খাযরাজী আল-আনসারী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর শ্রেষ্ঠতম ক্বারী ও কুরআন বিশেষজ্ঞ। তাঁর উপাধি ছিল 'সাইয়্যিদুল কুররা' (ক্বারীগণের সর্দার)। রাসূল (সাঃ) তাঁকে এই উপাধি দেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন।\n\nপ্রাথমিক জীবন\n\nতিনি মদীনায় ইসলাম গ্রহণের পর রাসূল (সাঃ)-এর ঘনিষ্ঠ সাহাবীদের মধ্যে স্থান পান। কুরআন মুখস্থ ও জ্ঞান",
      "তিনি ছিলেন রাসূল (সাঃ)-এর জীবদ্দশায় সম্পূর্ণ কুরআন মুখস্থকারী (হাফিয) প্রথম সাহাবীদের অন্যতম। রাসূল (সাঃ)-এর প্রশংসা\n\nরাসূল (সাঃ) তাঁকে উদ্দেশ করে বলেছিলেন: 'হে উবাই, আল্লাহ তোমাকে আদেশ করেছেন, যেন আমি তোমার কাছে কুরআন তেলাওয়াত করি।' এই আদেশ তাঁর মর্যাদার প্রমাণ।\n\nকুরআন সংকলন",
      "তিনি ছিলেন হযরত আবু বকর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে কুরআন সংকলন কমিটির প্রধান সদস্যদের মধ্যে একজন। তাঁর কিরাআত\n\nতাঁর কিরাআতের পদ্ধতি ছিল কুরআনের পাঠের ক্ষেত্রে অত্যন্ত নির্ভরযোগ্য এবং অনুকরণীয়। সামরিক ভূমিকা\n\nতিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। জ্ঞানের মর্যাদা",
      "তিনি ছিলেন সাহাবীদের মধ্যে অন্যতম শ্রেষ্ঠ জ্ঞানী, ফকীহ এবং তাফসীরকার।\n\nফতোয়া\n\nখুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি মদীনায় ফতোয়া দেওয়ার কাজে নিয়োজিত ছিলেন। প্রশাসনিক দায়িত্ব",
      "তিনি হযরত উমর (রাঃ)-এর খিলাফতকালে কুফায় হাদিস শিক্ষা দেন এবং পরে ফিকহী জ্ঞান বিতরণে ভূমিকা রাখেন। তাঁর হাদিস\n\nতিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্কতা অবলম্বন করতেন। মৃত্যু\n\nতিনি ১৯ হিজরি বা ২২ হিজরিতে (৬৪০/৬৪৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন।",
      "দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী\n\nতাঁর জীবনী কুরআন ও সুন্নাহর জ্ঞানের প্রতি তাঁর গভীর নিষ্ঠা এবং কুরআনের সংরক্ষণে তাঁর অসামান্য অবদানের এক উজ্জ্বল উদাহরণ।",
      "**কুরআন সংকলন:** কুরআন সংকলনে গুরুত্বপূর্ণ ভূমিকা রেখেছেন।",
      "**মৃত্যু:** ৬৪০ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত উবাই ইবনে কা'ব (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর কিতাবকে মুখস্থ করা, বোঝা এবং তার সংরক্ষণে অবদান রাখাই শ্রেষ্ঠত্বের মাপকাঠি।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "zaid_ibn_thabit",
    "categoryId": "sahabider_jibon",
    "title": "যায়েদ ইবনে সাবিত (রাঃ)",
    "paragraphs": [
      "হযরত যায়েদ ইবনে সাবিত (রাঃ)-এর পূর্ণ নাম হলো যায়েদ ইবনে সাবিত ইবনে আল-দাহহাক আল-আনসারী আল-খাযরাজী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর প্রধান ওহী লেখক এবং কুরআনের সংকলক। তাঁর উপাধি ছিল 'আবূ সাঈদ'। তিনি কুরআনের জ্ঞান এবং ফিকহী সিদ্ধান্ত (বিশেষ করে ফারায়েয) সম্পর্কে গভীর জ্ঞান রাখতেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন। প্রাথমিক জীবন\n\nমদীনায় হিজরতের সময় তাঁর বয়স ছিল মাত্র ১১ বছর। তিনি রাসূল (সাঃ)-এর সান্নিধ্য লাভ করেন। ওহী লেখক",
      "তিনি ছিলেন রাসূল (সাঃ)-এর প্রধান ওহী লেখকদের মধ্যে অন্যতম। রাসূল (সাঃ) যখনই ওহী পেতেন, তখনই তাঁকে ডেকে তা লিখে রাখতে বলতেন।\n\nভাষাজ্ঞান\n\nরাসূল (সাঃ)-এর নির্দেশে তিনি মাত্র সতেরো দিনে ইহুদিদের ভাষা (সিরিয়াক/হিব্রু) শিখে ফেলেন, যাতে তিনি তাদের চিঠি-পত্রের অনুবাদ করতে পারেন। সামরিক ভূমিকা",
      "তিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে তাঁর পাশে ছিলেন।\n\nকুরআন সংকলন (প্রধান মিশন)\n\nহযরত আবু বকর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে কুরআন সংকলন ও প্রচার কমিটির প্রধান হিসেবে তিনি কাজ করেন। এই কাজে তাঁর ভূমিকা ছিল ঐতিহাসিক। তিনি ছিলেন কুরআনের হাফিয এবং রাসূল (সাঃ)-এর শেষবার কুরআন তেলাওয়াত শোনার সাক্ষী।",
      "ফারায়েয বিশেষজ্ঞ\n\nতিনি ছিলেন সাহাবীদের মধ্যে ফারায়েয (উত্তরাধিকার আইন) সম্পর্কে সবচেয়ে জ্ঞানী ব্যক্তি। হযরত উমর (রাঃ) তাঁর জ্ঞানের উচ্চ মর্যাদা দিতেন। জ্ঞানের মর্যাদা\n\nহযরত উমর (রাঃ) তাঁকে মদীনার প্রধান ফকীহ এবং মুফতি হিসেবে নিযুক্ত করেন। হাদিস ও ফিকহ",
      "তিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্ক ছিলেন এবং ফিকহের ক্ষেত্রে গভীর জ্ঞান রাখতেন।\n\nপ্রশাসনিক দায়িত্ব\n\nখুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি মদীনার কাজীর (বিচারক) এবং বাইতুল মালের প্রধান হিসেবে দায়িত্ব পালন করেন। মৃত্যু",
      "তিনি ৪৫ হিজরিতে (৬৬৫ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।\n\nতাঁর জীবনী",
      "তাঁর জীবনী প্রশাসনিক ক্ষেত্রে তাঁর জ্ঞান ও দক্ষতার প্রমাণ বহন করে এবং কুরআনের সংরক্ষণে তাঁর অসামান্য অবদান ইসলামের ইতিহাসে চিরস্মরণীয়।",
      "**কুরআন লেখক:** রাসূলের ওহী লেখকদের প্রধান। কুরআন সংকলনে নেতৃত্ব দিয়েছেন।",
      "**মৃত্যু:** ৬৬৫ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত যায়েদ ইবনে সাবিত (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, বিশেষত কুরআন ও সুন্নাহর জ্ঞান, একজন ব্যক্তিকে প্রশাসনিক ও ধর্মীয় উভয় ক্ষেত্রে নেতৃত্ব দেওয়ার সুযোগ করে দেয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "khalid_ibn_saeed",
    "categoryId": "sahabider_jibon",
    "title": "খালিদ ইবনে সাইদ (রাঃ)",
    "paragraphs": [
      "হযরত খালিদ ইবনে সাইদ (রাঃ)-এর পূর্ণ নাম হলো খালিদ ইবনে সাইদ ইবনে আল-আস ইবনে উমাইয়্যা আল-কুরাইশী আল-উমাভী। তিনি ছিলেন ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী এবং একজন গুরুত্বপূর্ণ প্রশাসনিক ব্যক্তিত্ব। তাঁর উপাধি ছিল 'আবূ সাঈদ'। তিনি উমাইয়্যা গোত্রের অন্যতম সম্মানিত ব্যক্তি ছিলেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কায় কুরাইশ গোত্রের বনু উমাইয়্যা শাখায় জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিককার পঞ্চম বা ষষ্ঠ ইসলাম গ্রহণকারী। নির্যাতন\n\nতাঁর বাবা সাইদ ইবনে আল-আস তাঁর ইসলাম গ্রহণের কারণে তাঁকে কঠোর নির্যাতন করেন। তিনি দীর্ঘদিন নির্যাতন সহ্য করেন।",
      "হিজরত\n\nতিনি কুরাইশদের নির্যাতন থেকে বাঁচতে তাঁর স্ত্রী উম্মে আমিন (রাঃ)-এর সাথে আবিসিনিয়ায় (হাবশা) হিজরতকারী প্রথম দলের অন্তর্ভুক্ত ছিলেন। সামরিক ভূমিকা\n\nআবিসিনিয়া থেকে ফেরার পর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। প্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে সানা'আ (ইয়েমেন)-এর গভর্নর হিসেবে নিযুক্ত করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন।\n\nআবু বকর (রাঃ)-এর খিলাফতকালে\n\nরাসূল (সাঃ)-এর ইন্তেকালের পর তিনি প্রথমে উসামা (রাঃ)-এর অভিযানের অংশ হতে চেয়েছিলেন। রিদ্দা যুদ্ধ",
      "আবু বকর (রাঃ)-এর খিলাফতকালে তিনি রিদ্দা যুদ্ধে গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন এবং মুসলিম বাহিনীকে নেতৃত্ব দেন।\n\nশাম অভিযান\n\nআবু বকর (রাঃ) যখন সিরিয়া অভিযানে খালিদ ইবনে ওয়ালিদ (রাঃ)-কে সেনাপতি নিযুক্ত করেন, তখন খালিদ ইবনে সাইদ (রাঃ)-এর নেতৃত্বেও একটি বাহিনী পরিচালিত হয়। বিবাহ",
      "তিনি রাসূল (সাঃ)-এর স্ত্রী উম্মে হাবিবা (রাঃ)-এর সাথে বিবাহবন্ধনে আবদ্ধ হয়েছিলেন। শাহাদাত\n\nহযরত আবু বকর (রাঃ)-এর খিলাফতের প্রথম দিকেই তিনি সিরিয়া অভিযানে শহীদ হন।\n\nতাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে তাঁর প্রাথমিক ইসলাম গ্রহণ, নির্যাতনের মুখে অবিচলতা এবং প্রশাসনিক ও সামরিক ক্ষেত্রে তাঁর গুরুত্বপূর্ণ অবদানের জন্য স্মরণীয়।",
      "**প্রথম দিকে ইসলাম:** দশম মুসলিম। প্রথম দিকে ইসলাম গ্রহণ করেন।",
      "**মৃত্যু:** ৬৪২ সাল। সিরিয়ায় শহীদ।"
    ],
    "moral": "হযরত খালিদ ইবনে সাইদ (রাঃ)-এর জীবন প্রমাণ করে যে, সত্যের জন্য পরিবার ও সমাজ থেকে বিচ্ছিন্ন হয়েও আল্লাহর পথে দৃঢ় থাকা অপরিহার্য।",
    "source": "ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "sahabi_id": "bilal_ibn_rabah",
    "title": "বিলাল ইবনে রাবাহ (রাঃ)",
    "paragraphs": [
      "মক্কায় এক ক্রীতদাসের জন্ম। নাম বিলাল ইবনে রাবাহ। পিতা রাবাহ, মা হামামা - দুজনেই আবিসিনিয়ান ক্রীতদাস। মালিক উমাইয়া ইবনে খালাফ - নিষ্ঠুর কাফির। কালো চামড়া, লম্বা, চিকন শরীর। কে জানত এই দাস হবেন ইসলামের প্রথম মুয়াজ্জিন!",
      "**ইসলাম গ্রহণ:** প্রথম দিকে ইসলাম গ্রহণ করলেন। আবু বকরের মাধ্যমে। মালিক জানতে পারল। রাগে ফেটে পড়ল। শুরু হল নির্যাতন।",
      "**নির্যাতন:** দুপুরের উত্তপ্ত মরুভূমি। বিলালকে উলঙ্গ করে বালুতে শুইয়ে দেওয়া হল। বুকের উপর ভারী পাথর। উমাইয়া বলল: মুহাম্মাদের ধর্ম ত্যাগ করো! বিলাল বললেন: আহাদ, আহাদ! (এক, এক - আল্লাহ এক!) আরো নির্যাতন। গলায় রশি বেঁধে মক্কার রাস্তায় টেনে নিয়ে যাওয়া হল। শিশুরা পাথর মারল। বিলাল বললেন: আহাদ, আহাদ! রাসূল (সাঃ) দূর থেকে দেখলেন। চোখে পানি। আবু বকরকে বললেন: বিলালকে মুক্ত করো।",
      "**মুক্তি:** আবু বকর উমাইয়ার কাছে গেলেন। বললেন: বিলালকে বিক্রি করবে? উমাইয়া বলল: তুমি তাকে নষ্ট করেছ, তুমিই কিনো। আবু বকর অনেক দাম দিয়ে বিলাল কিনলেন। সাথে সাথে মুক্ত করে দিলেন। বিলাল কাঁদলেন। আবু বকর বললেন: তুমি আমার ভাই।",
      "**মদীনায় হিজরত:** ৬২২ সাল। বিলাল মদীনায় হিজরত করলেন। রাসূল (সাঃ) তাকে আবু রুওয়াইহা আল-খাসামির সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**প্রথম মুয়াজ্জিন:** মসজিদে নববী তৈরি হল। নামাযের জন্য ডাকার পদ্ধতি কী হবে? কেউ বলল ঘণ্টা, কেউ বলল শিঙা। আবদুল্লাহ ইবনে যায়েদ স্বপ্নে আযান দেখলেন। রাসূল (সাঃ) বললেন: এটা সত্য স্বপ্ন। বিলালকে শেখাও, তার আওয়াজ উঁচু। বিলাল প্রথম আযান দিলেন। সেই সুমধুর কণ্ঠ! মদীনায় ছড়িয়ে গেল।",
      "**যুদ্ধসমূহ:** বদর, উহুদ, খন্দক, খায়বার, মক্কা বিজয় - সব যুদ্ধে অংশ নিলেন। বদরে উমাইয়া ইবনে খালাফ - বিলালের পুরনো মালিক। বিলাল চিৎকার করলেন: উমাইয়া! কুফরের নেতা! আমি বাঁচব না যদি সে বাঁচে! উমাইয়া নিহত হল। বিলালের প্রতিশোধ।",
      "**মক্কা বিজয়:** ৬৩০ সাল। মক্কা বিজয়। রাসূল (সাঃ) কাবায় গেলেন। বললেন: বিলাল, কাবার ছাদে উঠে আযান দাও। বিলাল কাবার ছাদে উঠলেন। আযান দিলেন। সেই দাস আজ কাবার ছাদে! আবু সুফিয়ান বলল: আল্লাহর শুকরিয়া আমার পিতা মারা গেছেন, এই দিন দেখেননি। আত্তাব ইবনে উসাইদ বলল: আল্লাহ যদি চাইতেন তাহলে বিলাল ছাড়া অন্য কাউকে দিতেন। কিন্তু আল্লাহ বিলালকেই সম্মান দিলেন!",
      "**রাসূলের মৃত্যু:** ৬৩২ সাল। রাসূল (সাঃ) মারা গেলেন। বিলাল কাঁদতে কাঁদতে বললেন: আমি আর আযান দিতে পারব না। আবু বকর বললেন: বিলাল, আযান দাও। বিলাল বললেন: আপনি যদি আমাকে মুক্ত করে থাকেন তাহলে আমাকে ছেড়ে দিন। আমি আর আযান দিতে পারব না। আবু বকর কাঁদলেন। বললেন: যাও।",
      "**শামে জিহাদ:** বিলাল শামে চলে গেলেন। জিহাদে অংশ নিলেন। একবার স্বপ্নে রাসূল (সাঃ) কে দেখলেন। রাসূল বললেন: বিলাল, এই রূক্ষতা কেন? আমার সাথে দেখা করার সময় কি হয়নি? বিলাল ঘুম থেকে উঠে মদীনায় রওনা হলেন। হাসান ও হুসাইনের সাথে দেখা। তারা বলল: বিলাল চাচা, আমাদের জন্য আযান দিন। বিলাল আযান দিলেন। মদীনাবাসী কাঁদতে লাগল। রাসূলের স্মৃতি মনে পড়ল।",
      "**ইবাদত:** রাসূল (সাঃ) বলেছেন: আমি জান্নাতে তোমার জুতার আওয়াজ শুনেছি। কারণ? বিলাল বললেন: যখনই আমার অযু ভাঙে, আমি সাথে সাথে অযু করে দুই রাকাত নফল পড়ি।",
      "**মৃত্যু:** ৬৪০ সাল। দামেস্কে মৃত্যু। বয়স ৬০ বছরের বেশি। স্ত্রী কাঁদছেন। বিলাল বললেন: কাঁদো না! আগামীকাল আমি মুহাম্মাদ ও তার সাথীদের সাথে দেখা করব! দাফন হলেন দামেস্কে। প্রথম মুয়াজ্জিন। নির্যাতিত দাস থেকে ইসলামের গর্ব। আহাদ, আহাদ - ঈমানের প্রতীক।"
    ],
    "moral": "হযরত বিলাল (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে অবিচল ধৈর্য ও ভালোবাসা জাতি-বর্ণ নির্বিশেষে সকল মানুষের জন্য মুক্তির পথ উন্মুক্ত করে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "bilal_ibn_rabah"
  },
  {
    "id": "jabir_ibn_abdullah",
    "categoryId": "sahabider_jibon",
    "title": "জাবির ইবনে আব্দুল্লাহ (রাঃ)",
    "paragraphs": [
      "হযরত জাবির ইবনে আব্দুল্লাহ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ জাবির ইবনে আব্দুল্লাহ ইবনে আমর ইবনে হারাম আল-আনসারী আল-সালামী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন তরুণ সাহাবী এবং অধিক হাদিস বর্ণনাকারীদের অন্যতম। তাঁর উপাধি ছিল আবু আব্দুল্লাহ। তিনি তাঁর জীবনকে রাসূল (সাঃ)-এর স্মৃতিচারণ এবং জ্ঞান বিতরণে ব্যয় করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি এবং তাঁর পিতা আব্দুল্লাহ ইবনে আমর আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী ছিলেন। পারিবারিক পটভূমি\n\nতাঁর পিতা আব্দুল্লাহ ইবনে আমর উহুদের যুদ্ধে শহীদ হন। শহীদ হওয়ার সময় তিনি তাঁর পুত্র জাবির (রাঃ)-এর ওপর তাঁর নয়জন বোনের দায়িত্ব অর্পণ করে যান।",
      "প্রাথমিক জীবন\n\nপিতার শাহাদাতের পর অল্প বয়সে তিনি তাঁর বোনদের লালন-পালনের দায়িত্ব নেন। রাসূল (সাঃ) তাঁর এই পারিবারিক দায়িত্বের প্রতি বিশেষভাবে খেয়াল রাখতেন। সামরিক ভূমিকা\n\nতিনি বদর ও উহুদের যুদ্ধে অংশগ্রহণ করতে চেয়েছিলেন, কিন্তু তাঁর বয়স কম থাকায় এবং পরিবারের দায়িত্বের কারণে শুরুতে অনুমতি পাননি।",
      "প্রথম যুদ্ধে অংশগ্রহণ\n\nতিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর প্রায় সকল সামরিক অভিযানে (১৯টির মতো) তাঁর পাশে ছিলেন। হাদিস বর্ণনাকারী\n\nতিনি রাসূল (সাঃ)-এর জীবনের শেষ আট বছরে তাঁর সান্নিধ্য লাভ করেন। তাঁর মাধ্যমে প্রায় ১,৫৪০টি হাদিস বর্ণিত হয়েছে। তাঁর জীবনের দীর্ঘতা",
      "তিনি দীর্ঘজীবন লাভ করেন এবং তাঁর বর্ণিত হাদিসগুলো ফিকহ ও সীরাতের ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ।\n\nজ্ঞানের প্রতি আগ্রহ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর জ্ঞানার্জনের জন্য দূর-দূরান্তে সফর করেন। তিনি হাদিসের একটি নির্দিষ্ট অংশ শেখার জন্য মিশর পর্যন্ত ভ্রমণ করেন। জ্ঞান বিতরণ",
      "তিনি তাঁর জীবনের শেষভাগে মক্কা ও মদীনায় হাদিস শিক্ষাদানের এক বিশাল কেন্দ্র প্রতিষ্ঠা করেন। হজ ও উমরাহ\n\nতিনি রাসূল (সাঃ)-এর সঙ্গে বিদায় হজ পালন করেন এবং রাসূল (সাঃ)-এর হজের পদ্ধতি বিস্তারিতভাবে বর্ণনা করেন।\n\nফিতনা থেকে দূরে থাকা",
      "তিনি ফিতনার সময় সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার নীতি অবলম্বন করেন। দারিদ্র্য দূরীকরণ\n\nএকবার তিনি তার পিতার ঋণের কারণে বিপদে পড়লে, রাসূল (সাঃ) অলৌকিকভাবে তাঁর ঋণ পরিশোধে সাহায্য করেন। তাঁর বিনয়\n\nতিনি ছিলেন অত্যন্ত বিনয়ী এবং কঠোরভাবে আল্লাহর তাকওয়াবান।",
      "মৃত্যু\n\nতিনি ৭৮ হিজরিতে (৬৯৭ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। তিনি ছিলেন মদীনায় ইন্তেকাল করা শেষ সাহাবীদের মধ্যে অন্যতম। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী",
      "**হাদিস বর্ণনা:** ১৫৪০+ হাদিস বর্ণনা করেছেন। দীর্ঘজীবী সাহাবী।",
      "**মৃত্যু:** ৬৯৭ সাল। মদীনায় মৃত্যু।"
    ],
    "moral": "হযরত জাবির ইবনে আব্দুল্লাহ (রাঃ)-এর জীবন প্রমাণ করে যে, পারিবারিক দায়িত্ব পালন করেও রাসূল (সাঃ)-এর সুন্নাহকে রক্ষা করা এবং জ্ঞান বিতরণে নিবেদিত হওয়া সম্ভব।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abu_musa_al_ashari",
    "categoryId": "sahabider_jibon",
    "title": "আবু মূসা আল-আশ'আরী (রাঃ)",
    "paragraphs": [
      "হযরত আবু মূসা আল-আশ'আরী (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে কায়স ইবনে সুলাইম আল-আশ'আরী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন বিশিষ্ট সাহাবী, বিচারক (কাজী) এবং প্রশাসক। তাঁর উপাধি ছিল আবু মূসা। তাঁর কুরআন তেলাওয়াতের সুমিষ্ট কণ্ঠের কারণে রাসূল (সাঃ) তাঁকে বিশেষ প্রশংসা করেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি ইয়েমেনের আশ'আর গোত্রে জন্মগ্রহণ করেন। তিনি প্রাথমিক পর্যায়েই ইসলাম গ্রহণ করেন।\n\nহিজরত ও সান্নিধ্য\n\nতিনি আবিসিনিয়ায় (হাবশা) হিজরতকারীদের মধ্যে ছিলেন। পরে তিনি মদীনায় হিজরত করেন। কুরআন তেলাওয়াত",
      "তাঁর কুরআন তেলাওয়াতের কণ্ঠ ছিল অত্যন্ত সুমধুর। রাসূল (সাঃ) তাঁর তেলাওয়াত শুনে বলেছিলেন: 'তোমাকে দাউদ (আঃ)-এর সুরের কিছু অংশ দেওয়া হয়েছে।' সামরিক ভূমিকা\n\nতিনি বদর, উহুদ সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন।\n\nপ্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ইয়েমেনের গভর্নর হিসেবে নিযুক্ত করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন। হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি বসরা এবং কুফার গভর্নর হিসেবে দায়িত্ব পালন করেন। সামরিক বিজয়\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে পারস্য এবং অন্যান্য অঞ্চলে সামরিক অভিযানে নেতৃত্ব দেন এবং গুরুত্বপূর্ণ শহর জয় করেন।\n\nবিচারক ও মুফতি",
      "তিনি ছিলেন সাহাবীদের মধ্যে অন্যতম শ্রেষ্ঠ বিচারক (কাজী) এবং মুফতি। তাঁর ফতোয়াগুলো খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ ছিল। আলী (রাঃ)-এর খিলাফতকাল\n\nহযরত আলী (রাঃ)-এর খিলাফতকালে সৃষ্ট ফিতনার সময় তিনি সালিশকারী হিসেবে ভূমিকা পালন করেন। সালিশের ফলাফল\n\nসিফফিনের যুদ্ধের পর তিনি হযরত আলী (রাঃ)-এর পক্ষ থেকে সালিশকারী হিসেবে নিযুক্ত হন, যদিও সালিশের ফলাফল প্রত্যাশিত ছিল না।",
      "জ্ঞানের প্রতি আগ্রহ\n\nতিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্ক ছিলেন এবং তাঁর জ্ঞান বিতরণে নিবেদিত ছিলেন। তাঁর ছাত্রদের সংখ্যা\n\nতাঁর ছাত্রদের মধ্যে তাবেয়ীনের অনেক বড় ইমাম হাদিস ও ফিকহ শিখেছেন। ব্যক্তিগত চরিত্র",
      "তিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং একজন পরিশ্রমী আলেম। মৃত্যু\n\nতিনি ৪২ বা ৪৪ হিজরিতে (৬৬২/৬৬৪ খ্রিস্টাব্দে) কুফা শহরে ইন্তেকাল করেন।\n\nতাঁর জীবনী",
      "তাঁর জীবনী জ্ঞান, বিচার এবং প্রশাসনের ক্ষেত্রে তাঁর দক্ষতা ও নিষ্ঠার এক আদর্শ উদাহরণ।",
      "**সুমধুর কণ্ঠ:** কুরআন তিলাওয়াতে সুমধুর কণ্ঠের অধিকারী ছিলেন।",
      "**মৃত্যু:** ৬৬২ সাল। কুফায় মৃত্যু।"
    ],
    "moral": "হযরত আবু মূসা আল-আশ'আরী (রাঃ)-এর জীবন প্রমাণ করে যে, আধ্যাত্মিক গুণাবলী (মধুর কণ্ঠস্বর) এবং জ্ঞান একজন ব্যক্তিকে প্রশাসনিক ও বিচারিক ক্ষেত্রে নেতৃত্ব দিতে সাহায্য করে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "amr_ibn_al_as",
    "categoryId": "sahabider_jibon",
    "title": "আমর ইবনুল আস (রাঃ)",
    "paragraphs": [
      "হযরত আমর ইবনুল আস (রাঃ)-এর পূর্ণ নাম হলো আমর ইবনে আল-আস ইবনে ওয়া'ইল আল-কুরাইশী আল-সাহমী। তিনি ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ সামরিক ও রাজনৈতিক ব্যক্তিত্ব। তাঁর উপাধি ছিল আবূ আব্দুল্লাহ। তিনি তাঁর সামরিক কৌশল, রাজনৈতিক প্রজ্ঞা এবং বুদ্ধিমত্তার জন্য পরিচিত। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কার কুরাইশ গোত্রে জন্মগ্রহণ করেন। তিনি মক্কা বিজয়ের মাত্র কিছুদিন আগে হিজরতের অষ্টম বছর ইসলাম গ্রহণ করেন।\n\nইসলাম গ্রহণের পূর্বে\n\nইসলাম গ্রহণের আগে তিনি ছিলেন কুরাইশদের অন্যতম প্রধান শত্রু এবং রাজনৈতিক ব্যক্তিত্ব। সামরিক ভূমিকা",
      "ইসলাম গ্রহণের পর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন এবং মুসলিম বাহিনীর নেতৃত্ব দেন। প্রশাসনিক দায়িত্ব\n\nরাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ওমানের গভর্নর হিসেবে নিযুক্ত করা হয়।\n\nসামরিক বিজয়: মিশর বিজয় (৬৪১ খ্রি.)",
      "হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি মিশর বিজয়ের জন্য মুসলিম বাহিনীর নেতৃত্ব দেন। তাঁর সামরিক কৌশল এবং দ্রুত পদক্ষেপ মিশরের রোমান শাসনকে দুর্বল করে দেয়। মিশর বিজয় ছিল তাঁর জীবনের শ্রেষ্ঠ সামরিক কীর্তি। তিনি কায়রো এবং আলেকজান্দ্রিয়া শহর জয় করেন।\n\nরাজনৈতিক প্রজ্ঞা\n\nতিনি ছিলেন অত্যন্ত দূরদর্শী এবং রাজনৈতিকভাবে বিচক্ষণ। তিনি হযরত উমর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে গুরুত্বপূর্ণ প্রশাসনিক পদে ছিলেন। হযরত মুয়াবিয়া (রাঃ)-এর পক্ষে",
      "হযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি হযরত মুয়াবিয়া (রাঃ)-এর পক্ষ অবলম্বন করেন।\n\nসালিশ\n\nসিফফিনের যুদ্ধে তিনি মুয়াবিয়া (রাঃ)-এর পক্ষ থেকে সালিশকারী হিসেবে নিযুক্ত হন এবং তাঁর রাজনৈতিক বুদ্ধিমত্তা ব্যবহার করেন। মিশরের গভর্নর",
      "তিনি হযরত মুয়াবিয়া (রাঃ)-এর খিলাফতকালে মিশরের গভর্নর হিসেবে দায়িত্ব পালন করেন এবং প্রশাসনিক ক্ষেত্রে গুরুত্বপূর্ণ অবদান রাখেন।\n\nহাদিস ও ফিকহ\n\nতিনি হাদিস বর্ণনা এবং ফিকহী মাসআলায় জ্ঞান রাখতেন। তাঁর পুত্র আব্দুল্লাহ ইবনে আমর (রাঃ) ছিলেন একজন বিখ্যাত মুহাদ্দিস। জ্ঞানের মর্যাদা",
      "রাসূল (সাঃ) তাঁর ইসলাম গ্রহণকে মুসলিমদের জন্য বরকত বলে উল্লেখ করেছিলেন। মৃত্যু\n\nতিনি ৪৩ হিজরিতে (৬৬৪ খ্রিস্টাব্দে) মিশরে ইন্তেকাল করেন। তাঁর জীবনী\n\nতাঁর জীবনী ইসলামের ইতিহাসে তাঁর সামরিক প্রজ্ঞা, রাজনৈতিক বুদ্ধি এবং প্রশাসনিক দক্ষতার এক অনন্য উদাহরণ।",
      "**সেনাপতি:** মিশর ও উত্তর আফ্রিকা বিজয়ে নেতৃত্ব দিয়েছেন।",
      "**মৃত্যু:** ৬৬৪ সাল। মিশরে মৃত্যু।"
    ],
    "moral": "হযরত আমর ইবনুল আস (রাঃ)-এর জীবন প্রমাণ করে যে, রাজনৈতিক বুদ্ধিমত্তা ও দূরদর্শিতা মুসলিম উম্মাহর প্রশাসনিক বিজয়ের ক্ষেত্রে অপরিহার্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "mughira_ibn_shubah",
    "categoryId": "sahabider_jibon",
    "title": "মুগীরা ইবনে শু'বাহ (রাঃ)",
    "paragraphs": [
      "হযরত মুগীরা ইবনে শু'বাহ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ মুগীরা ইবনে শু'বাহ ইবনে আবি আমির আল-সাকাফী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন বিশিষ্ট সাহাবী, প্রখ্যাত প্রশাসক এবং কূটনৈতিক। তাঁর উপাধি ছিল আবূ আব্দুল্লাহ। তিনি তাঁর তীক্ষ্ণ বুদ্ধিমত্তা, বাকপটুতা এবং রাজনৈতিক দূরদর্শিতার জন্য পরিচিত ছিলেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কার কাছে তাইফ অঞ্চলের সাকাফ গোত্রে জন্মগ্রহণ করেন। তিনি হুদাইবিয়ার সন্ধির আগে ইসলাম গ্রহণ করেন। ইসলামের পূর্বে জীবন\n\nইসলাম গ্রহণের আগে তিনি ছিলেন একজন ধনী ও প্রভাবশালী ব্যক্তি। সামরিক ভূমিকা",
      "তিনি হুদাইবিয়ার সন্ধি এবং অন্যান্য গুরুত্বপূর্ণ অভিযানে রাসূল (সাঃ)-এর পাশে ছিলেন।\n\nহুদাইবিয়ার সন্ধি\n\nহুদাইবিয়ার সন্ধির সময় তিনি রাসূল (সাঃ)-এর সামরিক পরামর্শদাতা ছিলেন এবং কাফেরদের সাথে আলোচনার ক্ষেত্রে গুরুত্বপূর্ণ ভূমিকা রাখেন। প্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর ইন্তেকালের পর খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি গুরুত্বপূর্ণ প্রশাসনিক পদে ছিলেন। হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি বসরা এবং কুফার গভর্নর হিসেবে দায়িত্ব পালন করেন।\n\nগভর্নরশিপ\n\nতাঁর প্রশাসনিক দক্ষতা ছিল অত্যন্ত উচ্চ মানের। তিনি জটিল পরিস্থিতিতেও সুশাসন প্রতিষ্ঠা করতেন। সামরিক বিজয়",
      "তিনি পারস্য বিজয়ের অভিযানেও অংশগ্রহণ করেন এবং গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন। রাজনীতি ও কূটনীতি\n\nতিনি ছিলেন একজন দক্ষ কূটনীতিবিদ। তাঁর বুদ্ধিমত্তা অনেক জটিল রাজনৈতিক সমস্যা সমাধানে সাহায্য করত।\n\nহাদিস বর্ণনাকারী",
      "তিনি রাসূল (সাঃ)-এর হাদিস বর্ণনা করতেন এবং তাঁর জীবনের বিভিন্ন ঘটনা সম্পর্কে অবহিত ছিলেন। তাঁর ফিকহ\n\nতিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর সিদ্ধান্তগুলো ছিল বিচক্ষণতাপূর্ণ। মৃত্যু\n\nতিনি ৫০ হিজরিতে (৬৭০ খ্রিস্টাব্দে) কুফা শহরে ইন্তেকাল করেন। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে তাঁর রাজনৈতিক প্রজ্ঞা, প্রশাসনিক দক্ষতা এবং কূটনৈতিক জ্ঞানের এক অনন্য উদাহরণ।",
      "**সেনাপতি:** ইরাক বিজয়ে গুরুত্বপূর্ণ ভূমিকা রেখেছেন।",
      "**মৃত্যু:** ৬৭০ সাল। কুফায় মৃত্যু।"
    ],
    "moral": "হযরত মুগীরা ইবনে শু'বাহ (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, প্রজ্ঞা এবং বাকপটুতা সামরিক ও প্রশাসনিক উভয় ক্ষেত্রেই সাফল্যের চাবিকাঠি।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abdullah_ibn_amr_ibn_al_as",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে আমর ইবনুল আস (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে আমর (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে আমর ইবনে আল-আস আল-সাহমী আল-কুরাইশী। তিনি ছিলেন তাঁর পিতা আমর ইবনুল আস (রাঃ)-এর মতো একজন প্রখ্যাত মুহাদ্দিস ও ফকীহ। তাঁর উপাধি ছিল আবূ মুহাম্মদ। তিনি হাদিস বর্ণনা, ইবাদত এবং কিতাব সংকলনের জন্য বিখ্যাত ছিলেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় জন্মগ্রহণ করেন। তিনি তাঁর পিতা আমর ইবনুল আস (রাঃ)-এর আগেই ইসলাম গ্রহণ করেন।\n\nপিতার সঙ্গে পার্থক্য\n\nতাঁর পিতা ছিলেন একজন রাজনীতিবিদ ও সেনাপতি, আর আব্দুল্লাহ (রাঃ) ছিলেন মূলত একজন ইবাদতগুজার ও পণ্ডিত। হাদিস লেখক",
      "তিনি রাসূল (সাঃ)-এর অনুমতি নিয়ে তাঁর হাদিসগুলো লিখে রাখতেন। তাঁর সংকলিত গ্রন্থের নাম ছিল 'আস-সহীফাহ আস-সাদিকা'। এই সংকলনটিই মুসলিম ইতিহাসের প্রাচীনতম হাদিস সংকলনগুলোর মধ্যে অন্যতম।\n\nইবাদত\n\nতিনি ছিলেন অত্যধিক ইবাদতগুজার। তিনি প্রায় প্রতিদিনই রোজা রাখতেন এবং রাতে সালাত আদায় করতেন। রাসূল (সাঃ)-এর নির্দেশনা",
      "তাঁর অতিরিক্ত ইবাদতের কারণে রাসূল (সাঃ) তাঁকে কিছুটা সংযত হতে এবং তাঁর পরিবারকে সময় দিতে উপদেশ দেন। হাদিস বর্ণনাকারী\n\nতিনি প্রায় ৭০০টি হাদিস বর্ণনা করেন। তাঁর হাদিসগুলো ছিল অত্যন্ত নির্ভরযোগ্য।\n\nজ্ঞান ও ফিকহ",
      "তিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর ফতোয়াগুলো ছিল গুরুত্বপূর্ণ। সামরিক ভূমিকা\n\nতিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। সিফফিনের যুদ্ধে অংশগ্রহণ\n\nহযরত আলী (রাঃ) এবং মুয়াবিয়া (রাঃ)-এর মধ্যকার সিফফিনের যুদ্ধে তিনি অনিচ্ছাসত্ত্বেও তাঁর পিতা আমর ইবনুল আস (রাঃ)-এর নির্দেশে মুয়াবিয়া (রাঃ)-এর পক্ষে অংশগ্রহণ করেন।",
      "রাজনৈতিক জীবন\n\nতাঁর জীবনের প্রধান আগ্রহ রাজনীতি নয়, বরং জ্ঞানচর্চা ও ইবাদত ছিল। মৃত্যু\n\nতিনি ৬৩ হিজরিতে (৬৮৩ খ্রিস্টাব্দে) মিশরে ইন্তেকাল করেন। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে হাদিস সংকলন এবং ইবাদতের প্রতি তাঁর নিরবচ্ছিন্ন নিষ্ঠার এক আদর্শ উদাহরণ।",
      "**হাদিস বর্ণনা:** ৭০০+ হাদিস বর্ণনা করেছেন।",
      "**মৃত্যু:** ৬৮৪ সাল। তায়েফে মৃত্যু।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে আমর (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, বিশেষত হাদিস সংরক্ষণ এবং ইবাদতের প্রতি গভীর মনোযোগই জীবনের শ্রেষ্ঠ সম্পদ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "saad_ibn_abi_waqqas",
    "categoryId": "sahabider_jibon",
    "title": "সা'দ ইবনে আবী ওয়াক্কাস (রাঃ)",
    "paragraphs": [
      "হযরত সা'দ ইবনে আবী ওয়াক্কাস (রাঃ) ছিলেন মহানবী মুহাম্মদ (সাঃ)-এর অন্যতম প্রধান সাহাবী এবং আশারায়ে মুবাশশারাহ (জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত দশজন)-এর অন্যতম। তিনি ছিলেন তাদের মধ্যে সর্বশেষ ইন্তেকালকারী। তাঁর পুরো নাম আবু ইসহাক সা'দ এবং পিতা আবু ওয়াক্কাস মালিক। তিনি কুরাইশ বংশের বনু যুহরা শাখার সন্তান। তার মাতার নাম হামনা বিনতে সুফিয়ান।",
      "জন্ম ও প্রারম্ভিক জীবন\n\nতিনি মক্কায় ৫৯৫ খ্রিস্টাব্দে জন্মগ্রহণ করেন। তার পিতা আবু ওয়াক্কাস মালিক ইবনে উহাইব ছিলেন কুরাইশ গোত্রের বনু যুহরা শাখার। উহাইব ইবনে আবদ মানাফ ছিলেন রাসূল (সাঃ)-এর মা আমিনা বিনতে ওয়াহাবের চাচা। এভাবে সা'দ (রাঃ) রাসূল (সাঃ)-এর মাতৃকুলের আত্মীয় ছিলেন।",
      "ইসলাম গ্রহণ\n\nহযরত আবু বকর (রাঃ) ছিলেন সা'দের অন্তরঙ্গ বন্ধু। আবু বকর (রাঃ)-এর দাওয়াতেই তিনি মাত্র ১৭ বছর বয়সে ইসলাম গ্রহণ করেন এবং তিনি ছিলেন ১৭তম ইসলাম গ্রহণকারী। সা'দ (রাঃ) বলেন, 'ইসলাম গ্রহণের পর আমি নিজেকে তৃতীয় মুসলমান হিসেবে দেখতে পেলাম।' আসলে তিনি রাসূলুল্লাহর (সাঃ) নবুওয়াত প্রাপ্তির সাথে সাথে ইসলাম গ্রহণ করেন; কিন্তু অনেকের মতই তখন তিনি প্রকাশ্যে ঘোষণা দেননি।",
      "মায়ের সাথে ঘটনা ও কুরআনের আয়াত নাযিল\n\nসা'দের ইসলাম গ্রহণের কথা শুনে তার মা হামনা হৈ চৈ ও বিলাপ শুরু করে দিলেন। মা পরিষ্কার বলে দিলেন, 'সা'দ যতক্ষণ মুহাম্মাদের রিসালাতের অস্বীকৃতির ঘোষণা না দেবে ততক্ষণ আমি কিছু খাব না, কিছু পান করব না, রৌদ্র থেকে বাঁচার জন্য ছায়াতেও আসব না।' সা'দ (রাঃ) বড় অস্থির হয়ে পড়লেন এবং রাসূলের (সাঃ) খিদমতে হাজির হয়ে সব ঘটনা বিবৃত করলেন।",
      "কুরআনের আয়াত নাযিল\n\nরাসূলের (সাঃ) নিকট থেকে জবাব পাওয়ার পূর্বেই সূরা আল-আনকাবুতের অষ্টম আয়াতটি নাযিল হল: 'وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حُسْنًا ۖ وَإِن جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا' (আমি মানুষকে নির্দেশ দিয়েছি তার পিতামাতার প্রতি সদ্ব্যবহার করতে। তবে তারা যদি তোমার ওপর বল প্রয়োগ করে আমার সাথে এমন কিছু শরীক করতে বলে যার সম্পর্কে তোমার কোন জ্ঞান নেই, তুমি তাদের মেনো না।) - সূরা আনকাবুত: ৮",
      "মায়ের কাছে দৃঢ় অবস্থান\n\nতার মা তিনদিন পর্যন্ত কিছু মুখে দিলেন না। বার বার তিনি মার কাছে এসে বুঝাবার চেষ্টা করলেন; কিন্তু মায়ের একই কথা। অবশেষে তিনি মার মুখের ওপর বলে দিতে বাধ্য হলেন, 'মা, আপনার মতো হাজারটি মাও যদি আমার ইসলাম ত্যাগ করার ব্যাপারে জিদ করে পানাহার ছেড়ে দেয় এবং প্রাণ বিসর্জন দেয়, তবুও সত্য দ্বীন পরিত্যাগ করা আমার পক্ষে সম্ভব নয়।' সা'দের এ চরম সত্য কথাটি তার মার অন্তরে দাগ কাটে এবং অবশেষে তিনিও ইসলাম গ্রহণ করেন।",
      "মদীনায় হিজরত\n\nহযরত মুসআব ইবন উমাইর (রাঃ) ও ইবন উম্মে মাকতুমের মক্কা থেকে মদীনায় হিজরতের পর যে চার ব্যক্তি মদীনায় হিজরত করেন তাঁদের একজন সা'দ ইবন আবী ওয়াক্কাস। সহীহ বুখারীতে বারা ইবন আযিব (রাঃ) থেকে বর্ণিত, 'সর্বপ্রথম আমাদের নিকট আগমণ করেন মুসআব ইবন উমাইর ও ইবন উম্মে মাকতুম। অতঃপর বিলাল, সা'দ ও আম্মার বিন ইয়াসির আগমন করেন।'",
      "তীরন্দাজ হিসেবে খ্যাতি\n\nহযরত সা'দ (রাঃ) ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ তীরন্দাজ। রাসূল (সাঃ) উহুদের যুদ্ধে তাঁকে বলেছিলেন, 'ارْمِ سَعْدُ فِدَاكَ أَبِي وَأُمِّي' (তীর ছোড়ো সা'দ! আমার পিতা-মাতা তোমার জন্য কুরবান!) এটি ছিল রাসূল (সাঃ)-এর পক্ষ থেকে সর্বোচ্চ সম্মান। রাসূল (সাঃ) তাঁর জন্য পিতা-মাতা উভয়কে উৎসর্গ করার কথা বলেছিলেন, যা অন্য কারো জন্য বলেননি।",
      "পারস্য বিজয় ও আল-কাদিসিয়্যার যুদ্ধ\n\n৬৩৬ খ্রিস্টাব্দে হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি পারস্য সাম্রাজ্যের বিরুদ্ধে আল-কাদিসিয়্যার যুদ্ধে মুসলিম বাহিনীর সর্বাধিনায়ক ছিলেন। এই যুদ্ধে তিনি পারস্যের বিশাল বাহিনীকে পরাজিত করেন এবং পারস্য সাম্রাজ্যের পতন ঘটান। এই বিজয়ের মাধ্যমে ইরাক ও পারস্য মুসলিমদের অধীনে আসে।",
      "চীন ও বাংলায় ইসলাম প্রচার\n\n৬৪৬ ও ৬৫১ খ্রিস্টাব্দে তাঁকে কূটনৈতিক দায়িত্ব দিয়ে চীন পাঠানো হয়। ধারণা করা হয় যে, নৌ রুটে চীন যাওয়ার পথে তিনি চট্টগ্রাম বন্দরে থেমেছিলেন এবং বাংলাকে ইসলামের সাথে পরিচয় করানোয় তাঁর অবদান রয়েছে। ধারণা করা হয়, তিনি ৬৪৮ খ্রিস্টাব্দে বাংলাদেশের লালমনিরহাটে একটি মসজিদ নির্মাণ করেন, যা স্থানীয়ভাবে আবু আক্কাস মসজিদ নামে পরিচিত।",
      "স্বভাব ও চরিত্র\n\nইবনে ইসহাক বর্ণনা করেন, রাসূলুল্লাহর (সাঃ) সাহাবীদের মধ্যে চারজন ছিলেন সর্বাধিক কঠোর: উমর, আলী, যুবাইর এবং সা'দ (রাঃ)। হযরত সা'দের মধ্যে কাব্য প্রতিভাও ছিল। প্রাচীন সূত্রগুলিতে তার কিছু কবিতা সংকলিত হয়েছে। তিনি ছিলেন অত্যন্ত সাহসী, দৃঢ়চেতা এবং আল্লাহভীরু।",
      "কবুল হওয়া দোয়া\n\nরাসূল (সাঃ) তাঁর সম্পর্কে বলেছেন, 'اللَّهُمَّ اسْتَجِبْ لِسَعْدٍ إِذَا دَعَاكَ' (হে আল্লাহ! সা'দ যখন তোমার কাছে দোয়া করবে, তখন তা কবুল করো।) এই কারণে তাঁর দোয়া সর্বদা কবুল হতো। রাসূল (সাঃ) আরও বলেছেন, 'هَذَا خَالِي فَلْيُرِنِي امْرُؤٌ خَالَهُ' (এই আমার মামা, কেউ যদি তার মামা দেখাতে পারে!) - কারণ সা'দ (রাঃ) ছিলেন রাসূল (সাঃ)-এর মাতৃকুলের।",
      "ইন্তেকাল\n\nহযরত সা'দ (রাঃ) মদীনা থেকে দশ মাইল দূরে আকীক উপত্যকায় কিছুদিন অসুস্থ থাকার পর হিজরী ৫৫ সনে ৮৫ বছর বয়সে ইন্তেকাল করেন। গোসল ও কাফনের পর লাশ মদীনায় আনা হয়। মদীনার তৎকালীন গভর্নর মারওয়ান জানাযার ইমামতি করেন। উম্মুল মু'মিনীন হযরত আয়িশা (রাঃ) ও অন্যান্য আযওয়াজে মুতাহহারাহ তাঁর জানাযায় অংশগ্রহণ করেন।",
      "মরণকালের ঘটনা\n\nমরণকালে হযরত সা'দ (রাঃ) বহু অর্থ-সম্পদের অধিকারী ছিলেন। তা সত্ত্বেও তিনি একটি অতি পুরাতন পশমী জুব্বা চেয়ে নিয়ে বলেন, 'এ দিয়েই তোমরা আমাকে কাফন দেবে। এ জুব্বা পরেই আমি বদর যুদ্ধে কাফিরদের বিরুদ্ধে লড়েছি। আমার ইচ্ছা, এটা নিয়েই আমি আল্লাহর দরবারে উপস্থিত হই।' তাঁর ছেলে মুসআব বলেন, তাঁর মুমূর্ষ অবস্থায় তিনি বলেন, 'আমার জন্য কেঁদো না। আল্লাহ কক্ষণো আমাকে শাস্তি দেবেন না, আমি জান্নাতবাসী।'",
      "**বদরের বীর:** বদরের যুদ্ধে অসাধারণ বীরত্ব দেখিয়েছেন।",
      "**মৃত্যু:** ৬৭৪ সাল। মদীনায় মৃত্যু। আশারায়ে মুবাশশারার একজন।"
    ],
    "moral": "হযরত সা'দ (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে দৃঢ়তা, সামরিক দক্ষতা এবং মায়ের চেয়েও ঈমানকে প্রাধান্য দেওয়া একজন মুসলিমকে মহান বিজয়ের নায়ক এবং জান্নাতবাসী বানাতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; তিরমিযী; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; হায়াতুস সাহাবা"
  },
  {
    "id": "salman_farsi",
    "categoryId": "sahabider_jibon",
    "title": "সালমান ফারসি (রাঃ)",
    "paragraphs": [
      "হযরত সালমান আল-ফারসি (রাঃ) ছিলেন রাসূল মুহাম্মদ (সাঃ)-এর একজন মহান সাহাবী। তিনি পারস্যে জন্মগ্রহণ করেন এবং সত্যের সন্ধানে বিভিন্ন ধর্ম অনুসরণ করার পর ইসলাম গ্রহণ করেন।",
      "জন্ম ও প্রারম্ভিক জীবন\n\nসালমান ৫৩১-৫৭০ খ্রিস্টাব্দের মধ্যে পারস্যের ফার্স বা ইসপাহান প্রদেশে জন্মগ্রহণ করেন। তিনি জরথুস্ট্রিয়ান পরিবারে বেড়ে ওঠেন এবং ষোল বছর পুরোহিত হওয়ার জন্য অধ্যয়ন করেন।",
      "খ্রিস্টধর্মে আকৃষ্ট\n\n৫৮৭ সালে তিনি নেস্টোরিয়ান খ্রিস্টানদের সাথে সাক্ষাৎ করেন এবং তাদের দ্বারা প্রভাবিত হন। পিতার ইচ্ছার বিরুদ্ধে গিয়ে তিনি পরিবার ত্যাগ করেন। পরিবার তাকে বন্দী করলেও তিনি পালিয়ে যান।",
      "সত্যের অন্বেষণ\n\nসত্যের সন্ধানে তিনি মধ্যপ্রাচ্যে ঘুরে ঘুরে পুরোহিত ও পণ্ডিতদের সাক্ষাৎ করেন। সিরিয়ায় তিনি শেষ নবীর আগমনের ভবিষ্যদ্বাণী শুনেন। আরবে যাওয়ার পথে তাকে দাস হিসেবে বিক্রি করা হয় এবং মদীনার এক ইহুদীর কাছে নিয়ে যাওয়া হয়।",
      "ইসলাম গ্রহণ\n\nরাসূল (সাঃ)-এর সাথে সাক্ষাতের পর তিনি নবীর লক্ষণগুলি চিনতে পারেন এবং ইসলাম গ্রহণ করেন। রাসূল (সাঃ)-এর সাহায্যে তিনি স্বাধীনতা লাভ করেন। তিনি ছিলেন প্রথম ইরানি যিনি ইসলাম গ্রহণ করেন।",
      "খন্দকের যুদ্ধ\n\nখন্দকের যুদ্ধে ১০,০০০ কুরাইশ সৈন্য মদীনা আক্রমণ করলে সালমানের পরামর্শে মদিনার চারপাশে পরিখা খনন করা হয়। এটি ছিল সাসানীয় সামরিক কৌশল। এই কৌশলের মাধ্যমে মুসলিমরা বিজয়ী হন।",
      "আহলে বাইত\n\nমুহাজির ও আনসার উভয়েই দাবি করেন সালমান তাদের দলভুক্ত। রাসূল (সাঃ) বলেন: سَلْمَانُ مِنَّا أَهْلَ الْبَيْتِ (সালমান আমাদের আহলে বাইতের একজন।) এটি ছিল সর্বোচ্চ সম্মান।",
      "মর্যাদা\n\nআবু হুরায়রা (রাঃ) তাকে 'আবু আল-কিতাবায়েন' (দুই বইয়ের জনক - বাইবেল ও কুরআন) বলেন। আলী (রাঃ) তাকে 'লুকমান আল-হাকিম' (জ্ঞানী) বলে সম্মান করেন।",
      "পারস্য বিজয়\n\nতিনি পারস্য বিজয়ে অংশ নেন এবং উমর (রাঃ)-এর সময়ে চেটেসিফোনের প্রথম গভর্নর হন। পরে আলী (রাঃ) তাকে আল-মাদাইনের গভর্নর নিযুক্ত করেন।",
      "কুরআন অনুবাদ\n\nতিনি ফার্সি ভাষায় কুরআনের অনুবাদ করেন। তিনি ইতিহাসে প্রথম ব্যক্তি যিনি কুরআনকে বিদেশী ভাষায় অনুবাদ করেন।",
      "**খন্দকের পরিখা:** খন্দকের যুদ্ধে পরিখা খননের পরামর্শ দিয়েছিলেন।",
      "**মৃত্যু:** ৬৫৬ সাল। মাদায়েনে মৃত্যু। বয়স ৮৮ বছর।"
    ],
    "moral": "সালমান ফারসি (রাঃ)-এর জীবন প্রমাণ করে যে সত্যের সন্ধানে যে কেউ যেকোনো দূরত্ব অতিক্রম করতে পারে এবং আল্লাহ তাকে হেদায়েত দান করেন।",
    "source": "সহীহ বুখারী; সীরাতে ইবনে হিশাম"
  },
  {
    "id": "abdur_rahman_ibn_auf",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুর রহমান ইবনে আউফ (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুর রহমান ইবনে আউফ (রাঃ) (মৃত্যু: ৩১ হিজরি/৬৫২ খ্রিষ্টাব্দ) ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং ইসলামের ইতিহাসের অন্যতম ধনী ও দানশীল সাহাবী।",
      "নাম পরিবর্তন\n\nজাহিলী যুগে তার নাম ছিল 'আবদু আমর' (আমরের দাস)। ইসলাম গ্রহণের পর রাসূল (সাঃ) তার নাম রাখেন 'আব্দুর রহমান' (সবচেয়ে দয়াবানের দাস)। তিনি যুহরা গোত্রের সন্তান।",
      "ইসলাম গ্রহণ\n\nআবু বকর (রাঃ)-এর দাওয়াতে তিনি ইসলাম গ্রহণ করেন। তিনি ছিলেন ইসলাম গ্রহণকারী প্রথম ৮ জনের অন্যতম।",
      "আবিসিনিয়ায় হিজরত\n\n৬১৪ সালে কুরাইশদের নির্যাতন বৃদ্ধি পেলে তিনি আবিসিনিয়ায় হিজরত করেন। নাজাশি তাদের নিরাপত্তা প্রদান করেন। ৬১৯-৬২০ সালে তিনি মক্কায় ফিরে আসেন।",
      "মদীনায় হিজরত\n\n৬২২ সালে তিনি মদিনায় হিজরত করেন। রাসূল (সাঃ) তাকে সা'দ ইবনে রাবী' (রাঃ)-এর সাথে ভ্রাতৃত্ব বন্ধনে আবদ্ধ করেন। সা'দ সম্পদের অর্ধেক দিতে চাইলে তিনি বলেন: আমাকে শুধু বাজারের পথ দেখিয়ে দিন। তিনি ব্যবসা শুরু করেন এবং সফল হন।",
      "দুমাতুল জান্দাল অভিযান\n\n৬২৬ সালে রাসূল (সাঃ) তাকে দুমাতুল জান্দালের কালব গোত্রের উপর অভিযান চালনার নির্দেশ দেন। তিনি ৩ দিন দাওয়াত দেন এবং কালব গোত্র মুসলমান হয়। রাসূল (সাঃ)-এর নির্দেশে তিনি গোত্রপতির কন্যা তুমারিযকে বিয়ে করেন।",
      "দানশীলতা\n\nতিনি ৫০০ ঘোড়া ও ৫০০ উট আল্লাহর রাস্তায় দান করেন। তাবুক যুদ্ধে বিশাল অর্থ দান করেন। রাসূল (সাঃ) বলেন: عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فِي الْجَنَّةِ (আব্দুর রহমান ইবনে আউফ জান্নাতে।)",
      "খিলাফত নির্বাচন\n\n৬৪৪ সালে উমর (রাঃ) মৃত্যুর আগে ছয় সদস্যের বোর্ড গঠন করেন। এই বোর্ডে আব্দুর রহমানও ছিলেন এবং তিনি উসমান (রাঃ)-কে খলিফা নির্বাচনে ভূমিকা রাখেন।",
      "মৃত্যু\n\nতিনি হিজরি ৩২ সনে ৭২-৭৫ বছর বয়সে ইন্তেকাল করেন। উসমান (রাঃ) বা যুবাইর (রাঃ) জানাযার ইমামতি করেন। তাকে মদীনার বাকী' গোরস্থানে দাফন করা হয়। মৃত্যুকালে তিনি বিশাল সম্পদের অধিকারী ছিলেন কিন্তু অত্যন্ত বিনয়ী ছিলেন।",
      "**দানশীল:** অত্যন্ত ধনী ও দানশীল ছিলেন। সম্পদের বড় অংশ দান করতেন।",
      "**মৃত্যু:** ৬৫২ সাল। মদীনায় মৃত্যু। আশারায়ে মুবাশশারার একজন।"
    ],
    "moral": "আব্দুর রহমান ইবনে আউফ (রাঃ)-এর জীবন প্রমাণ করে যে সততা ও দানশীলতার সাথে সম্পদ অর্জন এবং আল্লাহর পথে ব্যয় করা একজন মুসলিমের শ্রেষ্ঠ গুণ।",
    "source": "সহীহ বুখারী; তিরমিযী"
  },
  {
    "id": "usman_ibn_talha",
    "categoryId": "sahabider_jibon",
    "title": "উসমান ইবনে তালহা (রাঃ)",
    "paragraphs": [
      "মক্কার বনু আবদুদ দার গোত্রে জন্ম। নাম উসমান ইবনে তালহা ইবনে আবি তালহা। পিতা তালহা ইবনে আবি তালহা, মা সুলাফা বিনতে সাদ। এই পরিবারের বিশেষত্ব - তারা বংশ পরম্পরায় কাবা শরিফের চাবির রক্ষক। জাহেলি যুগ থেকেই এই দায়িত্ব তাদের। কুসাই ইবনে কিলাব যখন মক্কার নেতৃত্ব পান, তখন তিনি বনু আবদুদ দার গোত্রকে কাবার চাবির দায়িত্ব দেন। সেই থেকে এই পরিবার কাবার দারোয়ান। উসমান ছিলেন সেই ঐতিহ্যের উত্তরাধিকারী। লম্বা, শক্তিশালী যুবক। কুরাইশদের মধ্যে সম্মানিত। কে জানত এই চাবির রক্ষক একদিন ইসলামের বীর হবেন!",
      "**ইসলামের শত্রু:** ৬১০ সাল। মুহাম্মাদ নবুয়ত ঘোষণা করলেন। কুরাইশরা বিরোধিতা শুরু করল। উসমান ইবনে তালহাও ইসলামের বিরোধী ছিলেন। কারণ তিনি ভাবতেন - নতুন ধর্ম মানে পুরনো ঐতিহ্য নষ্ট হবে। কাবার মর্যাদা কমবে। তাই তিনি মুসলিমদের বিরুদ্ধে ছিলেন। মুসলিমদের কষ্ট দিতেন। রাসূলকে গালি দিতেন। ৬২৫ সাল। উহুদের যুদ্ধ। কুরাইশরা প্রতিশোধ নিতে এসেছে। উসমানের পিতা তালহা ইবনে আবি তালহা ছিলেন কুরাইশদের পতাকাবাহী। পিতা শহীদ হলেন। উসমান পতাকা তুলে নিলেন। বীরত্বের সাথে লড়লেন মুসলিমদের বিরুদ্ধে। কিন্তু আল্লাহর পরিকল্পনা ছিল ভিন্ন।",
      "**ইসলাম গ্রহণ:** ৬২৯ সাল, সফর মাস। হুদাইবিয়ার সন্ধির পর পরিস্থিতি বদলাতে শুরু করল। মুসলিমরা নিরাপদে ইসলাম প্রচার করতে পারছেন। অনেক কুরাইশ ইসলাম সম্পর্কে ভাবতে শুরু করল। খালিদ ইবনে ওয়ালিদ ও আমর ইবনুল আস - দুই মহাবীর - ইসলাম গ্রহণের সিদ্ধান্ত নিলেন। তারা উসমান ইবনে তালহার কাছে এলেন। বললেন: উসমান, আমরা ইসলাম গ্রহণ করব। তুমিও চলো। উসমান অবাক হলেন। খালিদ ও আমর - এই দুই বীর মুসলমান হচ্ছেন! উসমান ভাবলেন: নিশ্চয়ই মুহাম্মাদ সত্য নবী। নইলে এরা কেন ইসলাম গ্রহণ করবেন? উসমান রাজি হলেন। তিনজন একসাথে মদীনার উদ্দেশ্যে রওনা হলেন। মদীনায় পৌঁছে রাসূলের কাছে গেলেন। রাসূল তাদের দেখে অত্যন্ত খুশি হলেন। বললেন: মক্কা তার কলিজার টুকরো আমাদের কাছে পাঠিয়ে দিয়েছে! তিনজনেই ইসলাম গ্রহণ করলেন।",
      "**কাবার চাবি:** ৬৩০ সাল, রমজান মাস। মক্কা বিজয়। রাসূল দশ হাজার সৈন্য নিয়ে মক্কায় এলেন। বিনা রক্তপাতে মক্কা বিজয়। রাসূল কাবা শরিফে গেলেন। তিনশত ষাটটি মূর্তি ভাঙলেন। তারপর কাবার ভিতরে যেতে চাইলেন। কিন্তু দরজা বন্ধ। চাবি কার কাছে? উসমান ইবনে তালহার কাছে। রাসূল বললেন: উসমানকে ডেকে আনো। উসমান এলেন। হাতে কাবার চাবি। রাসূলকে দিলেন। রাসূল কাবা খুললেন। ভিতরে গেলেন। দুই রাকাত নামায পড়লেন। বের হয়ে এলেন। আলী চাবি চাইলেন। আব্বাসও চাইলেন। উসমান ভাবলেন: হয়তো চাবি চলে যাবে। হঠাৎ ওহী নাযিল হল: আমানত মালিকদের ফিরিয়ে দাও। রাসূল উসমানকে ডাকলেন। চাবি ফিরিয়ে দিলেন। বললেন: এই চাবি তোমার। তোমার পরিবারের। চিরকালের জন্য। কিয়ামত পর্যন্ত। কেউ এটা তোমাদের কাছ থেকে নিতে পারবে না। শুধু জালিম ছাড়া। উসমান কাঁদলেন। বললেন: ইয়া রাসূলাল্লাহ! আমি আপনার বিরুদ্ধে লড়েছি। অথচ আপনি এই সম্মান দিলেন! রাসূল বললেন: ইসলাম পূর্বের পাপ মুছে দেয়। তুমি এখন আমার ভাই।",
      "**আজও চাবি তাদের হাতে:** আজ দুই হাজার পঁচিশ সাল। চৌদ্দশত বছর পার হয়ে গেছে। কিন্তু কাবার চাবি এখনও উসমান ইবনে তালহার বংশধরদের হাতে। তারা বনু শায়বা নামে পরিচিত। সৌদি সরকার তাদের সম্মান করে। প্রতিবার কাবা খোলার সময় তারাই চাবি দেয়। রাসূলের ওয়াদা আজও বাস্তব। এটা আল্লাহর নিদর্শন। উসমান হুনায়ন ও তাবুক অভিযানে অংশ নিলেন। প্রতিটি যুদ্ধে বীরত্ব দেখালেন। রাসূল তাকে বিশ্বাস করতেন। উনষাট হিজরিতে মক্কায় মৃত্যু। বয়স আশির বেশি। জীবনের শেষ দিন পর্যন্ত কাবার চাবির রক্ষক ছিলেন। মক্কায় দাফন হলেন। কাবার কাছেই। যে কাবার সেবা করেছেন সারা জীবন।"
    ]
  },
  {
    "id": "abdullah_ibn_rawaha",
    "categoryId": "sahabider_jibon",
    "title": "আবদুল্লাহ ইবনে রাওয়াহা (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। আবদুল্লাহ ইবনে রাওয়াহা। খাযরাজ গোত্র। কবি সাহাবী। জাহেলি যুগেও বিখ্যাত কবি ছিলেন। আরবের সাতজন শ্রেষ্ঠ কবির একজন। কবিতায় তার দক্ষতা ছিল অসাধারণ। শব্দ চয়ন, ছন্দ, অর্থ - সবকিছুতে পারদর্শী। মক্কার কবিরাও তাকে সম্মান করত। আকাবার দ্বিতীয় শপথে অংশ নিলেন। সেই রাতে বাহাত্তর জন আনসার রাসূলকে মদীনায় আমন্ত্রণ জানিয়েছিলেন। আবদুল্লাহ ছিলেন তাদের একজন। রাসূলের হাতে বাইয়াত করলেন। প্রতিশ্রুতি দিলেন - জীবন দিয়ে হলেও রাসূলকে রক্ষা করবেন।",
      "**ইসলামের কবি:** রাসূল মদীনায় আসার পর আবদুল্লাহ তার প্রশংসায় কবিতা লিখতে শুরু করলেন। হাসসান ইবনে সাবিত ও কাব ইবনে মালিকের সাথে ইসলামের তিন কবি। কাফিররা যখন রাসূলকে কবিতায় আক্রমণ করত, এই তিনজন জবাব দিতেন কবিতায়। আবদুল্লাহর কবিতায় ঈমানের শক্তি ছিল। তিনি লিখতেন রাসূলের বীরত্ব, ইসলামের সৌন্দর্য, জান্নাতের আকাঙ্ক্ষা। রাসূল তাকে ভালোবাসতেন। বলতেন: আবদুল্লাহর কবিতায় রূহ আছে। বদর, উহুদ, খন্দক - সব যুদ্ধে অংশ নিলেন। যুদ্ধক্ষেত্রেও কবিতা পড়তেন সৈন্যদের উৎসাহ দিতে।",
      "**মুতার সেনাপতি:** ছয়শত ঊনত্রিশ সাল। রোমান সাম্রাজ্যের বিরুদ্ধে মুতার অভিযান। রাসূল তিনজন সেনাপতি নিয়োগ করলেন। প্রথম যায়িদ ইবনে হারিসা। যায়িদ শহীদ হলে জাফর ইবনে আবি তালিব। জাফর শহীদ হলে আবদুল্লাহ ইবনে রাওয়াহা। তিন হাজার মুসলিম। দুই লক্ষ রোমান! যাওয়ার আগে পরিবারকে বিদায় জানালেন। স্ত্রী কাঁদছেন। আবদুল্লাহ বললেন: কাঁদো না। আমি শহীদ হলে জান্নাতে যাব। ছেলেদের জড়িয়ে ধরলেন। রাসূলের কাছে গেলেন। রাসূল দোয়া করলেন।",
      "**যুদ্ধক্ষেত্রে দ্বিধা:** মুতা। যায়িদ শহীদ হলেন। জাফর পতাকা তুললেন। বীরত্বের সাথে লড়লেন। দুই হাত কাটা গেল। বুকে পতাকা জড়িয়ে ধরলেন। শহীদ হলেন। এখন আবদুল্লাহর পালা। পতাকা তুলে নিলেন। কিন্তু একটু দ্বিধা করলেন। চারদিকে দুই লক্ষ শত্রু। মাত্র তিন হাজার মুসলিম। দুই বন্ধু শহীদ হয়ে গেছেন। এখন কী করবেন? নিজেকে বললেন: হে নফস! কেন জান্নাত থেকে পালাচ্ছ? এত মানুষ জান্নাত চায়। তুমি পাচ্ছ অথচ পালাচ্ছ? তারপর কবিতা পড়লেন: হে নফস! তুমি জান্নাতে যাবে না তো জাহান্নামে যাবে। তুমি শুধু একটা ফোঁটা পানি পিতার ঔরসে। এই বলে ঝাঁপিয়ে পড়লেন যুদ্ধে। বীরত্বের সাথে লড়লেন। শহীদ হলেন। বয়স আটত্রিশ বছর। রাসূল মদীনায় কাঁদলেন। বললেন: তিন ভাই শহীদ হয়েছে। যায়িদ, জাফর, আবদুল্লাহ। কবি সাহাবী। বীর যোদ্ধা। মুতার শহীদ। জান্নাতের বাসিন্দা।"
    ]
  },
  {
    "id": "zayd_ibn_haritha",
    "categoryId": "sahabider_jibon",
    "title": "যায়িদ ইবনে হারিসা (রাঃ)",
    "paragraphs": [
      "সিরিয়ার কালব গোত্রে জন্ম। নাম যায়িদ ইবনে হারিসা। পিতা হারিসা ইবনে শারাহিল। মা সুদা বিনতে সালাবা। সুখী পরিবার। কিন্তু ভাগ্য বদলে যাবে।",
      "**শৈশবে অপহরণ:** মাত্র ৮ বছর বয়স। মায়ের সাথে আত্মীয়ের বাড়ি গিয়েছিলেন। হঠাৎ দস্যুদের আক্রমণ। যায়িদকে ধরে নিয়ে গেল। মা কাঁদতে কাঁদতে বললেন: আমার ছেলে! কিন্তু দস্যুরা শুনল না। যায়িদকে দাস হিসেবে বিক্রি করল উকাজের বাজারে।",
      "**খাদিজার কেনা:** হাকিম ইবনে হিযাম - খাদিজা (রাঃ) এর ভাতিজা - যায়িদকে কিনলেন। খাদিজা (রাঃ) কে উপহার দিলেন। খাদিজা (রাঃ) যায়িদকে দেখলেন। বুদ্ধিমান, সৎ ছেলে। তাকে ভালোবাসলেন।",
      "**মুহাম্মাদের উপহার:** খাদিজা (রাঃ) মুহাম্মাদ (সাঃ) কে বিয়ে করলেন। যায়িদকে উপহার দিলেন স্বামীকে। রাসূল (সাঃ) যায়িদকে দেখলেন। তার চরিত্র দেখে মুগ্ধ হলেন। যায়িদও রাসূলকে ভালোবাসলেন। পিতা-পুত্রের সম্পর্ক গড়ে উঠল।",
      "**পিতার খোঁজ:** যায়িদের পিতা হারিসা ছেলেকে খুঁজছেন। বছরের পর বছর। কবিতা লিখছেন শোকে। একদিন কালব গোত্রের কিছু লোক মক্কায় এল। যায়িদকে দেখল। চিনে ফেলল। ফিরে গিয়ে হারিসাকে বলল: তোমার ছেলে মক্কায়! মুহাম্মাদ ইবনে আবদুল্লাহর কাছে!",
      "**পিতার আগমন:** হারিসা ও ভাই কা'ব মক্কায় এলেন। প্রচুর মুক্তিপণ নিয়ে। রাসূল (সাঃ) এর কাছে গেলেন। বললেন: হে আবদুল মুত্তালিবের পুত্র! তোমরা হারামের প্রতিবেশী, বন্দীদের মুক্ত করো, ক্ষুধার্তদের খাওয়াও। আমরা এসেছি আমাদের ছেলেকে নিতে। যা চাও দাম দাও।",
      "**যায়িদের সিদ্ধান্ত:** রাসূল (সাঃ) বললেন: যায়িদকে ডাকো। তাকে জিজ্ঞাসা করো। সে যদি তোমাদের সাথে যেতে চায়, যাক। আমি কোনো মুক্তিপণ চাই না। যায়িদ এলেন। পিতাকে দেখলেন। হারিসা বললেন: বেটা! আমি তোমার পিতা, এ তোমার চাচা। চলো বাড়ি যাই। যায়িদ বললেন: আমি মুহাম্মাদের সাথে থাকব। হারিসা অবাক: কী বলছ? দাসত্ব পছন্দ করছ স্বাধীনতার চেয়ে? যায়িদ বললেন: আমি এই মানুষের মধ্যে এমন কিছু দেখেছি যা আমি কখনো ছাড়ব না।",
      "**দত্তক পুত্র ঘোষণা:** রাসূল (সাঃ) যায়িদের কথা শুনে মুগ্ধ হলেন। তাকে নিয়ে কাবায় গেলেন। ঘোষণা করলেন: হে কুরাইশ! সাক্ষী থাকো। আজ থেকে যায়িদ আমার পুত্র। সে আমার উত্তরাধিকারী, আমি তার। হারিসা খুশি হয়ে ফিরে গেলেন। ছেলে ভালো হাতে আছে। সেদিন থেকে সবাই ডাকত: যায়িদ ইবনে মুহাম্মাদ।",
      "**প্রথম মুসলিম:** ৬১০ সাল। রাসূল (সাঃ) নবুয়ত পেলেন। প্রথম ঈমান আনলেন খাদিজা (রাঃ)। তারপর আলী (রাঃ) - ১০ বছর বয়সী। তারপর আবু বকর (রাঃ)। আর যায়িদ (রাঃ)। তৃতীয় বা চতুর্থ মুসলিম। প্রাপ্তবয়স্ক পুরুষদের মধ্যে প্রথম দিকে।",
      "**নির্যাতন সহ্য:** কুরাইশরা মুসলিমদের নির্যাতন শুরু করল। যায়িদও নির্যাতিত হলেন। কিন্তু ঈমান ছাড়লেন না। রাসূলের পাশে থাকলেন।",
      "**হিজরত:** ৬২২ সাল। রাসূল (সাঃ) মদীনায় হিজরত করলেন। যায়িদও গেলেন। রাসূল (সাঃ) মুহাজির ও আনসারদের ভ্রাতৃত্ব বন্ধন করালেন। যায়িদকে হামযা (রাঃ) এর সাথে ভ্রাতৃত্ব বন্ধন করালেন।",
      "**বিবাহ:** রাসূল (সাঃ) এর চাচাতো বোন যয়নাব বিনতে জাহশ। সম্ভ্রান্ত পরিবার। রাসূল (সাঃ) চাইলেন যায়িদের সাথে যয়নাবের বিয়ে হোক। যয়নাব ও তার ভাই রাজি ছিলেন না। কুরআনে আয়াত নাযিল হল: আল্লাহ ও তার রাসূল কোনো বিষয়ে সিদ্ধান্ত নিলে মুমিনের অন্য কোনো এখতিয়ার নেই। (সূরা আহযাব: ৩৬) বিয়ে হল। কিন্তু সংসার সুখের হল না। যয়নাব যায়িদকে ছোট মনে করতেন।",
      "**তালাক:** কিছুদিন পর যায়িদ রাসূল (সাঃ) কে বললেন: আমি তালাক দিতে চাই। রাসূল (সাঃ) বললেন: স্ত্রীকে রাখো, আল্লাহকে ভয় করো। কিন্তু সংসার চলল না। তালাক হল। পরে আল্লাহর নির্দেশে রাসূল (সাঃ) যয়নাবকে বিয়ে করলেন। এই ঘটনায় দত্তক প্রথা রহিত হল।",
      "**দত্তক প্রথা রহিত:** কুরআনে আয়াত নাযিল হল: তাদের পিতাদের নামে ডাকো। এটাই আল্লাহর কাছে ন্যায়সঙ্গত। (সূরা আহযাব: ৫) সেদিন থেকে যায়িদ ইবনে মুহাম্মাদ নয়, যায়িদ ইবনে হারিসা। কিন্তু রাসূলের ভালোবাসা কমেনি। যায়িদ রইলেন রাসূলের প্রিয়তম।",
      "**বদরের যুদ্ধ:** ৬২৪ সাল। প্রথম যুদ্ধ। যায়িদ বীরত্বের সাথে লড়লেন। মুসলিমদের বিজয়।",
      "**উহুদের যুদ্ধ:** ৬২৫ সাল। যায়িদ রাসূল (সাঃ) কে রক্ষা করলেন। আহত হলেন কিন্তু হার মানলেন না।",
      "**সামরিক অভিযানের নেতা:** রাসূল (সাঃ) যায়িদকে অনেক ছোট অভিযানের নেতা বানাতেন। কারণ তার বিচক্ষণতা ও সাহসিকতা। যায়িদ ৭-৮টি অভিযানে নেতৃত্ব দিয়েছেন। সবগুলোতে সফল।",
      "**পুত্র উসামা:** যায়িদের পুত্র উসামা ইবনে যায়িদ। রাসূল (সাঃ) উসামাকে অত্যন্ত ভালোবাসতেন। বলতেন: যায়িদ ও উসামা আমার সবচেয়ে প্রিয়।",
      "**মুতার অভিযান:** ৬২৯ সাল, জমাদিউল আউয়াল। রোমান সাম্রাজ্যের বিরুদ্ধে অভিযান। রাসূল (সাঃ) ৩,০০০ সৈন্য পাঠালেন। সেনাপতি নিয়োগ করলেন তিনজন: প্রথম যায়িদ ইবনে হারিসা। যায়িদ শহীদ হলে জাফর ইবনে আবি তালিব। জাফর শহীদ হলে আবদুল্লাহ ইবনে রাওয়াহা। সাদা পতাকা দিলেন যায়িদের হাতে।",
      "**বিদায়:** মদীনা থেকে বিদায়। রাসূল (সাঃ) সৈন্যদের সাথে কিছুদূর হেঁটে গেলেন। যায়িদকে জড়িয়ে ধরলেন। দোয়া করলেন। যায়িদ জানতেন না এটাই শেষ দেখা।",
      "**মুতার যুদ্ধক্ষেত্র:** সিরিয়ার মুতা। রোমান সাম্রাজ্যের ২,০০,০০০ সৈন্য! মুসলিম মাত্র ৩,০০০। ১:৬৭ অনুপাত! সাহাবীরা চিন্তিত। কিন্তু যায়িদ বললেন: আমরা সংখ্যা বা শক্তিতে লড়ি না। আমরা লড়ি ঈমানে। আল্লাহ আমাদের সাথে।",
      "**শাহাদাত:** যুদ্ধ শুরু হল। যায়িদ সাদা পতাকা হাতে সামনে। বীরত্বের সাথে লড়ছেন। একের পর এক শত্রু মারছেন। হঠাৎ একটি বর্শা এসে বুকে বিঁধল। যায়িদ মাটিতে পড়ে গেলেন। শাহাদাত বরণ করলেন। বয়স ৫৫ বছর। পতাকা পড়ে গেল। জাফর তুলে নিলেন।",
      "**রাসূলের শোক:** মদীনায় রাসূল (সাঃ)। জিবরীল (আঃ) খবর দিলেন। রাসূল (সাঃ) মসজিদে গেলেন। কাঁদতে কাঁদতে বললেন: আমার ভাই, আমার প্রিয় যায়িদ শহীদ হয়েছে। তারপর জাফর শহীদ হয়েছে। তারপর আবদুল্লাহ শহীদ হয়েছে। চোখ দিয়ে অশ্রু ঝরছে। সাহাবীরাও কাঁদলেন।",
      "**যায়িদের পরিবার:** যায়িদের বাড়িতে গেলেন। যায়িদের মেয়ে কাঁদছে। রাসূল (সাঃ) ও কাঁদলেন। সাদ ইবনে উবাদা বললেন: ইয়া রাসূলাল্লাহ! এ কী? রাসূল (সাঃ) বললেন: এ হল প্রিয়জনের জন্য প্রিয়জনের কান্না।",
      "**মর্যাদা:** রাসূল (সাঃ) বলেছেন: যায়িদ আমার মাওলা (প্রিয়জন, মুক্তিদাতা)। যায়িদ আমার প্রিয়তম। একমাত্র সাহাবী যাকে কুরআনে নাম ধরে উল্লেখ করা হয়েছে: যায়িদ যখন তার (যয়নাবের) সাথে সম্পর্ক ছিন্ন করল... (সূরা আহযাব: ৩৭)",
      "**উত্তরাধিকার:** পুত্র উসামা ইবনে যায়িদ। রাসূল (সাঃ) এর মৃত্যুর আগে উসামাকে সিরিয়ার অভিযানের সেনাপতি বানিয়েছিলেন। মাত্র ১৮ বছর বয়সে। অনেক বয়স্ক সাহাবী আপত্তি করলেন। রাসূল (সাঃ) বললেন: তোমরা তার পিতার নেতৃত্বেও আপত্তি করেছিলে। যায়িদ ছিল নেতৃত্বের যোগ্য, উসামাও।",
      "**স্মরণ:** দাস থেকে প্রিয়তম। অপহৃত শিশু থেকে সেনাপতি। যায়িদ ইবনে হারিসা (রাঃ) - রাসূলের প্রিয়, ইসলামের বীর, মুতার শহীদ। যার ভালোবাসা দাসত্বকে স্বাধীনতার চেয়ে প্রিয় করেছিল। যিনি পিতার ডাক ছেড়ে রাসূলের সাথে থাকা বেছে নিয়েছিলেন। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন।"
    ]
  },
  {
    "id": "jafar_ibn_abi_talib",
    "categoryId": "sahabider_jibon",
    "title": "জাফর ইবনে আবি তালিব (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। নাম জাফর ইবনে আবি তালিব ইবনে আবদুল মুত্তালিব। পিতা আবু তালিব, মা ফাতিমা বিনতে আসাদ। আলীর বড় ভাই। রাসূলের চাচাতো ভাই।",
      "**চেহারা ও চরিত্র:** রাসূলের চেয়ে দশ বছরের ছোট। লম্বা, সুদর্শন। রাসূলের সাথে চেহারায় অনেক মিল ছিল। রাসূল বলতেন: জাফর চরিত্রে ও চেহারায় আমার সবচেয়ে কাছের।",
      "**ইসলাম গ্রহণ:** প্রথম দিকে ইসলাম গ্রহণ করলেন। ভাই আলীর পরে। স্ত্রী আসমা বিনতে উমাইস - বিখ্যাত সাহাবিয়া। তিন ছেলে: আবদুল্লাহ, মুহাম্মাদ, আউন।",
      "**মক্কায় নির্যাতন:** মক্কায় মুসলিমদের উপর নির্যাতন বাড়ছে। কুরাইশরা কষ্ট দিচ্ছে। জাফরও নির্যাতিত হলেন। কিন্তু ঈমান ছাড়লেন না।",
      "**আবিসিনিয়ায় হিজরতের নির্দেশ:** ছয়শত পনেরো সাল। রাসূল বললেন: আবিসিনিয়ায় যাও। সেখানে ন্যায়পরায়ণ বাদশাহ আছেন। নাজাশি। তিনি তোমাদের আশ্রয় দেবেন।",
      "**নেতৃত্ব গ্রহণ:** জাফর নেতৃত্ব দিলেন। তিরাশি জন মুসলিম গেলেন। পুরুষ আঠারো জন, নারী এগারো জন। লোহিত সাগর পার হলেন। আবিসিনিয়ায় পৌঁছলেন।",
      "**নাজাশির আশ্রয়:** নাজাশি তাদের আশ্রয় দিলেন। বললেন: তোমরা নিরাপদ। আমার রাজ্যে কেউ তোমাদের কষ্ট দিতে পারবে না।",
      "**কুরাইশদের প্রতিনিধি:** কুরাইশরা রাগে ফেটে পড়ল। প্রতিনিধি পাঠাল: মুসলিমদের ফেরত দাও। আমর ইবনুল আস ও আবদুল্লাহ ইবনে রাবিয়া এল। উপহার নিয়ে। চামড়া, সুগন্ধি, মূল্যবান জিনিস।",
      "**নাজাশির দরবার:** নাজাশি জাফরকে ডাকলেন। বললেন: তোমরা কারা? কেন এসেছ? তোমাদের ধর্ম কী? জাফর দাঁড়ালেন। চমৎকার বক্তৃতা দিলেন।",
      "**জাফরের বক্তৃতা:** বললেন: হে বাদশাহ! আমরা জাহেলিয়াতে ছিলাম। মূর্তি পূজা করতাম। মদ পান করতাম। জুয়া খেলতাম। মেয়েদের জীবন্ত কবর দিতাম। দুর্বলদের কষ্ট দিতাম। আল্লাহ আমাদের মধ্য থেকে একজন নবী পাঠালেন। আমরা তাকে চিনি। তিনি সত্যবাদী, আমানতদার। তিনি আমাদের এক আল্লাহর ইবাদত শেখালেন। মূর্তি ভাঙতে বললেন। সত্য বলতে বললেন। আত্মীয়তা রক্ষা করতে বললেন।",
      "**সূরা মারিয়াম তিলাওয়াত:** নাজাশি বললেন: তোমাদের কাছে আল্লাহর কোনো বাণী আছে? জাফর বললেন: হ্যাঁ। তারপর সূরা মারিয়াম তিলাওয়াত করলেন। মারিয়াম ও ঈসার কথা।",
      "**নাজাশির কান্না:** নাজাশি কাঁদলেন। চোখ দিয়ে অশ্রু ঝরছে। বললেন: এই আর ঈসার বাণী একই উৎস থেকে। আল্লাহর কাছ থেকে। তোমরা নিরাপদ। আমি তোমাদের রক্ষা করব।",
      "**কুরাইশদের ব্যর্থতা:** আমর ইবনুল আস ব্যর্থ হলেন। মুসলিমদের ফেরত পেলেন না। রাগ করে ফিরে গেলেন। জাফর ও সাথীরা আবিসিনিয়ায় থাকলেন।",
      "**এগারো বছর:** এগারো বছর আবিসিনিয়ায় ছিলেন। মুসলিমদের নেতা। নাজাশির কাছে সম্মানিত। কুরাইশরা দুইবার প্রতিনিধি পাঠাল। দুইবারই ব্যর্থ হল।",
      "**খায়বারে ফিরে আসা:** ছয়শত আটাশ সাল। খায়বার বিজয়ের সময় আবিসিনিয়া থেকে ফিরলেন। ষোলজন সাথী নিয়ে। রাসূল খায়বার থেকে ফিরছেন। পথে জাফরের সাথে দেখা।",
      "**রাসূলের খুশি:** রাসূল এত খুশি হলেন যে জাফরকে জড়িয়ে ধরলেন। কপালে চুমু দিলেন। বললেন: আল্লাহর কসম! জানি না কোনটায় বেশি খুশি - জাফরের আগমনে না খায়বার বিজয়ে! সাহাবীরা তাকবীর দিলেন।",
      "**জাফর আত-তাইয়ার:** উপাধি দিলেন - জাফর আত-তাইয়ার। উড়ন্ত জাফর। কারণ জান্নাতে তার দুই ডানা আছে বলে রাসূল বলেছেন।",
      "**মুতার অভিযান:** ছয়শত ঊনত্রিশ সাল। রোমান সাম্রাজ্যের বিরুদ্ধে মুতার অভিযান। রাসূল তিনজন সেনাপতি নিয়োগ করলেন। প্রথম যায়িদ। যায়িদ শহীদ হলে জাফর। জাফর শহীদ হলে আবদুল্লাহ ইবনে রাওয়াহা।",
      "**যুদ্ধক্ষেত্র:** সিরিয়ার মুতা। রোমান সাম্রাজ্যের দুই লক্ষ সৈন্য! মুসলিম মাত্র তিন হাজার। এক থেকে সাতষট্টি অনুপাত!",
      "**যায়িদের শাহাদাত:** যুদ্ধ শুরু হল। যায়িদ সাদা পতাকা হাতে সামনে। বীরত্বের সাথে লড়লেন। শহীদ হলেন। পতাকা পড়ে গেল।",
      "**পতাকা তুলে নেওয়া:** জাফর পতাকা তুলে নিলেন। চিৎকার করলেন: আল্লাহু আকবার! সামনে এগিয়ে গেলেন। ঘোড়ায় চড়ে ছিলেন।",
      "**ঘোড়া জবাই:** ঘোড়া থেকে লাফ দিয়ে নামলেন। ঘোড়াকে জবাই করলেন - যাতে পালানোর চিন্তা না আসে। বললেন: আজ জান্নাত না হয় শাহাদাত!",
      "**ডান হাত কাটা:** ডান হাতে পতাকা। তলোয়ার চালাচ্ছেন। একটি তলোয়ার এসে ডান হাত কেটে ফেলল। রক্ত ঝরছে। কিন্তু জাফর থামলেন না।",
      "**বাম হাতে ধরা:** বাম হাতে পতাকা ধরলেন। আবার লড়তে লাগলেন। আরেকটি তলোয়ার এসে বাম হাতও কেটে ফেলল। দুই হাত কাটা গেল।",
      "**বুকে জড়িয়ে ধরা:** দুই বাহু দিয়ে পতাকা বুকে জড়িয়ে ধরলেন। লড়তে লাগলেন। পতাকা ফেলবেন না। পতাকা রক্ষা করতে হবে।",
      "**শাহাদাত:** একটি তলোয়ার এসে শরীর দুই ভাগ করে ফেলল। জাফর মাটিতে পড়ে গেলেন। শাহাদাত বরণ করলেন। শরীরে নব্বইয়ের বেশি আঘাত। সব সামনে থেকে। পেছনে একটিও না। বয়স একচল্লিশ বছর।",
      "**রাসূলের শোক:** মদীনায় রাসূল। জিবরীল খবর দিলেন। রাসূল মসজিদে গেলেন। কাঁদতে কাঁদতে বললেন: আমার ভাই যায়িদ শহীদ হয়েছে। তারপর জাফর শহীদ হয়েছে। তারপর আবদুল্লাহ শহীদ হয়েছে।",
      "**জাফরের পরিবারের কাছে:** জাফরের বাড়িতে গেলেন। আসমা কাঁদছেন। তিন ছেলে কাঁদছে। রাসূল তাদের সান্ত্বনা দিলেন। বললেন: জাফর জান্নাতে। আল্লাহ তাকে দুটি ডানা দিয়েছেন।",
      "**দুটি ডানা:** রাসূল বললেন: আল্লাহ জাফরকে দুটি ডানা দিয়েছেন। জান্নাতে ফেরেশতাদের সাথে উড়ে বেড়ায়। জাফর আত-তাইয়ার। উড়ন্ত জাফর।",
      "**মর্যাদা:** জাফর ইবনে আবি তালিব - মুতার শহীদ। জান্নাতের বাসিন্দা। উড়ন্ত জাফর। আল্লাহ তাকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "sad_ibn_muadh",
    "categoryId": "sahabider_jibon",
    "title": "সা'দ ইবনে মুয়াজ (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। সাদ ইবনে মুয়াজ। আউস গোত্রের নেতা। লম্বা, শক্তিশালী। মুসআব ইবনে উমাইর ইসলাম প্রচার করছেন। সাদ রাগ করে এলেন। মুসআব কুরআন তিলাওয়াত করলেন। সাদ শুনলেন। সাথে সাথে ইসলাম গ্রহণ করলেন। গোত্রে ফিরে বললেন: ইসলাম না আনলে কথা বলব না। সন্ধ্যার মধ্যে পুরো গোত্র মুসলিম হল!",
      "বদরে রাসূল পরামর্শ চাইলেন। সাদ বললেন: আপনি যদি সমুদ্রে ঝাঁপ দিতে বলেন, আমরা ঝাঁপ দেব। আপনি যদি পাহাড়ে চড়তে বলেন, আমরা চড়ব। রাসূল খুশি হলেন।",
      "খন্দকে তীর লাগল। রগ কেটে গেল। রক্তপাত বন্ধ হচ্ছে না। বনু কুরাইযার বিচার করলেন। যোদ্ধাদের হত্যা, নারী-শিশু বন্দী। রাসূল বললেন: তুমি আল্লাহর ফয়সালা করেছ। এক মাস পর শহীদ হলেন। রাসূল বললেন: সাদের মৃত্যুতে আল্লাহর আরশ কেঁপে উঠেছে! সত্তর হাজার ফেরেশতা জানাযায় এসেছিল।"
    ]
  },
  {
    "id": "usayd_ibn_hudayr",
    "categoryId": "sahabider_jibon",
    "title": "উসাইদ ইবনে হুদাইর (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। উসাইদ ইবনে হুদাইর। আউস গোত্রের নেতা। সাদ ইবনে মুয়াজের বন্ধু। সাদের পরে ইসলাম গ্রহণ করলেন।",
      "রাতে কুরআন তিলাওয়াত করছেন। ঘোড়া পাশে বাঁধা। হঠাৎ ঘোড়া লাফাতে লাগল। থামলেন। ঘোড়া শান্ত। আবার তিলাওয়াত। ঘোড়া আবার লাফাল। আকাশে মেঘের মতো কিছু দেখলেন। ভিতরে আলো। রাসূলকে বললেন। রাসূল বললেন: সেগুলো ফেরেশতা। তোমার তিলাওয়াত শুনছিল।",
      "বদর, উহুদ, খন্দক - সব যুদ্ধে বীরত্ব দেখিয়েছেন। ছয়শত ঊনচল্লিশ সালে মদীনায় মৃত্যু। উমর জানাযায় কাঁদলেন। ফেরেশতারা যার তিলাওয়াত শুনত।"
    ]
  },
  {
    "id": "anas_ibn_malik_extended",
    "categoryId": "sahabider_jibon",
    "title": "আনাস ইবনে মালিক (রাঃ) ",
    "paragraphs": [
      "মদীনায় জন্ম। আনাস ইবনে মালিক। খাযরাজ গোত্র। মা উম্মে সুলাইম - বিখ্যাত সাহাবিয়া।",
      "**রাসূলের খাদেম:** মাত্র ১০ বছর বয়সে মা তাকে রাসূলের সেবায় দিলেন। ১০ বছর সেবা করেছেন।",
      "**রাসূলের ভালোবাসা:** রাসূল কখনো বলেননি: উফ! কখনো বলেননি: কেন করলে? কেন করলে না?",
      "**দোয়া:** রাসূল দোয়া করলেন: আল্লাহ তার সম্পদ ও সন্তান বাড়াও, দীর্ঘায়ু দাও। আনাসের ১০০+ সন্তান হয়েছিল!",
      "**সব যুদ্ধে:** বদর ছাড়া সব যুদ্ধে অংশ নিয়েছেন। উহুদে রাসূলকে রক্ষা করেছেন।",
      "**হাদিস বর্ণনা:** ২২৮৬টি হাদিস বর্ণনা করেছেন। তৃতীয় সর্বোচ্চ।",
      "**দীর্ঘজীবী:** ১০৩ বছর বেঁচে ছিলেন। শেষ সাহাবী যিনি বসরায় মারা গেছেন।",
      "**মৃত্যু:** ৯৩ হিজরি, ৭১২ সাল। বসরায়। রাসূলের প্রিয় খাদেম।"
    ]
  },
  {
    "id": "abdullah_ibn_umar_extended",
    "categoryId": "sahabider_jibon",
    "title": "আবদুল্লাহ ইবনে উমর (রাঃ) - বিস্তারিত",
    "paragraphs": [
      "মক্কায় জন্ম। আবদুল্লাহ ইবনে উমর। উমর (রাঃ) এর পুত্র। ইসলামের প্রথম দিকে জন্ম।",
      "**শৈশব:** পিতার সাথে হিজরত করেন। মদীনায় বড় হন। রাসূলের সান্নিধ্যে।",
      "**উহুদে প্রত্যাখ্যান:** ১৩ বছর বয়সে উহুদে যেতে চেয়েছিলেন। রাসূল বয়স কম বলে পাঠাননি।",
      "**খন্দক থেকে:** ১৫ বছর বয়সে খন্দক থেকে সব যুদ্ধে অংশ নিয়েছেন।",
      "**রাসূলের অনুসরণ:** রাসূলের প্রতিটি কাজ অনুসরণ করতেন। যেখানে রাসূল বসতেন সেখানে বসতেন।",
      "**ইবাদত:** অত্যন্ত ইবাদতগুজার। রাতে নামায, দিনে রোযা। কুরআন তিলাওয়াত।",
      "**ফিতনা থেকে দূরে:** আলী ও মুয়াবিয়ার যুদ্ধে কোনো পক্ষ নেননি। নিরপেক্ষ থেকেছেন।",
      "**হাদিস বর্ণনা:** ২৬৩০টি হাদিস বর্ণনা করেছেন। দ্বিতীয় সর্বোচ্চ।",
      "**মৃত্যু:** ৭৩ হিজরি, ৬৯২ সাল। মক্কায়। বয়স ৮৪ বছ। উমরের যোগ্য পুত্র।"
    ]
  },
  {
    "id": "aisha_bint_abu_bakr",
    "categoryId": "sahabider_jibon",
    "title": "আয়েশা বিনতে আবু বকর (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। আয়েশা বিনতে আবু বকর। পিতা আবু বকর, মা উম্মে রুমান। ইসলামের প্রথম দিকে জন্ম।",
      "**বিবাহ:** ৬ বছর বয়সে বিয়ে, ৯ বছরে বাসর। রাসূলের সবচেয়ে প্রিয় স্ত্রী।",
      "**বুদ্ধিমতী:** অত্যন্ত বুদ্ধিমতী ও স্মরণশক্তিসম্পন্ন। রাসূল তাকে অনেক কিছু শিখিয়েছেন।",
      "**ইফকের ঘটনা:** মিথ্যা অপবাদ দেওয়া হয়েছিল। কুরআনে আয়াত নাযিল হয়ে নির্দোষ প্রমাণিত হলেন।",
      "**রাসূলের মৃত্যু:** রাসূল তার কোলে মাথা রেখে মারা গেলেন। তার ঘরে দাফন হলেন।",
      "**আলেমা:** ফিকহ, হাদিস, তাফসীরে পারদর্শী। সাহাবীরা তার কাছে জিজ্ঞাসা করতেন।",
      "**হাদিস বর্ণনা:** ২২১০টি হাদিস বর্ণনা করেছেন। নারীদের মধ্যে সর্বোচ্চ।",
      "**উটের যুদ্ধ:** উসমানের হত্যাকারীদের বিচার চেয়ে বসরায় গিয়েছিলেন। যুদ্ধ হল। পরে অনুতপ্ত হন।",
      "**শিক্ষাদান:** জীবনের শেষ ৪০ বছর হাদিস ও ফিকহ শিক্ষা দিয়েছেন।",
      "**মৃত্যু:** ৫৮ হিজরি, ৬৭৮ সাল। মদীনায়। বয়স ৬৪ বছর। উম্মুল মুমিনীন, আলেমা।"
    ]
  },
  {
    "id": "hafsa_bint_umar",
    "categoryId": "sahabider_jibon",
    "title": "হাফসা বিনতে উমর (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। হাফসা বিনতে উমর। পিতা উমর (রাঃ), মা যয়নাব বিনতে মাযউন।",
      "**প্রথম বিবাহ:** খুনাইস ইবনে হুযাফার সাথে বিয়ে হয়েছিল। উহুদে শহীদ হলেন। হাফসা বিধবা।",
      "**রাসূলের সাথে বিবাহ:** উমর চিন্তিত। আবু বকর ও উসমানকে প্রস্তাব দিলেন। রাজি হলেন না। রাসূল নিজে বিয়ে করলেন।",
      "**রোযাদার:** অত্যন্ত ইবাদতগুজার। রোযা রাখতেন, রাতে নামায পড়তেন।",
      "**কুরআনের হাফেজা:** কুরআন মুখস্থ ছিল। লিখতেও পারতেন।",
      "**কুরআনের সংরক্ষক:** আবু বকরের সংকলিত কুরআনের কপি হাফসার কাছে ছিল। উসমান সেটা থেকে প্রমিত কপি তৈরি করেন।",
      "**মৃত্যু:** ৪৫ হিজরি, ৬৬৫ সাল। মদীনায়। উম্মুল মুমিনীন, কুরআনের সংরক্ষক।"
    ]
  },
  {
    "id": "khadija_bint_khuwaylid",
    "categoryId": "sahabider_jibon",
    "title": "খাদিজা বিনতে খুওয়াইলিদ (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। খাদিজা বিনতে খুওয়াইলিদ। সম্ভ্রান্ত পরিবার। ধনী ব্যবসায়ী।",
      "**প্রথম বিবাহ:** দুইবার বিয়ে হয়েছিল। দুইবার বিধবা হন। দুই সন্তান।",
      "**মুহাম্মাদের সাথে:** মুহাম্মাদকে ব্যবসায়ের দায়িত্ব দিলেন। সততা ও আমানতদারি দেখে মুগ্ধ হলেন।",
      "**বিবাহ প্রস্তাব:** নিজে প্রস্তাব পাঠালেন। বিয়ে হল। খাদিজার বয়স ৪০, মুহাম্মাদের ২৫।",
      "**সন্তান:** ছয় সন্তান। দুই ছেলে: কাসিম, আবদুল্লাহ (শৈশবে মারা যান)। চার মেয়া: যয়নাব, রুকাইয়া, উম্মে কুলসুম, ফাতিমা।",
      "**প্রথম মুসলিম:** নবুয়তের পর প্রথম ঈমান আনলেন। নারীদের মধ্যে প্রথম মুসলিম।",
      "**সমর্থন:** রাসূলকে সব সময় সমর্থন করেছেন। সম্পদ দিয়ে সাহায্য করেছেন।",
      "**শিয়াবে আবি তালিব:** তিন বছর অবরোধে ছিলেন। কষ্ট সহ্য করেছেন। অসুস্থ হয়ে পড়লেন।",
      "**মৃত্যু:** ১০ নবুয়ত, ৬১৯ সাল। মক্কায়। বয়স ৬৫ বছর। রাসূল অত্যন্ত শোকাহত।",
      "**মর্যাদা:** রাসূল বলেছেন: খাদিজা জান্নাতের নারীদের সর্দার। জিবরীল তাকে সালাম দিয়েছেন।"
    ]
  },
  {
    "id": "safiya_bint_abdul_muttalib",
    "categoryId": "sahabider_jibon",
    "title": "সাফিয়্যা বিনতে আব্দুল মুত্তালিব (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। সাফিয়্যা বিনতে আব্দুল মুত্তালিব। রাসূলের ফুফু। হামযার বোন।",
      "**ইসলাম গ্রহণ:** প্রথম দিকে ইসলাম গ্রহণ করেন। মক্কায় নির্যাতন সহ্য করেন।",
      "**হিজরত:** মদীনায় হিজরত করেন। রাসূলের কাছে থাকতেন।",
      "**উহুদে সাহস:** উহুদের যুদ্ধে উপস্থিত ছিলেন। ভাই হামযা শহীদ হলেন। লাশ দেখতে চাইলেন। রাসূল বারণ করলেন। কিন্তু সাফিয়্যা ধৈর্য ধরলেন।",
      "**খন্দকে বীরত্ব:** খন্দকের যুদ্ধে নারী ও শিশুরা দুর্গে ছিল। একজন ইহুদি গুপ্তচর এল। সাফিয়্যা তাকে তাঁবুর খুঁটি দিয়ে মেরে ফেললেন!",
      "**পুত্র যুবাইর:** পুত্র যুবাইর ইবনুল আওয়াম - আশারায়ে মুবাশশারার একজন।",
      "**মৃত্যু:** ২০ হিজরি, ৬৪১ সাল। মদীনায়। সাহসী সাহাবিয়া।"
    ]
  },
  {
    "id": "umm_salama",
    "categoryId": "sahabider_jibon",
    "title": "উম্মে সালামা (রাঃ)",
    "paragraphs": [
      "মক্কায় জন্ম। উম্মে সালামা। আসল নাম হিন্দ বিনতে আবি উমাইয়া। সম্ভ্রান্ত পরিবার।",
      "**প্রথম বিবাহ:** আবু সালামার সাথে বিয়ে। প্রথম দিকে ইসলাম গ্রহণ করেন।",
      "**আবিসিনিয়ায় হিজরত:** প্রথম হিজরতকারীদের মধ্যে ছিলেন। আবিসিনিয়ায় গিয়েছিলেন।",
      "**মদীনায় হিজরত:** মদীনায় হিজরত করেন। পথে অনেক কষ্ট হয়েছিল। পরিবার আলাদা করে দিয়েছিল।",
      "**স্বামী শহীদ:** উহুদে আবু সালামা আহত হন। পরে মারা যান। উম্মে সালামা বিধবা।",
      "**রাসূলের সাথে বিবাহ:** রাসূল বিয়ের প্রস্তাব দেন। উম্মে সালামা বলেন: আমার সন্তান আছে, বয়স বেশি। রাসূল বলেন: আল্লাহ সমাধান করবেন। বিয়ে হল।",
      "**বুদ্ধিমতী:** অত্যন্ত বুদ্ধিমতী। হুদাইবিয়ায় রাসূলকে পরামর্শ দিয়েছিলেন।",
      "**হাদিস বর্ণনা:** ৩৭৮টি হাদিস বর্ণনা করেছেন।",
      "**দীর্ঘজীবী:** সবচেয়ে শেষে মারা যাওয়া উম্মুল মুমিনীন।",
      "**মৃত্যু:** ৬২ হিজরি, ৬৮১ সাল। মদীনায়। বয়স ৮৪ বছর। বুদ্ধিমতী উম্মুল মুমিনীন।"
    ]
  },
  {
    "id": "hassan_ibn_thabit",
    "categoryId": "sahabider_jibon",
    "title": "হাসসান ইবনে সাবিত (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। হাসসান ইবনে সাবিত। খাযরাজ গোত্র। আরবের বিখ্যাত কবি।",
      "**ইসলাম গ্রহণ:** রাসূল মদীনায় আসার পর ইসলাম গ্রহণ করেন।",
      "**রাসূলের কবি:** রাসূলের প্রশংসায় কবিতা লিখতেন। কাফিরদের জবাব দিতেন কবিতায়।",
      "**রাসূলের দোয়া:** রাসূল বলেছেন: হাসসান! তুমি তাদের কবিতায় আক্রমণ করো। জিবরীল তোমার সাথে আছে।",
      "**ইফকের ঘটনা:** আয়েশা (রাঃ) এর বিরুদ্ধে মিথ্যা অপবাদে অংশ নিয়েছিলেন। পরে তওবা করেন।",
      "**দীর্ঘজীবী:** ১২০ বছর বেঁচে ছিলেন। ৬০ বছর জাহেলিয়াতে, ৬০ বছর ইসলামে।",
      "**মৃত্যু:** ৫৪ হিজরি, ৬৭৪ সাল। মদীনায়। ইসলামের কবি।"
    ]
  },
  {
    "id": "abdullah_ibn_abbas_extended",
    "categoryId": "sahabider_jibon",
    "title": "আবদুল্লাহ ইবনে আব্বাস (রাঃ) - বিস্তারিত",
    "paragraphs": [
      "মক্কায় জন্ম। আবদুল্লাহ ইবনে আব্বাস। রাসূলের চাচা আব্বাসের পুত্র। রাসূলের চাচাতো ভাই।",
      "**শৈশব:** হিজরতের তিন বছর আগে জন্ম। মক্কায় বড় হন। পরে মদীনায় আসেন।",
      "**রাসূলের দোয়া:** রাসূল তার মাথায় হাত রেখে দোয়া করেছেন: আল্লাহ তাকে দ্বীনের জ্ঞান দাও এবং তাবীল (ব্যাখ্যা) শেখাও।",
      "**তাফসীরের ইমাম:** কুরআনের তাফসীরে সবচেয়ে জ্ঞানী। উমর বলতেন: ইবনে আব্বাস কুরআনের ব্যাপারে সবচেয়ে জ্ঞানী।",
      "**হিবরুল উম্মাহ:** উপাধি - হিবরুল উম্মাহ (উম্মতের পণ্ডিত), তুরজুমানুল কুরআন (কুরআনের ব্যাখ্যাকারী)।",
      "**আলীর সাথে:** আলী (রাঃ) এর খিলাফতে তার সাথে ছিলেন। বসরার গভর্নর ছিলেন।",
      "**শিক্ষাদান:** মক্কা ও তায়েফে শিক্ষা দিতেন। হাজার হাজার ছাত্র।",
      "**অন্ধত্ব:** জীবনের শেষ দিকে অন্ধ হয়ে যান। কিন্তু শিক্ষাদান চালিয়ে যান।",
      "**হাদিস বর্ণনা:** ১৬৬০টি হাদিস বর্ণনা করেছেন।",
      "**মৃত্যু:** ৬৮ হিজরি, ৬৮৭ সাল। তায়েফে। বয়স ৭১ বছর। তাফসীরের ইমাম।"
    ]
  },
  {
    "id": "ubada_ibn_samit",
    "categoryId": "sahabider_jibon",
    "title": "উবাদা ইবনে সামিত (রাঃ)",
    "paragraphs": [
      "মদীনায় জন্ম। উবাদা ইবনে সামিত। খাযরাজ গোত্র। লম্বা, শক্তিশালী।",
      "**আকাবার শপথ:** দুই আকাবার শপথেই অংশ নিয়েছেন। প্রথম দিকের আনসার।",
      "**বদরের বীর:** বদরের যুদ্ধে অসাধারণ বীরত্ব দেখিয়েছেন।",
      "**সব যুদ্ধে:** উহুদ, খন্দক, খায়বার - সব যুদ্ধে অংশ নিয়েছেন।",
      "**শিক্ষক:** কুরআন শেখাতেন। মদীনায় শিক্ষক হিসেবে বিখ্যাত ছিলেন।",
      "**শামে:** উমরের খিলাফতে শামে গিয়ে কুরআন শেখাতেন।",
      "**মৃত্যু:** ৩৪ হিজরি, ৬৫৪ সাল। শামে। কুরআনের শিক্ষক।"
    ]
  },
  {
    "id": "abdullah_ibn_masud_extended",
    "categoryId": "sahabider_jibon",
    "title": "আবু যর আল-গিফারি (রাঃ)",
    "paragraphs": [
      "গিফার গোত্রে জন্ম। আবু যর জুনদুব ইবনে জুনাদা। মরুভূমিতে বাস।",
      "**ইসলাম গ্রহণ:** চতুর্থ বা পঞ্চম মুসলিম। মক্কায় একা এসে ইসলাম গ্রহণ করেন।",
      "**সাহসী ঘোষণা:** কাবার কাছে জোরে বললেন: আশহাদু আল্লা ইলাহা ইল্লাল্লাহ! কুরাইশরা মারধর করল। আব্বাস বাঁচালেন।",
      "**গোত্রে ফিরে:** গোত্রে ফিরে ইসলাম প্রচার করলেন। পুরো গোত্র মুসলিম হল।",
      "**মদীনায়:** হিজরতের পর মদীনায় এলেন। রাসূলের সাথে থাকতেন।",
      "**সত্যবাদী:** রাসূল বলেছেন: আবু যরের চেয়ে সত্যবাদী কেউ নেই।",
      "**সাদাসিধে জীবন:** অত্যন্ত সাদাসিধে জীবনযাপন করতেন। দুনিয়াবিমুখ।",
      "**উসমানের সাথে মতভেদ:** সম্পদ জমানোর বিরুদ্ধে কথা বলতেন। উসমান তাকে রাবাযায় পাঠান।",
      "**মৃত্যু:** ৩২ হিজরি, ৬৫২ সাল। রাবাযায়। একাকী। সত্যবাদী সাহাবী।"
    ]
  },
  {
    "id": "miqdad_ibn_aswad",
    "categoryId": "sahabider_jibon",
    "title": "মিকদাদ ইবনুল আসওয়াদ (রাঃ)",
    "paragraphs": [
      "ইয়েমেনে জন্ম। মিকদাদ ইবনে আমর। মক্কায় এসে আসওয়াদ ইবনে আবদ ইয়াগুসের পালক পুত্র হন।",
      "**ইসলাম গ্রহণ:** প্রথম দিকে ইসলাম গ্রহণ করেন। নির্যাতন সহ্য করেন।",
      "**হিজরত:** মদীনায় হিজরত করেন। রাসূলের সাথে থাকেন।",
      "**বদরের বীর:** বদরে রাসূল পরামর্শ চাইলেন। মিকদাদ বললেন: ইয়া রাসূলাল্লাহ! আমরা বনি ইসরাইলের মতো বলব না যে আপনি ও আপনার রব যুদ্ধ করুন। বরং আমরা আপনার ডানে, বামে, সামনে, পেছনে লড়ব। রাসূল খুশি হলেন।",
      "**সব যুদ্ধে:** সব যুদ্ধে অংশ নিয়েছেন। বীর যোদ্ধা।",
      "**মৃত্যু:** ৩৩ হিজরি, ৬৫৩ সাল। মদীনায়। বদরের বীর।"
    ]
  }
]