[
  {
    "id": "abu_bakr_siddiq",
    "categoryId": "sahabider_jibon",
    "title": "আবু বকর সিদ্দিক (রাঃ)",
    "paragraphs": [
      "হযরত আবু বকর (আরবি: أبو بكر الصديق; জন্ম: ২৭ অক্টোবর ৫৭৩ – মৃত্যু: ২৩ আগস্ট ৬৩৪) ছিলেন একজন আরব রাজনৈতিক ও ধর্মীয় নেতা যিনি রাশিদুন খিলাফত প্রতিষ্ঠা করেন এবং ৬৩২ সাল থেকে ৬৩৪ সাল পর্যন্ত ইসলামের প্রথম খলিফা হিসেবে শাসন করেন।",
      "**বংশ ও উপাধি:** আবু বকরের পূর্ণ নাম ছিল আব্দুল্লাহ ইবনে আবি কুহাফা। আরবী ভাষায় আব্দুল্লাহ (আরবি: عَبْدُ ٱللهِ) নামের অর্থ 'আল্লাহর বান্দা।' শৈশবে উটের প্রতি বিশেষ ভালোবাসার কারণে তাকে 'আবু বকর' ডাকনাম দেওয়া হয় যার অর্থ উটের বাছুরের পিতা।",
      "**উপাধি:** ইসলাম গ্রহণের আগে তার উপাধি ছিল আতিক (আরবি: عتيق) যার অর্থ 'রক্ষাকারী'। লাইলাতুল মেরাজের ঘটনায় রাসূল (সাঃ)-কে বিশ্বাস করার পর রাসূল তাকে আল-সিদ্দিক (আরবি: الصديق) উপাধি দেন যার অর্থ 'সত্যবাদী'।",
      "**জন্ম ও প্রারম্ভিক জীবন:** আবু বকর ৫৭৩ খ্রিস্টাব্দে মক্কায় কুরাইশ উপজাতির বনু তাইম শাখায় একটি ধনী পরিবারে জন্মগ্রহণ করেন। তার পিতা ছিলেন উসমান (লাকাব আবু কুহাফা) এবং মা ছিলেন সালমা বিনতে শাখার (উম্মে উল-খায়ের)।",
      "**বংশতালিকাবিদ:** আবু বকর ছিলেন তার সময়ের প্রসিদ্ধ আরব বংশতালিকাবিদ। শুধু কুরাইশের ইতিহাসই নয়, অন্যান্য আরব গোত্রের ইতিহাস সম্পর্কেও তার বিশেষজ্ঞ জ্ঞান ছিল। রাসূল (সাঃ) বলেছেন: 'নিশ্চয়ই আবু বকর কুরাইশদের বংশ সম্পর্কে সবচেয়ে জ্ঞানী।'",
      "**প্রাথমিক জীবন:** ইসলাম গ্রহণের আগে আবু বকর হানিফ ধর্মকে অনুশীলন করতেন এবং কখনও প্রতিমা পূজা করতেন না। তিনি একজন ধনী ব্যবসায়ী ছিলেন এবং মক্কার সম্মানিত ব্যক্তি ছিলেন।",
      "**ইসলাম গ্রহণ:** আবু বকর ব্যবসায়ী হওয়ায় তিনি সিরিয়া সফর করতেন। একটি যাত্রার সময় এক বৃদ্ধ তাকে একজন নবীর আগমনের কথা বলেন। রাসূল (সাঃ) নবুয়ত ঘোষণা করলে আবু বকর তাৎক্ষণিকভাবে ইসলাম গ্রহণ করেন। তিনি ছিলেন ইসলাম গ্রহণকারী প্রথম স্বাধীন পুরুষ।",
      "**দাস মুক্তি:** আবু বকর দাসদের প্রতি সহানুভূতি অনুভব করতেন। তিনি বিলাল ইবনে রাবাহ, আবু ফুকাইয়া, আম্মার ইবনে ইয়াসির সহ আটজন দাস-দাসী কিনে মুক্ত করেন এবং তাদের স্বাধীনতার জন্য ৪০,০০০ দিনার ব্যয় করেন। তার পিতা জিজ্ঞাসা করেন কেন তিনি শক্তিশালী দাস মুক্ত করেননি। আবু বকর উত্তর দেন: 'আমি ঈশ্বরের জন্য দাসদের মুক্ত করছি, নিজের জন্য নয়।'",
      "**কুরাইশদের নিপীড়ন:** ৬১৩ সালে রাসূল (সাঃ) প্রকাশ্যে ইসলামের দাওয়াত দিতে শুরু করলে আবু বকর প্রথম প্রকাশ্য ভাষণ দেন। কুরাইশ যুবকরা তাকে মারধর করে জ্ঞান হারিয়ে ফেলা পর্যন্ত। এই ঘটনার পর তার মা ইসলাম গ্রহণ করেন।",
      "**আবিসিনিয়ায় হিজরত:** ৬১৪ সালে নির্যাতন বৃদ্ধি পেলে তিনি আবিসিনিয়ায় হিজরত করেন। নাজাশি তাদের নিরাপত্তা দেন। ৬১৯-৬২০ সালে তিনি মক্কায় ফিরে আসেন।",
      "**মদিনায় হিজরত:** ৬২২ সালে কুরাইশরা রাসূল (সাঃ)-কে হত্যার চেষ্টা করে। রাসূল আবু বকরকে সাথে নিয়ে জাবাল থাওয়ারের গুহায় আশ্রয় নেন। তিন দিন তিন রাত গুহায় থাকার পর তারা মদিনায় যাত্রা করেন। এ সময় কুরআনের আয়াত নাযিল হয়: 'যদি তোমরা তাকে সাহায্য না করো, তবে আল্লাহ তাকে সাহায্য করেছেন যখন তিনি ছিলেন দুজনের মধ্যে দ্বিতীয়, যখন তারা গুহায় ছিলেন।' (সূরা তাওবা: ৪০)",
      "**মদিনায় জীবন:** মদিনায় রাসূল (সাঃ) মসজিদে নববী নির্মাণের সিদ্ধান্ত নেন এবং জমির দাম আবু বকর প্রদান করেন। আবু বকরের সাথে খায়েরিজাহ বিন জাইদ আনসারির সাথে ভ্রাতৃত্ব বন্ধন করা হয়। তিনি মদিনায় কাপড়ের ব্যবসা শুরু করেন। ৬২৩ সালে তার কন্যা আয়েশা (রাঃ) রাসূল (সাঃ)-এর সাথে বিবাহবন্ধনে আবদ্ধ হন।",
      "**বদরের যুদ্ধ:** ৬২৪ সালে আবু বকর বদরের যুদ্ধে রাসূল (সাঃ)-এর তাঁবুর রক্ষী হিসেবে কাজ করেন। আলী (রাঃ) বলেন: 'আবু বকর সবচেয়ে সাহসী, টানা তলোয়ার নিয়ে রাসূলকে রক্ষা করেন।'",
      "**উহুদ ও খন্দকের যুদ্ধ:** ৬২৫ সালে উহুদের যুদ্ধে তিনি অংশ নেন এবং আহত হন। যুদ্ধ শুরু হওয়ার আগে, তার ছেলে আব্দুর রহমান, সেই সময় এখনও অমুসলিম এবং কুরাইশদের পক্ষে লড়াই করতে এগিয়ে আসে। ৬২৭ সালে তিনি খন্দকের যুদ্ধে অংশ নেন এবং পরিখা খননে সহায়তা করেন।",
      "**হুদায়বিয়ার সন্ধি:** ৬২৮ সালে তিনি হুদায়বিয়ার সন্ধিতে অংশ নেন এবং সাক্ষী হিসেবে এতে স্বাক্ষর করেন। উমর সন্ধির শর্তে অসন্তুষ্ট হয়ে আবু বকরের কাছে আসেন। আবু বকর তাকে বোঝান এবং বলেন: 'তিনি আল্লাহর রাসূল এবং তিনি তাঁর রবের অবাধ্য নন।'",
      "**মক্কা বিজয়:** ৬৩০ সালে মক্কা বিজয়ের সময় আবু বকর রাসূল (সাঃ)-এর সাথে ছিলেন। তার পিতা আবু কুহাফা তখনও অমুসলিম ছিলেন। রাসূল (সাঃ) বলেন: 'আপনি আপনার পিতাকে তাঁর ঘরে রেখে আসতে পারতেন, আমি নিজেই তাঁর কাছে যেতাম।' আবু কুহাফা ইসলাম গ্রহণ করেন এবং আবু বকর খুশিতে কাঁদেন।",
      "**তাবুক অভিযান:** ৬৩০ সালে তাবুক অভিযানে আবু বকর তার সমস্ত সম্পদ দান করেন। রাসূল (সাঃ) জিজ্ঞাসা করেন: 'তুমি তোমার পরিবারের জন্য কী রেখে এসেছ?' আবু বকর উত্তর দেন: 'আমি তাদের জন্য আল্লাহ ও তাঁর রাসূলকে রেখে এসেছি।'",
      "**আমির-উল-হজ্জ:** ৬৩১ সালে রাসূল (সাঃ) আবু বকরকে আমির-উল-হজ্জ (হজ্জের নেতা) হিসেবে নিযুক্ত করেন এবং তিনশ মুসলমানের একটি প্রতিনিধিদল নিয়ে মক্কায় পাঠান। আবু বকর হজ্জ অনুষ্ঠানে সভাপতিত্ব করেন এবং আলী রাসূল (সাঃ)-এর পক্ষ থেকে সূরা তাওবাহর একটি অংশ ঘোষণা করেন।",
      "**রাসূলের শেষ দিন:** রাসূল (সাঃ)-এর শেষ দিনগুলিতে তিনি আবু বকরকে নামাযের ইমামতি করতে বলেন। রাসূল বলেন: 'আবু বকরের দরজা ছাড়া মসজিদের দিকে যাওয়ার সমস্ত দরজা বন্ধ করে দাও, কারণ আমি তার চেয়ে ভাল বন্ধু আর কেউ নেই।'",
      "**রাসূলের মৃত্যু:** রাসূল (সাঃ)-এর মৃত্যুর পর মুসলিম সম্প্রদায় গভীর ধাক্কা খায়। উমর বিশেষভাবে প্রভাবিত হন এবং ঘোষণা করেন যে রাসূল মারা যাননি। আবু বকর মদিনায় ফিরে এসে উমরকে শান্ত করেন এবং মসজিদে সমবেত ব্যক্তিদের উদ্দেশে বলেন: 'কেউ যদি মুহাম্মাদের উপাসনা করে, তবে মুহাম্মাদ মারা গেছেন। যদি কেউ আল্লাহর উপাসনা করে, আল্লাহ জীবিত, অমর।'",
      "**কুরআনের আয়াত:** এরপর তিনি কুরআন থেকে তিলাওয়াত করেন: 'মুহাম্মাদ একজন রাসুল ছাড়া আর কিছুই নন এবং তার পূর্বে অনেক রাসুল মারা গেছেন।' (সূরা আল ইমরান: ১৪৪)",
      "**সাকীফায় নির্বাচন:** রাসূল (সাঃ)-এর মৃত্যুর পর সাকীফায় সমাবেশ অনুষ্ঠিত হয়। আনসাররা তাদের মধ্য থেকে নেতা নির্বাচন করতে চাইলে আবু বকর ও উমর সেখানে যান। আবু বকর বলেন যে উত্তরাধিকার কুরাইশদের মধ্য থেকে হতে হবে। উমর আবু বকরের প্রতি আনুগত্যের শপথ নেন এবং সবাই অনুসরণ করেন।",
      "**খলিফার শপথ:** খলিফার দায়িত্ব গ্রহণের পর আবু বকর বলেন: 'আমি তোমাদের মধ্যে সেরা নই। আমি যদি ভাল করি, আমাকে সাহায্য করো; আর আমি যদি অন্যায় করি, তাহলে আমাকে ঠিক করিয়ে দাও। যতক্ষণ আমি আল্লাহ ও তাঁর রাসূলের আনুগত্য করি ততক্ষণ আমার আনুগত্য করো।'",
      "**রিদ্দার যুদ্ধ:** আবু বকরের নির্বাচনের পর বেশ কয়েকটি আরব উপজাতি বিদ্রোহ শুরু করে এবং যাকাত দিতে অস্বীকার করে। আবু বকর দৃঢ়তার সাথে বলেন: 'যারা নামায ও যাকাতের মধ্যে পার্থক্য করে, আমি তাদের বিরুদ্ধে যুদ্ধ করব।'",
      "**কুরআন সংরক্ষণ:** ইয়ামামার যুদ্ধে অনেক হাফিয শহীদ হওয়ায় উমর আবু বকরকে কুরআন লিখিত আকারে সংকলনের পরামর্শ দেন। আবু বকর প্রথমে দ্বিধাগ্রস্ত ছিলেন কিন্তু পরে রাজি হন এবং যায়েদ ইবনে সাবিতকে এই কাজের দায়িত্ব দেন।",
      "**পারস্য ও সিরিয়ায় অভিযান:** আরব একত্রিত হওয়ার পর আবু বকর বাইজেন্টাইন ও সাসানীয় সাম্রাজ্যে অভিযান পাঠান। ৬৩৩ সালে ইরাক ও ফিলিস্তিনে বাহিনী প্রেরণ করা হয় যা বেশ কয়েকটি শহর দখল করে।",
      "**মৃত্যু:** ৬৩৪ সালের ২৩ আগস্ট আবু বকর অসুস্থ হয়ে পড়েন এবং তার প্রচণ্ড জ্বর হয়। মৃত্যুর আগে তিনি আলী (রাঃ)-কে অনুরোধ করেন যেন তিনি তার গোসল করান। তিনি উমর (রাঃ)-কে তার উত্তরসূরি হিসেবে মনোনীত করেন এবং উসমান (রাঃ)-কে দিয়ে তার শেষ ইচ্ছা লিখিয়ে নেন।",
      "**দাফন:** উমর তার জানাযার নামাযের নেতৃত্ব দেন এবং তাকে রাসূল (সাঃ)-এর কবরের পাশে সমাহিত করা হয়।"
    ],
    "moral": "আবু বকর (রাঃ)-এর জীবন প্রমাণ করে যে সত্যের পথে দৃঢ়তা, ত্যাগ, দানশীলতা এবং রাসূলের প্রতি ভালোবাসা সর্বোচ্চ মর্যাদা এনে দেয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর"
  },
  {
    "id": "umar_ibn_khattab",
    "categoryId": "sahabider_jibon",
    "title": "উমর ইবনুল খাত্তাব (রাঃ)",
    "paragraphs": [
      "মক্কার উত্তপ্ত বালুতে একটি শিশুর জন্ম হয় ৫৮৪ সালে। নাম রাখা হয় উমর। পিতা খাত্তাব ইবনে নুফায়েল, মা হানতামা বিনতে হিশাম। কুরাইশ বংশের বনু আদি গোত্রের এই পরিবার ছিল মক্কায় সম্মানিত। কে জানত এই শিশুটিই একদিন হবে আল-ফারুক!",
      "**কঠিন শৈশব ও শিক্ষা:** ছোট উমরের জীবন ছিল কঠোর পরিশ্রমে ভরা। মরুভূমিতে পিতার উট চরাতে হতো। পিতা খাত্তাব ছিলেন কঠোর মানুষ। উমর বলেছেন: 'আমার বাবা কঠোর পরিশ্রম করাতেন। না করলে মারধর করতেন।' এই কঠিন জীবনই তাকে বানিয়েছিল লৌহমানব। সেই যুগে পুরো কুরাইশে মাত্র ১৭ জন লিখতে পারতেন। উমর ছিলেন তাদের একজন। কবিতা ছিল তার প্রিয়। তীরন্দাজি, অশ্বারোহণ, কুস্তি - সবেতেই পারদর্শী। ৬ ফুট ৩ ইঞ্চি লম্বা, শক্তিশালী গড়ন। মক্কার সবচেয়ে ভয়ঙ্কর যোদ্ধা।",
      "**ব্যবসায়ী জীবন:** যুবক উমর হলেন সফল বণিক। চামড়া আর কাপড়ের ব্যবসা। সিরিয়া, ইরাক, ইয়েমেন - সব জায়গায় বাণিজ্য। রোমান, পারসিক সাম্রাজ্যে যেতেন। মক্কায় তিনি ছিলেন বিচারক, সালিশকারী। মানুষ বিশ্বাস করত তার ন্যায়বিচারে।",
      "**ইসলামের শত্রু:** ৬১০ সাল। মুহাম্মাদ (সাঃ) শুরু করলেন ইসলাম প্রচার। উমর হয়ে উঠলেন কঠিন শত্রু। তার বোন ফাতিমা ও ভগ্নিপতি সাঈদকে দড়ি দিয়ে বেঁধে মারতেন। দাসী লুবাইনাকেও মারতেন। পরে আবু বকর লুবাইনাকে মুক্ত করেন। একসময় উমর সিদ্ধান্ত নিলেন - মুহাম্মাদকে হত্যা করতে হবে!",
      "**ইসলাম গ্রহণ:** ৬১৬ সাল। ৩৯ বছর বয়সী উমর তলোয়ার নিয়ে বেরিয়ে পড়লেন - লক্ষ্য মুহাম্মাদকে হত্যা! ইবনে সাদ, ইবনে হিশাম, দারকুতনী ও ইবনে আসীরের বর্ণনা অনুযায়ী, পথে বন্ধু নাইম ইবনে আবদুল্লাহর সাথে দেখা। নাইম গোপনে মুসলমান হয়েছিলেন কিন্তু উমর জানতেন না।\n\n'কোথায় যাচ্ছ উমর?' নাইম জিজ্ঞাসা করলেন।\n'মুহাম্মাদকে হত্যা করতে!' উমর দৃঢ়স্বরে জবাব দিলেন।\n'তুমি কি মনে করো বনু হাশিম ও বনু যুহরা তোমাকে ছেড়ে দেবে? আগে নিজের ঘরের খবর নাও। তোমার বোন ফাতিমা আর ভগ্নিপতি সাঈদ মুসলমান হয়ে গেছে!'\n\nউমরের চোখ জ্বলে উঠল রাগে। ঘুরিয়ে নিলেন পা বোনের বাড়ির দিকে।\n\nবাড়িতে পৌঁছে শুনলেন কুরআন তিলাওয়াতের শব্দ। খাব্বাব ইবনুল আরাত সূরা তাহা পড়াচ্ছিলেন। উমরের পদশব্দে খাব্বাব লুকিয়ে গেলেন। ফাতিমা পাণ্ডুলিপি লুকিয়ে ফেললেন।\n\nউমর ঘরে ঢুকে গর্জন করলেন: 'এই গুনগুন কিসের শব্দ?'\n'কিছু না ভাই, আমরা শুধু কথা বলছিলাম।' ফাতিমা বললেন।\n'মিথ্যা বলো না! শুনেছি তোমরা মুহাম্মাদের ধর্ম নিয়েছ!'\n\nএই বলে সাঈদের উপর ঝাঁপিয়ে পড়লেন। ফাতিমা স্বামীকে বাঁচাতে এগিয়ে এলেন। উমর তাকেও আঘাত করলেন। ফাতিমার মুখ দিয়ে রক্ত ঝরতে লাগল।\n\nবোনের রক্ত দেখে উমরের মন কেঁপে উঠল। লজ্জিত হলেন। কিন্তু ফাতিমা সাহসের সাথে বললেন: 'হ্যাঁ উমর! আমরা মুসলমান হয়েছি। আল্লাহ ও তাঁর রাসূলের প্রতি ঈমান এনেছি। তুমি যা ইচ্ছা করো, আমরা ইসলাম ছাড়ব না!'\n\nউমর নরম স্বরে বললেন: 'তোমরা যা পড়ছিলে সেই লেখা আমাকে দেখাও।'\n'তুমি অপবিত্র অবস্থায় আছ। এটা আল্লাহর পবিত্র কালাম। আগে গোসল করো, তবেই দেখতে পারবে।' ফাতিমা বললেন।\n\nউমর গোসল করলেন। পবিত্র হলেন। হাতে নিলেন সূরা তাহার পাণ্ডুলিপি। পড়তে শুরু করলেন:\n\nطه ما أنزلنا عليك القرآن لتشقى\n'তা-হা। আমি তোমার প্রতি কুরআন এজন্য নাযিল করিনি যে তুমি কষ্ট পাবে।'\n\nإن الساعة آتية أكاد أخفيها لتجزى كل نفس بما تسعى\n'নিশ্চয়ই কিয়ামত আসবে। আমি তা গোপন রাখতে চাই যাতে প্রত্যেককে তার কর্মের ফল দেওয়া যায়।'\n\nفلا يصدنك عنها من لا يؤمن بها واتبع هواه فتردى\n'যে এতে বিশ্বাস করে না এবং নিজ প্রবৃত্তির অনুসরণ করে, সে যেন তোমাকে এ থেকে বিরত না রাখে। নইলে তুমি ধ্বংস হয়ে যাবে।'\n\nপড়তে পড়তে উমরের চোখ ভিজে এলো। হৃদয় কাঁপল। তিনি বললেন: 'সুবহানাল্লাহ! এ কেমন সুন্দর ও মহৎ বাণী! এটা মানুষের রচিত নয়, এটা আল্লাহর বাণী! আমাকে মুহাম্মাদের কাছে নিয়ে চলো!'\n\nখাব্বাব লুকানো জায়গা থেকে বেরিয়ে এলেন। বললেন: 'উমর, সুসংবাদ! গতকাল রাসূল (সাঃ) দোয়া করেছেন: \"হে আল্লাহ, আবু জাহল অথবা উমর ইবনুল খাত্তাব - এই দুজনের মধ্যে যে তোমার কাছে বেশি প্রিয় তাকে দিয়ে ইসলামকে শক্তিশালী করো!\" আল্লাহ তোমাকে বেছে নিয়েছেন!'\n\nউমর সোজা চললেন দারুল আরকামে। যেখানে রাসূল (সাঃ) সাহাবীদের সাথে ছিলেন। তলোয়ার হাতে উমরকে আসতে দেখে সাহাবীরা ভয় পেলেন। হামযা (রাঃ) দরজায় দাঁড়িয়ে বললেন: 'যদি সে ভালো উদ্দেশ্যে আসে তবে ঠিক আছে। আর যদি খারাপ উদ্দেশ্যে আসে, তবে তার নিজের তলোয়ার দিয়েই তার মাথা কেটে ফেলব!'\n\nকিন্তু রাসূল (সাঃ) শান্ত স্বরে বললেন: 'তাকে আসতে দাও।'\n\nউমর ঘরে ঢুকলেন। রাসূল (সাঃ) তার কাপড়ের কলার ধরে জোরে টান দিলেন এবং জিজ্ঞাসা করলেন: 'উমর ইবনুল খাত্তাব! কেন এসেছ? কখন থামবে তুমি?'\n\nউমর কাঁপা গলায় বললেন: 'ইয়া রাসূলাল্লাহ! আমি সাক্ষ্য দিচ্ছি যে লা ইলাহা ইল্লাল্লাহ এবং আপনি আল্লাহর রাসূল!'\n\nরাসূল (সাঃ) এত খুশি হলেন যে উচ্চস্বরে তাকবীর দিলেন: 'আল্লাহু আকবার!' তাঁর তাকবীর ধ্বনি দারুল আরকামের বাইরে পর্যন্ত শোনা গেল। সাহাবীরা বুঝলেন - ইসলাম শক্তিশালী হয়েছে! রাসূল (সাঃ) উমরকে 'আল-ফারুক' উপাধি দিলেন।\n\nতবে আহমদ ইবনে হাম্বল ও ইবনে হিশামের আরেকটি বর্ণনা রয়েছে। সেই বর্ণনা অনুযায়ী, এক রাতে উমর রাসূল (সাঃ)-কে কাবার প্রাঙ্গণে নামাজরত অবস্থায় অনুসরণ করছিলেন। তখন তাঁর মুখে কুরআনের বাণী শুনে উমরের মনে হলো: 'এটি মানব রচিত নয়, আল্লাহ রচিত বাণী!' তখনই তিনি রাসূলকে জানালেন যে ইসলাম তার অন্তরে প্রবেশ করেছে।\n\nইসলাম গ্রহণের পর উমর প্রথমে ভীত ছিলেন। লোকচক্ষুর আড়ালে থাকতেন। কিন্তু যখন স্থানীয় জনগণ তার ধর্মান্তরিত হওয়া জানতে পেরে তাকে মারতে আসল, তখন আল-আস ইবনে ওয়াইল তাকে রক্ষা করেন।\n\nকিন্তু উমর বেশিদিন লুকিয়ে থাকতে পারলেন না। তিনি সোজা গেলেন ইসলামের সবচেয়ে কঠোর শত্রু আবু জাহলের কাছে। বললেন: 'আবু জাহল, জেনে রাখো - আমি মুসলমান হয়েছি!' আবু জাহল রাগে ফেটে পড়লেন কিন্তু কিছু করতে পারলেন না।\n\nএরপর উমর ও হামযা (রাঃ) দুই সারিতে মুসলিমদের নিয়ে প্রকাশ্যে কাবা প্রাঙ্গণে গেলেন। প্রথমবার মুসলিমরা প্রকাশ্যে কাবায় নামায পড়লেন। কুরাইশরা বাধা দিতে সাহস পেল না।\n\nআবদুল্লাহ ইবনে মাসউদ (রাঃ) পরে বলেছেন: 'উমর মুসলিম হওয়ার আগে আমরা গোপনে ইবাদত করতাম। উমর মুসলিম হওয়ার পর আমরা শক্তিশালী হয়েছি এবং মান-সম্মানের সাথে বসবাস করতে পেরেছি। সেদিন থেকে আমরা প্রকাশ্যে নামায পড়তে পেরেছি।'\n\nসকল বর্ণনাকারী এ ব্যাপারে একমত যে উমরের ইসলাম গ্রহণে মুসলমানদের মনোবল যথেষ্ট বৃদ্ধি পায়। ইসলাম পেল নতুন শক্তি, নতুন সাহস!",
      "**হিজরত ও মদীনা:** ৬২২ সাল। সবাই রাতে গোপনে হিজরত করছেন। কিন্তু উমর দিনের বেলায় কাবায় গেলেন। কুরাইশদের বললেন: 'কে আছো মোকাবেলা করবে?' ২০ জন সাহাবীসহ প্রকাশ্যে মদীনায় গেলেন। রাসূল (সাঃ) উমরকে মুহাম্মাদ ইবনে মাসলামার সাথে ভ্রাতৃত্বে আবদ্ধ করলেন। ৬২৫ সালে উমরের কন্যা হাফসা (রাঃ) রাসূলকে বিয়ে করলেন।",
      "**যুদ্ধসমূহ:** বদর (৬২৪), উহুদ (৬২৫), খন্দক (৬২৭), খায়বার, মক্কা বিজয় (৬৩০), হুনায়ন, তাবুক - সব যুদ্ধে উমর। তাবুকে সম্পদের অর্ধেক দান করলেন। আবু বকর সব দান করলেন! উমর বললেন: 'আমি কখনও আবু বকরকে ছাড়িয়ে যেতে পারব না।'",
      "**রাসূলের মৃত্যু ও খিলাফত:** ৬৩২ সাল। রাসূল (সাঃ) মৃত্যুবরণ করলেন। উমর বিশ্বাস করলেন না। তলোয়ার হাতে বললেন: 'যে বলবে নবি মারা গেছেন আমি তার হাত-পা কাটব!' আবু বকর তিলাওয়াত করলেন: 'মুহাম্মাদ একজন রাসুল। তার পূর্বে সকল রাসুল গত হয়েছেন।' (সূরা আল ইমরান: ১৪৪) উমর সত্য বুঝলেন। সাকীফায় উমর আবু বকরের হাত ধরলেন: 'আমি বাইয়াত করছি।' ইসলামী খিলাফত প্রতিষ্ঠিত হল। উমর ছিলেন প্রধান উপদেষ্টা। কুরআন সংকলনের পরামর্শ দিলেন। আবু বকর উমরকে উত্তরসূরি মনোনীত করলেন।",
      "**খলিফা হিসেবে দায়িত্ব:** ২২ আগস্ট ৬৩৪। উমর খলিফা হলেন। প্রথম ভাষণ: 'যদি ফোরাতের তীরে একটি কুকুর না খেয়ে মারা যায়, উমর দায়ী থাকবে!' এককেন্দ্রিক সরকার গড়লেন। প্রদেশ, জেলা, গভর্নর। প্রথম চালু করলেন: পুলিশ বাহিনী, গোয়েন্দা বিভাগ, প্রশাসনিক আদালত। হিজরি বর্ষপঞ্জি প্রণয়ন। বাইতুল মাল স্থাপন। মসজিদ সম্প্রসারণ। বসরা ও কুফা শহর নির্মাণ।",
      "**জেরুজালেম ও সংস্কার:** ৬৩৮ সাল। উমর নিজে জেরুজালেমে গেলেন। 'উমরের চুক্তি' স্বাক্ষর করলেন। খ্রিস্টানদের নিরাপত্তা দিলেন। ইহুদিদের ফিরে আসার অনুমতি দিলেন। হারাম আল শরিফ নিজে হাতে পরিষ্কার করলেন। খালিদ ইবনে ওয়ালিদকে পদচ্যুত করলেন - বোঝাতে চাইলেন বিজয় আল্লাহর!",
      "**দুর্ভিক্ষ ও বিজয়:** ৬৩৮ সাল। ভয়াবহ দুর্ভিক্ষ। উমর মাংস, ঘি, দুধ খাওয়া বন্ধ করলেন। লক্ষাধিক মানুষ বাঁচলেন। ৬৩৯ সাল। প্লেগে আবু উবাইদা সহ ২৫,০০০ মুসলিম শহীদ হলেন। উমরের খিলাফতকালে লেভান্ট, মিশর, সম্পূর্ণ সাসানীয় সাম্রাজ্য, পারস্য, আজারবাইজান, আর্মেনিয়া বিজয়। পশ্চিমে লিবিয়া থেকে পূর্বে সিন্ধু নদ পর্যন্ত! মাত্র ১০ বছরে ২২ লক্ষ বর্গমাইল!",
      "**সাধারণ জীবন:** মাটির ঘরে বাস। রাতে ছদ্মবেশে জনগণের অবস্থা দেখতেন। একবার এক বিধবার জন্য নিজে পিঠে খাদ্য বহন করলেন। নিজে রান্না করে দিলেন। যব রুটি ও খেজুর খেতেন। ১২ জায়গায় ছেঁড়া গাউন পরতেন। বাইজেন্টাইন দূতরা তাকে গাছের নিচে ঘুমাতে দেখে বললেন: 'তুমি ন্যায়বিচার করেছ তাই নিরাপদে ঘুমাও।'",
      "**শাহাদাত:** ৬৪৪ সাল। পার্সিয়ান দাস পিরুজ ফজরের নামাযে উমরকে ৬ বার ছুরি দিয়ে আঘাত করল। উমর বললেন: 'নামায শেষ করো।' তিন দিন পর শহীদ হলেন। ৬ সদস্যের কমিটি গঠন করলেন: আবদুর রহমান, সাদ, তালহা, উসমান, আলী, যুবাইর। রাসূল ও আবু বকরের পাশে দাফন হলেন। ৭ নভেম্বর ৬৪৪। উসমান তৃতীয় খলিফা হলেন। উমরের খিলাফত: ১০ বছর। ন্যায়বিচার, সাম্য, দরিদ্র কল্যাণ। আমিরুল মুমিনীন। আশারায়ে মুবাশশারা।"
    ],
    "moral": "উমর (রাঃ)-এর জীবন প্রমাণ করে যে ন্যায়বিচার, দৃঢ়তা, সাধারণ জীবনযাপন এবং দরিদ্রদের প্রতি দয়া একজন শাসককে মহান করে তোলে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর"
  },
  {
    "id": "uthman_ibn_affan",
    "categoryId": "sahabider_jibon",
    "title": "উসমান ইবনে আফফান (রাঃ)",
    "paragraphs": [
      "হযরত উসমান (রাঃ)-এর পূর্ণ নাম হলো উসমান ইবনে আফফান ইবনে আবি আল-আস আল-কুরাইশী আল-উমাভী। তিনি ছিলেন ইসলামের তৃতীয় খলীফা, অতুলনীয় দানশীলতার প্রতীক। তাঁর উপাধি হলো যুন-নূরাইন (দুই নূরের অধিকারী), কারণ তিনি রাসূল (সাঃ)-এর দুজন কন্যা—রুকাইয়্যা (রাঃ) ও উম্মে কুলসুম (রাঃ)-কে বিবাহ করেছিলেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি ৫৭৬ খ্রিস্টাব্দে মক্কায় কুরাইশ গোত্রের বনু উমাইয়্যা শাখায় জন্মগ্রহণ করেন। তিনি প্রথম দিককার ইসলাম গ্রহণকারী এবং আবু বকর (রাঃ)-এর দাওয়াতে ইসলাম গ্রহণ করেন। উদারতা ও দান\n\nতিনি তাঁর জীবনে বহুবার তাঁর সমস্ত সম্পদ আল্লাহর রাস্তায় দান করেছেন। তিনি তাবুক যুদ্ধের সময় বিশাল আর্থিক সাহায্য দেন।",
      "গুরুত্বপূর্ণ অবদান\n\nতিনি মদীনার মুসলিমদের জন্য বীরে রুমা (রুমা কূপ) কিনে ওয়াকফ করেন। এছাড়াও তিনি মদীনার মসজিদের সম্প্রসারণের জন্য জমি কেনেন। খিলাফত লাভ\n\nহযরত উমর (রাঃ)-এর অসিয়ত অনুযায়ী গঠিত শুরা কমিটির মাধ্যমে তিনি তৃতীয় খলীফা নির্বাচিত হন। তাঁর খিলাফতের সময়কাল ছিল প্রায় বারো বছর (২৪-৩৫ হি.)।",
      "প্রধান প্রশাসনিক মিশন: কুরআন সংকলন ও প্রচার (মুসহাফ আল-উসমানী)\n\nতাঁর শাসনামলের সবচেয়ে বড় ও ঐতিহাসিক অবদান হলো একই পাঠে কুরআন সংকলন ও প্রচার। সাম্রাজ্য বিস্তারের ফলে বিভিন্ন অঞ্চলে কিরাআতের ভিন্নতা দেখা দিলে হুযাইফা ইবনুল ইয়ামান (রাঃ) তাঁকে এই বিষয়ে সতর্ক করেন। তিনি হযরত আবু বকর (রাঃ) কর্তৃক সংরক্ষিত কুরআনের মূল কপি হযরত হাফসা (রাঃ) থেকে নিয়ে একটি কমিটি গঠন করেন।\n\nএই কাজটি যায়েদ ইবনে সাবিত (রাঃ)-এর নেতৃত্বে গঠিত একটি কমিটির মাধ্যমে সম্পন্ন হয় এবং কুরআনের প্রামাণ্য অনুলিপিগুলো (মুসহাফ আল-উসমানী) প্রধান প্রধান প্রদেশে প্রেরণ করা হয়। সামরিক বিজয় ও নৌবাহিনী প্রতিষ্ঠা",
      "তাঁর শাসনামলে সাম্রাজ্য বিশালতা লাভ করে। তিনি প্রথম মুসলিম নৌবাহিনী প্রতিষ্ঠা করেন। এই নৌবাহিনী ইসলামের ইতিহাসে নতুন সামরিক শক্তি যোগ করে।\n\nএই নৌবাহিনীর মাধ্যমে ৬৪৯ খ্রিস্টাব্দে সাইপ্রাস ও রোডস দ্বীপ জয় করা হয়। পূর্বদিকের বিজয়: তাঁর নির্দেশে পারস্যের পূর্বে খোরাসান ও সিজিস্তান পর্যন্ত মুসলিম সাম্রাজ্য বিস্তার লাভ করে। উত্তর আফ্রিকার বিজয়: তাঁর আমলে উত্তর আফ্রিকার বিস্তীর্ণ অঞ্চল, বিশেষ করে ত্রিপোলি পর্যন্ত বিজয় সম্পন্ন হয়।",
      "প্রশাসনিক সংস্কার\n\nতিনি কেন্দ্রীয় প্রশাসনের বাইতুল মালের সুষ্ঠু ব্যবস্থাপনার জন্য বিশেষ মনোযোগ দেন এবং প্রশাসনিক দক্ষতা বাড়ানোর চেষ্টা করেন। অর্থনৈতিক উন্নয়ন\n\nসামরিক বিজয় ও বাণিজ্য বৃদ্ধির ফলে রাষ্ট্রের অর্থনৈতিক সমৃদ্ধি ঘটে। তিনি নতুন রাস্তা, সেতু এবং দুর্গ নির্মাণে মনোযোগ দেন।",
      "ফিতনা ও বিদ্রোহের সূচনা\n\nজীবনের শেষভাগে তাঁর বিরুদ্ধে ফিতনা শুরু হয়। বিদ্রোহীরা তাঁর নিয়োগকৃত কিছু গভর্নর এবং তাঁর আত্মীয়-স্বজনের প্রতি অভিযোগ তোলে। দীর্ঘ অবরোধ\n\n৩৫ হিজরিতে বিদ্রোহীরা মদীনায় তাঁর বাড়ি অবরোধ করে। তিনি পরিস্থিতি শান্ত করার জন্য যথাসাধ্য চেষ্টা করেন এবং রক্তপাত এড়াতে মুসলিমদের আত্মরক্ষার অনুমতি দেননি।",
      "শাহাদাত\n\nদীর্ঘ অবরোধের পর, ৩৫ হিজরির যুল-হাজ্জ মাসে কুরআন তিলাওয়াতরত অবস্থায় তাঁকে বিদ্রোহীরা আক্রমণ করে শহীদ করে। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী ইসলামের ইতিহাসে দানশীলতা, নম্রতা এবং চরম ধৈর্যের এক শ্রেষ্ঠ উদাহরণ।"
    ],
    "moral": "হযরত উসমান (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা চরম প্রতিকূলতা এবং ফিতনার মধ্যেও ধৈর্য এবং বিনয় বজায় রেখে আল্লাহর পথে দৃঢ় থাকতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "ali_ibn_abi_talib",
    "categoryId": "sahabider_jibon",
    "title": "আলী ইবনে আবী তালিব (রাঃ)",
    "paragraphs": [
      "হযরত আলী (রাঃ)-এর পূর্ণ নাম হলো আলী ইবনে আবী তালিব ইবনে আব্দুল মুত্তালিব।",
      "তিনি ছিলেন ইসলামের চতুর্থ খলীফা, রাসূল (সাঃ)-এর চাচাতো ভাই, জামাতা এবং শ্রেষ্ঠতম বীর।\n\nতাঁর উপাধি হলো আসাদুল্লাহ (আল্লাহর সিংহ) বা আল-হায়দার।\n\nএছাড়াও তিনি জ্ঞানের গভীরতার জন্য পরিচিত।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি রাসূল (সাঃ)-এর জন্মস্থান মক্কাতেই জন্মগ্রহণ করেন।\n\nতিনি ছিলেন বালকদের মধ্যে সর্বপ্রথম ইসলাম গ্রহণকারী।\n\nহিজরত ও আত্মত্যাগ\n\nহিজরতের রাতে তিনি রাসূল (সাঃ)-এর বিছানায় শুয়ে থেকে নিজের জীবনের ঝুঁকি নিয়ে কাফেরদের বিভ্রান্ত করেন।",
      "এই ঘটনা তাঁর সীমাহীন সাহসিকতা ও আত্মত্যাগের প্রমাণ।\n\nতিনি রাসূল (সাঃ)-এর আমানত মালিকদের ফেরত দিয়ে তিন দিন পর মদীনায় হিজরত করেন।\n\nবিবাহ ও পারিবারিক জীবন\n\nতিনি রাসূল (সাঃ)-এর প্রিয় কন্যা ফাতিমা (রাঃ)-কে বিবাহ করেন।",
      "তাঁদের দুই পুত্র হাসান (রাঃ) ও হুসাইন (রাঃ) ছিলেন রাসূল (সাঃ)-এর অত্যন্ত প্রিয়।\n\nরাসূল (সাঃ) বলেছেন, 'হাসান ও হুসাইন জান্নাতের যুবকদের সর্দার।\n\n'",
      "সামরিক বীরত্ব\n\nতিনি বদর, উহুদ, খন্দক, খায়বার, হুনাইন সহ প্রায় সকল যুদ্ধে অসাধারণ বীরত্ব প্রদর্শন করেন।\n\nখায়বার যুদ্ধে তিনি দুর্গের বিশাল দরজা উপড়ে ফেলেন এবং ইহুদি বীর মারহাবকে পরাজিত করেন।"
    ],
    "moral": "হযরত আলী (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা জ্ঞান, শক্তি ও সাহসিকতাকে ইসলামের পথে ব্যবহার করে চরম প্রতিকূলতার মধ্যেও ন্যায়ের ওপর অটল থাকতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "talha_ibn_ubaydullah",
    "categoryId": "sahabider_jibon",
    "title": "তালহা ইবনে উবাইদুল্লাহ (রাঃ)",
    "paragraphs": [
      "হযরত তালহা (রাঃ)-এর পূর্ণ নাম হলো তালহা ইবনে উবাইদুল্লাহ ইবনে উসমান ইবনে আমর আল-কুরাইশী আল-তাইয়্মী। তিনি ছিলেন আশারায়ে মুবাশশারাহ (জান্নাতের সুসংবাদপ্রাপ্ত ১০ জন)-এর অন্যতম। তাঁর উপাধি ছিল 'তালহাতুল খায়র' (কল্যাণের তালহা) বা 'আল-ফাইয়্যাদ' (অতি দানশীল)। রাসূল (সাঃ) তাঁকে উহুদের যুদ্ধের পর 'জীবন্ত শহীদ' বলে আখ্যায়িত করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কায় কুরাইশ গোত্রের বনু তাইম শাখায় জন্মগ্রহণ করেন। তিনি হযরত আবু বকর (রাঃ)-এর দাওয়াতে প্রথম দিকেই ইসলাম গ্রহণ করেন। নির্যাতন\n\nইসলাম গ্রহণের কারণে তিনি এবং তাঁর মা কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন। হিজরত ও সান্নিধ্য",
      "তিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন।\n\nসামরিক ভূমিকা: উহুদের যুদ্ধে আত্মত্যাগ\n\nউহুদের যুদ্ধে যখন মুসলিমদের বিপর্যয় ঘটে, তখন তিনি ছিলেন রাসূল (সাঃ)-এর পাশে থাকা কয়েকজন সাহাবীর মধ্যে অন্যতম। তিনি নিজের শরীর ঢাল হিসেবে ব্যবহার করে রাসূল (সাঃ)-কে কাফেরদের তীর থেকে রক্ষা করেন। তাঁর শরীরে প্রায় ৭০টিরও বেশি আঘাত লেগেছিল। এই যুদ্ধে তিনি চরম বীরত্ব প্রদর্শন করেন, যার কারণে রাসূল (সাঃ) তাঁর প্রতি সন্তুষ্ট হন।",
      "আশারায়ে মুবাশশারাহর সদস্য\n\nতিনি রাসূল (সাঃ)-এর জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত সেই দশজন সাহাবীর অন্যতম। উদারতা ও দানশীলতা\n\nতিনি ছিলেন একজন অত্যন্ত ধনী এবং দানশীল ব্যবসায়ী। তাঁর সম্পদের বেশিরভাগই আল্লাহর রাস্তায় ব্যয় করতেন। তাঁর বদান্যতার কারণে তাঁকে 'আল-ফাইয়্যাদ' উপাধি দেওয়া হয়। খিলাফতের ভূমিকা",
      "হযরত উমর (রাঃ)-এর ইন্তেকালের পর গঠিত শুরা কমিটির ছয়জন সদস্যের মধ্যে তিনি অন্যতম ছিলেন।\n\nউটের যুদ্ধ (ফিতনা)\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি এবং যুবাইর (রাঃ) হযরত আলী (রাঃ)-এর বিরুদ্ধে গঠিত দলে যোগ দেন। শাহাদাত",
      "উটের যুদ্ধের (জামাল যুদ্ধ) সময় তিনি ৩৬ হিজরিতে (৬৫৬ খ্রিস্টাব্দে) শহীদ হন। তাঁর ইন্তেকাল\n\nশহীদ হওয়ার আগে তিনি যুদ্ধের ময়দানেই অনুতপ্ত হন বলে বর্ণিত আছে। দাফন\n\nতাঁকে বসরা অঞ্চলে দাফন করা হয়।",
      "তাঁর মর্যাদা\n\nরাসূল (সাঃ) তাঁর শাহাদাতের উচ্চ মর্যাদা ঘোষণা করেছেন। তাঁর জীবনী\n\nতাঁর জীবনী ইসলামের ইতিহাসে অবিচল বিশ্বাস, চরম সাহসিকতা এবং আল্লাহ ও তাঁর রাসূল (সাঃ)-এর প্রতি ব্যক্তিগত আত্মত্যাগের এক বিরল উদাহরণ।"
    ],
    "moral": "হযরত তালহা (রাঃ)-এর জীবন প্রমাণ করে যে, চরম সাহসিকতা ও দানশীলতার মাধ্যমে একজন ব্যক্তি জান্নাতের সুসংবাদপ্রাপ্ত হতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "zubayr_ibn_al_awwam",
    "categoryId": "sahabider_jibon",
    "title": "যুবাইর ইবনুল আওয়াম (রাঃ)",
    "paragraphs": [
      "হযরত যুবাইর (রাঃ)-এর পূর্ণ নাম হলো যুবাইর ইবনে আল-আওয়াম ইবনে খুয়াইলিদ আল-কুরাইশী আল-আসাদী। তিনি ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং রাসূল (সাঃ)-এর হাওয়ারী (বিশেষ সাহায্যকারী)। তাঁর উপাধি ছিল 'আল-হাওয়ারী'। রাসূল (সাঃ) তাঁকে এই উপাধি দেন, যা তাঁর বিশেষ নৈকট্য প্রমাণ করে।",
      "জন্ম ও বংশ পরিচয়\n\nতিনি মক্কায় জন্মগ্রহণ করেন। তিনি ছিলেন রাসূল (সাঃ)-এর স্ত্রী খাদিজা (রাঃ)-এর ভাতিজা এবং রাসূল (সাঃ)-এর ফুপু সফিয়্যা বিনতে আব্দুল মুত্তালিব (রাঃ)-এর পুত্র। ইসলাম গ্রহণ\n\nতিনি মাত্র আট বছর বয়সে ইসলাম গ্রহণকারী প্রথম দিককার কয়েকজন সাহাবীর একজন। নির্যাতন",
      "ইসলাম গ্রহণের কারণে তিনিও কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন।\n\nহিজরত ও সান্নিধ্য\n\nতিনি তাঁর স্ত্রী আসমা বিনতে আবী বকর (রাঃ)-এর সাথে মদীনায় হিজরত করেন। সামরিক ভূমিকা",
      "তিনি বদর, উহুদ, খন্দক সহ প্রায় সকল যুদ্ধে অংশগ্রহণ করেন এবং ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ বীর। প্রথম মুসলিম হিসেবে তলোয়ার\n\nকথিত আছে, ইসলামের ইতিহাসে তিনিই প্রথম সাহাবী যিনি কাফেরদের বিরুদ্ধে তলোয়ার কোষমুক্ত করেছিলেন।\n\nআশারায়ে মুবাশশারাহর সদস্য",
      "তিনি রাসূল (সাঃ)-এর জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত সেই দশজন সাহাবীর অন্যতম। খিলাফতের ভূমিকা\n\nহযরত উমর (রাঃ)-এর ইন্তেকালের পর গঠিত শুরা কমিটির ছয়জন সদস্যের মধ্যে তিনিও ছিলেন একজন গুরুত্বপূর্ণ সদস্য। উটের যুদ্ধ (ফিতনা)\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি এবং তালহা (রাঃ) হযরত আলী (রাঃ)-এর বিরুদ্ধে গঠিত দলে যোগ দেন।",
      "বিবাদ নিরসন\n\nউটের যুদ্ধের আগে যখন হযরত আলী (রাঃ) তাঁকে রাসূল (সাঃ)-এর ভবিষ্যদ্বাণীর কথা স্মরণ করিয়ে দেন, তখন তিনি যুদ্ধ থেকে সরে আসেন। শাহাদাত\n\nতিনি যুদ্ধক্ষেত্র থেকে সরে আসার পর এক ব্যক্তি তাঁকে অনুসরণ করে অন্যায়ভাবে ৩৬ হিজরিতে (৬৫৬ খ্রিস্টাব্দে) শহীদ করে। তাঁর ইন্তেকাল",
      "শহীদ হওয়ার আগে তিনি যুদ্ধের ময়দান থেকে ফিরে আসছিলেন।\n\nতাঁর মর্যাদা\n\nরাসূল (সাঃ) তাঁকে 'আল-হাওয়ারী' উপাধি দিয়ে তাঁর প্রতি তাঁর বিশেষ স্নেহ ও নির্ভরতা প্রকাশ করেন। তাঁর জীবনী ইসলামের ইতিহাসে অবিচল বিশ্বাস, শ্রেষ্ঠ বীরত্ব এবং রাসূল (সাঃ)-এর প্রতি আনুগত্যের এক উজ্জ্বল উদাহরণ।"
    ],
    "moral": "হযরত যুবাইর (রাঃ)-এর জীবন প্রমাণ করে যে, একজন মুজাহিদ তাঁর বীরত্ব এবং রাসূল (সাঃ)-এর প্রতি আনুগত্যের মাধ্যমে সর্বকালে সম্মানিত হন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "ammar_ibn_yasir",
    "categoryId": "sahabider_jibon",
    "title": "আম্মার ইবনে ইয়াসির (রাঃ)",
    "paragraphs": [
      "হযরত আম্মার ইবনে ইয়াসির (রাঃ)-এর পূর্ণ নাম হলো আম্মার ইবনে ইয়াসির ইবনে আমির আল-আনাসী। তিনি ছিলেন ইসলামের প্রথম দিককার নির্যাতিত সাহাবীদের অন্যতম এবং শাহাদাতের জন্য বিখ্যাত। তাঁর উপাধি ছিল 'আবুল ইয়াকযান'। তিনি রাসূল (সাঃ)-এর কাছে অত্যন্ত প্রিয় ছিলেন এবং তাঁর সততা ও নিষ্ঠা ছিল সর্বজনস্বীকৃত।",
      "জন্ম ও বংশ পরিচয়\n\nতিনি মক্কায় জন্মগ্রহণ করেন। তাঁর পরিবার ইয়ামেন থেকে মক্কায় এসেছিল এবং কুরাইশ গোত্রের মিত্র ছিল, কিন্তু তারা ছিল দুর্বল ও রক্ষকহীন। ইসলাম গ্রহণ\n\nতিনি ছিলেন ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। তিনি প্রায় ১১ জনের পরে ইসলাম গ্রহণ করেন।",
      "নির্যাতন\n\nতাঁর পুরো পরিবার—আম্মার (রাঃ), তাঁর পিতা ইয়াসির (রাঃ) এবং তাঁর মা সুমাইয়্যা (রাঃ) কুরাইশদের হাতে অকথ্য নির্যাতনের শিকার হন। তাঁদেরকে মক্কার গরম বালিতে দিনের পর দিন নির্যাতন করা হতো। শাহাদাতের মর্যাদা\n\nতাঁর মা সুমাইয়্যা (রাঃ) ছিলেন ইসলামের প্রথম শহীদ, যাঁকে আবু জাহল নির্মমভাবে হত্যা করে। তাঁর পিতা ইয়াসির (রাঃ)-ও নির্যাতনে শহীদ হন।",
      "রাসূল (সাঃ)-এর সান্ত্বনা\n\nরাসূল (সাঃ) তাঁদের নির্যাতন সহ্য করতে দেখে বলেছিলেন: 'ধৈর্য ধারণ করো, হে ইয়াসিরের পরিবার, তোমাদের জন্য জান্নাতের ওয়াদা দেওয়া হলো।' আম্মারের পরীক্ষা ও মুক্তি\n\nআম্মার (রাঃ)-কে চরম নির্যাতনের মুখে রাসূল (সাঃ) ও ইসলামকে অস্বীকার করতে বাধ্য করা হয়েছিল। যদিও তিনি বাহ্যিকভাবে তা করেছিলেন, কিন্তু তাঁর হৃদয়ে ঈমান অটুট ছিল।",
      "আল্লাহর ক্ষমা\n\nআম্মার (রাঃ) আল্লাহর কাছে ক্ষমা প্রার্থনা করলে, আল্লাহ তা'আলা ওহী নাযিল করে তাঁর জন্য ক্ষমা ঘোষণা করেন (সূরা নাহল, ১৬:১০৬), যেখানে চরম পরিস্থিতিতে বাধ্য হয়ে কুফরী কথা বলার বৈধতা দেওয়া হয়। হিজরত ও মদীনার জীবন\n\nতিনি মদীনায় হিজরত করেন এবং প্রথম মসজিদ, মসজিদে নববী নির্মাণের কাজে সক্রিয়ভাবে অংশগ্রহণ করেন।",
      "নির্মাণ কাজে ভূমিকা\n\nমসজিদে নববী নির্মাণের সময় তাঁকে দ্বিগুণ ভার বহন করতে দেখা যায়। রাসূল (সাঃ) তাঁর মাথায় লেগে থাকা ধুলো ঝেড়ে দেন এবং তাঁর প্রতি বিশেষ স্নেহ প্রকাশ করেন। সামরিক ভূমিকা\n\nতিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল যুদ্ধে অংশগ্রহণ করেন এবং তাঁর বীরত্ব ও নিষ্ঠা ছিল অতুলনীয়। জ্ঞানের মর্যাদা",
      "হযরত উমর (রাঃ) তাঁকে কুফার গভর্নর নিযুক্ত করেন। তিনি ফিকহ ও জ্ঞান বিতরণেও অবদান রাখেন।\n\nআলী (রাঃ)-এর পক্ষে\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি হযরত আলী (রাঃ)-এর পক্ষ অবলম্বন করেন। শাহাদাতের ভবিষ্যদ্বাণী",
      "রাসূল (সাঃ) তাঁর সম্পর্কে ভবিষ্যদ্বাণী করেছিলেন: 'আফসোসের বিষয় আম্মারের জন্য! তোমাকে একটি বিদ্রোহী দল হত্যা করবে। তুমি তাদের জান্নাতের দিকে আহ্বান করবে, আর তারা তোমাকে জাহান্নামের দিকে আহ্বান করবে।'\n\nশাহাদাত\n\n৩৭ হিজরিতে (৬৫৮ খ্রিস্টাব্দে) সিফফিনের যুদ্ধে তিনি মুয়াবিয়া (রাঃ)-এর পক্ষের বিদ্রোহী দলের হাতে শহীদ হন। ভবিষ্যদ্বাণীর প্রমাণ"
    ],
    "moral": "হযরত আম্মার (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে চরম নিপীড়ন ও নির্যাতনের মুখেও ঈমানের ওপর অটল থাকলেই জান্নাতের ওয়াদা পূরণ হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "khalid_ibn_al_walid",
    "categoryId": "sahabider_jibon",
    "title": "খালিদ ইবনে ওয়ালিদ (রাঃ)",
    "paragraphs": [
      "হযরত খালিদ ইবনে ওয়ালিদ (রাঃ)-এর পূর্ণ নাম হলো খালিদ ইবনে আল-ওয়ালিদ ইবনে আল-মুগীরাহ আল-মাখযুমী। তিনি ছিলেন ইসলামের ইতিহাসের সর্বকালের শ্রেষ্ঠ সামরিক কমান্ডার এবং রণকৌশলের এক উজ্জ্বল নক্ষত্র। তাঁর উপাধি হলো 'সাইফুল্লাহ' (আল্লাহর তরবারি), যা রাসূল (সাঃ) মুতার যুদ্ধে তাঁর বীরত্ব দেখে প্রদান করেন।",
      "জন্ম ও বংশ পরিচয়\n\nতিনি মক্কার কুরাইশ গোত্রের বনু মাখযুম শাখায় জন্মগ্রহণ করেন। এটি ছিল কুরাইশদের মধ্যে অন্যতম সামরিক ও অভিজাত শাখা। ইসলাম গ্রহণের পূর্বে\n\nইসলাম গ্রহণের আগে তিনি ছিলেন ইসলামের ঘোর শত্রু এবং একজন অত্যন্ত দক্ষ কুরাইশ সেনাপতি। উহুদের যুদ্ধে তাঁর সামরিক কৌশলের কারণেই মুসলিমরা প্রাথমিকভাবে পরাজিত হয়েছিল।",
      "ইসলাম গ্রহণ\n\nতিনি হিজরতের অষ্টম বছর, মক্কা বিজয়ের মাত্র কিছুদিন আগে ইসলাম গ্রহণ করেন। তাঁর ইসলাম গ্রহণ ছিল মুসলিমদের জন্য এক বিশাল সামরিক শক্তি অর্জন। সামরিক ভূমিকা\n\nইসলাম গ্রহণের পর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন এবং তাঁর সামরিক প্রজ্ঞা ছিল অতুলনীয়। তিনি কখনো কোনো যুদ্ধে পরাজিত হননি।",
      "মুতার যুদ্ধ (সামরিক মিশন)\n\nতিনি মুতার যুদ্ধে (৮ হি.) সেনাপতির দায়িত্ব নেন। এই যুদ্ধে রোমান বাহিনীর বিশালতা সত্ত্বেও তিনি অসাধারণ সামরিক কৌশলের মাধ্যমে মুসলিম বাহিনীকে রক্তপাত এড়িয়ে রক্ষা করেন। তাঁর কৌশল\n\nমুতার যুদ্ধে তিনি এমনভাবে সৈন্য বিন্যাস পরিবর্তন করেছিলেন যে রোমানরা ভেবেছিল মুসলিমদের জন্য নতুন সাহায্যকারী বাহিনী এসে গেছে, যা রোমানদের পিছু হটতে বাধ্য করে।",
      "সাইফুল্লাহ উপাধি\n\nমুতার যুদ্ধে তাঁর বীরত্ব ও সামরিক নৈপুণ্যের কারণে রাসূল (সাঃ) তাঁকে 'সাইফুল্লাহ' (আল্লাহর তরবারি) উপাধি দেন। রিদ্দা যুদ্ধ\n\nহযরত আবু বকর (রাঃ)-এর খিলাফতকালে তিনি রিদ্দা যুদ্ধে মুসলিম বাহিনীর প্রধান সেনাপতি ছিলেন এবং তাঁর সামরিক নেতৃত্বে মুসাইলামা আল-কাযযাবের বিশাল বাহিনী পরাজিত হয়।",
      "পারস্য ও রোমান অভিযান\n\nতিনি পারস্য সাম্রাজ্যের বিরুদ্ধে পরিচালিত 'চেইনসের যুদ্ধ' সহ অনেক দ্রুত বিজয়ের নেতৃত্ব দেন। এরপর তিনি ইরাক থেকে সিরিয়াতে এসে রোমানদের বিরুদ্ধে অভিযান শুরু করেন। ইয়ারমুকের যুদ্ধ (সামরিক মিশন)\n\nহযরত উমর (রাঃ)-এর খিলাফতকালে তিনি ইয়ারমুকের যুদ্ধে (৬৩৬ খ্রি.) রোমানদের বিরুদ্ধে মুসলিম বাহিনীর সামরিক নেতৃত্ব দেন এবং রোমানদের পরাজিত করে সিরিয়া বিজয় সম্পন্ন করেন।",
      "সেনাপতির পদচ্যুতি\n\nহযরত উমর (রাঃ) তাঁর সামরিক প্রজ্ঞাকে প্রশ্নবিদ্ধ না করলেও, মুসলিমদেরকে কেবল আল্লাহর উপর নির্ভর করতে শেখানোর জন্য তাঁকে সেনাপতির পদ থেকে সরিয়ে দেন। খালিদ (রাঃ)-এর প্রতিক্রিয়া\n\nপদচ্যুত হওয়ার পরও তিনি সামান্যতমও আপত্তি করেননি। তিনি বলেছিলেন: 'আমি উমরের জন্য যুদ্ধ করি না, আমি আল্লাহর জন্য যুদ্ধ করি।'",
      "জ্ঞানের মর্যাদা\n\nসামরিক কমান্ডার হওয়া সত্ত্বেও তিনি রাসূল (সাঃ)-এর হাদিস সম্পর্কে সচেতন ছিলেন এবং ফিকহী জ্ঞান রাখতেন। মৃত্যু ও শেষ জীবন\n\nতিনি তাঁর জীবনের শেষ দিনগুলো হোম্স (সিরিয়া) শহরে কাটান। তিনি ২১ হিজরিতে (৬৪২ খ্রিস্টাব্দে) ইন্তেকাল করেন।"
    ],
    "moral": "হযরত খালিদ ইবনে ওয়ালিদ (রাঃ)-এর জীবন প্রমাণ করে যে, একজন শ্রেষ্ঠ সামরিক কমান্ডার তাঁর জীবনের সমস্ত দক্ষতা ব্যক্তিগত খ্যাতি নয়, বরং আল্লাহর পথে উৎসর্গ করতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "sahabi_id": "abu_ubaydah_ibn_al_jarrah",
    "title": "আবু উবাইদাহ ইবনুল জাররাহ (রাঃ)",
    "paragraphs": [
      "হযরত আবু উবাইদাহ (রাঃ)-এর পূর্ণ নাম হলো আমের ইবনে আব্দুল্লাহ ইবনে আল-জাররাহ আল-ফিহরী আল-কুরাইশী। তিনি ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং ইসলামের একজন শ্রেষ্ঠ সেনাপতি। তাঁর উপাধি ছিল 'আমীনুল উম্মাহ' (উম্মতের আমানতদার), যা রাসূল (সাঃ) তাঁকে প্রদান করেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় কুরাইশ গোত্রের বনু ফিহর শাখায় জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিকের ইসলাম গ্রহণকারী।\n\nনির্যাতন\n\nইসলাম গ্রহণের কারণে তিনিও কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন। হিজরত ও সান্নিধ্য",
      "তিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন। সামরিক ভূমিকা: উহুদ যুদ্ধ\n\nউহুদের যুদ্ধে তিনি চরম বীরত্ব প্রদর্শন করেন। যখন রাসূল (সাঃ)-এর চেহারা মুবারকে লৌহবর্মের দুটি কড়া ঢুকে গিয়েছিল, তখন আবু উবাইদাহ (রাঃ) নিজের দাঁত দিয়ে সেগুলো টেনে বের করেন।\n\nএই সময় তিনি নিজের দুটি দাঁত হারান, যা তাঁর গভীর ভালোবাসা ও আত্মত্যাগের প্রমাণ। আমীনুল উম্মাহ উপাধি",
      "নবী (সাঃ) একবার নাজরানের খ্রিস্টানদের প্রতিনিধি দলকে তাঁর সম্পর্কে বলেন: 'আমি তোমাদের এমন একজনকে পাঠাব, যিনি আমানতদারিতে অতুলনীয়।' পরে তিনি আবু উবাইদাহ (রাঃ)-কে প্রেরণ করেন এবং তাঁকে আমীনুল উম্মাহ উপাধি দেন।\n\nখিলাফতের ভূমিকা\n\nহযরত আবু বকর (রাঃ) এবং উমর (রাঃ)-এর খিলাফতকালে তিনি সিরিয়ার মুসলিম বাহিনীর প্রধান সেনাপতি ছিলেন। সামরিক বিজয়: সিরিয়া বিজয়",
      "তিনি রোমানদের বিরুদ্ধে পরিচালিত যুদ্ধে নেতৃত্ব দেন এবং সিরিয়ার বিস্তীর্ণ অঞ্চল, বিশেষ করে দামেস্ক, জর্দান এবং ফিলিস্তিন বিজয় সম্পন্ন করেন।\n\nইয়ারমুকের যুদ্ধ\n\nইয়ারমুকের যুদ্ধের আগে হযরত উমর (রাঃ) খালিদ ইবনে ওয়ালিদ (রাঃ)-এর বদলে তাঁকে প্রধান সেনাপতির দায়িত্ব দেন। তিনি অত্যন্ত বিনয়ের সাথে সেই দায়িত্ব গ্রহণ করেন। পদমর্যাদা",
      "তিনি সামরিক কমান্ডার হিসেবে তাঁর প্রজ্ঞা ও দক্ষতার জন্য সুপরিচিত ছিলেন। ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন অত্যন্ত বিনয়ী, দুনিয়াবিমুখ এবং কঠোরভাবে আল্লাহর তাকওয়াবান। তিনি তাঁর সৈন্যদের সাথে মিশে থাকতেন।\n\nমৃত্যু",
      "১৮ হিজরিতে (৬৩৯ খ্রিস্টাব্দে) সিরিয়ায় আমওয়াস (Amwas) মহামারীতে তিনি আক্রান্ত হন। নেতৃত্ব\n\nমহামারীর সময় তিনি মুসলিম সৈন্যদের সুস্থতা নিশ্চিত করতে সর্বোচ্চ চেষ্টা করেন। শাহাদাত\n\nএই মহামারীতেই তিনি ইন্তেকাল করেন। তাঁকে জর্ডানের কাছে দাফন করা হয়। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে শ্রেষ্ঠ আমানতদারী, বিনয় এবং রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসার এক আদর্শ উদাহরণ।"
    ],
    "moral": "হযরত আবু উবাইদাহ (রাঃ)-এর জীবন প্রমাণ করে যে, একজন নেতা বিনয়, আমানতদারী এবং ব্যক্তিগত ত্যাগের মাধ্যমে উম্মতের ভালোবাসা ও আস্থা অর্জন করতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "abu_ubaidah_ibn_al_jarrah"
  },
  {
    "sahabi_id": "abdullah_ibn_masud",
    "title": "আব্দুল্লাহ ইবনে মাসউদ (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে মাসউদ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুর রহমান আব্দুল্লাহ ইবনে মাসউদ ইবনে গাফিল আল-হুযালী। তিনি ছিলেন ইসলামের ইতিহাসের প্রথম দিকের অন্যতম শ্রেষ্ঠ কুরআন পাঠক ও ফকীহ সাহাবী। তাঁর উপাধি ছিল 'আব্দুল্লাহ'। তাঁকে 'সাহাবীদের মধ্যে ফিকহের ইমাম' বলা হতো। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় জন্মগ্রহণ করেন। তিনি ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী এবং ইসলাম গ্রহণকারী ষষ্ঠ ব্যক্তি।\n\nপ্রথম তেলাওয়াত\n\nতিনি মক্কার কাফেরদের সামনে প্রকাশ্যে প্রথম কুরআন তেলাওয়াত করা সাহাবী। এর জন্য তিনি কাফেরদের হাতে মার খেয়েছিলেন। কুরআনের শ্রেষ্ঠ পাঠক",
      "রাসূল (সাঃ) তাঁর তেলাওয়াতের প্রশংসা করতেন। রাসূল (সাঃ) বলেছিলেন: 'যে ব্যক্তি কুরআনকে ঠিক যেভাবে নাযিল হয়েছে, সেভাবে পড়তে চায়, সে যেন ইবনে উম্মে আবদ (আব্দুল্লাহ ইবনে মাসউদ)-এর কিরাআতে পড়ে।'\n\nইলমের উৎস\n\nতিনি সরাসরি রাসূল (সাঃ)-এর কাছ থেকে ৭০টিরও বেশি সূরা শিখেছিলেন। তিনি রাসূল (সাঃ)-এর জুতো ও মিসওয়াক বহন করতেন। জ্ঞানের মর্যাদা",
      "হযরত উমর (রাঃ) তাঁর জ্ঞানের গভীরতার কারণে তাঁকে অত্যন্ত শ্রদ্ধা করতেন। ফতোয়া\n\nতিনি ফিকহী মাসআলায় অত্যন্ত গভীর জ্ঞান রাখতেন। তাঁর ফতোয়াগুলোই পরবর্তীতে হানাফি ফিকহের ভিত্তির অন্যতম উৎস হিসেবে কাজ করেছে।\n\nকুফার শিক্ষক",
      "হযরত উমর (রাঃ) তাঁকে কুফায় শিক্ষক ও কাজীর (বিচারক) দায়িত্ব দিয়ে প্রেরণ করেন। সেখানে তিনি হাজার হাজার ছাত্র তৈরি করেন, যাঁরা পরবর্তীতে কুফার ফিকহী ধারাকে সমৃদ্ধ করেন। প্রশাসনিক ভূমিকা (শিক্ষক)\n\nকুফায় তাঁর শিক্ষকতা ছিল একটি গুরুত্বপূর্ণ প্রশাসনিক মিশন। তিনি তাঁর ছাত্রদের হাদিসের সনদ এবং ফিকহের জ্ঞান প্রদান করেন।\n\nসামরিক ভূমিকা",
      "তিনি বদর, উহুদ সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। বদরের যুদ্ধে অবদান\n\nবদরের যুদ্ধের পর তিনি আবু জাহলকে হত্যা করেন এবং তার মাথা নিয়ে আসেন। ব্যক্তিগত চরিত্র\n\nতিনি ছিলেন খুবই বিনয়ী এবং দুনিয়াবিমুখ (যাহিদ)। তাঁর ছাত্ররা",
      "তাঁর ছাত্রদের মধ্যে অন্যতম: আলকামা ইবনে কায়স এবং মাসরুক ইবনে আল-আজদা', যারা ইরাকের ফিকহের ভিত্তিস্থাপন করেন।\n\nহাদিস বর্ণনায় সতর্কতা\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন, যাতে রাসূল (সাঃ)-এর কোনো কথা ভুলভাবে বর্ণিত না হয়। খিলাফতের ভূমিকা",
      "তিনি হযরত উসমান (রাঃ)-এর খিলাফতকাল পর্যন্ত জীবিত ছিলেন। মৃত্যু\n\nতিনি ৩২ বা ৩৩ হিজরিতে (৬৫৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে মাসউদ (রাঃ)-এর জীবন প্রমাণ করে যে, প্রকৃত মর্যাদা শারীরিক শক্তি বা সম্পদ দ্বারা আসে না, বরং কুরআন ও সুন্নাহর গভীর জ্ঞানের মাধ্যমে অর্জিত হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা",
    "id": "abdullah_ibn_masud"
  },
  {
    "sahabi_id": "muadh_ibn_jabal",
    "title": "মুয়াজ ইবনে জাবাল (রাঃ)",
    "paragraphs": [
      "হযরত মুয়াজ ইবনে জাবাল (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুর রহমান মুয়াজ ইবনে জাবাল ইবনে আমর আল-খাযরাজী আল-আনসারী।",
      "তিনি ছিলেন ইসলামের অন্যতম শ্রেষ্ঠ ফকীহ ও মুয়াল্লিম (শিক্ষক)।\n\nতাঁর উপাধি ছিল আবু আব্দুর রহমান।\n\nরাসূল (সাঃ) তাঁকে 'হালাল-হারাম সম্পর্কে সবচেয়ে জ্ঞানী' সাহাবী হিসেবে প্রশংসা করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন। প্রাথমিক জীবন\n\nতিনি মদীনায় ইসলাম গ্রহণের পর রাসূল (সাঃ)-এর ঘনিষ্ঠ সাহাবীদের মধ্যে স্থান পান। সামরিক ভূমিকা",
      "তিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন।\n\nপ্রশাসনিক মিশন: ইয়ামেনের গভর্নর\n\nরাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ইয়ামেনের শিক্ষক ও গভর্নর হিসেবে প্রেরণ করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন। ফতোয়ার পদ্ধতি",
      "ইয়ামেনে যাওয়ার সময় রাসূল (সাঃ) তাঁকে জিজ্ঞেস করেন: 'তুমি কীভাবে ফায়সালা করবে?' তিনি বলেন: 'প্রথমে আল্লাহর কিতাব দিয়ে, এরপর আপনার সুন্নাহ দিয়ে, এরপর ইজতিহাদ (নিজের যুক্তি) দিয়ে।\n\n' রাসূল (সাঃ) তাঁর এই জবাবে সন্তুষ্ট হন।\n\nএই ঘটনা ফিকহের উসূল (মূলনীতি)-এর ভিত্তি স্থাপন করে। জ্ঞানের মর্যাদা",
      "রাসূল (সাঃ) তাঁকে খুব ভালোবাসতেন এবং বলেছিলেন: 'মুয়াজ হলেন কিয়ামতের দিন আলেমদের অগ্রভাগে থাকবেন।' তিনি ছিলেন হাদিস ও ফিকহের গভীর জ্ঞানের অধিকারী। হাদিস বর্ণনায় সতর্কতা\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্ক ছিলেন। মৃত্যু"
    ],
    "moral": "হযরত মুয়াজ ইবনে জাবাল (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানের গভীরতা এবং আল্লাহর পথে তার ব্যবহার একজন মানুষকে শ্রেষ্ঠতম আলেম ও পথপ্রদর্শক বানাতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "muadh_ibn_jabal"
  },
  {
    "id": "abu_hurairah",
    "categoryId": "sahabider_jibon",
    "title": "আবু হুরাইরা (রাঃ)",
    "paragraphs": [
      "হযরত আবু হুরাইরা (রাঃ)-এর পূর্ণ নাম হলো আব্দুর রহমান ইবনে সখর আল-দাওসী। তিনি ছিলেন ইসলামের ইতিহাসে সর্বাধিক হাদিস বর্ণনাকারী সাহাবী। তাঁর উপাধি 'আবু হুরাইরা' (বিড়ালের পিতা) নামে তিনি বেশি পরিচিত ছিলেন। এই উপাধিটি তিনি একটি ছোট বিড়াল লালন-পালন করার কারণে রাসূল (সাঃ)-এর কাছ থেকে পেয়েছিলেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কার দাওস গোত্রে জন্মগ্রহণ করেন। তিনি হিজরতের সপ্তম বছর, খায়বারের যুদ্ধের সময় ইসলাম গ্রহণ করেন। হিজরত ও মদীনার জীবন\n\nইসলাম গ্রহণের পর তিনি মদীনায় হিজরত করেন এবং মসজিদে নববীর আসহাবে সুফফার (মসজিদের চত্বরে অবস্থানকারী দরিদ্র ছাত্র) অন্তর্ভুক্ত হন।",
      "জ্ঞানের প্রতি আগ্রহ\n\nতাঁর প্রধান লক্ষ্য ছিল জ্ঞানার্জন। তিনি রাসূল (সাঃ)-এর সান্নিধ্য লাভের জন্য তাঁর সমস্ত মনোযোগ উৎসর্গ করেন। অন্যান্য সাহাবীর চেয়ে বেশি হাদিস বর্ণনা\n\nতিনি নিজেই বলতেন, অন্য সাহাবীরা যখন ব্যবসা ও কৃষি নিয়ে ব্যস্ত থাকতেন, তখন তিনি সব ছেড়ে দিয়ে রাসূল (সাঃ)-এর সাথে লেগে থাকতেন।",
      "হাদিস বর্ণনার সংখ্যা\n\nতাঁর মাধ্যমে ৫,৩৭৪টি হাদিস বর্ণিত হয়েছে। এই বিশাল সংখ্যক হাদিসের কারণে তিনি হাদিসশাস্ত্রের জন্য এক অমূল্য ভান্ডার রেখে গেছেন। রাসূল (সাঃ)-এর দু'আ\n\nএকবার তিনি ভুলে যাওয়ার অভিযোগ করলে রাসূল (সাঃ) তাঁর কাপড়ের আঁচল বিছিয়ে দিতে বলেন এবং রাসূল (সাঃ) তাঁর দু'আর মাধ্যমে তাঁর জন্য অসামান্য স্মৃতিশক্তির জন্য দু'আ করেন। এই দু'আর ফলস্বরূপ, তিনি কখনোই কোনো হাদিস ভুলে যাননি।",
      "রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি মাত্র চার বছর রাসূল (সাঃ)-এর সান্নিধ্যে ছিলেন, কিন্তু এই স্বল্প সময়ে তিনি অন্য সকলের চেয়ে বেশি জ্ঞান লাভ করেন। সামরিক ভূমিকা\n\nতিনি খায়বারের যুদ্ধসহ রাসূল (সাঃ)-এর জীবদ্দশায় অনুষ্ঠিত কিছু সামরিক অভিযানে অংশগ্রহণ করেন। জ্ঞান বিতরণ",
      "তিনি রাসূল (সাঃ)-এর ইন্তেকালের পর তাঁর জীবনের বেশিরভাগ সময় মদীনা ও অন্যান্য অঞ্চলে হাদিস বিতরণে ব্যয় করেন।\n\nজ্ঞানের মর্যাদা\n\nহযরত উমর (রাঃ) সহ অন্যান্য সাহাবী তাঁর হাদিস সংরক্ষণের গুরুত্ব বুঝতে পেরে তাঁকে অত্যন্ত শ্রদ্ধা করতেন। তিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন। প্রশাসনিক ভূমিকা",
      "তিনি খিলাফতে রাশিদার সময়কালে বাহরাইনের গভর্নর হিসেবে এবং মদীনার ডেপুটি গভর্নর হিসেবে দায়িত্ব পালন করেন। তিনি তাঁর শাসনকালে জনগণের মধ্যে ন্যায়বিচার প্রতিষ্ঠার চেষ্টা করেন।\n\nমৃত্যু ও শেষ জীবন\n\nতিনি তাঁর জীবনের শেষ ভাগে মদীনায় ফিরে আসেন এবং ইবাদতে মনোনিবেশ করেন। তিনি ৫৯ হিজরিতে (৬৭৯ খ্রিস্টাব্দে) মদীনার কাছে আল-আকীক নামক স্থানে ইন্তেকাল করেন। দাফন",
      "তাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী\n\nতাঁর জীবনী জ্ঞানার্জনের প্রতি নিরবচ্ছিন্ন নিষ্ঠা এবং আল্লাহর প্রতি গভীর ভালোবাসার এক আদর্শ উদাহরণ।\n\nতিনি হাদিসশাস্ত্রের ভিত্তি স্থাপনে মৌলিক অবদান রাখেন। তাঁর সংকলিত হাদিসগুলো মুসলিম উম্মাহর জন্য চিরন্তন সম্পদ।"
    ],
    "moral": "হযরত আবু হুরাইরা (রাঃ)-এর জীবন প্রমাণ করে যে, জীবনের সমস্ত ভোগ-বিলাস ত্যাগ করে শুধু রাসূল (সাঃ)-এর সুন্নাহ সংরক্ষণে আত্মনিবেদন করলে আল্লাহ সর্বোচ্চ মর্যাদা দান করেন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abdullah_ibn_abbas",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে আব্বাস (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে আব্বাস (রাঃ)-এর পূর্ণ নাম হলো আবু আল-আব্বাস আব্দুল্লাহ ইবনে আল-আব্বাস ইবনে আব্দুল মুত্তালিব আল-হাশিমি। তিনি ছিলেন রাসূল (সাঃ)-এর চাচাতো ভাই এবং কুরআনের ব্যাখ্যার ক্ষেত্রে শ্রেষ্ঠতম সাহাবী। তাঁর উপাধি ছিল 'আল-হিব্রু আল-উম্মাহ' (উম্মতের পণ্ডিত) এবং 'মুফাসসিরুল কুরআন' (কুরআনের ব্যাখ্যাকার)।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি হিজরতের তিন বছর আগে মক্কায় জন্মগ্রহণ করেন। তাঁর বয়স যখন ১৩ বছর, তখন মক্কা বিজয়ের আগে তিনি তাঁর পিতার সাথে ইসলাম গ্রহণ করেন। জ্ঞানের প্রতি আগ্রহ\n\nতিনি তাঁর শৈশব থেকেই জ্ঞানের প্রতি গভীর আগ্রহ দেখান। রাসূল (সাঃ)-এর ইন্তেকালের সময় তাঁর বয়স ছিল মাত্র ১৩ বছর।",
      "রাসূল (সাঃ)-এর দু'আ\n\nরাসূল (সাঃ) তাঁর জন্য বিশেষভাবে দু'আ করেছিলেন: 'হে আল্লাহ! তাকে দ্বীনের জ্ঞান দান করো এবং কুরআনের ব্যাখ্যা শিক্ষা দাও।' রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি রাসূল (সাঃ)-এর জীবনের শেষ তিন বছর তাঁর সান্নিধ্যে ছিলেন এবং এই অল্প সময়েই রাসূল (সাঃ)-এর কাছ থেকে গভীর জ্ঞান লাভ করেন।",
      "হাদিস সংগ্রহ\n\nরাসূল (সাঃ)-এর ইন্তেকালের পর তিনি অন্যান্য সাহাবীদের কাছ থেকে জ্ঞান অর্জনের জন্য কঠোর পরিশ্রম করেন। তিনি জ্ঞান লাভের জন্য অনেক সাহাবীর দরজায় অপেক্ষা করতেন। ফিকহ ও তাফসীর\n\nতিনি ছিলেন তাঁর যুগের শ্রেষ্ঠ মুফাসসির এবং ফকীহ। তাঁর তাফসীরের পদ্ধতি ছিল হাদিস, সাহাবীদের বক্তব্য এবং আরবি ভাষার গভীর জ্ঞানের ওপর নির্ভরশীল।",
      "তাঁর তাফসীর\n\nতিনি কুরআনের প্রতিটি আয়াতের শাব্দিক অর্থ, ঐতিহাসিক প্রেক্ষাপট এবং ফিকহী সিদ্ধান্ত ব্যাখ্যা করতেন। ইজতিহাদ\n\nহযরত উমর (রাঃ) তাঁর প্রখর মেধার কারণে অল্প বয়সেও তাঁকে বড় বড় সাহাবীদের মজলিসে অংশগ্রহণের সুযোগ দিতেন। সামরিক ভূমিকা",
      "তিনি রাসূল (সাঃ)-এর শেষ জীবনের কিছু অভিযানে অংশগ্রহণ করেন। খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা হিসেবে ভূমিকা রাখেন।\n\nহযরত আলী (রাঃ)-এর খিলাফতকালে তিনি বসরার গভর্নর হিসেবে দায়িত্ব পালন করেন। রাজনৈতিক পরীক্ষা",
      "তিনি সিফফিনের যুদ্ধের পর খারিজিদের সাথে বিতর্কে অংশগ্রহণ করেন এবং তাঁর যুক্তি দিয়ে হাজার হাজার খারিজিকে তাদের ভুল থেকে ফিরিয়ে আনেন। জ্ঞান বিতরণ\n\nতিনি জীবনের শেষভাগে মক্কা ও তায়েফে বসবাস করে হাজার হাজার ছাত্রকে হাদিস, তাফসীর ও ফিকহের জ্ঞান দান করেন।\n\nতাঁর ছাত্ররা",
      "তাঁর ছাত্রদের মধ্যে অন্যতম: মুজাহিদ, ইকরিমা এবং সাঈদ ইবনে জুবাইর, যারা পরবর্তীতে তাফসীর ও ফিকহের ক্ষেত্রে ইমাম হিসেবে পরিচিত হন। মৃত্যু\n\nতিনি ৬৮ হিজরিতে (৬৮৭ খ্রিস্টাব্দে) তায়েফ শহরে ইন্তেকাল করেন। দাফন\n\nতাঁকে তায়েফেই দাফন করা হয়। তাঁর জীবনী"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে আব্বাস (রাঃ)-এর জীবন প্রমাণ করে যে, রাসূল (সাঃ)-এর দোয়ার ফলস্বরূপ জ্ঞান লাভের মাধ্যমে অল্প বয়সেই উম্মতের সর্বোচ্চ পণ্ডিত হওয়া সম্ভব।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "sahabi_id": "fatimah_bint_muhammad",
    "title": "ফাতিমা বিনতে মুহাম্মদ (রাঃ)",
    "paragraphs": [
      "হযরত ফাতিমা (রাঃ)-এর পূর্ণ নাম হলো ফাতিমা বিনতে মুহাম্মদ ইবনে আব্দুল্লাহ ইবনে আব্দুল মুত্তালিব। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর প্রিয়তম কন্যা এবং জান্নাতের নারীদের সর্দার। তাঁর উপাধি ছিল 'যাহরা' (উজ্জ্বল), 'বাতূল' (পবিত্র) এবং 'সাইয়্যিদাতু নিসা-ইল জান্নাহ' (জান্নাতের নারীদের সর্দার)। জন্ম ও বংশ পরিচয়",
      "তিনি মক্কায় রাসূল (সাঃ)-এর নবুয়ত লাভের প্রায় পাঁচ বছর আগে জন্মগ্রহণ করেন।\n\nশৈশব ও ইসলাম গ্রহণ\n\nতিনি তাঁর শৈশবেই ইসলাম গ্রহণ করেন এবং তাঁর মায়ের (খাদিজা রাঃ) ইন্তেকালের পর রাসূল (সাঃ)-এর সবচেয়ে ঘনিষ্ঠ সহচর ছিলেন। মক্কী জীবন",
      "মক্কায় যখন রাসূল (সাঃ) নির্যাতিত হতেন, তখন তিনি পিতার পাশে দাঁড়াতেন এবং তাঁকে সান্ত্বনা দিতেন। হিজরত ও মদীনার জীবন\n\nতিনি মদীনায় হিজরত করেন এবং সেখানে তিনি হযরত আলী ইবনে আবী তালিব (রাঃ)-কে বিবাহ করেন।\n\nপারিবারিক জীবন",
      "তাঁর এবং আলী (রাঃ)-এর জীবন ছিল অত্যন্ত সাধারণ ও দারিদ্র্যপীড়িত। তাঁরা নিজেদের হাতে কাজ করে জীবিকা নির্বাহ করতেন। সন্তান-সন্ততি\n\nতাঁর পুত্র হাসান (রাঃ) ও হুসাইন (রাঃ) এবং কন্যা যয়নব (রাঃ) ও উম্মে কুলসুম (রাঃ)। রাসূল (সাঃ)-এর ভালোবাসা\n\nরাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন। তিনি যখন আসতেন, রাসূল (সাঃ) দাঁড়িয়ে যেতেন এবং তাঁকে নিজের পাশে বসাতেন।",
      "নবী (সাঃ) বলেছিলেন: 'ফাতিমা আমার দেহের অংশ। যে তাকে কষ্ট দেয়, সে আমাকেই কষ্ট দেয়।' জান্নাতের মর্যাদা\n\nরাসূল (সাঃ) তাঁকে জান্নাতের নারীদের সর্দার হওয়ার সুসংবাদ দেন। পর্দা ও শালীনতা\n\nতিনি ছিলেন তাঁর যুগের নারীদের মধ্যে সর্বোচ্চ পর্দা ও শালীনতার প্রতীক। জ্ঞান ও ইবাদত",
      "তিনি ছিলেন অত্যন্ত জ্ঞানী এবং ইবাদতগুজার। তিনি তাঁর স্বামীর সাথে সাধারণ জীবনেও আল্লাহর প্রতি সর্বদা অনুগত ছিলেন।\n\nরাসূল (সাঃ)-এর শেষ জীবন\n\nরাসূল (সাঃ)-এর ইন্তেকালের সময় তিনি তাঁর পাশে ছিলেন। রাসূল (সাঃ) ইন্তেকালের আগে তাঁকে বলেছিলেন যে, তিনিই তাঁর পরিবারের মধ্যে প্রথম তাঁর সাথে মিলিত হবেন। ইন্তেকাল",
      "রাসূল (সাঃ)-এর ইন্তেকালের মাত্র ছয় মাস পর ১১ হিজরিতে (৬৩২ খ্রিস্টাব্দে) তিনি ইন্তেকাল করেন।\n\nতাঁর ইচ্ছা\n\nতিনি ইন্তেকালের আগে তাঁর স্বামীকে অসিয়ত করেন যে, তাঁকে যেন রাতে দাফন করা হয়, যাতে কোনো পরপুরুষ তাঁর দেহ দেখতে না পায়। দাফন",
      "তাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী\n\nতাঁর জীবনী ইসলামের ইতিহাসে শ্রেষ্ঠ বিনয়, পবিত্রতা এবং রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসার এক আদর্শ উদাহরণ।"
    ],
    "moral": "হযরত ফাতিমা (রাঃ)-এর জীবন প্রমাণ করে যে, নারীত্বের সর্বোচ্চ মর্যাদা অর্জন করা যায় পবিত্রতা, বিনয় এবং আল্লাহর প্রতি গভীর আনুগত্যের মাধ্যমে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "fatima_bint_muhammad"
  },
  {
    "id": "hamza_ibn_abd_al_muttalib",
    "categoryId": "sahabider_jibon",
    "title": "হামযা ইবনে আব্দুল মুত্তালিব (রাঃ)",
    "paragraphs": [
      "হযরত হামযা (রাঃ)-এর পূর্ণ নাম হলো হামযা ইবনে আব্দুল মুত্তালিব ইবনে হাশিম আল-কুরাইশী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর আপন চাচা এবং দুধভাই। তিনি 'আসাদুল্লাহ' (আল্লাহর সিংহ) এবং 'সাইয়্যিদুশ শুহাদা' (শহীদদের সর্দার) নামে পরিচিত। তাঁর উপাধি ছিল আবূ ইমারা। তাঁর বীরত্ব, বলিষ্ঠতা এবং সত্যের প্রতি আপসহীনতার কারণে তিনি এই উপাধি লাভ করেন।",
      "জন্ম ও ইসলাম গ্রহণের পূর্বে\n\nতিনি রাসূল (সাঃ)-এর প্রায় সমবয়সী ছিলেন এবং মক্কার কুরাইশদের মধ্যে তিনি একজন সম্মানিত ও শক্তিশালী নেতা ছিলেন। তিনি ছিলেন একজন দক্ষ শিকারী ও কুস্তিগীর। ইসলাম গ্রহণ\n\nনবুয়তের ষষ্ঠ বছরে তিনি ইসলাম গ্রহণ করেন। তাঁর ইসলাম গ্রহণের ঘটনাটি ছিল নাটকীয়। আবু জাহেল রাসূল (সাঃ)-কে অপমান করলে তিনি তা জানতে পারেন।",
      "তাঁর ইসলাম গ্রহণ\n\nইসলামের প্রতি ভালোবাসা এবং ভাতিজার প্রতি সম্মান রক্ষার্থে তিনি আবু জাহেলকে আক্রমণ করেন এবং প্রকাশ্যে তাঁর ইসলাম গ্রহণের ঘোষণা দেন। তাঁর ইসলাম গ্রহণ মুসলিমদের জন্য এক বিশাল শক্তি যোগ করে। হিজরত ও মদীনার জীবন\n\nতিনি মদীনায় হিজরত করেন। রাসূল (সাঃ) মদীনায় তাঁকে যায়দ ইবনে হারিসা (রাঃ)-এর সাথে ভ্রাতৃত্বের বন্ধনে আবদ্ধ করেন।",
      "সামরিক ভূমিকা\n\nতিনি ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ বীর। তিনি সকল সামরিক অভিযানে অংশগ্রহণ করেন এবং মুসলিম বাহিনীর নেতৃত্ব দেন। প্রথম সেনাপতি\n\nতিনি ছিলেন ইসলামের ইতিহাসে প্রথম ব্যক্তি, যিনি রাসূল (সাঃ)-এর নির্দেশে একটি সামরিক অভিযানের (সালাহ আল-বাহর) নেতৃত্ব দেন।",
      "বদরের যুদ্ধ\n\nবদরের যুদ্ধে তিনি মুসলিম বাহিনীর প্রধান সেনাপতি ছিলেন এবং তাঁর বীরত্বে কাফেররা ভীত হয়। তিনি শাইবা ইবনে রাবিয়াহ সহ কুরাইশদের অনেক বীরকে হত্যা করেন। তাঁর বলিষ্ঠ নেতৃত্ব ও সাহসিকতা বদরের যুদ্ধে মুসলিমদের বিজয়ে গুরুত্বপূর্ণ ভূমিকা রাখে। উহুদের যুদ্ধ ও শাহাদাত (সামরিক মিশন)\n\nউহুদের যুদ্ধে তিনি চরম বীরত্ব প্রদর্শন করেন। এই যুদ্ধে তিনি কুরাইশদের বহু যোদ্ধাকে হত্যা করেন।",
      "শাহাদাত\n\nউহুদের যুদ্ধে তিনি ওয়াহশী ইবনে হারব নামক এক দাস দ্বারা শহীদ হন। ওয়াহশীকে এই কাজের জন্য হিন্দ বিনতে উতবা (যাঁর পিতা বদরে হামযা (রাঃ)-এর হাতে নিহত হয়েছিলেন) নিয়োগ করেছিলেন। অঙ্গহানি\n\nশহীদ হওয়ার পর তাঁর দেহ বিকৃত করা হয়। রাসূল (সাঃ) তাঁর চাচার এই করুণ পরিণতি দেখে গভীরভাবে শোকাহত হন। সাইয়্যিদুশ শুহাদা",
      "রাসূল (সাঃ) তাঁকে 'সাইয়্যিদুশ শুহাদা' (শহীদদের সর্দার) উপাধি দেন।\n\nজান্নাতের মর্যাদা\n\nরাসূল (সাঃ) তাঁর জান্নাতের উচ্চ মর্যাদার সুসংবাদ দেন। হাদিসের মর্যাদা",
      "তাঁর সম্পর্কিত হাদিসগুলো তাঁর বীরত্ব, ভালোবাসা এবং ত্যাগের প্রমাণ বহন করে। তাঁর জীবনী\n\nতাঁর জীবনী ইসলামের ইতিহাসে তাঁর বীরত্ব, বলিষ্ঠতা এবং সত্যের জন্য সর্বোচ্চ আত্মত্যাগের এক বিরল উদাহরণ। তাঁর শাহাদাত মুসলিম উম্মাহর জন্য এক বিশাল ক্ষতি ছিল। রাসূল (সাঃ)-এর ভালোবাসা\n\nরাসূল (সাঃ) তাঁকে গভীরভাবে ভালোবাসতেন।"
    ],
    "moral": "হযরত হামযা (রাঃ)-এর জীবন প্রমাণ করে যে, সত্যের পক্ষে দাঁড়াতে এবং ইসলামকে রক্ষা করতে সর্বোচ্চ বীরত্ব ও আত্মত্যাগ অপরিহার্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "abdullah_ibn_umar",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে উমর (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে উমর (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে উমর ইবনে আল-খাত্তাব আল-কুরাইশী আল-আদাবী। তিনি ছিলেন ইসলামের দ্বিতীয় খলীফা হযরত উমর (রাঃ)-এর পুত্র এবং সুন্নাহর কঠোর অনুসারী সাহাবী। তাঁর উপাধি ছিল আব্দুর রহমান। তাঁকে 'আল-আবিদ' (অতি ইবাদতকারী) উপাধিতেও ডাকা হতো।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি নবুয়তের প্রথম বছরগুলোতে মক্কায় জন্মগ্রহণ করেন। তিনি তাঁর পিতা উমর (রাঃ)-এর সাথে শৈশবেই ইসলাম গ্রহণ করেন। শৈশবের জীবন\n\nতিনি তাঁর শৈশব রাসূল (সাঃ)-এর সান্নিধ্যে কাটান এবং অল্প বয়স থেকেই জ্ঞানার্জনের প্রতি আগ্রহী ছিলেন। সামরিক ভূমিকা",
      "তিনি উহুদের যুদ্ধে অংশগ্রহণ করতে চেয়েছিলেন, কিন্তু তখন তাঁর বয়স কম থাকায় রাসূল (সাঃ) তাঁকে অনুমতি দেননি।\n\nপ্রথম যুদ্ধে অংশগ্রহণ\n\nতিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি সকল সামরিক অভিযানে রাসূল (সাঃ)-এর পাশে ছিলেন। হাদিস বর্ণনাকারী",
      "তিনি সর্বাধিক হাদিস বর্ণনাকারী সাহাবীদের মধ্যে অন্যতম। তাঁর মাধ্যমে প্রায় ২,৬৩০টি হাদিস বর্ণিত হয়েছে। সুন্নাহর অনুসরণ\n\nতিনি রাসূল (সাঃ)-এর প্রতিটি কাজ ও নির্দেশকে কঠোরভাবে অনুসরণ করতেন। তিনি এমনভাবে সুন্নাহ পালন করতেন, যাতে কোনো প্রকার ব্যতিক্রম না হয়।\n\nজ্ঞানের মর্যাদা",
      "তিনি ফিকহ, হাদিস এবং ইসলামের আইন সম্পর্কে গভীর জ্ঞান রাখতেন। তাঁর ফতোয়াগুলো মদীনার আলেমদের কাছে অত্যন্ত গুরুত্বপূর্ণ ছিল। ইজতিহাদ ও ইবাদত\n\nতিনি অতি ইবাদতগুজার ছিলেন। তিনি তাঁর জীবনের বেশিরভাগ সময় সালাত, সাওম (রোজা) এবং ইবাদতে ব্যয় করতেন। খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা হিসেবে ভূমিকা রাখেন।",
      "ফিতনা থেকে দূরে থাকা\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে কঠোরভাবে দূরে থাকেন। তিনি মনে করতেন, মুসলিমদের মধ্যে রক্তপাত ঘটানো আল্লাহর পছন্দ নয়। তিনি কখনোই কোনো খলীফার পদ বা সরকারি দায়িত্ব গ্রহণ করেননি, যদিও তাঁকে বারবার প্রস্তাব দেওয়া হয়েছিল।\n\nরাজনৈতিক নিরপেক্ষতা",
      "তিনি ছিলেন সম্পূর্ণ রাজনৈতিকভাবে নিরপেক্ষ। তিনি হযরত আলী (রাঃ) বা মুয়াবিয়া (রাঃ) কারোরই পক্ষ নেননি। মৃত্যু\n\nতিনি ৭৩ হিজরিতে (৬৯৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। জানাযা ও দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে সুন্নাহর প্রতি কঠোর আনুগত্য, বিনয় এবং রাজনৈতিক ফিতনা থেকে দূরে থাকার প্রজ্ঞার এক আদর্শ উদাহরণ।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে উমর (রাঃ)-এর জীবন প্রমাণ করে যে, জীবনের প্রতিটি ক্ষেত্রে রাসূল (সাঃ)-এর সুন্নাহকে কঠোরভাবে অনুসরণ করাই একজন মুমিনের প্রধান কর্তব্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "anas_ibn_malik",
    "categoryId": "sahabider_jibon",
    "title": "আনাস ইবনে মালিক (রাঃ)",
    "paragraphs": [
      "হযরত আনাস ইবনে মালিক (রাঃ)-এর পূর্ণ নাম হলো আবু হামযা আনাস ইবনে মালিক ইবনে নযর আল-আনসারী আল-খাযরাজী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর দীর্ঘ দশ বছরের খাদেম (সেবক)। তাঁর উপাধি ছিল আবু হামযা। তিনি রাসূল (সাঃ)-এর কাছ থেকে বিশেষভাবে স্নেহ ও দু'আ লাভ করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। মদীনায় হিজরতের পরপরই তাঁর মা উম্মে সুলাইম (রাঃ) তাঁকে রাসূল (সাঃ)-এর খেদমতে অর্পণ করেন। রাসূল (সাঃ)-এর সান্নিধ্য\n\nতিনি মদীনায় হিজরতের পর থেকে রাসূল (সাঃ)-এর ইন্তেকাল পর্যন্ত একটানা দশ বছর তাঁর ব্যক্তিগত খাদেম হিসেবে নিয়োজিত ছিলেন।",
      "রাসূল (সাঃ)-এর সেবা\n\nতিনি রাসূল (সাঃ)-এর সমস্ত ব্যক্তিগত কাজ, যেমন: ওযু করানো, জুতো রাখা, খাবার পরিবেশন—ইত্যাদিতে সাহায্য করতেন। রাসূল (সাঃ)-এর দু'আ\n\nআনাস (রাঃ)-এর জন্য রাসূল (সাঃ) বিশেষভাবে দু'আ করেছিলেন: 'হে আল্লাহ! তার ধন-সম্পদ ও সন্তান-সন্ততি বাড়িয়ে দাও এবং তাকে বরকত দান করো।'",
      "এই দু'আর ফলস্বরূপ, তিনি দীর্ঘজীবন পান, তাঁর বিপুল সম্পদ হয় এবং তাঁর পুত্র-পৌত্রদের সংখ্যা প্রায় একশত বিশ জন হয়েছিল। হাদিস বর্ণনাকারী\n\nতিনি রাসূল (সাঃ)-এর জীবনের ব্যক্তিগত ও অভ্যন্তরীণ দিকগুলো সম্পর্কে সবচেয়ে বেশি জানতেন। তিনি প্রায় ২,২৮৬টি হাদিস বর্ণনা করেন। সামরিক ভূমিকা\n\nতিনি রাসূল (সাঃ)-এর সঙ্গে খন্দকের যুদ্ধ, হুদাইবিয়ার সন্ধি, মক্কা বিজয় সহ অনেক গুরুত্বপূর্ণ অভিযানে অংশগ্রহণ করেন।",
      "জ্ঞানের মর্যাদা\n\nতিনি তাঁর যুগের আলেমদের কাছে হাদিস, ফিকহ এবং সীরাতের একজন গুরুত্বপূর্ণ উৎস ছিলেন। জ্ঞান বিতরণ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর বসরায় হিজরত করেন এবং সেখানে হাদিস শিক্ষাদানের এক বিশাল কেন্দ্র প্রতিষ্ঠা করেন। তাঁর ছাত্রদের সংখ্যা ছিল বিপুল। তাঁর কাছ থেকে হাসান আল-বসরী এবং মুহাম্মদ ইবনে সিরীন সহ তাবেয়ীনের বহু বড় ইমাম হাদিস শিখেছেন।",
      "ফিতনা থেকে দূরে থাকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে ফিতনা থেকে দূরে থাকার চেষ্টা করেন। তিনি তাঁর জীবনের শেষ দিন পর্যন্ত হাদিস বর্ণনা ও রাসূল (সাঃ)-এর স্মৃতিচারণ করতেন। দীর্ঘ জীবন\n\nতিনি দীর্ঘজীবন লাভ করেন এবং প্রায় ১০০ বছর বেঁচে ছিলেন। তাঁর শেষ জীবন",
      "মৃত্যুর আগে তিনি তাঁর পরিবারের সদস্যদের আল্লাহর পথে অবিচল থাকতে উপদেশ দেন। মৃত্যু\n\nতিনি ৯৩ হিজরিতে (৭১২ খ্রিস্টাব্দে) বসরায় ইন্তেকাল করেন।\n\nদাফন",
      "তাঁকে বসরায় দাফন করা হয়। তাঁর জীবনী\n\nতাঁর জীবনী রাসূল (সাঃ)-এর প্রতি গভীর ভালোবাসা, ব্যক্তিগত সেবার মাধ্যমে জ্ঞান অর্জন এবং বরকতের এক শ্রেষ্ঠ উদাহরণ।"
    ],
    "moral": "হযরত আনাস (রাঃ)-এর জীবন প্রমাণ করে যে, রাসূল (সাঃ)-এর ব্যক্তিগত সেবার মাধ্যমে জ্ঞান অর্জন করলে আল্লাহর পক্ষ থেকে জীবন ও সম্পদে বরকত লাভ হয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "said_ibn_zayd",
    "categoryId": "sahabider_jibon",
    "title": "সাঈদ ইবনে যায়েদ (রাঃ)",
    "paragraphs": [
      "হযরত সাঈদ ইবনে যায়েদ (রাঃ)-এর পূর্ণ নাম হলো সাঈদ ইবনে যায়েদ ইবনে আমর ইবনে নুফায়েল আল-কুরাইশী আল-আদাবী। তিনি ছিলেন আশারায়ে মুবাশশারাহ (জান্নাতের সুসংবাদপ্রাপ্ত ১০ জন)-এর অন্যতম। তিনি ছিলেন ইসলামের দ্বিতীয় খলীফা হযরত উমর ইবনুল খাত্তাব (রাঃ)-এর ফুফুতো ভাই এবং ভগ্নিপতি।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কার বনু আদী গোত্রে জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিকের ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। নির্যাতন\n\nইসলাম গ্রহণের কারণে তিনি এবং তাঁর স্ত্রী ফাতিমা বিনতে আল-খাত্তাব (হযরত উমরের বোন) কুরাইশদের পক্ষ থেকে কঠোর নির্যাতনের শিকার হন।",
      "উমরের ইসলাম গ্রহণ\n\nহযরত উমর (রাঃ) তাঁদের ইসলাম গ্রহণের কথা জানতে পেরেই উত্তেজিত হয়ে তাঁদের বাড়িতে আক্রমণ করেন। এই ঘটনাই পরে উমর (রাঃ)-এর ইসলাম গ্রহণের কারণ হয়। হিজরত ও সান্নিধ্য\n\nতিনি মদীনায় হিজরত করেন এবং রাসূল (সাঃ)-এর সকল গুরুত্বপূর্ণ মুহূর্তে পাশে ছিলেন।",
      "সামরিক ভূমিকা\n\nতিনি বদর যুদ্ধ ব্যতীত রাসূল (সাঃ)-এর সকল যুদ্ধে অংশগ্রহণ করেন। বদরের সময় তিনি রাসূল (সাঃ)-এর নির্দেশে একটি গুরুত্বপূর্ণ মিশনে নিয়োজিত ছিলেন। বদর যুদ্ধে অনুপস্থিত থাকলেও রাসূল (সাঃ) তাঁকে বদরের অংশগ্রহণকারীদের মতো গনিমত ও মর্যাদা দান করেন। আশারায়ে মুবাশশারাহর সদস্য\n\nতিনি রাসূল (সাঃ)-এর জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত সেই দশজন সাহাবীর অন্যতম।",
      "খিলাফতের ভূমিকা\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ পরামর্শদাতা ছিলেন। সামরিক বিজয়: সিরিয়া অভিযান\n\nহযরত উমর (রাঃ)-এর খিলাফতকালে তিনি সিরিয়া বিজয়ের অভিযানে গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন এবং মুসলিম বাহিনীর নেতৃত্ব দেন। প্রশাসনিক দায়িত্ব",
      "তিনি কুফা শহর প্রতিষ্ঠায় অংশগ্রহণ করেন। তিনি প্রশাসক হিসেবেও দায়িত্ব পালন করেন।\n\nফিতনা থেকে দূরে থাকা\n\nহযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার সিদ্ধান্ত নেন। তিনি মদীনা ছেড়ে সিরিয়ার আল-আকীক উপত্যকায় নির্জন জীবন যাপন করেন। জ্ঞান ও ইবাদত",
      "তিনি তাঁর জীবনকে ইবাদত ও জ্ঞান চর্চায় ব্যয় করেন এবং হাদিস বর্ণনায় সতর্কতা অবলম্বন করতেন।\n\nতাঁর স্ত্রী\n\nতাঁর স্ত্রী ফাতিমা বিনতে আল-খাত্তাব (রাঃ) ছিলেন একজন পুণ্যবতী ও প্রথম দিকের ইসলাম গ্রহণকারী সাহাবিয়্যা। মৃত্যু",
      "তিনি ৫০ হিজরি বা ৫১ হিজরিতে (৬৭০ খ্রিস্টাব্দে) মদীনার আল-আকীক উপত্যকায় ইন্তেকাল করেন। জানাযা ও দাফন\n\nহযরত আব্দুল্লাহ ইবনে উমর (রাঃ) তাঁর জানাযার সালাতে ইমামতি করেন। তাঁকে মদীনার কাছেই দাফন করা হয়।\n\nতাঁর মর্যাদা"
    ],
    "moral": "হযরত সাঈদ ইবনে যায়েদ (রাঃ)-এর জীবন প্রমাণ করে যে, কঠিনতম নির্যাতনের মুখেও ঈমানের ওপর দৃঢ় থাকা এবং রাসূল (সাঃ)-এর আনুগত্য করাই জান্নাতের পথ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abu_said_al_khudri",
    "categoryId": "sahabider_jibon",
    "title": "আবু সাঈদ আল-খুদরী (রাঃ)",
    "paragraphs": [
      "হযরত আবু সাঈদ আল-খুদরী (রাঃ)-এর পূর্ণ নাম হলো সা'দ ইবনে মালিক ইবনে সিনান আল-খুদরী আল-আনসারী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন তরুণ সাহাবী এবং অধিক হাদিস বর্ণনাকারীদের অন্যতম। তাঁর উপাধি ছিল আবু সাঈদ। তিনি মদীনার খাযরাজ গোত্রের বনু খুদরা শাখার অন্তর্ভুক্ত ছিলেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মদীনায় জন্মগ্রহণ করেন। তিনি মদীনার আনসারদের মধ্যে একজন ছিলেন এবং শৈশবেই ইসলাম গ্রহণ করেন।\n\nপ্রাথমিক জীবন\n\nতাঁর পিতা মালিক ইবনে সিনান (রাঃ) উহুদের যুদ্ধে শহীদ হন। এই ঘটনার পর তিনি তাঁর মায়ের তত্ত্বাবধানে বেড়ে ওঠেন। সামরিক ভূমিকা",
      "তিনি তাঁর পিতাকে হারানোর পর অল্প বয়সেই উহুদের যুদ্ধে অংশগ্রহণের অনুমতি চেয়েছিলেন, কিন্তু তখন তাঁর বয়স কম থাকায় রাসূল (সাঃ) তাঁকে অনুমতি দেননি।\n\nপ্রথম যুদ্ধে অংশগ্রহণ\n\nতিনি খন্দকের যুদ্ধে (৫ হি.) প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে তাঁর পাশে ছিলেন। হাদিস বর্ণনাকারী",
      "তিনি অধিক হাদিস বর্ণনাকারী সাহাবীদের মধ্যে অন্যতম। তাঁর মাধ্যমে প্রায় ১,১৭০টি হাদিস বর্ণিত হয়েছে। জ্ঞান অন্বেষণ\n\nতিনি রাসূল (সাঃ)-এর সান্নিধ্যে থেকে হাদিস ও ফিকহের জ্ঞান লাভ করেন এবং তাঁর জীবন উৎসর্গ করেন জ্ঞান বিতরণে।\n\nতাঁর জ্ঞানের মর্যাদা",
      "তাবেয়ীনের যুগে তিনি মদীনার একজন প্রধান মুফতি এবং হাদিস শিক্ষকের ভূমিকা পালন করেন। ফিকহী অবস্থান\n\nতিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর ফতোয়াগুলো মদীনার আলেমদের কাছে গুরুত্বপূর্ণ ছিল। হাদিস বর্ণনার পদ্ধতি\n\nতিনি হাদিস বর্ণনার ক্ষেত্রে অত্যন্ত সতর্কতা অবলম্বন করতেন এবং নিশ্চিত না হয়ে কোনো হাদিস বর্ণনা করতেন না।",
      "জিহাদে অংশগ্রহণ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে পরিচালিত বিভিন্ন সামরিক অভিযানে অংশগ্রহণ করেন। ফিতনা থেকে দূরে থাকা\n\nতিনি ফিতনার সময় সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার নীতি অবলম্বন করেন। মৃত্যু",
      "তিনি ৬৪ হিজরি বা ৭৪ হিজরিতে (৬৮৩/৬৯৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।\n\nতাঁর জীবনী",
      "তাঁর জীবনী অল্প বয়সে পিতাকে হারানোর পরও জ্ঞানার্জনের প্রতি তাঁর নিষ্ঠা এবং সুন্নাহর সংরক্ষণে তাঁর অবিচল অঙ্গীকারের এক আদর্শ উদাহরণ। তিনি তাঁর জীবনের বেশিরভাগ সময় জ্ঞান বিতরণে ব্যয় করেছেন। তাঁর বর্ণিত হাদিসগুলো ফিকহ ও আক্বীদার ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ। তাঁর ইবাদত ছিল সুপরিচিত। তাঁর জীবন\n\nতাঁর জীবন আল্লাহর সন্তুষ্টির জন্য উৎসর্গীকৃত ছিল।"
    ],
    "moral": "হযরত আবু সাঈদ আল-খুদরী (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞানার্জনের প্রতি নিরবচ্ছিন্ন নিষ্ঠা এবং সুন্নাহর সংরক্ষণে আত্মনিবেদন করলে আল্লাহ সর্বোচ্চ মর্যাদা দান করেন।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "ubayy_ibn_kaab",
    "categoryId": "sahabider_jibon",
    "title": "উবাই ইবনে কা'ব (রাঃ)",
    "paragraphs": [
      "হযরত উবাই ইবনে কা'ব (রাঃ)-এর পূর্ণ নাম হলো উবাই ইবনে কা'ব ইবনে কায়স আল-খাযরাজী আল-আনসারী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর শ্রেষ্ঠতম ক্বারী ও কুরআন বিশেষজ্ঞ। তাঁর উপাধি ছিল 'সাইয়্যিদুল কুররা' (ক্বারীগণের সর্দার)। রাসূল (সাঃ) তাঁকে এই উপাধি দেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন।\n\nপ্রাথমিক জীবন\n\nতিনি মদীনায় ইসলাম গ্রহণের পর রাসূল (সাঃ)-এর ঘনিষ্ঠ সাহাবীদের মধ্যে স্থান পান। কুরআন মুখস্থ ও জ্ঞান",
      "তিনি ছিলেন রাসূল (সাঃ)-এর জীবদ্দশায় সম্পূর্ণ কুরআন মুখস্থকারী (হাফিয) প্রথম সাহাবীদের অন্যতম। রাসূল (সাঃ)-এর প্রশংসা\n\nরাসূল (সাঃ) তাঁকে উদ্দেশ করে বলেছিলেন: 'হে উবাই, আল্লাহ তোমাকে আদেশ করেছেন, যেন আমি তোমার কাছে কুরআন তেলাওয়াত করি।' এই আদেশ তাঁর মর্যাদার প্রমাণ।\n\nকুরআন সংকলন",
      "তিনি ছিলেন হযরত আবু বকর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে কুরআন সংকলন কমিটির প্রধান সদস্যদের মধ্যে একজন। তাঁর কিরাআত\n\nতাঁর কিরাআতের পদ্ধতি ছিল কুরআনের পাঠের ক্ষেত্রে অত্যন্ত নির্ভরযোগ্য এবং অনুকরণীয়। সামরিক ভূমিকা\n\nতিনি বদর, উহুদ, খন্দক সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। জ্ঞানের মর্যাদা",
      "তিনি ছিলেন সাহাবীদের মধ্যে অন্যতম শ্রেষ্ঠ জ্ঞানী, ফকীহ এবং তাফসীরকার।\n\nফতোয়া\n\nখুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি মদীনায় ফতোয়া দেওয়ার কাজে নিয়োজিত ছিলেন। প্রশাসনিক দায়িত্ব",
      "তিনি হযরত উমর (রাঃ)-এর খিলাফতকালে কুফায় হাদিস শিক্ষা দেন এবং পরে ফিকহী জ্ঞান বিতরণে ভূমিকা রাখেন। তাঁর হাদিস\n\nতিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্কতা অবলম্বন করতেন। মৃত্যু\n\nতিনি ১৯ হিজরি বা ২২ হিজরিতে (৬৪০/৬৪৩ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন।",
      "দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী\n\nতাঁর জীবনী কুরআন ও সুন্নাহর জ্ঞানের প্রতি তাঁর গভীর নিষ্ঠা এবং কুরআনের সংরক্ষণে তাঁর অসামান্য অবদানের এক উজ্জ্বল উদাহরণ।"
    ],
    "moral": "হযরত উবাই ইবনে কা'ব (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর কিতাবকে মুখস্থ করা, বোঝা এবং তার সংরক্ষণে অবদান রাখাই শ্রেষ্ঠত্বের মাপকাঠি।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "zaid_ibn_thabit",
    "categoryId": "sahabider_jibon",
    "title": "যায়েদ ইবনে সাবিত (রাঃ)",
    "paragraphs": [
      "হযরত যায়েদ ইবনে সাবিত (রাঃ)-এর পূর্ণ নাম হলো যায়েদ ইবনে সাবিত ইবনে আল-দাহহাক আল-আনসারী আল-খাযরাজী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর প্রধান ওহী লেখক এবং কুরআনের সংকলক। তাঁর উপাধি ছিল 'আবূ সাঈদ'। তিনি কুরআনের জ্ঞান এবং ফিকহী সিদ্ধান্ত (বিশেষ করে ফারায়েয) সম্পর্কে গভীর জ্ঞান রাখতেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী সাহাবী ছিলেন। প্রাথমিক জীবন\n\nমদীনায় হিজরতের সময় তাঁর বয়স ছিল মাত্র ১১ বছর। তিনি রাসূল (সাঃ)-এর সান্নিধ্য লাভ করেন। ওহী লেখক",
      "তিনি ছিলেন রাসূল (সাঃ)-এর প্রধান ওহী লেখকদের মধ্যে অন্যতম। রাসূল (সাঃ) যখনই ওহী পেতেন, তখনই তাঁকে ডেকে তা লিখে রাখতে বলতেন।\n\nভাষাজ্ঞান\n\nরাসূল (সাঃ)-এর নির্দেশে তিনি মাত্র সতেরো দিনে ইহুদিদের ভাষা (সিরিয়াক/হিব্রু) শিখে ফেলেন, যাতে তিনি তাদের চিঠি-পত্রের অনুবাদ করতে পারেন। সামরিক ভূমিকা",
      "তিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে তাঁর পাশে ছিলেন।\n\nকুরআন সংকলন (প্রধান মিশন)\n\nহযরত আবু বকর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে কুরআন সংকলন ও প্রচার কমিটির প্রধান হিসেবে তিনি কাজ করেন। এই কাজে তাঁর ভূমিকা ছিল ঐতিহাসিক। তিনি ছিলেন কুরআনের হাফিয এবং রাসূল (সাঃ)-এর শেষবার কুরআন তেলাওয়াত শোনার সাক্ষী।",
      "ফারায়েয বিশেষজ্ঞ\n\nতিনি ছিলেন সাহাবীদের মধ্যে ফারায়েয (উত্তরাধিকার আইন) সম্পর্কে সবচেয়ে জ্ঞানী ব্যক্তি। হযরত উমর (রাঃ) তাঁর জ্ঞানের উচ্চ মর্যাদা দিতেন। জ্ঞানের মর্যাদা\n\nহযরত উমর (রাঃ) তাঁকে মদীনার প্রধান ফকীহ এবং মুফতি হিসেবে নিযুক্ত করেন। হাদিস ও ফিকহ",
      "তিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্ক ছিলেন এবং ফিকহের ক্ষেত্রে গভীর জ্ঞান রাখতেন।\n\nপ্রশাসনিক দায়িত্ব\n\nখুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি মদীনার কাজীর (বিচারক) এবং বাইতুল মালের প্রধান হিসেবে দায়িত্ব পালন করেন। মৃত্যু",
      "তিনি ৪৫ হিজরিতে (৬৬৫ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়।\n\nতাঁর জীবনী",
      "তাঁর জীবনী প্রশাসনিক ক্ষেত্রে তাঁর জ্ঞান ও দক্ষতার প্রমাণ বহন করে এবং কুরআনের সংরক্ষণে তাঁর অসামান্য অবদান ইসলামের ইতিহাসে চিরস্মরণীয়।"
    ],
    "moral": "হযরত যায়েদ ইবনে সাবিত (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, বিশেষত কুরআন ও সুন্নাহর জ্ঞান, একজন ব্যক্তিকে প্রশাসনিক ও ধর্মীয় উভয় ক্ষেত্রে নেতৃত্ব দেওয়ার সুযোগ করে দেয়।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "khalid_ibn_saeed",
    "categoryId": "sahabider_jibon",
    "title": "খালিদ ইবনে সাইদ (রাঃ)",
    "paragraphs": [
      "হযরত খালিদ ইবনে সাইদ (রাঃ)-এর পূর্ণ নাম হলো খালিদ ইবনে সাইদ ইবনে আল-আস ইবনে উমাইয়্যা আল-কুরাইশী আল-উমাভী। তিনি ছিলেন ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী এবং একজন গুরুত্বপূর্ণ প্রশাসনিক ব্যক্তিত্ব। তাঁর উপাধি ছিল 'আবূ সাঈদ'। তিনি উমাইয়্যা গোত্রের অন্যতম সম্মানিত ব্যক্তি ছিলেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কায় কুরাইশ গোত্রের বনু উমাইয়্যা শাখায় জন্মগ্রহণ করেন। তিনি ছিলেন ইসলামের প্রথম দিককার পঞ্চম বা ষষ্ঠ ইসলাম গ্রহণকারী। নির্যাতন\n\nতাঁর বাবা সাইদ ইবনে আল-আস তাঁর ইসলাম গ্রহণের কারণে তাঁকে কঠোর নির্যাতন করেন। তিনি দীর্ঘদিন নির্যাতন সহ্য করেন।",
      "হিজরত\n\nতিনি কুরাইশদের নির্যাতন থেকে বাঁচতে তাঁর স্ত্রী উম্মে আমিন (রাঃ)-এর সাথে আবিসিনিয়ায় (হাবশা) হিজরতকারী প্রথম দলের অন্তর্ভুক্ত ছিলেন। সামরিক ভূমিকা\n\nআবিসিনিয়া থেকে ফেরার পর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। প্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে সানা'আ (ইয়েমেন)-এর গভর্নর হিসেবে নিযুক্ত করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন।\n\nআবু বকর (রাঃ)-এর খিলাফতকালে\n\nরাসূল (সাঃ)-এর ইন্তেকালের পর তিনি প্রথমে উসামা (রাঃ)-এর অভিযানের অংশ হতে চেয়েছিলেন। রিদ্দা যুদ্ধ",
      "আবু বকর (রাঃ)-এর খিলাফতকালে তিনি রিদ্দা যুদ্ধে গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন এবং মুসলিম বাহিনীকে নেতৃত্ব দেন।\n\nশাম অভিযান\n\nআবু বকর (রাঃ) যখন সিরিয়া অভিযানে খালিদ ইবনে ওয়ালিদ (রাঃ)-কে সেনাপতি নিযুক্ত করেন, তখন খালিদ ইবনে সাইদ (রাঃ)-এর নেতৃত্বেও একটি বাহিনী পরিচালিত হয়। বিবাহ",
      "তিনি রাসূল (সাঃ)-এর স্ত্রী উম্মে হাবিবা (রাঃ)-এর সাথে বিবাহবন্ধনে আবদ্ধ হয়েছিলেন। শাহাদাত\n\nহযরত আবু বকর (রাঃ)-এর খিলাফতের প্রথম দিকেই তিনি সিরিয়া অভিযানে শহীদ হন।\n\nতাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে তাঁর প্রাথমিক ইসলাম গ্রহণ, নির্যাতনের মুখে অবিচলতা এবং প্রশাসনিক ও সামরিক ক্ষেত্রে তাঁর গুরুত্বপূর্ণ অবদানের জন্য স্মরণীয়।"
    ],
    "moral": "হযরত খালিদ ইবনে সাইদ (রাঃ)-এর জীবন প্রমাণ করে যে, সত্যের জন্য পরিবার ও সমাজ থেকে বিচ্ছিন্ন হয়েও আল্লাহর পথে দৃঢ় থাকা অপরিহার্য।",
    "source": "ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "sahabi_id": "bilal_ibn_rabah",
    "title": "বিলাল ইবনে রাবাহ (রাঃ)",
    "paragraphs": [
      "হযরত বিলাল (রাঃ)-এর পূর্ণ নাম হলো বিলাল ইবনে রাবাহ আল-হাবশী। তিনি ছিলেন ইসলামের ইতিহাসের প্রথম মুয়াজ্জিন এবং ইসলামের সাম্য ও মুক্তির প্রতীক। তাঁর উপাধি ছিল 'আবূ আব্দুল্লাহ'। তিনি তাঁর কণ্ঠের মাধুর্য ও রাসূল (সাঃ)-এর প্রতি ভালোবাসার জন্য পরিচিত। জন্ম ও বংশ পরিচয়",
      "তিনি আবিসিনিয়ার (বর্তমান ইথিওপিয়া) অধিবাসী ছিলেন। তিনি মক্কার মুশরিকদের দাস হিসেবে জীবনযাপন করতেন।\n\nইসলাম গ্রহণ\n\nতিনি ছিলেন ইসলামের প্রথম দিককার ইসলাম গ্রহণকারী (আস-সাবিকুন আল-আউয়ালুন)-এর অন্যতম। নির্যাতন",
      "তাঁর ইসলাম গ্রহণের কারণে তাঁর মনিব উমাইয়া ইবনে খালাফ তাঁকে অকথ্য নির্যাতন করত। মক্কার গরম বালির ওপর শুইয়ে বুকে পাথর চাপা দেওয়া হতো। অবিচলতা\n\nনির্যাতনের সময় তিনি কেবল 'আহাদ, আহাদ' (আল্লাহ এক, আল্লাহ এক) বলতেন, যা তাঁর অবিচল ঈমানের প্রমাণ।\n\nমুক্তি",
      "হযরত আবু বকর (রাঃ) তাঁকে প্রচুর অর্থ দিয়ে তাঁর মনিবের কাছ থেকে মুক্ত করেন। মদীনার জীবন\n\nমদীনায় হিজরতের পর তিনি রাসূল (সাঃ)-এর ঘনিষ্ঠ সাহাবীদের মধ্যে স্থান পান। প্রথম মুয়াজ্জিন\n\nরাসূল (সাঃ) তাঁকে ইসলামের প্রথম মুয়াজ্জিন হিসেবে নিযুক্ত করেন। তাঁর কণ্ঠের আযান মুসলিমদের জন্য ছিল এক অনন্য প্রতীক।",
      "সামরিক ভূমিকা\n\nতিনি বদর, উহুদ সহ সকল যুদ্ধে অংশগ্রহণ করেন। বদরের যুদ্ধে তিনি তাঁর পূর্বের মনিব উমাইয়া ইবনে খালাফকে হত্যা করেন। মক্কা বিজয়\n\nমক্কা বিজয়ের দিন রাসূল (সাঃ)-এর নির্দেশে তিনি কাবা শরীফের ছাদে উঠে আযান দেন, যা ইসলামের সাম্য ও বিজয়ের প্রতীক ছিল। রাসূল (সাঃ)-এর প্রতি ভালোবাসা",
      "রাসূল (সাঃ)-এর ইন্তেকালের পর তিনি এত বেশি শোকার্ত হন যে, মদীনায় আযান দেওয়া বন্ধ করে দেন।\n\nআযান\n\nতিনি কেবল হযরত উমর (রাঃ)-এর অনুরোধে জেরুজালেম বিজয়কালে একবার এবং পরে সিরিয়া থেকে এসে একবার আযান দেন, যা শুনে মদীনার সবাই কেঁদে ফেলেছিল। আবু বকর (রাঃ)-এর আমলে ভূমিকা",
      "তিনি আবু বকর (রাঃ)-এর খিলাফতকালেও ইসলামের সামরিক অভিযানে অংশগ্রহণ করেন। ইবাদত\n\nতিনি ছিলেন অত্যন্ত ইবাদতগুজার। রাসূল (সাঃ) তাঁকে বলেছিলেন: 'আমি জান্নাতে তোমার জুতোর শব্দ শুনতে পেয়েছি।'\n\nকারণ:",
      "রাসূল (সাঃ)-কে তিনি বলেছিলেন যে, যখনই তাঁর অযু ভেঙে যায়, তিনি সাথে সাথেই অযু করে দুই রাকাত নফল সালাত আদায় করেন। তাঁর যুহদ\n\nতিনি দুনিয়ার বিলাসবহুল জীবন থেকে নিজেকে দূরে রাখতেন এবং জ্ঞান ও জিহাদের পথ বেছে নেন। মৃত্যু\n\nতিনি ২০ হিজরির কাছাকাছি সময়ে সিরিয়ার দামেস্কে ইন্তেকাল করেন। তাঁর জীবনী"
    ],
    "moral": "হযরত বিলাল (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে অবিচল ধৈর্য ও ভালোবাসা জাতি-বর্ণ নির্বিশেষে সকল মানুষের জন্য মুক্তির পথ উন্মুক্ত করে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া",
    "id": "bilal_ibn_rabah"
  },
  {
    "id": "jabir_ibn_abdullah",
    "categoryId": "sahabider_jibon",
    "title": "জাবির ইবনে আব্দুল্লাহ (রাঃ)",
    "paragraphs": [
      "হযরত জাবির ইবনে আব্দুল্লাহ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ জাবির ইবনে আব্দুল্লাহ ইবনে আমর ইবনে হারাম আল-আনসারী আল-সালামী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন তরুণ সাহাবী এবং অধিক হাদিস বর্ণনাকারীদের অন্যতম। তাঁর উপাধি ছিল আবু আব্দুল্লাহ। তিনি তাঁর জীবনকে রাসূল (সাঃ)-এর স্মৃতিচারণ এবং জ্ঞান বিতরণে ব্যয় করেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মদীনার খাযরাজ গোত্রে জন্মগ্রহণ করেন। তিনি এবং তাঁর পিতা আব্দুল্লাহ ইবনে আমর আকাবার দ্বিতীয় শপথে অংশগ্রহণকারী অন্যতম আনসারী ছিলেন। পারিবারিক পটভূমি\n\nতাঁর পিতা আব্দুল্লাহ ইবনে আমর উহুদের যুদ্ধে শহীদ হন। শহীদ হওয়ার সময় তিনি তাঁর পুত্র জাবির (রাঃ)-এর ওপর তাঁর নয়জন বোনের দায়িত্ব অর্পণ করে যান।",
      "প্রাথমিক জীবন\n\nপিতার শাহাদাতের পর অল্প বয়সে তিনি তাঁর বোনদের লালন-পালনের দায়িত্ব নেন। রাসূল (সাঃ) তাঁর এই পারিবারিক দায়িত্বের প্রতি বিশেষভাবে খেয়াল রাখতেন। সামরিক ভূমিকা\n\nতিনি বদর ও উহুদের যুদ্ধে অংশগ্রহণ করতে চেয়েছিলেন, কিন্তু তাঁর বয়স কম থাকায় এবং পরিবারের দায়িত্বের কারণে শুরুতে অনুমতি পাননি।",
      "প্রথম যুদ্ধে অংশগ্রহণ\n\nতিনি খন্দকের যুদ্ধে প্রথম অংশগ্রহণ করেন। এরপর তিনি রাসূল (সাঃ)-এর প্রায় সকল সামরিক অভিযানে (১৯টির মতো) তাঁর পাশে ছিলেন। হাদিস বর্ণনাকারী\n\nতিনি রাসূল (সাঃ)-এর জীবনের শেষ আট বছরে তাঁর সান্নিধ্য লাভ করেন। তাঁর মাধ্যমে প্রায় ১,৫৪০টি হাদিস বর্ণিত হয়েছে। তাঁর জীবনের দীর্ঘতা",
      "তিনি দীর্ঘজীবন লাভ করেন এবং তাঁর বর্ণিত হাদিসগুলো ফিকহ ও সীরাতের ক্ষেত্রে অত্যন্ত গুরুত্বপূর্ণ।\n\nজ্ঞানের প্রতি আগ্রহ\n\nতিনি রাসূল (সাঃ)-এর ইন্তেকালের পর জ্ঞানার্জনের জন্য দূর-দূরান্তে সফর করেন। তিনি হাদিসের একটি নির্দিষ্ট অংশ শেখার জন্য মিশর পর্যন্ত ভ্রমণ করেন। জ্ঞান বিতরণ",
      "তিনি তাঁর জীবনের শেষভাগে মক্কা ও মদীনায় হাদিস শিক্ষাদানের এক বিশাল কেন্দ্র প্রতিষ্ঠা করেন। হজ ও উমরাহ\n\nতিনি রাসূল (সাঃ)-এর সঙ্গে বিদায় হজ পালন করেন এবং রাসূল (সাঃ)-এর হজের পদ্ধতি বিস্তারিতভাবে বর্ণনা করেন।\n\nফিতনা থেকে দূরে থাকা",
      "তিনি ফিতনার সময় সক্রিয় রাজনীতি এবং মুসলিমদের অভ্যন্তরীণ যুদ্ধ থেকে দূরে থাকার নীতি অবলম্বন করেন। দারিদ্র্য দূরীকরণ\n\nএকবার তিনি তার পিতার ঋণের কারণে বিপদে পড়লে, রাসূল (সাঃ) অলৌকিকভাবে তাঁর ঋণ পরিশোধে সাহায্য করেন। তাঁর বিনয়\n\nতিনি ছিলেন অত্যন্ত বিনয়ী এবং কঠোরভাবে আল্লাহর তাকওয়াবান।",
      "মৃত্যু\n\nতিনি ৭৮ হিজরিতে (৬৯৭ খ্রিস্টাব্দে) মদীনায় ইন্তেকাল করেন। তিনি ছিলেন মদীনায় ইন্তেকাল করা শেষ সাহাবীদের মধ্যে অন্যতম। দাফন\n\nতাঁকে মদীনার বিখ্যাত কবরস্থান জান্নাতুল বাকীতে দাফন করা হয়। তাঁর জীবনী"
    ],
    "moral": "হযরত জাবির ইবনে আব্দুল্লাহ (রাঃ)-এর জীবন প্রমাণ করে যে, পারিবারিক দায়িত্ব পালন করেও রাসূল (সাঃ)-এর সুন্নাহকে রক্ষা করা এবং জ্ঞান বিতরণে নিবেদিত হওয়া সম্ভব।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abu_musa_al_ashari",
    "categoryId": "sahabider_jibon",
    "title": "আবু মূসা আল-আশ'আরী (রাঃ)",
    "paragraphs": [
      "হযরত আবু মূসা আল-আশ'আরী (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে কায়স ইবনে সুলাইম আল-আশ'আরী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন বিশিষ্ট সাহাবী, বিচারক (কাজী) এবং প্রশাসক। তাঁর উপাধি ছিল আবু মূসা। তাঁর কুরআন তেলাওয়াতের সুমিষ্ট কণ্ঠের কারণে রাসূল (সাঃ) তাঁকে বিশেষ প্রশংসা করেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি ইয়েমেনের আশ'আর গোত্রে জন্মগ্রহণ করেন। তিনি প্রাথমিক পর্যায়েই ইসলাম গ্রহণ করেন।\n\nহিজরত ও সান্নিধ্য\n\nতিনি আবিসিনিয়ায় (হাবশা) হিজরতকারীদের মধ্যে ছিলেন। পরে তিনি মদীনায় হিজরত করেন। কুরআন তেলাওয়াত",
      "তাঁর কুরআন তেলাওয়াতের কণ্ঠ ছিল অত্যন্ত সুমধুর। রাসূল (সাঃ) তাঁর তেলাওয়াত শুনে বলেছিলেন: 'তোমাকে দাউদ (আঃ)-এর সুরের কিছু অংশ দেওয়া হয়েছে।' সামরিক ভূমিকা\n\nতিনি বদর, উহুদ সহ রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন।\n\nপ্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ইয়েমেনের গভর্নর হিসেবে নিযুক্ত করা হয়। এটি ছিল তাঁর শ্রেষ্ঠ প্রশাসনিক মিশন। হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি বসরা এবং কুফার গভর্নর হিসেবে দায়িত্ব পালন করেন। সামরিক বিজয়\n\nতিনি খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে পারস্য এবং অন্যান্য অঞ্চলে সামরিক অভিযানে নেতৃত্ব দেন এবং গুরুত্বপূর্ণ শহর জয় করেন।\n\nবিচারক ও মুফতি",
      "তিনি ছিলেন সাহাবীদের মধ্যে অন্যতম শ্রেষ্ঠ বিচারক (কাজী) এবং মুফতি। তাঁর ফতোয়াগুলো খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে গুরুত্বপূর্ণ ছিল। আলী (রাঃ)-এর খিলাফতকাল\n\nহযরত আলী (রাঃ)-এর খিলাফতকালে সৃষ্ট ফিতনার সময় তিনি সালিশকারী হিসেবে ভূমিকা পালন করেন। সালিশের ফলাফল\n\nসিফফিনের যুদ্ধের পর তিনি হযরত আলী (রাঃ)-এর পক্ষ থেকে সালিশকারী হিসেবে নিযুক্ত হন, যদিও সালিশের ফলাফল প্রত্যাশিত ছিল না।",
      "জ্ঞানের প্রতি আগ্রহ\n\nতিনি হাদিস বর্ণনার ক্ষেত্রেও সতর্ক ছিলেন এবং তাঁর জ্ঞান বিতরণে নিবেদিত ছিলেন। তাঁর ছাত্রদের সংখ্যা\n\nতাঁর ছাত্রদের মধ্যে তাবেয়ীনের অনেক বড় ইমাম হাদিস ও ফিকহ শিখেছেন। ব্যক্তিগত চরিত্র",
      "তিনি ছিলেন বিনয়ী, অত্যন্ত ধার্মিক এবং একজন পরিশ্রমী আলেম। মৃত্যু\n\nতিনি ৪২ বা ৪৪ হিজরিতে (৬৬২/৬৬৪ খ্রিস্টাব্দে) কুফা শহরে ইন্তেকাল করেন।\n\nতাঁর জীবনী",
      "তাঁর জীবনী জ্ঞান, বিচার এবং প্রশাসনের ক্ষেত্রে তাঁর দক্ষতা ও নিষ্ঠার এক আদর্শ উদাহরণ।"
    ],
    "moral": "হযরত আবু মূসা আল-আশ'আরী (রাঃ)-এর জীবন প্রমাণ করে যে, আধ্যাত্মিক গুণাবলী (মধুর কণ্ঠস্বর) এবং জ্ঞান একজন ব্যক্তিকে প্রশাসনিক ও বিচারিক ক্ষেত্রে নেতৃত্ব দিতে সাহায্য করে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "amr_ibn_al_as",
    "categoryId": "sahabider_jibon",
    "title": "আমর ইবনুল আস (রাঃ)",
    "paragraphs": [
      "হযরত আমর ইবনুল আস (রাঃ)-এর পূর্ণ নাম হলো আমর ইবনে আল-আস ইবনে ওয়া'ইল আল-কুরাইশী আল-সাহমী। তিনি ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ সামরিক ও রাজনৈতিক ব্যক্তিত্ব। তাঁর উপাধি ছিল আবূ আব্দুল্লাহ। তিনি তাঁর সামরিক কৌশল, রাজনৈতিক প্রজ্ঞা এবং বুদ্ধিমত্তার জন্য পরিচিত। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কার কুরাইশ গোত্রে জন্মগ্রহণ করেন। তিনি মক্কা বিজয়ের মাত্র কিছুদিন আগে হিজরতের অষ্টম বছর ইসলাম গ্রহণ করেন।\n\nইসলাম গ্রহণের পূর্বে\n\nইসলাম গ্রহণের আগে তিনি ছিলেন কুরাইশদের অন্যতম প্রধান শত্রু এবং রাজনৈতিক ব্যক্তিত্ব। সামরিক ভূমিকা",
      "ইসলাম গ্রহণের পর তিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন এবং মুসলিম বাহিনীর নেতৃত্ব দেন। প্রশাসনিক দায়িত্ব\n\nরাসূল (সাঃ)-এর জীবদ্দশায় তাঁকে ওমানের গভর্নর হিসেবে নিযুক্ত করা হয়।\n\nসামরিক বিজয়: মিশর বিজয় (৬৪১ খ্রি.)",
      "হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি মিশর বিজয়ের জন্য মুসলিম বাহিনীর নেতৃত্ব দেন। তাঁর সামরিক কৌশল এবং দ্রুত পদক্ষেপ মিশরের রোমান শাসনকে দুর্বল করে দেয়। মিশর বিজয় ছিল তাঁর জীবনের শ্রেষ্ঠ সামরিক কীর্তি। তিনি কায়রো এবং আলেকজান্দ্রিয়া শহর জয় করেন।\n\nরাজনৈতিক প্রজ্ঞা\n\nতিনি ছিলেন অত্যন্ত দূরদর্শী এবং রাজনৈতিকভাবে বিচক্ষণ। তিনি হযরত উমর (রাঃ) এবং হযরত উসমান (রাঃ)-এর খিলাফতকালে গুরুত্বপূর্ণ প্রশাসনিক পদে ছিলেন। হযরত মুয়াবিয়া (রাঃ)-এর পক্ষে",
      "হযরত উসমান (রাঃ)-এর শাহাদাতের পর সৃষ্ট ফিতনার সময় তিনি হযরত মুয়াবিয়া (রাঃ)-এর পক্ষ অবলম্বন করেন।\n\nসালিশ\n\nসিফফিনের যুদ্ধে তিনি মুয়াবিয়া (রাঃ)-এর পক্ষ থেকে সালিশকারী হিসেবে নিযুক্ত হন এবং তাঁর রাজনৈতিক বুদ্ধিমত্তা ব্যবহার করেন। মিশরের গভর্নর",
      "তিনি হযরত মুয়াবিয়া (রাঃ)-এর খিলাফতকালে মিশরের গভর্নর হিসেবে দায়িত্ব পালন করেন এবং প্রশাসনিক ক্ষেত্রে গুরুত্বপূর্ণ অবদান রাখেন।\n\nহাদিস ও ফিকহ\n\nতিনি হাদিস বর্ণনা এবং ফিকহী মাসআলায় জ্ঞান রাখতেন। তাঁর পুত্র আব্দুল্লাহ ইবনে আমর (রাঃ) ছিলেন একজন বিখ্যাত মুহাদ্দিস। জ্ঞানের মর্যাদা",
      "রাসূল (সাঃ) তাঁর ইসলাম গ্রহণকে মুসলিমদের জন্য বরকত বলে উল্লেখ করেছিলেন। মৃত্যু\n\nতিনি ৪৩ হিজরিতে (৬৬৪ খ্রিস্টাব্দে) মিশরে ইন্তেকাল করেন। তাঁর জীবনী\n\nতাঁর জীবনী ইসলামের ইতিহাসে তাঁর সামরিক প্রজ্ঞা, রাজনৈতিক বুদ্ধি এবং প্রশাসনিক দক্ষতার এক অনন্য উদাহরণ।"
    ],
    "moral": "হযরত আমর ইবনুল আস (রাঃ)-এর জীবন প্রমাণ করে যে, রাজনৈতিক বুদ্ধিমত্তা ও দূরদর্শিতা মুসলিম উম্মাহর প্রশাসনিক বিজয়ের ক্ষেত্রে অপরিহার্য।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া"
  },
  {
    "id": "mughira_ibn_shubah",
    "categoryId": "sahabider_jibon",
    "title": "মুগীরা ইবনে শু'বাহ (রাঃ)",
    "paragraphs": [
      "হযরত মুগীরা ইবনে শু'বাহ (রাঃ)-এর পূর্ণ নাম হলো আবু আব্দুল্লাহ মুগীরা ইবনে শু'বাহ ইবনে আবি আমির আল-সাকাফী। তিনি ছিলেন রাসূলুল্লাহ (সাঃ)-এর একজন বিশিষ্ট সাহাবী, প্রখ্যাত প্রশাসক এবং কূটনৈতিক। তাঁর উপাধি ছিল আবূ আব্দুল্লাহ। তিনি তাঁর তীক্ষ্ণ বুদ্ধিমত্তা, বাকপটুতা এবং রাজনৈতিক দূরদর্শিতার জন্য পরিচিত ছিলেন।",
      "জন্ম ও ইসলাম গ্রহণ\n\nতিনি মক্কার কাছে তাইফ অঞ্চলের সাকাফ গোত্রে জন্মগ্রহণ করেন। তিনি হুদাইবিয়ার সন্ধির আগে ইসলাম গ্রহণ করেন। ইসলামের পূর্বে জীবন\n\nইসলাম গ্রহণের আগে তিনি ছিলেন একজন ধনী ও প্রভাবশালী ব্যক্তি। সামরিক ভূমিকা",
      "তিনি হুদাইবিয়ার সন্ধি এবং অন্যান্য গুরুত্বপূর্ণ অভিযানে রাসূল (সাঃ)-এর পাশে ছিলেন।\n\nহুদাইবিয়ার সন্ধি\n\nহুদাইবিয়ার সন্ধির সময় তিনি রাসূল (সাঃ)-এর সামরিক পরামর্শদাতা ছিলেন এবং কাফেরদের সাথে আলোচনার ক্ষেত্রে গুরুত্বপূর্ণ ভূমিকা রাখেন। প্রশাসনিক দায়িত্ব",
      "রাসূল (সাঃ)-এর ইন্তেকালের পর খুলাফায়ে রাশিদীনের (রাঃ) সময়কালে তিনি গুরুত্বপূর্ণ প্রশাসনিক পদে ছিলেন। হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি বসরা এবং কুফার গভর্নর হিসেবে দায়িত্ব পালন করেন।\n\nগভর্নরশিপ\n\nতাঁর প্রশাসনিক দক্ষতা ছিল অত্যন্ত উচ্চ মানের। তিনি জটিল পরিস্থিতিতেও সুশাসন প্রতিষ্ঠা করতেন। সামরিক বিজয়",
      "তিনি পারস্য বিজয়ের অভিযানেও অংশগ্রহণ করেন এবং গুরুত্বপূর্ণ সামরিক ভূমিকা পালন করেন। রাজনীতি ও কূটনীতি\n\nতিনি ছিলেন একজন দক্ষ কূটনীতিবিদ। তাঁর বুদ্ধিমত্তা অনেক জটিল রাজনৈতিক সমস্যা সমাধানে সাহায্য করত।\n\nহাদিস বর্ণনাকারী",
      "তিনি রাসূল (সাঃ)-এর হাদিস বর্ণনা করতেন এবং তাঁর জীবনের বিভিন্ন ঘটনা সম্পর্কে অবহিত ছিলেন। তাঁর ফিকহ\n\nতিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর সিদ্ধান্তগুলো ছিল বিচক্ষণতাপূর্ণ। মৃত্যু\n\nতিনি ৫০ হিজরিতে (৬৭০ খ্রিস্টাব্দে) কুফা শহরে ইন্তেকাল করেন। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে তাঁর রাজনৈতিক প্রজ্ঞা, প্রশাসনিক দক্ষতা এবং কূটনৈতিক জ্ঞানের এক অনন্য উদাহরণ।"
    ],
    "moral": "হযরত মুগীরা ইবনে শু'বাহ (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, প্রজ্ঞা এবং বাকপটুতা সামরিক ও প্রশাসনিক উভয় ক্ষেত্রেই সাফল্যের চাবিকাঠি।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "abdullah_ibn_amr_ibn_al_as",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুল্লাহ ইবনে আমর ইবনুল আস (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুল্লাহ ইবনে আমর (রাঃ)-এর পূর্ণ নাম হলো আব্দুল্লাহ ইবনে আমর ইবনে আল-আস আল-সাহমী আল-কুরাইশী। তিনি ছিলেন তাঁর পিতা আমর ইবনুল আস (রাঃ)-এর মতো একজন প্রখ্যাত মুহাদ্দিস ও ফকীহ। তাঁর উপাধি ছিল আবূ মুহাম্মদ। তিনি হাদিস বর্ণনা, ইবাদত এবং কিতাব সংকলনের জন্য বিখ্যাত ছিলেন। জন্ম ও ইসলাম গ্রহণ",
      "তিনি মক্কায় জন্মগ্রহণ করেন। তিনি তাঁর পিতা আমর ইবনুল আস (রাঃ)-এর আগেই ইসলাম গ্রহণ করেন।\n\nপিতার সঙ্গে পার্থক্য\n\nতাঁর পিতা ছিলেন একজন রাজনীতিবিদ ও সেনাপতি, আর আব্দুল্লাহ (রাঃ) ছিলেন মূলত একজন ইবাদতগুজার ও পণ্ডিত। হাদিস লেখক",
      "তিনি রাসূল (সাঃ)-এর অনুমতি নিয়ে তাঁর হাদিসগুলো লিখে রাখতেন। তাঁর সংকলিত গ্রন্থের নাম ছিল 'আস-সহীফাহ আস-সাদিকা'। এই সংকলনটিই মুসলিম ইতিহাসের প্রাচীনতম হাদিস সংকলনগুলোর মধ্যে অন্যতম।\n\nইবাদত\n\nতিনি ছিলেন অত্যধিক ইবাদতগুজার। তিনি প্রায় প্রতিদিনই রোজা রাখতেন এবং রাতে সালাত আদায় করতেন। রাসূল (সাঃ)-এর নির্দেশনা",
      "তাঁর অতিরিক্ত ইবাদতের কারণে রাসূল (সাঃ) তাঁকে কিছুটা সংযত হতে এবং তাঁর পরিবারকে সময় দিতে উপদেশ দেন। হাদিস বর্ণনাকারী\n\nতিনি প্রায় ৭০০টি হাদিস বর্ণনা করেন। তাঁর হাদিসগুলো ছিল অত্যন্ত নির্ভরযোগ্য।\n\nজ্ঞান ও ফিকহ",
      "তিনি ফিকহী মাসআলায় গভীর জ্ঞান রাখতেন এবং তাঁর ফতোয়াগুলো ছিল গুরুত্বপূর্ণ। সামরিক ভূমিকা\n\nতিনি রাসূল (সাঃ)-এর সকল সামরিক অভিযানে অংশগ্রহণ করেন। সিফফিনের যুদ্ধে অংশগ্রহণ\n\nহযরত আলী (রাঃ) এবং মুয়াবিয়া (রাঃ)-এর মধ্যকার সিফফিনের যুদ্ধে তিনি অনিচ্ছাসত্ত্বেও তাঁর পিতা আমর ইবনুল আস (রাঃ)-এর নির্দেশে মুয়াবিয়া (রাঃ)-এর পক্ষে অংশগ্রহণ করেন।",
      "রাজনৈতিক জীবন\n\nতাঁর জীবনের প্রধান আগ্রহ রাজনীতি নয়, বরং জ্ঞানচর্চা ও ইবাদত ছিল। মৃত্যু\n\nতিনি ৬৩ হিজরিতে (৬৮৩ খ্রিস্টাব্দে) মিশরে ইন্তেকাল করেন। তাঁর জীবনী",
      "তাঁর জীবনী ইসলামের ইতিহাসে হাদিস সংকলন এবং ইবাদতের প্রতি তাঁর নিরবচ্ছিন্ন নিষ্ঠার এক আদর্শ উদাহরণ।"
    ],
    "moral": "হযরত আব্দুল্লাহ ইবনে আমর (রাঃ)-এর জীবন প্রমাণ করে যে, জ্ঞান, বিশেষত হাদিস সংরক্ষণ এবং ইবাদতের প্রতি গভীর মনোযোগই জীবনের শ্রেষ্ঠ সম্পদ।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; ইমাম যাহাবী, সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "saad_ibn_abi_waqqas",
    "categoryId": "sahabider_jibon",
    "title": "সা'দ ইবনে আবী ওয়াক্কাস (রাঃ)",
    "paragraphs": [
      "হযরত সা'দ ইবনে আবী ওয়াক্কাস (রাঃ) ছিলেন মহানবী মুহাম্মদ (সাঃ)-এর অন্যতম প্রধান সাহাবী এবং আশারায়ে মুবাশশারাহ (জীবদ্দশায় জান্নাতের সুসংবাদপ্রাপ্ত দশজন)-এর অন্যতম। তিনি ছিলেন তাদের মধ্যে সর্বশেষ ইন্তেকালকারী। তাঁর পুরো নাম আবু ইসহাক সা'দ এবং পিতা আবু ওয়াক্কাস মালিক। তিনি কুরাইশ বংশের বনু যুহরা শাখার সন্তান। তার মাতার নাম হামনা বিনতে সুফিয়ান।",
      "জন্ম ও প্রারম্ভিক জীবন\n\nতিনি মক্কায় ৫৯৫ খ্রিস্টাব্দে জন্মগ্রহণ করেন। তার পিতা আবু ওয়াক্কাস মালিক ইবনে উহাইব ছিলেন কুরাইশ গোত্রের বনু যুহরা শাখার। উহাইব ইবনে আবদ মানাফ ছিলেন রাসূল (সাঃ)-এর মা আমিনা বিনতে ওয়াহাবের চাচা। এভাবে সা'দ (রাঃ) রাসূল (সাঃ)-এর মাতৃকুলের আত্মীয় ছিলেন।",
      "ইসলাম গ্রহণ\n\nহযরত আবু বকর (রাঃ) ছিলেন সা'দের অন্তরঙ্গ বন্ধু। আবু বকর (রাঃ)-এর দাওয়াতেই তিনি মাত্র ১৭ বছর বয়সে ইসলাম গ্রহণ করেন এবং তিনি ছিলেন ১৭তম ইসলাম গ্রহণকারী। সা'দ (রাঃ) বলেন, 'ইসলাম গ্রহণের পর আমি নিজেকে তৃতীয় মুসলমান হিসেবে দেখতে পেলাম।' আসলে তিনি রাসূলুল্লাহর (সাঃ) নবুওয়াত প্রাপ্তির সাথে সাথে ইসলাম গ্রহণ করেন; কিন্তু অনেকের মতই তখন তিনি প্রকাশ্যে ঘোষণা দেননি।",
      "মায়ের সাথে ঘটনা ও কুরআনের আয়াত নাযিল\n\nসা'দের ইসলাম গ্রহণের কথা শুনে তার মা হামনা হৈ চৈ ও বিলাপ শুরু করে দিলেন। মা পরিষ্কার বলে দিলেন, 'সা'দ যতক্ষণ মুহাম্মাদের রিসালাতের অস্বীকৃতির ঘোষণা না দেবে ততক্ষণ আমি কিছু খাব না, কিছু পান করব না, রৌদ্র থেকে বাঁচার জন্য ছায়াতেও আসব না।' সা'দ (রাঃ) বড় অস্থির হয়ে পড়লেন এবং রাসূলের (সাঃ) খিদমতে হাজির হয়ে সব ঘটনা বিবৃত করলেন।",
      "কুরআনের আয়াত নাযিল\n\nরাসূলের (সাঃ) নিকট থেকে জবাব পাওয়ার পূর্বেই সূরা আল-আনকাবুতের অষ্টম আয়াতটি নাযিল হল: 'وَوَصَّيْنَا الْإِنسَانَ بِوَالِدَيْهِ حُسْنًا ۖ وَإِن جَاهَدَاكَ لِتُشْرِكَ بِي مَا لَيْسَ لَكَ بِهِ عِلْمٌ فَلَا تُطِعْهُمَا' (আমি মানুষকে নির্দেশ দিয়েছি তার পিতামাতার প্রতি সদ্ব্যবহার করতে। তবে তারা যদি তোমার ওপর বল প্রয়োগ করে আমার সাথে এমন কিছু শরীক করতে বলে যার সম্পর্কে তোমার কোন জ্ঞান নেই, তুমি তাদের মেনো না।) - সূরা আনকাবুত: ৮",
      "মায়ের কাছে দৃঢ় অবস্থান\n\nতার মা তিনদিন পর্যন্ত কিছু মুখে দিলেন না। বার বার তিনি মার কাছে এসে বুঝাবার চেষ্টা করলেন; কিন্তু মায়ের একই কথা। অবশেষে তিনি মার মুখের ওপর বলে দিতে বাধ্য হলেন, 'মা, আপনার মতো হাজারটি মাও যদি আমার ইসলাম ত্যাগ করার ব্যাপারে জিদ করে পানাহার ছেড়ে দেয় এবং প্রাণ বিসর্জন দেয়, তবুও সত্য দ্বীন পরিত্যাগ করা আমার পক্ষে সম্ভব নয়।' সা'দের এ চরম সত্য কথাটি তার মার অন্তরে দাগ কাটে এবং অবশেষে তিনিও ইসলাম গ্রহণ করেন।",
      "মদীনায় হিজরত\n\nহযরত মুসআব ইবন উমাইর (রাঃ) ও ইবন উম্মে মাকতুমের মক্কা থেকে মদীনায় হিজরতের পর যে চার ব্যক্তি মদীনায় হিজরত করেন তাঁদের একজন সা'দ ইবন আবী ওয়াক্কাস। সহীহ বুখারীতে বারা ইবন আযিব (রাঃ) থেকে বর্ণিত, 'সর্বপ্রথম আমাদের নিকট আগমণ করেন মুসআব ইবন উমাইর ও ইবন উম্মে মাকতুম। অতঃপর বিলাল, সা'দ ও আম্মার বিন ইয়াসির আগমন করেন।'",
      "তীরন্দাজ হিসেবে খ্যাতি\n\nহযরত সা'দ (রাঃ) ছিলেন ইসলামের ইতিহাসের অন্যতম শ্রেষ্ঠ তীরন্দাজ। রাসূল (সাঃ) উহুদের যুদ্ধে তাঁকে বলেছিলেন, 'ارْمِ سَعْدُ فِدَاكَ أَبِي وَأُمِّي' (তীর ছোড়ো সা'দ! আমার পিতা-মাতা তোমার জন্য কুরবান!) এটি ছিল রাসূল (সাঃ)-এর পক্ষ থেকে সর্বোচ্চ সম্মান। রাসূল (সাঃ) তাঁর জন্য পিতা-মাতা উভয়কে উৎসর্গ করার কথা বলেছিলেন, যা অন্য কারো জন্য বলেননি।",
      "পারস্য বিজয় ও আল-কাদিসিয়্যার যুদ্ধ\n\n৬৩৬ খ্রিস্টাব্দে হযরত উমর (রাঃ)-এর খিলাফতকালে তিনি পারস্য সাম্রাজ্যের বিরুদ্ধে আল-কাদিসিয়্যার যুদ্ধে মুসলিম বাহিনীর সর্বাধিনায়ক ছিলেন। এই যুদ্ধে তিনি পারস্যের বিশাল বাহিনীকে পরাজিত করেন এবং পারস্য সাম্রাজ্যের পতন ঘটান। এই বিজয়ের মাধ্যমে ইরাক ও পারস্য মুসলিমদের অধীনে আসে।",
      "চীন ও বাংলায় ইসলাম প্রচার\n\n৬৪৬ ও ৬৫১ খ্রিস্টাব্দে তাঁকে কূটনৈতিক দায়িত্ব দিয়ে চীন পাঠানো হয়। ধারণা করা হয় যে, নৌ রুটে চীন যাওয়ার পথে তিনি চট্টগ্রাম বন্দরে থেমেছিলেন এবং বাংলাকে ইসলামের সাথে পরিচয় করানোয় তাঁর অবদান রয়েছে। ধারণা করা হয়, তিনি ৬৪৮ খ্রিস্টাব্দে বাংলাদেশের লালমনিরহাটে একটি মসজিদ নির্মাণ করেন, যা স্থানীয়ভাবে আবু আক্কাস মসজিদ নামে পরিচিত।",
      "স্বভাব ও চরিত্র\n\nইবনে ইসহাক বর্ণনা করেন, রাসূলুল্লাহর (সাঃ) সাহাবীদের মধ্যে চারজন ছিলেন সর্বাধিক কঠোর: উমর, আলী, যুবাইর এবং সা'দ (রাঃ)। হযরত সা'দের মধ্যে কাব্য প্রতিভাও ছিল। প্রাচীন সূত্রগুলিতে তার কিছু কবিতা সংকলিত হয়েছে। তিনি ছিলেন অত্যন্ত সাহসী, দৃঢ়চেতা এবং আল্লাহভীরু।",
      "কবুল হওয়া দোয়া\n\nরাসূল (সাঃ) তাঁর সম্পর্কে বলেছেন, 'اللَّهُمَّ اسْتَجِبْ لِسَعْدٍ إِذَا دَعَاكَ' (হে আল্লাহ! সা'দ যখন তোমার কাছে দোয়া করবে, তখন তা কবুল করো।) এই কারণে তাঁর দোয়া সর্বদা কবুল হতো। রাসূল (সাঃ) আরও বলেছেন, 'هَذَا خَالِي فَلْيُرِنِي امْرُؤٌ خَالَهُ' (এই আমার মামা, কেউ যদি তার মামা দেখাতে পারে!) - কারণ সা'দ (রাঃ) ছিলেন রাসূল (সাঃ)-এর মাতৃকুলের।",
      "ইন্তেকাল\n\nহযরত সা'দ (রাঃ) মদীনা থেকে দশ মাইল দূরে আকীক উপত্যকায় কিছুদিন অসুস্থ থাকার পর হিজরী ৫৫ সনে ৮৫ বছর বয়সে ইন্তেকাল করেন। গোসল ও কাফনের পর লাশ মদীনায় আনা হয়। মদীনার তৎকালীন গভর্নর মারওয়ান জানাযার ইমামতি করেন। উম্মুল মু'মিনীন হযরত আয়িশা (রাঃ) ও অন্যান্য আযওয়াজে মুতাহহারাহ তাঁর জানাযায় অংশগ্রহণ করেন।",
      "মরণকালের ঘটনা\n\nমরণকালে হযরত সা'দ (রাঃ) বহু অর্থ-সম্পদের অধিকারী ছিলেন। তা সত্ত্বেও তিনি একটি অতি পুরাতন পশমী জুব্বা চেয়ে নিয়ে বলেন, 'এ দিয়েই তোমরা আমাকে কাফন দেবে। এ জুব্বা পরেই আমি বদর যুদ্ধে কাফিরদের বিরুদ্ধে লড়েছি। আমার ইচ্ছা, এটা নিয়েই আমি আল্লাহর দরবারে উপস্থিত হই।' তাঁর ছেলে মুসআব বলেন, তাঁর মুমূর্ষ অবস্থায় তিনি বলেন, 'আমার জন্য কেঁদো না। আল্লাহ কক্ষণো আমাকে শাস্তি দেবেন না, আমি জান্নাতবাসী।'"
    ],
    "moral": "হযরত সা'দ (রাঃ)-এর জীবন প্রমাণ করে যে, আল্লাহর পথে দৃঢ়তা, সামরিক দক্ষতা এবং মায়ের চেয়েও ঈমানকে প্রাধান্য দেওয়া একজন মুসলিমকে মহান বিজয়ের নায়ক এবং জান্নাতবাসী বানাতে পারে।",
    "source": "সহীহ বুখারী; সহীহ মুসলিম; তিরমিযী; ইমাম ইবনে কাসীর, আল-বিদায়া ওয়ান নিহায়া; হায়াতুস সাহাবা"
  },
  {
    "id": "salman_farsi",
    "categoryId": "sahabider_jibon",
    "title": "সালমান ফারসি (রাঃ)",
    "paragraphs": [
      "হযরত সালমান আল-ফারসি (রাঃ) ছিলেন রাসূল মুহাম্মদ (সাঃ)-এর একজন মহান সাহাবী। তিনি পারস্যে জন্মগ্রহণ করেন এবং সত্যের সন্ধানে বিভিন্ন ধর্ম অনুসরণ করার পর ইসলাম গ্রহণ করেন।",
      "জন্ম ও প্রারম্ভিক জীবন\n\nসালমান ৫৩১-৫৭০ খ্রিস্টাব্দের মধ্যে পারস্যের ফার্স বা ইসপাহান প্রদেশে জন্মগ্রহণ করেন। তিনি জরথুস্ট্রিয়ান পরিবারে বেড়ে ওঠেন এবং ষোল বছর পুরোহিত হওয়ার জন্য অধ্যয়ন করেন।",
      "খ্রিস্টধর্মে আকৃষ্ট\n\n৫৮৭ সালে তিনি নেস্টোরিয়ান খ্রিস্টানদের সাথে সাক্ষাৎ করেন এবং তাদের দ্বারা প্রভাবিত হন। পিতার ইচ্ছার বিরুদ্ধে গিয়ে তিনি পরিবার ত্যাগ করেন। পরিবার তাকে বন্দী করলেও তিনি পালিয়ে যান।",
      "সত্যের অন্বেষণ\n\nসত্যের সন্ধানে তিনি মধ্যপ্রাচ্যে ঘুরে ঘুরে পুরোহিত ও পণ্ডিতদের সাক্ষাৎ করেন। সিরিয়ায় তিনি শেষ নবীর আগমনের ভবিষ্যদ্বাণী শুনেন। আরবে যাওয়ার পথে তাকে দাস হিসেবে বিক্রি করা হয় এবং মদীনার এক ইহুদীর কাছে নিয়ে যাওয়া হয়।",
      "ইসলাম গ্রহণ\n\nরাসূল (সাঃ)-এর সাথে সাক্ষাতের পর তিনি নবীর লক্ষণগুলি চিনতে পারেন এবং ইসলাম গ্রহণ করেন। রাসূল (সাঃ)-এর সাহায্যে তিনি স্বাধীনতা লাভ করেন। তিনি ছিলেন প্রথম ইরানি যিনি ইসলাম গ্রহণ করেন।",
      "খন্দকের যুদ্ধ\n\nখন্দকের যুদ্ধে ১০,০০০ কুরাইশ সৈন্য মদীনা আক্রমণ করলে সালমানের পরামর্শে মদিনার চারপাশে পরিখা খনন করা হয়। এটি ছিল সাসানীয় সামরিক কৌশল। এই কৌশলের মাধ্যমে মুসলিমরা বিজয়ী হন।",
      "আহলে বাইত\n\nমুহাজির ও আনসার উভয়েই দাবি করেন সালমান তাদের দলভুক্ত। রাসূল (সাঃ) বলেন: سَلْمَانُ مِنَّا أَهْلَ الْبَيْتِ (সালমান আমাদের আহলে বাইতের একজন।) এটি ছিল সর্বোচ্চ সম্মান।",
      "মর্যাদা\n\nআবু হুরায়রা (রাঃ) তাকে 'আবু আল-কিতাবায়েন' (দুই বইয়ের জনক - বাইবেল ও কুরআন) বলেন। আলী (রাঃ) তাকে 'লুকমান আল-হাকিম' (জ্ঞানী) বলে সম্মান করেন।",
      "পারস্য বিজয়\n\nতিনি পারস্য বিজয়ে অংশ নেন এবং উমর (রাঃ)-এর সময়ে চেটেসিফোনের প্রথম গভর্নর হন। পরে আলী (রাঃ) তাকে আল-মাদাইনের গভর্নর নিযুক্ত করেন।",
      "কুরআন অনুবাদ\n\nতিনি ফার্সি ভাষায় কুরআনের অনুবাদ করেন। তিনি ইতিহাসে প্রথম ব্যক্তি যিনি কুরআনকে বিদেশী ভাষায় অনুবাদ করেন।"
    ],
    "moral": "সালমান ফারসি (রাঃ)-এর জীবন প্রমাণ করে যে সত্যের সন্ধানে যে কেউ যেকোনো দূরত্ব অতিক্রম করতে পারে এবং আল্লাহ তাকে হেদায়েত দান করেন।",
    "source": "সহীহ বুখারী; সীরাতে ইবনে হিশাম"
  },
  {
    "id": "abdur_rahman_ibn_auf",
    "categoryId": "sahabider_jibon",
    "title": "আব্দুর রহমান ইবনে আউফ (রাঃ)",
    "paragraphs": [
      "হযরত আব্দুর রহমান ইবনে আউফ (রাঃ) (মৃত্যু: ৩১ হিজরি/৬৫২ খ্রিষ্টাব্দ) ছিলেন আশারায়ে মুবাশশারাহ-এর অন্যতম এবং ইসলামের ইতিহাসের অন্যতম ধনী ও দানশীল সাহাবী।",
      "নাম পরিবর্তন\n\nজাহিলী যুগে তার নাম ছিল 'আবদু আমর' (আমরের দাস)। ইসলাম গ্রহণের পর রাসূল (সাঃ) তার নাম রাখেন 'আব্দুর রহমান' (সবচেয়ে দয়াবানের দাস)। তিনি যুহরা গোত্রের সন্তান।",
      "ইসলাম গ্রহণ\n\nআবু বকর (রাঃ)-এর দাওয়াতে তিনি ইসলাম গ্রহণ করেন। তিনি ছিলেন ইসলাম গ্রহণকারী প্রথম ৮ জনের অন্যতম।",
      "আবিসিনিয়ায় হিজরত\n\n৬১৪ সালে কুরাইশদের নির্যাতন বৃদ্ধি পেলে তিনি আবিসিনিয়ায় হিজরত করেন। নাজাশি তাদের নিরাপত্তা প্রদান করেন। ৬১৯-৬২০ সালে তিনি মক্কায় ফিরে আসেন।",
      "মদীনায় হিজরত\n\n৬২২ সালে তিনি মদিনায় হিজরত করেন। রাসূল (সাঃ) তাকে সা'দ ইবনে রাবী' (রাঃ)-এর সাথে ভ্রাতৃত্ব বন্ধনে আবদ্ধ করেন। সা'দ সম্পদের অর্ধেক দিতে চাইলে তিনি বলেন: আমাকে শুধু বাজারের পথ দেখিয়ে দিন। তিনি ব্যবসা শুরু করেন এবং সফল হন।",
      "দুমাতুল জান্দাল অভিযান\n\n৬২৬ সালে রাসূল (সাঃ) তাকে দুমাতুল জান্দালের কালব গোত্রের উপর অভিযান চালনার নির্দেশ দেন। তিনি ৩ দিন দাওয়াত দেন এবং কালব গোত্র মুসলমান হয়। রাসূল (সাঃ)-এর নির্দেশে তিনি গোত্রপতির কন্যা তুমারিযকে বিয়ে করেন।",
      "দানশীলতা\n\nতিনি ৫০০ ঘোড়া ও ৫০০ উট আল্লাহর রাস্তায় দান করেন। তাবুক যুদ্ধে বিশাল অর্থ দান করেন। রাসূল (সাঃ) বলেন: عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ فِي الْجَنَّةِ (আব্দুর রহমান ইবনে আউফ জান্নাতে।)",
      "খিলাফত নির্বাচন\n\n৬৪৪ সালে উমর (রাঃ) মৃত্যুর আগে ছয় সদস্যের বোর্ড গঠন করেন। এই বোর্ডে আব্দুর রহমানও ছিলেন এবং তিনি উসমান (রাঃ)-কে খলিফা নির্বাচনে ভূমিকা রাখেন।",
      "মৃত্যু\n\nতিনি হিজরি ৩২ সনে ৭২-৭৫ বছর বয়সে ইন্তেকাল করেন। উসমান (রাঃ) বা যুবাইর (রাঃ) জানাযার ইমামতি করেন। তাকে মদীনার বাকী' গোরস্থানে দাফন করা হয়। মৃত্যুকালে তিনি বিশাল সম্পদের অধিকারী ছিলেন কিন্তু অত্যন্ত বিনয়ী ছিলেন।"
    ],
    "moral": "আব্দুর রহমান ইবনে আউফ (রাঃ)-এর জীবন প্রমাণ করে যে সততা ও দানশীলতার সাথে সম্পদ অর্জন এবং আল্লাহর পথে ব্যয় করা একজন মুসলিমের শ্রেষ্ঠ গুণ।",
    "source": "সহীহ বুখারী; তিরমিযী"
  }
]