[
  {
    "id": "abu-bakr-nobir-mrityu",
    "categoryId": "sahabider_jibon_theke",
    "title": "আবু বকর (রাঃ) এর সেই অবিচল ভাষণ",
    "summary": "",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) এর ইন্তেকালের খবর ছড়িয়ে পড়ার সাথে সাথে পুরো মদিনা যেন এক শোকের সমুদ্রে ডুবে গেল। সাহাবীরা দিশেহারা হয়ে পড়লেন, অনেকেই এই বাস্তবতা মেনে নিতে পারছিলেন না। হযরত উমর (রাঃ) এর মতো দৃঢ় মানুষও তলোয়ার হাতে বলে বেড়াচ্ছিলেন, \"যে বলবে রাসূল (সাঃ) মারা গেছেন, আমি তার শিরশ্ছেদ করব!\"",
      "এমন এক চরম বিশৃঙ্খল ও আবেগঘন মুহূর্তে হযরত আবু বকর (রাঃ) সম্পূর্ণ শান্ত ও অবিচল ছিলেন। তিনি সোজা নবীজির (সাঃ) হুজরায় প্রবেশ করলেন, তাঁর পবিত্র কপালে চুম্বন করলেন এবং বেরিয়ে এসে সমবেত উত্তেজিত জনতার সামনে দাঁড়ালেন।",
      "প্রথমে তিনি হযরত উমর (রাঃ)-কে শান্ত হতে বললেন। এরপর জনতার দিকে ফিরে আল্লাহর প্রশংসা করে তিনি ইতিহাসের সেই বিখ্যাত ভাষণটি দিলেন, যা স্বর্ণাক্ষরে লেখা থাকবে।",
      "তিনি বললেন,",
      "'مَنْ كَانَ يَعْبُدُ مُحَمَّدًا فَإِنَّ مُحَمَّدًا قَدْ مَاتَ، وَمَنْ كَانَ يَعْبُدُ اللَّهَ فَإِنَّ اللَّهَ حَيٌّ لَا يَمُوتُ'",
      "\"শোনো! তোমাদের মধ্যে যারা মুহাম্মদের উপাসনা করতে, তারা জেনে রাখো, মুহাম্মদ (সাঃ) মৃত্যুবরণ করেছেন। আর যারা আল্লাহর উপাসনা করো, তারা জেনে রাখো, আল্লাহ চিরঞ্জীব, তিনি কখনো মৃত্যুবরণ করবেন না।\"",
      "এরপর তিনি পবিত্র কুরআনের আয়াতটি তিলাওয়াত করলেন:",
      "'وَمَا مُحَمَّدٌ إِلَّا رَسُولٌ قَدْ خَلَتْ مِن قَبْلِهِ الرُّسُلُ ۚ أَفَإِن مَّاتَ أَوْ قُتِلَ انقَلَبْتُمْ عَلَىٰ أَعْقَابِكُمْ'",
      "\"আর মুহাম্মদ তো একজন রাসূল মাত্র; তাঁর পূর্বে বহু রাসূল গত হয়েছেন। সুতরাং যদি তিনি মারা যান অথবা নিহত হন, তবে কি তোমরা পেছনে ফিরে যাবে?\"** **(সূরা আলে ইমরান: ১৪৪)",
      "এই আয়াত এবং হযরত আবু বকর (রাঃ) এর ভাষণ শোনার সাথে সাথে সাহাবীদের সম্বিত ফিরে এলো। হযরত উমর (রাঃ) বলেন, \"আবু বকরের মুখে আয়াতটি শোনার পর আমার মনে হলো যেন আমি তা প্রথমবারের মতো শুনছি। আমার পা দুটি অবশ হয়ে গেল এবং আমি মাটিতে বসে পড়লাম।\" এভাবেই আবু বকর (রাঃ) এর প্রজ্ঞা ও ঈমানী দৃঢ়তা সদ্য অভিভাবকহীন মুসলিম উম্মাহকে এক ভয়ংকর গৃহযুদ্ধ ও পতনের হাত থেকে রক্ষা করেছিল।"
    ],
    "moral": "নেতৃত্বের সবচেয়ে বড় পরীক্ষা আসে সংকটময় মুহূর্তে। ঈমানী দৃঢ়তা, প্রজ্ঞা এবং সঠিক সময়ে সঠিক সিদ্ধান্তই একটি জাতিকে ধ্বংসের হাত থেকে রক্ষা করতে পারে।",
    "source": "সহীহ আল-বুখারী (হাদিস নং:** ৩৬৬৭, ৩৬৬৮); সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "umar-r-daiittobodh",
    "categoryId": "sahabider_jibon_theke",
    "title": "খলিফা উমরের পিঠে আটার বস্তা",
    "paragraphs": [
      "ইসলামের দ্বিতীয় খলিফা হযরত উমর (রাঃ) প্রায়ই রাতের আঁধারে ছদ্মবেশে মদিনার অলিগলিতে ঘুরে বেড়াতেন প্রজাদের দুঃখ-কষ্ট নিজের চোখে দেখার জন্য। এক রাতে তিনি মদিনার বাইরে একটি তাঁবুতে আলো জ্বলতে দেখলেন।",
      "কাছে গিয়ে তিনি দেখলেন, কয়েকটি শিশু ক্ষুধার যন্ত্রণায় কাঁদছে আর তাদের মা চুলার ওপর একটি পাত্রে শুধু পানি ফুটিয়ে তাদের সান্ত্বনা দেওয়ার বৃথা চেষ্টা করছেন।",
      "হযরত উমর (রাঃ) সেই নারীকে সালাম দিয়ে তাঁর কষ্টের কারণ জানতে চাইলেন। নারীটি খলিফাকে না চিনেই ক্ষোভের সাথে বললেন,",
      "\"আমাদের খবর নেওয়ার দায়িত্ব খলিফা উমরের। কিন্তু সে আমাদের কোনো খোঁজই রাখেনি। কিয়ামতের দিনে আমি আল্লাহর কাছে এর বিচার চাইব।\"",
      "এই কথা শুনে খলিফা উমর (রাঃ) ভয়ে কেঁপে উঠলেন। তিনি এক মুহূর্তও দেরি না করে সোজা রাষ্ট্রীয় কোষাগার বা বাইতুল মালে ছুটে গেলেন। সেখান থেকে তিনি একটি বস্তায় আটা, তেল, খেজুর এবং প্রয়োজনীয় সবকিছু ভরলেন।",
      "যখন তাঁর খাদেম বস্তাটি উঠিয়ে দিতে চাইলেন, তখন তিনি বললেন,",
      "\"তুমি কি কিয়ামতের দিনে আমার পাপের বোঝা বহন করবে? আজ এই বস্তা আমাকেই বহন করতে হবে।\"",
      "এই বলে তিনি নিজেই পিঠে করে আটার বস্তাটি বয়ে নিয়ে সেই নারীর তাঁবুতে পৌঁছালেন। তিনি নিজ হাতে চুলায় আগুন জ্বালিয়ে খাবার রান্না করলেন এবং সেই অভুক্ত মা ও শিশুদের পেট ভরে খাওয়ালেন। শিশুরা পেট ভরে খেয়ে হাসতে হাসতে ঘুমিয়ে পড়ল। সেই দৃশ্য দেখে তিনি স্বস্তির নিঃশ্বাস ফেলে বললেন,",
      "\"আমি নিজ চোখে তাদের কান্না দেখে গিয়েছিলাম, এখন তাদের হাসি দেখে ফিরছি।\""
    ],
    "moral": "শাসকের দায়িত্ব প্রজাদের ওপর শাসন করা নয়, বরং তাদের সেবা করা। একজন সত্যিকারের নেতা তার প্রজাদের কষ্টের জন্য নিজেকে আল্লাহর কাছে দায়ী মনে করেন।",
    "source": "ইবনে কাসিরের 'আল-বিদায়া ওয়ান-নিহায়ا'; 'তারীখ আত-তাবারী'।"
  },
  {
    "id": "umar-r-islam-grohon",
    "categoryId": "sahabider_jibon_theke",
    "title": "উমর (রাঃ) এর ইসলাম গ্রহণ",
    "paragraphs": [
      "ইসলাম গ্রহণের পূর্বে উমর (রাঃ) ছিলেন মুসলিমদের কঠোরতম শত্রুদের একজন। একদিন তিনি রাসূলুল্লাহ (সাঃ)-কে হত্যা করার উদ্দেশ্যে খোলা তলোয়ার নিয়ে বেরিয়ে পড়েন। পথিমধ্যে এক ব্যক্তি তাঁকে তাঁর নিজের বোন ফাতিমা ও ভগ্নিপতি সা'ঈদ (রাঃ) এর ইসলাম গ্রহণের খবর দেন।",
      "খবর শুনে তিনি ক্রোধে উন্মত্ত হয়ে বোনের বাড়ির দিকে ছোটেন। ঘরের ভেতর থেকে তিনি হযরত খাব্বাব (রাঃ) এর কন্ঠে সূরা ত্বহা-এর তিলাওয়াত শুনতে পান। তিনি ঘরে প্রবেশ করেই তাঁর ভগ্নিপতিকে মারধর শুরু করেন। বোন তাঁকে বাঁচাতে এলে তাঁকেও আঘাত করে রক্তাক্ত করে দেন।",
      "বোনের দৃঢ়তা দেখে উমরের হৃদয়ে কিছুটা পরিবর্তন আসে। তিনি বলেন, \"তোমরা যা পড়ছিলে, তা আমাকে দেখাও।\" বোন তাঁকে পবিত্র হয়ে এসে কুরআন স্পর্শ করতে বলেন। উমর (রাঃ) পবিত্র হয়ে এসে সূরা ত্বহা-এর আয়াতগুলো পড়েন।",
      "কুরআনের বাণী তাঁর পাথরের মতো কঠিন অন্তরে প্রবেশ করে তা গলিয়ে দেয়। তিনি বলেন, \"এটি কতই না সুন্দর ও সম্মানিত বাণী! আমাকে মুহাম্মাদের কাছে নিয়ে চলো।\"",
      "এরপর তিনি সেই খোলা তলোয়ার নিয়েই রাসূলুল্লাহ (সাঃ) এর কাছে দারুল আরকামে উপস্থিত হন। সাহাবীরা তাঁকে দেখে ভয় পেয়ে গেলেও হযরত হামযা (রাঃ) বলেন, \"তাকে আসতে দাও। যদি সে ভালো উদ্দেশ্যে আসে, তবে ভালো। অন্যথায় তার তলোয়ার দিয়েই তাকে হত্যা করা হবে।\"",
      "রাসূলুল্লাহ (সাঃ) তাঁর চাদর ধরে শক্ত করে টেনে বলেন, \"হে খাত্তাবের পুত্র! কীজন্য এসেছ?\" উমর (রাঃ) তখন ঈমানের ঘোষণা দেন:",
      "'أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّكَ رَسُولُ اللَّهِ'",
      "তাঁর ইসলাম গ্রহণে মুসলিম শিবিরে আনন্দের বন্যা বয়ে যায়। তাঁর কারণেই মুসলিমরা প্রথমবারের মতো কাবা প্রাঙ্গণে প্রকাশ্যে সালাত আদায়ের সাহস পেয়েছিলেন।"
    ],
    "moral": "আল্লাহ যার জন্য হিদায়াত চান, তার অন্তরকে তিনি নিজেই ঘুরিয়ে দেন। কুরআনের বাণী পাথরের মতো কঠিন অন্তরকেও গলিয়ে ফেলার ক্ষমতা রাখে।",
    "source": "সীরাতে ইবনে হিশাম; তাবাকাত ইবনে সা'দ।"
  },
  {
    "id": "usman-r-rumer-kup",
    "categoryId": "sahabider_jibon_theke",
    "title": "উসমান (রাঃ) এর রুমা কূপ ক্রয়",
    "paragraphs": [
      "মক্কা থেকে হিজরত করে মদিনায় আসার পর মুসলিমরা সুপেয় পানির তীব্র সংকটে পড়েন। মদিনায় 'রুমা' নামক একটি কূপ ছিল, যার পানি ছিল অত্যন্ত সুস্বাদু। কিন্তু কূপটির মালিক ছিল একজন ইহুদি এবং সে চড়া দামে পানি বিক্রি করত।",
      "মুসলিমদের এই কষ্ট দেখে আল্লাহর রাসূল (সাঃ) ঘোষণা করলেন:",
      "'مَنْ يَشْتَرِي بِئْرَ رُومَةَ فَيَكُونُ دَلْوُهُ فِيهَا كَدِلَاءِ الْمُسْلِمِينَ بِخَيْرٍ لَهُ مِنْهَا فِي الْجَنَّةِ'",
      "\"যে ব্যক্তি রুমা কূপটি ক্রয় করে মুসলিমদের জন্য ওয়াকফ করে দেবে, তার জন্য জান্নাতে এর চেয়েও উত্তম ঝর্ণা থাকবে।\"",
      "রাসূল (সাঃ) এর এই আহ্বান শুনে হযরত উসমান (রাঃ) সেই ইহুদির কাছে কূপটি কেনার প্রস্তাব নিয়ে গেলেন। ইহুদি লোকটি তার ব্যবসার ক্ষতি হবে ভেবে পুরো কূপ বিক্রি করতে রাজি হলো না।",
      "তখন উসমান (রাঃ) অর্ধেক কূপ ১২,০০০ দিরহামের বিনিময়ে কিনে নিলেন এই শর্তে যে, একদিন কূপের পানি তুলবে ইহুদি এবং আরেকদিন তুলবেন উসমান (রাঃ)।",
      "হযরত উসমান (রাঃ) নিজের মালিকানার দিনে মুসলিমদের বিনামূল্যে পানি নেওয়ার অনুমতি দিয়ে দিলেন এবং সবাইকে পরের দিনের জন্যও পর্যাপ্ত পানি সংগ্রহ করতে বললেন। ফলে, ইহুদির পালা আসার দিনে তার কাছ থেকে কেউ আর পানি কিনত না।",
      "এতে ইহুদি লোকটি বাধ্য হয়ে বাকি অর্ধেকও উসমান (রাঃ) এর কাছে বিক্রি করে দেয়। হযরত উসমান (রাঃ) পুরো কূপটি কিনে নিয়ে তা সকল মানুষের জন্য ওয়াকফ বা উৎসর্গ করে দেন। সেই কূপটি আজও 'বিরে উসমান' বা উসমানের কূপ নামে পরিচিত।"
    ],
    "moral": "জনকল্যাণে সম্পদ ব্যয় করা ইসলামের অন্যতম বড় শিক্ষা। বিচক্ষণতা ও সঠিক পরিকল্পনা দ্বারা অনেক বড় সামাজিক সমস্যার সমাধান করা সম্ভব।",
    "source": "সহীহ আল-বুখারী; সিয়ারু আ'লামিন নুবালা।"
  },
  {
    "id": "ali-r-bormo-bichar",
    "categoryId": "sahabider_jibon_theke",
    "title": "খলিফা আলী (রাঃ) ও ইহুদির বর্ম",
    "paragraphs": [
      "খলিফা হযরত আলী (রাঃ) এর প্রিয় লৌহবর্মটি হারিয়ে যায়। কিছুদিন পর তিনি কুফার বাজারে এক ইহুদি ব্যক্তিকে সেই বর্মটি বিক্রি করতে দেখেন। তিনি ইহুদিকে বর্মটি তাঁর নিজের বলে দাবি করেন, কিন্তু ইহুদি লোকটি তা অস্বীকার করে।",
      "তাঁরা দুজনেই তৎকালীন কাজী বা প্রধান বিচারপতি শুরাইহ এর দরবারে উপস্থিত হলেন, যাঁকে হযরত আলী (রাঃ) নিজেই নিয়োগ দিয়েছিলেন।",
      "বিচারক শুরাইহ নিয়ম অনুযায়ী বাদীর কাছে সাক্ষী চাইলেন। তিনি আলী (রাঃ) কে বললেন, \"হে আমিরুল মুমিনিন, আপনার দাবির পক্ষে দুজন সাক্ষী পেশ করুন।\"",
      "হযরত আলী (রাঃ) তাঁর পুত্র হাসান (রাঃ) এবং তাঁর ভৃত্যকে সাক্ষী হিসেবে পেশ করলেন। কিন্তু কাজী শুরাইহ বললেন, \"ইসলামের বিধান অনুযায়ী, পিতার পক্ষে পুত্রের সাক্ষ্য গ্রহণযোগ্য নয়। আপনার আর একজন সাক্ষী প্রয়োজন।\"",
      "যেহেতু আলী (রাঃ) আর কোনো সাক্ষী হাজির করতে পারলেন না, তাই কাজী শুরাইহ আইন অনুযায়ী খলিফার বিরুদ্ধেই রায় দিলেন এবং বর্মটি ইহুদির মালিকানায় বহাল রাখলেন।",
      "বিচারব্যবস্থার এমন নিরপেক্ষতা দেখে সেই ইহুদি ব্যক্তিটি অভিভূত হয়ে গেল। সে বলল, \"আমি সাক্ষ্য দিচ্ছি, এই বিচারব্যবস্থা নবীদের বিচারব্যবস্থার মতোই। আমিরুল মুমিনিন নিজে আমাকে বিচারকের সামনে হাজির করেছেন এবং বিচারক তাঁরই বিরুদ্ধে রায় দিয়েছেন!\" এরপর সে স্বীকার করল যে, বর্মটি সত্যিই আলী (রাঃ) এর ছিল এবং সে ইসলাম গ্রহণ করল।"
    ],
    "moral": "ইসলামের দৃষ্টিতে আইনের ঊর্ধ্বে কেউ নয়, এমনকি স্বয়ং রাষ্ট্রপ্রধানও। ন্যায়বিচার হলো একটি ইসলামী রাষ্ট্রের ভিত্তি, যেখানে শাসক ও সাধারণ নাগরিকের মধ্যে কোনো ভেদাভেদ করা হয় না।",
    "source": "সুনানে কুবরা লিল-বায়হাকী; আল-বিদায়া ওয়ান-নিহায়া।"
  },
  {
    "id": "nuayman-ibn-amr-prank",
    "categoryId": "sahabider_jibon_theke",
    "title": "নু'আইমান (রাঃ) এর হাস্যরস",
    "paragraphs": [
      "হযরত নু'আইমান ইবনে আমর (রাঃ) ছিলেন একজন বদরী সাহাবী এবং তাঁর মাঝে চমৎকার রসবোধ ছিল। তিনি প্রায়ই রাসূলুল্লাহ (সাঃ) এবং অন্যান্য সাহাবীদের সাথে নির্মল মজা করতেন, যা নবীজি (সাঃ) উপভোগ করতেন।",
      "একবার মদিনার বাজারে এক বিক্রেতা উৎকৃষ্ট মানের মধু নিয়ে বসেছিল। নু'আইমান (রাঃ) তার কাছ থেকে এক পাত্র মধু নিলেন। এরপর তিনি সোজা রাসূলুল্লাহ (সাঃ) এর বাড়িতে গিয়ে নবীজিকে সেই মধু উপহার হিসেবে দিলেন। নবীজি (সাঃ) খুশি হয়ে উপহার গ্রহণ করলেন।",
      "এরপর নু'আইমান (রাঃ) মধু বিক্রেতার কাছে ফিরে এসে বললেন, \"তুমি আমার সাথে চলো, রাসূলুল্লাহ (সাঃ) এর কাছ থেকে তোমার মধুর দাম নিয়ে নেবে।\" সরল বিশ্বাসে বিক্রেতা তাঁর সাথে চলল।",
      "রাসূলুল্লাহ (সাঃ) এর বাড়ির সামনে এসে নু'আইমান (রাঃ) বাইরে দাঁড়িয়ে গেলেন এবং বিক্রেতাকে ভেতরে পাঠিয়ে দিয়ে বললেন, \"ভেতরে যাও, আল্লাহর রাসূল তোমাকে দাম দিয়ে দেবেন।\" এই বলে তিনি সেখান থেকে সরে পড়লেন।",
      "বিক্রেতা ভেতরে গিয়ে নবীজি (সাঃ) এর কাছে মধুর দাম চাইলে তিনি অবাক হয়ে বললেন, \"এটা তো নু'আইমান আমাকে উপহার হিসেবে দিয়েছে!\" তখন তিনি পুরো ঘটনা বুঝতে পারলেন।",
      "রাসূলুল্লাহ (সাঃ) লোকটির মধুর দাম পরিশোধ করে দিলেন। পরে যখন নু'আইমান (রাঃ) এর সাথে দেখা হলো, তখন নবীজি (সাঃ) হাসতে হাসতে জিজ্ঞেস করলেন, \"নু'আইমান, তুমি এমনটি কেন করলে?\"",
      "নু'আইমান (রাঃ) সরলভাবে উত্তর দিলেন, \"ইয়া রাসূলাল্লাহ! আমার খুব ইচ্ছা ছিল আপনি এই ভালো মধুটা খান, কিন্তু আমার কাছে দাম দেওয়ার মতো কোনো টাকা ছিল না। তাই আমি চেয়েছিলাম আপনিও মধু খান আর আমার পক্ষ থেকে দামটাও পরিশোধ হয়ে যাক!\"",
      "তাঁর এই সরল উত্তর শুনে রাসূলুল্লাহ (সাঃ) এবং উপস্থিত সাহাবীগণ প্রাণ খুলে হেসে ফেললেন।"
    ],
    "moral": "ইসলামে নির্মল হাস্যরস ও একে অপরের সাথে সুন্দর সম্পর্ক বজায় রাখাকে উৎসাহিত করা হয়েছে। সাহাবীদের জীবন শুধু যুদ্ধ ও ইবাদতের মধ্যেই সীমাবদ্ধ ছিল না, তাঁদের মাঝে মানবিকতার সকল সুন্দর দিকই বিদ্যমান ছিল।",
    "source": "আল-ইসাবা ফি তাময়িযিস সাহাবা (ইবনে হাজার); সিয়ারু আ'লামিন নুবালা।"
  },
  {
    "id": "abdurrahman-ibn-awf-babsha",
    "categoryId": "sahabider_jibon_theke",
    "title": "আব্দুর রহমান (রাঃ) এর আত্মমর্যাদা",
    "paragraphs": [
      "হযরত আব্দুর রহমান ইবনে আউফ (রাঃ) দ্বীনের জন্য তাঁর সকল সম্পদ মক্কায় ফেলে রেখে শূন্য হাতে মদিনায় হিজরত করেন। রাসূলুল্লাহ (সাঃ) তাঁর সাথে আনসারী সাহাবী সা'দ ইবনে রাবী (রাঃ) এর ভ্রাতৃত্বের বন্ধন স্থাপন করে দেন।",
      "সা'দ (রাঃ) ছিলেন মদিনার অন্যতম শ্রেষ্ঠ ধনী। তিনি তাঁর মুহাজির ভাইকে পরম ভালোবাসায় বললেন,",
      "\"ভাই আমার! আমি মদিনার সবচেয়ে ধনী ব্যক্তিদের একজন। আমার যা কিছু সম্পদ আছে, তার অর্ধেক আমি আপনাকে দিয়ে দিলাম। আমার দুজন স্ত্রী আছেন, আপনার যাঁকে পছন্দ হয় বলুন, আমি তাঁকে তালাক দিয়ে দেব এবং ইদ্দত শেষে আপনি তাঁকে বিয়ে করে নেবেন।\"",
      "ত্যাগ ও ভালোবাসার এমন প্রস্তাব পৃথিবীর ইতিহাসে বিরল। কিন্তু আব্দুর রহমান (রাঃ) এর আত্মমর্যাদাবোধ ছিল আরও বিরল। তিনি এই বিশাল প্রস্তাব শুনে জবাবে বললেন,",
      "'بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، دُلَّنِي عَلَى السُّوقِ'",
      "\"ভাই আমার, আল্লাহ আপনার সম্পদে ও পরিবারে বরকত দান করুন। আমার এসবের কিছুই প্রয়োজন নেই। আপনি শুধু আমাকে দয়া করে বাজারের পথটি দেখিয়ে দিন।\"",
      "সা'দ (রাঃ) তাঁকে বনু কাইনুকার বাজারটি দেখিয়ে দিলেন। আব্দুর রহমান (রাঃ) সেখানে সামান্য পনির ও ঘি দিয়ে ব্যবসা শুরু করলেন এবং আল্লাহর রহমতে অল্প দিনের মধ্যেই মদিনার অন্যতম শ্রেষ্ঠ ধনী সাহাবীতে পরিণত হন।"
    ],
    "moral": "ইসলাম কর্মবিমুখতাকে নয়, বরং পরিশ্রম ও আত্মমর্যাদাকে উৎসাহিত করে। অন্যের ওপর নির্ভরশীল না হয়ে নিজ পরিশ্রমে অর্জিত সম্পদে আল্লাহ বরকত দান করেন।",
    "source": "**সহীহ আল-বুখারী (হাদিস নং:** ৩৭৮০); 'সিয়ারু আ'লামিন নুবালা'।"
  },
  {
    "id": "talha-ibn-ubaydullah-uhud",
    "categoryId": "sahabider_jibon_theke",
    "title": "উহুদের ময়দানে তালহা (রাঃ)",
    "paragraphs": [
      "উহুদের যুদ্ধে মুসলিম বাহিনী ছত্রভঙ্গ হয়ে পড়লে রাসূলুল্লাহ (সাঃ) কাফিরদের দ্বারা পরিবেষ্টিত হয়ে পড়েন। এই চরম বিপজ্জনক মুহূর্তে মাত্র কয়েকজন সাহাবী রাসূলুল্লাহ (সাঃ) এর পাশে ছিলেন, যাঁদের মধ্যে অন্যতম ছিলেন হযরত তালহা ইবনে উবায়দুল্লাহ (রাঃ)।",
      "কাফিররা নবীজির দিকে বৃষ্টির মতো তীর নিক্ষেপ করছিল। তালহা (রাঃ) দেখলেন, একটি তীর সরাসরি রাসূলুল্লাহ (সাঃ) এর দিকে ধেয়ে আসছে। তিনি নিজের হাত বাড়িয়ে দিয়ে সেই তীরটি রুখে দিলেন। তীরের আঘাতে তাঁর হাতটি চিরদিনের জন্য অকেজো হয়ে গেল।",
      "তিনি একাই একটি মানবঢাল তৈরি করে ফেলেছিলেন। যেদিক থেকেই তীর বা তলোয়ারের আঘাত আসছিল, তিনি নিজের শরীর দিয়ে তা আটকাতেন। তাঁর শরীরে সত্তরেরও বেশি আঘাতের চিহ্ন ছিল।",
      "তাঁর এই অবিশ্বাস্য বীরত্ব ও আত্মত্যাগের কারণে রাসূলুল্লাহ (সাঃ) তাঁকে 'জীবন্ত শহীদ' (الشهيد الحي) বলে আখ্যায়িত করেছিলেন। তিনি বলেছিলেন:",
      "\"যে ব্যক্তি কোনো শহীদকে পৃথিবীতে হেঁটে বেড়াতে দেখতে চায়, সে যেন তালহা ইবনে উবায়দুল্লাহকে দেখে নেয়।\""
    ],
    "moral": "আল্লাহ ও তাঁর রাসূলের প্রতি ভালোবাসা মুমিনের সবচেয়ে বড় শক্তি। সত্যিকারের ভালোবাসা নিজের জীবনের চেয়েও ভালোবাসার পাত্রকে রক্ষা করাকে বেশি গুরুত্ব দেয়।",
    "source": "সহীহ আল-বুখারী; জামে আত-তিরমিযী; সীরাতে ইবনে হিশাম।"
  },
  {
    "id": "saad-ibn-abi-waqqas-dua",
    "categoryId": "sahabider_jibon_theke",
    "title": "সা'দ (রাঃ) এর কবুল হওয়া দোয়া",
    "paragraphs": [
      "হযরত সা'দ ইবনে আবি ওয়াক্কাস (রাঃ) ছিলেন সেই দশজন সৌভাগ্যবান সাহাবীর একজন, যাঁরা দুনিয়াতেই জান্নাতের সুসংবাদ পেয়েছিলেন। একবার নবীজি (সাঃ) আল্লাহর কাছে তাঁর জন্য এক বিশেষ দোয়া করেন:",
      "'اللَّهُمَّ اسْتَجِبْ لِسَعْدٍ إِذَا دَعَاكَ'",
      "\"হে আল্লাহ! সা'দ যখনই তোমার কাছে কোনো দোয়া করবে, তুমি তা কবুল করে নিও।\"",
      "আল্লাহর রাসূলের এই দোয়া এমনভাবে কবুল হয়েছিল যে, লোকেরা সা'দ (রাঃ) এর দোয়াকে তীরের মতোই অব্যর্থ মনে করত।",
      "একবার কুফার এক ব্যক্তি তাঁর বিরুদ্ধে খলিফা উমর (রাঃ) এর কাছে মিথ্যা অভিযোগ দায়ের করে। হযরত সা'দ (রাঃ) এই ভিত্তিহীন অভিযোগে অত্যন্ত ব্যথিত হলেন এবং আল্লাহর দরবারে হাত তুলে বদদোয়া করলেন:",
      "'اللَّهُمَّ إِنْ كَانَ عَبْدُكَ هَذَا كَاذِبًا، قَامَ رِيَاءً وَسُمْعَةً، فَأَطِلْ عُمْرَهُ، وَأَطِلْ فَقْرَهُ، وَعَرِّضْهُ لِلْفِتَنِ'",
      "\"হে আল্লাহ! যদি এই ব্যক্তি মিথ্যাবাদী হয়, লোক দেখানো বা খ্যাতির জন্য আমার বিরুদ্ধে দাঁড়িয়ে থাকে, তবে তুমি তার আয়ু অনেক দীর্ঘ করে দাও, তাকে চরম দরিদ্র করে দাও, এবং তাকে ফেতনার সম্মুখীন করো।\"",
      "পরবর্তীতে লোকেরা দেখেছে, তাঁর দোয়া অক্ষরে অক্ষরে কবুল হয়েছে। লোকটি দীর্ঘ, দরিদ্র ও ফেতনায় জর্জরিত এক জীবন লাভ করেছিল।"
    ],
    "moral": "আল্লাহ তাঁর প্রিয় বান্দাদের দোয়া কবুল করেন। কারো বিরুদ্ধে মিথ্যা অভিযোগ করা এবং কাউকে অন্যায়ভাবে কষ্ট দেওয়ার পরিণام অত্যন্ত ভয়াবহ হতে পারে।",
    "source": "**সহীহ আল-বুখারী (হাদিস নং:** ৭৫৫); সহীহ মুসলিম।"
  },
  {
    "id": "salman-farsi-shotter-shondhan",
    "categoryId": "sahabider_jibon_theke",
    "title": "সালমান ফারসি (রাঃ) এর সত্যের সন্ধান",
    "paragraphs": [
      "সালমান (রাঃ) পারস্যের এক সম্ভ্রান্ত অগ্নি-উপাসক পরিবারে জন্মগ্রহণ করেন। কিন্তু তাঁর অন্তর সত্যের সন্ধানে ব্যাকুল ছিল। তিনি বাড়ি ছেড়ে সিরিয়ায় যান এবং কয়েকজন খ্রিস্টান পাদ্রীর সান্নিধ্যে থেকে জ্ঞান অর্জন করেন।",
      "তাঁর শেষ উস্তাদ মৃত্যুর আগে তাঁকে বলেন,",
      "\"বৎস, পৃথিবীতে আমার জানা মতে আর কোনো সৎ ব্যক্তি নেই। তবে শেষ নবীর আগমনের সময় ঘনিয়ে এসেছে। তিনি আরবে জন্মগ্রহণ করবেন, খেজুর বাগানের শহরে হিজরত করবেন। তাঁর দুটি কাঁধের মাঝে নবুয়তের মোহর থাকবে। তিনি হাদিয়া গ্রহণ করবেন, কিন্তু সদকা গ্রহণ করবেন না।\"",
      "গুরুর মৃত্যুর পর সালমান (রাঃ) এক বণিক দলের সাথে আরব যাত্রা করেন, কিন্তু তারা বিশ্বাসঘাতকতা করে তাঁকে দাস হিসেবে বিক্রি করে দেয়। অবশেষে তিনি মদিনায় এসে পৌঁছান।",
      "রাসূলুল্লাহ (সাঃ) এর আগমনের সংবাদ পেয়ে তিনি কিছু খেজুর নিয়ে নবীজির (সাঃ) কাছে উপস্থিত হলেন এবং বললেন, \"এটি সদকা।\" নবীজি (সাঃ) তা গ্রহণ না করে সাহাবীদের দিয়ে দিলেন। সালমান (রাঃ) ভাবলেন, একটি চিহ্ন মিলেছে।",
      "কিছুদিন পর তিনি আবার কিছু খেজুর নিয়ে এলেন এবং বললেন, \"এটি হাদিয়া।\" এবার নবীজি (সাঃ) তা গ্রহণ করলেন এবং সাহাবীদের নিয়ে খেলেন। সালমান (রাঃ) বুঝলেন, দ্বিতীয় চিহ্নও মিলে গেছে।",
      "অবশেষে একদিন তিনি নবীজির (সাঃ) পেছনে গিয়ে নбуয়তের মোহরটি দেখার চেষ্টা করছিলেন। তাঁর উদ্দেশ্য বুঝতে পেরে আল্লাহর রাসূল (সাঃ) তাঁর পিঠ থেকে চাদর সরিয়ে দিলেন। সালমান (রাঃ) সুস্পষ্টভাবে নবুয়তের মোহর দেখতে পেয়ে কান্নায় ভেঙে পড়লেন এবং ইসলাম গ্রহণ করলেন। এভাবেই তাঁর দীর্ঘ সত্যের অনুসন্ধানের সমাপ্তি ঘটল।"
    ],
    "moral": "সত্যের জন্য আন্তরিক অনুসন্ধান কখনো বৃtha যায় না। আল্লাহ তাদেরকেই পথ দেখান, যারা সততা ও ধৈর্যের সাথে পথ খোঁজেন।",
    "source": "মুসনাদে আহমাদ; 'সিয়ারু আ'লামিন নুবালা' (ইমাম যাহাবী)।"
  },
  {
    "id": "bilal-r-ahadun-ahad",
    "categoryId": "sahabider_jibon_theke",
    "title": "বিলাল (রাঃ) এর 'আহাদুন আহাদ'",
    "paragraphs": [
      "হযরত বিলাল (রাঃ) ছিলেন একজন হাবশী কৃতদাস। তাঁর মনিব ছিল ইসলামের ঘোর শত্রু উমাইয়া ইবনে খালাফ। ইসলাম গ্রহণের খবর পেয়ে উমাইয়া তাঁর ওপর বর্বর নির্যাতন শুরু করে।",
      "প্রতিদিন দুপুরে, যখন আরবের মরুভূমির বালু অগ্নিকুণ্ডের মতো উত্তপ্ত হয়ে উঠত, তখন উমাইয়া তাকে তপ্ত বালুর ওপর চিৎ করে শুইয়ে দিত এবং বুকের ওপর একটি বিশাল পাথর চাপিয়ে দিত।",
      "এই অসহনীয় যন্ত্রণার মধ্যে সে বলত, \"মুহাম্মদের ধর্ম ত্যাগ কর, লাত ও উজ্জার পূজা কর, নইলে এভাবেই শুকিয়ে মরবি!\"",
      "তপ্ত বালুর নিচে পিঠ পুড়ে যাচ্ছিল, বুকের ওপর পাথরের চাপে নিঃশ্বাস বন্ধ হয়ে আসছিল, কিন্তু হযরত বিলাল (রাঃ) এর ঈমান ছিল পর্বতের চেয়েও অটল। সকল যন্ত্রণা সহ্য করে তাঁর মুখ থেকে কেবল একটিই শব্দ বেরিয়ে আসত—",
      "'أَحَدٌ أَحَدٌ'",
      "\"তিনি এক, তিনি এক।\"",
      "তাঁর এই ঈমানী দৃঢ়তা দেখে উমাইয়ার ক্রোধ আরও বেড়ে যেত। অবশেষে একদিন হযরত আবু বকর (রাঃ) এই দৃশ্য দেখে উমাইয়াকে তার মূল্যের চেয়েও বেশি অর্থ দিয়ে হযরত বিলাল (রাঃ)-কে কিনে নেন এবং আল্লাহর রাস্তায় মুক্ত করে দেন। এই ত্যাগের ফলেই হযরত বিলাল (রাঃ) পরবর্তীতে ইসলামের প্রথম মুয়াজ্জিন হওয়ার সম্মান লাভ করেন।"
    ],
    "moral": "ঈমানের শক্তি শারীরিক সকল যন্ত্রণা ও অত্যাচারকে হার মানাতে পারে। সত্যের পথে অবিচল থাকলে আল্লাহ অবশ্যই মুক্তির পথ খুলে দেন এবং সর্বোচ্চ সম্মান দান করেন।",
    "source": "সীরাতে ইবনে হিশام; 'সিয়ারু আ'লামিন নুবালা' (ইমাম যাহাবী)।"
  },
  {
    "id": "khalid-ibn-walid-mutah-judho",
    "categoryId": "sahabider_jibon_theke",
    "title": "খালিদ (রাঃ) এর মু'তার রণকৌশল",
    "paragraphs": [
      "অষ্টম হিজরিতে মু'তার যুদ্ধ ছিল এক অসম লড়াই, যেখানে মাত্র ৩,০০০ মুসলিম সৈন্যের বিপরীতে রোমান বাহিনীর সৈন্য ছিল প্রায় ২ লক্ষ। যুদ্ধে রাসূলুল্লাহ (সাঃ) এর নিযুক্ত তিনজন সেনাপতিই শাহাদাত বরণ করেন।",
      "মুসলিম বাহিনী যখন সেনাপতিহীন ও ছত্রভঙ্গ হওয়ার পথে, তখন এক চরম সংকটময় মুহূর্তে খালিদ ইবনে ওয়ালিদ (রাঃ) নিজ উদ্যোগে যুদ্ধের পতাকা হাতে তুলে নেন।",
      "তিনি বুঝতে পারছিলেন, এই বিশাল বাহিনীর সাথে সম্মুখ যুদ্ধে জয়লাভ করা অসম্ভব। তাঁর মূল লক্ষ্য ছিল মুসলিম বাহিনীকে নিরাপদে ফিরিয়ে আনা। তিনি এক অবিশ্বাস্য রণকৌশল অবলম্বন করলেন।",
      "রাতের আঁধারে তিনি তাঁর পুরো সেনাবাহিনীকে নতুন করে বিন্যস্ত করলেন। পেছনের সৈন্যদের সামনে, সামনের সৈন্যদের পেছনে, ডানের সৈন্যদের বামে এবং বামের সৈন্যদের ডানে পাঠিয়ে দিলেন।",
      "পরদিন সকালে রোমান বাহিনী নতুন চেহারার সৈন্যদের দেখে ভাবল, মদিনা থেকে বিশাল এক নতুন সাহায্যকারী বাহিনী এসে পৌঁছেছে। এই ভয়ের সুযোগে খালিদ (রাঃ) আক্রমণ করার ভান করে ধীরে ধীরে তাঁর পুরো সেনাবাহিনীকে নিরাপদে যুদ্ধক্ষেত্র থেকে বের করে মদিনায় ফিরিয়ে আনেন।",
      "তাঁর এই অসাধারণ রণকৌশলের কারণেই সেদিন প্রায় ৩,০০০ মুসলিমের জীবন রক্ষা পেয়েছিল। এই ঘটনার পরই রাসূলুল্লাহ (সাঃ) তাঁকে 'সাইফুল্লাহ' বা 'আল্লাহর তলোয়ার' (سيف الله) উপাধিতে ভূষিত করেন।"
    ],
    "moral": "বীরত্ব মানে শুধু সম্মুখ সমরে ঝাঁপিয়ে পড়া নয়, বরং প্রজ্ঞা, দূরদর্শিতা এবং কঠিন পরিস্থিতিতে সঠিক সিদ্ধান্ত নিয়ে নিজের লোকদের জীবন রক্ষা করাও নেতৃত্বের অন্যতম সেরা গুণ।",
    "source": "**সহীহ আল-বুখারী (হাদিস নং:** ৪২৬২); 'আল-বিদায়া ওয়ান-নিহায়া'; 'আর-রাহিকুল মাখতুম'।"
  },
  {
    "id": "jafar-ibn-abi-talib-najashi",
    "categoryId": "sahabider_jibon_theke",
    "title": "বাদশাহ নাজ্জাশির দরবারে জাফর (রাঃ)",
    "paragraphs": [
      "মক্কায় কাফিরদের নির্যাতন অসহনীয় পর্যায়ে পৌঁছালে একদল মুসলিম আবিসিনিয়ায় হিজরত করেন। সেখানকার খ্রিস্টান বাদশাহ নাজ্জাশি ছিলেন একজন ন্যায়পরায়ণ শাসক। কুরাইশরা আমর ইবনুল আসকে মূল্যবান উপঢৌকনসহ নাজ্জাশির দরবারে পাঠায়, যাতে তিনি মুসলিমদের মক্কায় ফেরত পাঠিয়ে দেন।",
      "কুরাইশ প্রতিনিধিরা বাদশাহর কাছে মুসলিমদের বিরুদ্ধে অভিযোগ করলে বাদশাহ মুসলিমদের ডেকে পাঠান। মুসলিমদের পক্ষ থেকে কথা বলার জন্য এগিয়ে এলেন রাসূলুল্লাহ (সাঃ) এর চাচাতো ভাই হযরত জাফর ইবনে আবি তালিব (রাঃ)।",
      "জাফর (রাঃ) বাদশাহকে উদ্দেশ্য করে তাঁর বিখ্যাত ভাষণ শুরু করলেন:",
      "\"হে বাদশাহ! আমরা ছিলাম এক বর্বর ও অজ্ঞ জাতি। আমরা মূর্তিপূজা করতাম, মৃতদেহ ভক্ষণ করতাম, অশ্লীল কাজে লিপ্ত থাকতাম, আত্মীয়তার সম্পর্ক ছিন্ন করতাম এবং সবলরা দুর্বলদের ওপর অত্যাচার করত।\"",
      "\"আমরা যখন এই অবস্থায় ছিলাম, তখন আল্লাহ আমাদের মধ্য থেকেই এমন একজন রাসূল পাঠালেন, যাঁর বংশ, সততা ও পবিত্রতা সম্পর্কে আমরা আগে থেকেই অবগত ছিলাম। তিনি আমাদের এক আল্লাহর দিকে আহ্বান জানালেন, সত্য কথা বলতে, আমানত রক্ষা করতে এবং হারাম কাজ ও রক্তপাত থেকে বিরত থাকতে নির্দেশ দিলেন।\"",
      "\"আমরা তাঁর ওপর ঈমান এনেছি। একারণেই আমাদের قوم আমাদের ওপর অত্যাচার শুরু করেছে। তাই আমরা আপনার রাজ্যে আশ্রয় নিয়েছি, এই আশায় যে এখানে আমরা অত্যাচারিত হব না।\"",
      "এরপর বাদশাহ তাঁকে কুরআনের কিছু অংশ তিলাওয়াত করতে বললে, জাফর (রাঃ) সূরা মারইয়ামের প্রথম অংশ তিলাওয়াত করেন। তিলাওয়াত শুনে বাদশাহ নাজ্জাশি এবং তাঁর পাদ্রীরা এত কাঁদলেন যে তাঁদের দাড়ি ভিজে গেল।",
      "অবশেষে নাজ্জাশি বললেন, \"আল্লাহর কসম! এই বাণী এবং ঈসা (আঃ) যা নিয়ে এসেছিলেন, উভয়ই একই প্রদীপের আলো।\" তিনি কুরাইশদের উপহার প্রত্যাখ্যান করলেন এবং মুসলিমদের তাঁর রাজ্যে নিরাপদে থাকার অনুমতি দিলেন।"
    ],
    "moral": "সত্য ও ন্যায়ের বাণী সকল যুগের সকল মানুষের অন্তরকে স্পর্শ করে। প্রজ্ঞা, সাহস এবং উত্তমরূপে নিজের বক্তব্য উপস্থাপন করার মাধ্যমে কঠিনতম পরিস্থিতিও নিজের অনুকূলে আনা যায়।",
    "source": "সীরাতে ইবনে হিশাম; আর-রাহিকুল মাখতুম।"
  },
  {
    "id": "musab-ibn-umair-tyag",
    "categoryId": "sahabider_jibon_theke",
    "title": "মুস'আব (রাঃ) এর ত্যাগ ও শাহাদাত",
    "paragraphs": [
      "হযরত মুস'আব ইবনে উমাইর (রাঃ) ছিলেন মক্কার অন্যতম ধনী পরিবারের সন্তান। তাঁর পোশাক ও সুগন্ধি ছিল মক্কার যুবকদের জন্য ঈর্ষার বিষয়। কিন্তু যখন তিনি ইসলাম গ্রহণ করলেন, তখন তাঁর জীবন সম্পূর্ণরূপে পরিবর্তিত হয়ে গেল।",
      "পরিবার তাঁকে বন্দী করে রাখে, কিন্তু তিনি পালিয়ে আবিসিনিয়ায় হিজরত করেন। সেখান থেকে ফিরে আসার পর তাঁর অবস্থা এমন হয়েছিল যে, তাঁর গায়ের পোশাকে ছিল তালি লাগানো। রাসূলুল্লাহ (সাঃ) তাঁকে এই অবস্থায় দেখে কেঁদে ফেলেছিলেন।",
      "রাসূলুল্লাহ (সাঃ) তাঁর জ্ঞান ও প্রজ্ঞার কারণে তাঁকে মদিনায় ইসলামের প্রথম দূত বা শিক্ষক হিসেবে পাঠান। তাঁর সুন্দর দাওয়াতে মদিনার ঘরে ঘরে ইসলাম প্রবেশ করে।",
      "অবশেষে উহুদের যুদ্ধে তিনি মুসলিমদের পতাকাবাহক ছিলেন। যুদ্ধের এক পর্যায়ে শত্রুরা তাঁর ডান হাত কেটে দিলে তিনি বাম হাতে পতাকা ধরেন। বাম হাত কেটে দিলে তিনি দুই বাহুর অবশিষ্টাংশ দিয়ে বুকের সাথে পতাকা জড়িয়ে রাখেন, যতক্ষণ না শাহাদাত বরণ করেন।",
      "যুদ্ধের পর যখন শহীদদের দাফন করা হচ্ছিল, তখন দেখা গেল মুস'আব (রাঃ) এর কাফনের জন্য মাত্র একটি চাদর রয়েছে। সেই চাদর দিয়ে তাঁর মাথা ঢাকলে পা বের হয়ে যেত, আর পা ঢাকলে মাথা বের হয়ে যেত। তখন রাসূলুল্লাহ (সাঃ) বললেন,",
      "\"চাদরটি দিয়ে তার মাথা ঢেকে দাও এবং তার পায়ের ওপর ইযখির ঘাস দিয়ে দাও।\" এভাবেই ইসলামের প্রথম রাষ্ট্রদূতের দাফন সম্পন্ন হয়।"
    ],
    "moral": "আল্লাহর সন্তুষ্টির জন্য দুনিয়ার ভোগ-বিলাস ও সম্পদ ত্যাগ করার মধ্যেই রয়েছে সত্যিকারের সম্মান ও সফলতা। ঈমানের পথে সর্বোচ্চ ত্যাগই একজন মুমিনকে আল্লাহর কাছে প্রিয় করে তোলে।",
    "source": "সীরাতে ইবনে হিশাম; সিয়ারু আ'লামিন নুবালা; তাবাকাত ইবনে সা'দ।"
  },
  {
    "id": "hamza-r-islam-grohon",
    "categoryId": "sahabider_jibon_theke",
    "title": "হামযা (রাঃ) এর ইসলাম গ্রহণ",
    "paragraphs": [
      "হযরত হামযা (রাঃ) ছিলেন রাসূলুল্লাহ (সাঃ) এর চাচা এবং মক্কার সবচেয়ে সাহসী योद्धाদের একজন। একদিন তিনি শিকার থেকে ফেরার পথে জানতে পারেন যে, আবু জাহেল তাঁর ভাতিজা মুহাম্মাদ (সাঃ)-কে চরমভাবে অপমান করেছে।",
      "এই কথা শোনা মাত্রই বংশীয় মর্যাদায় তাঁর রক্ত গরম হয়ে গেল। তিনি সোজা কাবা ঘরের দিকে রওনা দিলেন, যেখানে আবু জাহেল তার সঙ্গীদের নিয়ে বসেছিল। হামযা (রাঃ) তার ধনুক দিয়ে আবু জাহেলের মাথায় এত জোরে আঘাত করলেন যে তার মাথা ফেটে গেল। তিনি গর্জন করে বললেন,",
      "\"তুই আমার ভাতিজাকে গালি দিস, অথচ আমিও তার ধর্ম গ্রহণ করেছি? পারলে আমার ওপর প্রতিশোধ নিয়ে দেখা!\"",
      "এই ঘটনার মাধ্যমে হামযা (রাঃ) প্রকাশ্যে ইসলামের ঘোষণা দিয়ে ফেললেন। কিন্তু বাড়ি ফিরে তিনি গভীর চিন্তায় পড়ে গেলেন। তিনি উত্তেজনার বশে একটি কথা বলে ফেলেছেন, কিন্তু তিনি কি আসলেই অন্তর থেকে ইসলামকে মেনে নিয়েছেন? সারা রাত তিনি আল্লাহর কাছে দোয়া করতে থাকলেন, \"হে আল্লাহ! যদি এই পথ সঠিক হয়, তবে আমার অন্তরে তা स्थापित করে দিন।\"",
      "আল্লাহ তাঁর দোয়া কবুল করলেন। পরদিন সকালে তিনি রাসূলুল্লাহ (সাঃ) এর কাছে গিয়ে তাঁর ইসলাম গ্রহণের আনুষ্ঠানিক ঘোষণা দিলেন। তাঁর ইসলাম গ্রহণে মুসলিমরা অত্যন্ত আনন্দিত ও শক্তিশালী হয়েছিলেন, কারণ এরপর থেকে কাফিররা মুসলিমদের ওপর প্রকাশ্যে অত্যাচার করতে ভয় পেত।"
    ],
    "moral": "আল্লাহ যাকে ইচ্ছা হেদায়েত দান করেন। কখনো কখনো অন্যায়ের বিরুদ্ধে জাগরিত হওয়া আত্মসম্মানবোধও মানুষকে সত্যের পথে পরিচালিত করতে পারে।",
    "source": "সীরাতে ইবনে হিশাম; আল-বিদায়া ওয়ান-নিহায়া।"
  },
  {
    "id": "abdullah-ibn-masud-quran-recitation",
    "categoryId": "sahabider_jibon_theke",
    "title": "আব্দুল্লাহ ইবনে মাস'উদ (রাঃ) এর সাহসিকতা",
    "paragraphs": [
      "ইসলামের প্রাথমিক যুগে মক্কায় মুসলিমরা অত্যন্ত দুর্বল অবস্থায় ছিলেন। একদিন সাহাবীরা একত্রিত হয়ে আলোচনা করছিলেন, \"আমাদের মধ্যে এমন কে আছে, যে কুরাইশদের সামনে গিয়ে উচ্চস্বরে কুরআন শোনাতে পারবে?\"",
      "এই কথা শুনে শারীরিকভাবে দুর্বল হযরত আব্দুল্লাহ ইবনে মাস'উদ (রাঃ) বললেন, \"আমি এই কাজটি করতে পারব।\" সাহাবীরা তাঁর নিরাপত্তার কথা ভেবে বারণ করলেও তিনি তাঁর সিদ্ধান্তে অটল রইলেন।",
      "পরদিন সকালে তিনি মাকামে ইব্রাহিমের কাছে গিয়ে দাঁড়ালেন, যখন কুরাইশ নেতারা কাবা প্রাঙ্গণে বসেছিল। তিনি উচ্চস্বরে সূরা আর-রাহমান তিলাওয়াত শুরু করলেন। প্রথমে কুরাইশরা অবাক হলেও পরে তারা একসাথে তাঁর ওপর ঝাঁপিয়ে পড়ল এবং তাঁকে মারাত্মকভাবে আহত করল।",
      "তিনি মার খেতে খেতেই যতটুকু সম্ভব তিলাওয়াত চালিয়ে গেলেন। অবশেষে সাহাবীরা তাঁকে রক্তাক্ত অবস্থায় উদ্ধার করে নিয়ে এলেন।",
      "তাঁরা আফসোস করে বললেন, \"আমরা তো একারণেই আপনাকে ভয় পাচ্ছিলাম।\" কিন্তু ঈমানের তেজে বলীয়ান ইবনে মাস'উদ (রাঃ) উত্তর দিলেন:",
      "\"আল্লাহর কসম! আল্লাহর শত্রুরা আমার চোখে আজকের চেয়ে বেশি নগণ্য আর কখনো ছিল না। আপনারা যদি চান, আমি আগামীকাল আবার গিয়ে তাদের সামনে কুরআন শোনাব।\"",
      "এভাবেই তিনি প্রথম সাহাবী হিসেবে মক্কায় প্রকাশ্যে কুরআন তিলাওয়াতের ইতিহাস সৃষ্টি করেন।"
    ],
    "moral": "ঈমানী শক্তি শারীরিক দুর্বলতাকে অতিক্রম করে যায়। সত্য প্রকাশ করার জন্য শারীরিক শক্তির চেয়ে আত্মিক সাহস অনেক বেশি জরুরি।",
    "source": "সীরাতে ইবনে হিশাম; উসদুল গাবাহ।"
  },
  {
    "id": "kab-ibn-malik-tawba",
    "categoryId": "sahabider_jibon_theke",
    "title": "কা'ব ইবনে মালিক (রাঃ) এর তাওবা",
    "paragraphs": [
      "তাবুক যুদ্ধের সময় কোনো কারণ ছাড়াই হযরত কা'ব ইবনে মালিক (রাঃ) এবং তাঁর দুই সঙ্গী মদিনায় থেকে যান। যুদ্ধ থেকে ফিরে আসার পর রাসূল (সাঃ) এর কাছে তাঁরা সত্য কথা বললে আল্লাহর পক্ষ থেকে তাঁদের বয়কট করার নির্দেশ আসে।",
      "পঞ্চাশ দিন পর্যন্ত এই কঠিন বয়কট চলে। কেউ তাঁদের সাথে কথা বলত না, সালামের উত্তর দিত না। এমনকি তাঁদেরকে নিজ স্ত্রীদের থেকেও আলাদা থাকতে বলা হয়। এই কঠিন পরীক্ষার সময় কা'ব (রাঃ) সত্য ও ধৈর্যের ওপর অটল থাকেন।",
      "পঞ্চাশ দিন পর একদিন ফজরের নামাযের পর তিনি সুসংবাদ শুনতে পান। আল্লাহ সুবহানাহু ওয়া তা'আলা পবিত্র কুরআনে আয়াত নাযিল করে তাঁদের তিনজনের তাওবা কবুল করে নিয়েছেন:",
      "'وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوا أَن لَّا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا ۚ إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ'",
      "\"এবং সেই তিনজনের প্রতিও, যাদের ব্যাপারে সিদ্ধান্ত স্থগিত রাখা হয়েছিল; এমনকি পৃথিবী প্রশস্ত হওয়া সত্ত্বেও তাদের জন্য তা সংকুচিত হয়ে গিয়েছিল এবং তাদের জীবন তাদের জন্য দুর্বিষহ হয়ে উঠেছিল। আর তারা বুঝতে পেরেছিল যে, আল্লাহ ছাড়া আর কোনো আশ্রয়স্থল নেই। অতঃপর তিনি তাদের প্রতি ক্ষমাপরবশ হলেন যাতে তারা তাওবা করে। নিশ্চয়ই আল্লাহ অধিক তাওবা কবুলকারী, পরম দয়ালু।\"** (সূরা আত-তাওবা:** ১১৮)",
      "এই আয়াত নাযিলের পর তিনি রাসূলুল্লাহ (সাঃ) এর দরবারে উপস্থিত হলে নবীজির চেহারা মুবারক চাঁদের মতো উজ্জ্বল হয়ে ওঠে। তিনি বলেন, \"তোমার মা তোমাকে জন্ম দেওয়ার পর থেকে আজকের দিনের চেয়ে উত্তম কোনো দিনের মুখোমুখি তুমি হওনি।\""
    ],
    "moral": "ভুল স্বীকার করা এবং সত্যের ওপর অটল থাকা মুমিনের বৈশিষ্ট্য। আল্লাহর পক্ষ থেকে আসা পরীক্ষা যতই কঠিন হোক না কেন, ধৈর্যের সাথে তা মোকাবেলা করলে এবং আন্তরিকভাবে তাওবা করলে আল্লাহ অবশ্যই ক্ষমা করেন।",
    "source": "**সহীহ আল-বুখারী (হাদিস নং:** ৪৪১৮); সহীহ মুসলিম; তাফসীরে ইবনে কাসির।"
  },
  {
    "id": "abu-ubaidah-aminul-ummah",
    "categoryId": "sahabider_jibon_theke",
    "title": "উম্মাহর আমানতদার আবু উবাইদাহ (রাঃ)",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) হযরত আবু উবাইদাহ ইবনুল জাররাহ (রাঃ)-কে এতটাই বিশ্বাস করতেন যে, তিনি তাঁকে 'আমিনু হাযিহিল উম্মাহ' বা 'এই উম্মাহর আমানতদার' উপাধি দিয়েছিলেন।",
      "একবার আবু উবাইদাহ (রাঃ) বাহরাইন থেকে বিপুল পরিমাণ জিযিয়া বা কর সংগ্রহ করে মদিনায় ফিরে এলেন। এটি ছিল সেই পর্যন্ত মদিনায় আসা সবচেয়ে বড় সম্পদের চালান। সাহাবীরা ফজরের নামাযে মসজিদে নববীতে জমায়েত হলেন।",
      "নামায শেষে রাসূলুল্লাহ (সাঃ) তাঁদের দেখে মুচকি হেসে বললেন, \"আমার মনে হচ্ছে, তোমরা শুনেছ যে আবু উবাইদাহ কিছু নিয়ে এসেছে?\" তাঁরা বললেন, \"হ্যাঁ, ইয়া রাসূলাল্লাহ!\"",
      "নবীজি (সাঃ) বললেন,",
      "\"সুসংবাদ গ্রহণ করো। আল্লাহর কসম! আমি তোমাদের জন্য দারিদ্র্যের ভয় করি না। বরং আমি ভয় করি যে, তোমাদের পূর্ববর্তী জাতিদের মতো তোমাদের জন্যও দুনিয়ার প্রাচুর্য উন্মুক্ত করে দেওয়া হবে, আর তোমরা তা নিয়ে প্রতিযোগিতায় লিপ্ত হবে এবং তা তোমাদেরকে ধ্বংস করে দেবে, যেমনটি তাদের করেছিল।\"",
      "এরপর সেই বিপুল পরিমাণ সম্পদ মসজিদে নববীতে আনা হলো। আবু উবাইদাহ (রাঃ) পুরো সম্পদের স্তূপ রাসূলুল্লাহ (সাঃ) এর সামনে রেখে দিলেন, যেন এটি তাঁর ব্যক্তিগত কোনো বিষয়ই নয়। তাঁর এই বিশ্বস্ততা দেখেই রাসূলুল্লাহ (সাঃ) তাঁকে এই উম্মাহর আমানতদার হিসেবে ঘোষণা দিয়েছিলেন।"
    ],
    "moral": "সম্পদের প্রাচুর্য অনেক সময় মানুষের জন্য পরীক্ষা হয়ে দাঁড়ায়। সত্যিকারের ঈমানদার তো সে-ই, যে বিপুল সম্পদের মাঝেও নিজের আমানত রক্ষা করে এবং নির্লোভ থাকে।",
    "source": "**সহীহ আল-বুখারী (হাদিস নং:** ৩১৫৮); সহীহ মুসলিম।"
  },
  {
    "id": "abu-dharr-islam-grohon",
    "categoryId": "sahabider_jibon_theke",
    "title": "আবু যর গিফারী (রাঃ) এর নির্ভীক ঘোষণা",
    "paragraphs": [
      "রাসূল (সাঃ) এর নবুয়তের খবর পেয়ে তৎকালীন কুখ্যাত গিফার গোত্রের আবু যর (রাঃ) সত্য অনুসন্ধানের জন্য মক্কায় আসেন। তিনি অত্যন্ত সতর্কতার সাথে কয়েকদিন অতিবাহিত করার পর হযরত আলী (রাঃ) এর মাধ্যমে রাসূল (সাঃ) এর সাক্ষাৎ লাভ করেন এবং ইসলাম গ্রহণ করেন।",
      "রাসূলুল্লাহ (সাঃ) তাঁকে বললেন, \"হে আবু যর, আপাতত তোমার ইসলাম গ্রহণের বিষয়টি গোপন রাখো এবং নিজ গোত্রে ফিরে যাও। যখন আমাদের বিজয়ের খবর শুনবে, তখন ফিরে এসো।\"",
      "কিন্তু আবু যর (রাঃ) এর ঈমানী চেতনা ছিল অত্যন্ত প্রবল। তিনি বললেন,",
      "\"সেই সত্তার কসম, যাঁর হাতে আমার প্রাণ! আমি এই কালেমার ঘোষণা মক্কার কাফিরদের মাঝে দিয়েই ছাড়ব।\"",
      "এই বলে তিনি সোজা মাসজিদুল হারামে চলে গেলেন এবং কুরাইশদের ভীড়ের মাঝে দাঁড়িয়ে সর্বোচ্চ স্বরে ঘোষণা করলেন:",
      "'أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ'",
      "এই ঘোষণা শোনা মাত্রই কাফিররা তাঁর ওপর ঝাঁপিয়ে পড়ল এবং তাঁকে এমনভাবে মারতে লাগল যে তিনি প্রায় মৃত্যুর কাছাকাছি পৌঁছে যান। রাসূল (সাঃ) এর চাচা আব্বাস (রাঃ) এসে তাদেরকে এই বলে থামান যে, \"তোমরা কি গিফার গোত্রের লোককে হত্যা করছ? তোমাদের বাণিজ্য কাফেলা তো তাদের এলাকা দিয়েই যায়!\" একথা শুনে তারা তাঁকে ছেড়ে দেয়।",
      "কিন্তু পরের দিন আবু যর (রাঃ) আবার একই কাজ করেন এবং আবারও মারাত্মকভাবে প্রহৃত হন। তাঁর এই নির্ভীকতা ছিল ঈমানের শক্তির এক অনন্য দৃষ্টান্ত।"
    ],
    "moral": "সত্যকে গ্রহণ করার পর তা প্রকাশ করার জন্য ঈমানী শক্তি ও সাহস প্রয়োজন। সত্যিকারের মুমিন আল্লাহর জন্য কোনো অত্যাচারকেই ভয় পায় না।",
    "source": "**সহীহ আল-বুখারী (হাদিস নং:** ৩২৯৯); সহীহ মুসলিম।"
  },
  {
    "id": "anas-r-seba-o-dua",
    "categoryId": "sahabider_jibon_theke",
    "title": "আনাস (রাঃ) এর জন্য রাসূলের দোয়া",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) যখন মদিনায় হিজরত করে আসেন, তখন আনসারী সাহাবীরা নিজেদের প্রিয় বস্তু নিয়ে তাঁর খেদমতে হাজির হচ্ছিলেন। হযরত আনাস (রাঃ) এর মা উম্মে সুলাইম (রাঃ) তখন দশ বছর বয়সী আনাস (রাঃ)-কে নিয়ে এসে বললেন,",
      "\"ইয়া রাসূলাল্লাহ! আনসারদের প্রত্যেক পুরুষ ও নারী আপনাকে কিছু না কিছু হাদিয়া দিয়েছে। আমার কাছে আপনাকে দেওয়ার মতো কিছুই নেই, শুধু আমার এই ছেলেটি ছাড়া। একে আপনি আপনার খাদেম হিসেবে গ্রহণ করুন। সে আপনার সেবা করবে। আপনি তার জন্য আল্লাহর কাছে দোয়া করুন।\"",
      "রাসূলুল্লাহ (সাঃ) এই উপহার পেয়ে অত্যন্ত খুশি হলেন এবং আনাস (রাঃ) এর জন্য দোয়া করলেন:",
      "'اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ'",
      "\"হে আল্লাহ, তার সম্পদ ও সন্তান বৃদ্ধি করে দিন এবং আপনি তাকে যা কিছু দান করবেন, তাতে বরকত দিন।\"",
      "হযরত আনাস (রাঃ) দীর্ঘ জীবন লাভ করেছিলেন এবং নিজেই বর্ণনা করতেন, \"আমি আমার বাগান থেকে বছরে দু'বার ফল পেতাম, যা অন্য কারো হতো না। আমি আমার নিজের ঔরসজাত একশত'র বেশি সন্তান ও নাতি-নাতনিকে দাফন করেছি। আর আমার আয়ু এত দীর্ঘ হয়েছিল যে আমি লজ্জিত হয়ে পড়েছিলাম।\" তিনি ১০ বছর রাসূল (সাঃ) এর সেবা করেছেন এবং বলেন, \"এই দীর্ঘ সময়ে নবীজি আমাকে কখনো 'উফ' পর্যন্ত বলেননি।\""
    ],
    "moral": "নবীর দোয়া আল্লাহ কবুল করেন। আল্লাহর রাসূলের খেদমত করা এক মহান সৌভাগ্য, যার প্রতিদান দুনিয়া ও আখিরাত উভয় জায়গাতেই পাওয়া যায়।",
    "source": "সহীহ আল-বুখারী; সহীহ মুসলিম।"
  },
  {
    "id": "nuayman-selling-suwaybid",
    "categoryId": "sahabider_jibon_theke",
    "title": "বন্ধুকে বিক্রি করে দেওয়ার গল্প",
    "paragraphs": [
      "একদিন নু'আইমান (রাঃ), তাঁর বন্ধু সুয়াইবিত (রাঃ) এবং আবূ বকর (রাঃ) সহ কয়েকজন সাহাবী ব্যবসার উদ্দেশ্যে সফরে বের হলেন। সুয়াইবিত (রাঃ) এর দায়িত্ব ছিল কাফেলার খাবার-দাবারের দেখাশোনা করা।",
      "পথিমধ্যে একটি বাজারে বিরতি নিল কাফেলা। নু'আইমান (রাঃ) বাজারে ঘুরতে ঘুরতে হঠাৎ একটা দুষ্টুমির পরিকল্পনা করলেন। তিনি কয়েকজন ক্রেতার কাছে গিয়ে বললেন, আপনারা কি একজন শক্তিশালী, কর্মঠ দাস কিনতে চান?",
      "ক্রেতারা আগ্রহী হয়ে বলল, হ্যাঁ! কিন্তু দাস কোথায়?",
      "নু'আইমান (রাঃ) বললেন, আছে আছে! তবে একটা ছোট সমস্যা আছে। দাসটি একটু জেদি। সে নিজেকে সুয়াইবিত ইবনে হারমালা বলে পরিচয় দেবে এবং দাবি করবে যে সে স্বাধীন মানুষ। কিন্তু আপনারা তার কথায় কান দেবেন না!",
      "ক্রেতারা বুঝে গেল এবং মূল্য পরিশোধ করল। নু'আইমান (রাঃ) টাকা পকেটে নিয়ে ক্রেতাদের সাথে সুয়াইবিত (রাঃ) এর কাছে গেলেন এবং বললেন, এই যে! এই সেই দাস যাকে আমি বিক্রি করেছি।",
      "সুয়াইবিত (রাঃ) চমকে উঠে চিৎকার করে বললেন, কী বলছো তুমি নু'আইমান? আমি দাস নই! আমি সুয়াইবিত ইবনে হারমালা! আমি একজন স্বাধীন মানুষ!",
      "ক্রেতারা মুচকি হেসে বলল, দেখেছেন? ঠিক যেমনটা বলা হয়েছিল! এই দাস সত্যিই জেদি! চলো, আমাদের সাথে চলো।",
      "তারা সুয়াইবিত (রাঃ) কে টেনে নিয়ে যেতে লাগল। সুয়াইবিত (রাঃ) হাত-পা ছুড়ে প্রতিবাদ করতে লাগলেন, আমি সত্যিই স্বাধীন! আমাকে ছেড়ে দাও!",
      "এমন সময় আবূ বকর (রাঃ) হৈচৈ শুনে দৌড়ে এলেন। পুরো ব্যাপারটা বুঝে তিনি হাসতে হাসতে ক্রেতাদের টাকা ফেরত দিলেন এবং সুয়াইবিত (রাঃ) কে মুক্ত করলেন।",
      "সুয়াইবিত (রাঃ) রাগে-দুঃখে বললেন, নু'আইমান! তুমি আমাকে দাস বানিয়ে বিক্রি করে দিলে?",
      "পরে যখন তারা মদিনায় ফিরে রাসূলুল্লাহ (সাঃ) কে এই ঘটনা বললেন, রাসূল (সাঃ) এবং সব সাহাবীরা প্রাণ খুলে হেসেছিলেন।",
      "এই ঘটনা থেকে বোঝা যায় যে সাহাবীদের মধ্যে কতটা ভালোবাসা ও বন্ধুত্ব ছিল। তাঁরা একে অপরের সাথে নির্মল মজা করতেন এবং রাসূল (সাঃ) নিজেও এই ধরনের নিরীহ হাস্যরস উপভোগ করতেন।"
    ],
    "moral": "ইসলামে হালাল সীমার মধ্যে হাস্যরস ও আনন্দ করা বৈধ। রাসূল (সাঃ) নিজেও হাসতেন এবং সাহাবীদের নির্মল মজা উপভোগ করতেন। তবে মজা এমন হতে হবে যা কাউকে কষ্ট না দেয় এবং ইসলামী সীমার মধ্যে থাকে।",
    "source": "মুসনাদে আহমাদ; সুনান ইবনু মাজাহ।"
  },
  {
    "id": "abu-hurairah-cat-lover",
    "categoryId": "sahabider_jibon_theke",
    "title": "আবু হুরায়রা (রাঃ) ও বিড়ালের গল্প",
    "paragraphs": [
      "আবু হুরায়রা (রাঃ) এর আসল নাম ছিল আবদুর রহমান ইবনে সাখর আদ-দাওসি। কিন্তু তিনি আবু হুরায়রা নামেই বিখ্যাত হয়ে গেলেন। আবু হুরায়রা মানে বিড়ালের বাবা! এই নামের পেছনে রয়েছে এক মজার ইতিহাস।",
      "আবু হুরায়রা (রাঃ) ছোটবেলা থেকেই বিড়াল পছন্দ করতেন। তিনি একটি ছোট বিড়াল পুষতেন এবং সবসময় তার সাথে রাখতেন। এমনকি যখন তিনি বাইরে যেতেন, তখনও বিড়ালটিকে তাঁর জামার হাতায় লুকিয়ে নিয়ে যেতেন!",
      "একদিন রাসূলুল্লাহ (সাঃ) তাঁকে দেখলেন যে তিনি একটি ছোট বিড়াল নিয়ে খেলছেন। রাসূল (সাঃ) হেসে জিজ্ঞেস করলেন, হে আবদুর রহমান! এটা কী?",
      "তিনি বললেন, ইয়া রাসূলাল্লাহ! এটা আমার ছোট বিড়াল। আমি একে খুব ভালোবাসি। রাসূল (সাঃ) হাসতে হাসতে বললেন, তাহলে তুমি আবু হুরায়রা! বিড়ালের বাবা!",
      "এই নাম শুনে সবাই হেসে উঠল। কিন্তু আবু হুরায়রা (রাঃ) এই নাম খুব পছন্দ করলেন কারণ রাসূল (সাঃ) নিজেই তাঁকে এই নাম দিয়েছেন। এরপর থেকে তিনি সবসময় এই নামেই পরিচিত হলেন।",
      "আবু হুরায়রা (রাঃ) বলতেন, মানুষ আমাকে আবু হুরায়রা বলে ডাকে কারণ আমি একটি ছোট বিড়াল পুষতাম এবং সবসময় তার যত্ন নিতাম। রাসূল (সাঃ) এই নাম দেওয়ার পর আমি এটা নিয়ে গর্বিত।",
      "মজার ব্যাপার হলো, আবু হুরায়রা (রাঃ) পরবর্তীতে ইসলামের ইতিহাসে সবচেয়ে বেশি হাদিস বর্ণনাকারী হয়ে গেলেন। তিনি ৫,৩৭৪টি হাদিস বর্ণনা করেছেন! তিনি রাসূল (সাঃ) এর সাথে মাত্র তিন বছর ছিলেন, কিন্তু তাঁর স্মৃতিশক্তি ছিল অসাধারণ।",
      "রাসূল (সাঃ) একবার তাঁর জন্য দোয়া করেছিলেন, হে আল্লাহ! আবু হুরায়রাকে এমন স্মৃতিশক্তি দাও যেন সে কখনো ভুলে না যায়। এই দোয়ার বরকতে তিনি যা শুনতেন তা মনে রাখতে পারতেন।",
      "আবু হুরায়রা (রাঃ) বলতেন, আমি রাসূল (সাঃ) এর কাছে সবসময় থাকতাম। যখন অন্যরা বাজারে যেত বা ব্যবসা করত, আমি রাসূল (সাঃ) এর সাথে থাকতাম এবং তাঁর কথা শুনতাম। আমার পেট ভরার জন্য শুধু কিছু খেজুর যথেষ্ট ছিল।",
      "তিনি এত দরিদ্র ছিলেন যে কখনো কখনো ক্ষুধায় অজ্ঞান হয়ে যেতেন। একবার তিনি মসজিদের মেঝেতে পড়ে ছিলেন। উমর (রাঃ) ভাবলেন তিনি পাগল হয়ে গেছেন! কিন্তু আসলে তিনি ক্ষুধায় অজ্ঞান হয়ে গিয়েছিলেন।",
      "এই বিড়াল প্রেমী সাহাবী পরবর্তীতে ইসলামের ইতিহাসে অমর হয়ে গেলেন তাঁর হাদিস বর্ণনার জন্য। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন।"
    ],
    "moral": "ছোট জিনিস নিয়ে মজা করা এবং প্রাণীদের প্রতি দয়া দেখানো ইসলামে উৎসাহিত। রাসূল (সাঃ) নিজেও হাসি-ঠাট্টা করতেন এবং সাহাবীদের বৈশিষ্ট্য নিয়ে সুন্দর নাম রাখতেন।",
    "source": "সহীহ আল-বুখারী; সুনানে আবু দাউদ; মুসনাদে আহমাদ।"
  },
  {
    "id": "sawda-bint-zamaa-humor",
    "categoryId": "sahabider_jibon_theke",
    "title": "সাওদা (রাঃ) এর দৌড় প্রতিযোগিতা",
    "paragraphs": [
      "হযরত সাওদা বিনতে যামআ (রাঃ) ছিলেন রাসূলুল্লাহ (সাঃ) এর স্ত্রী এবং উম্মুল মুমিনীন। তিনি ছিলেন একটু মোটা এবং ভারী শরীরের। কিন্তু তাঁর হাস্যরসবোধ ছিল অসাধারণ এবং রাসূল (সাঃ) তাঁকে খুব পছন্দ করতেন।",
      "একবার রাসূলুল্লাহ (সাঃ) সফরে যাচ্ছিলেন এবং তাঁর কয়েকজন স্ত্রী তাঁর সাথে ছিলেন। তাঁদের মধ্যে আয়েশা (রাঃ) এবং সাওদা (রাঃ) ও ছিলেন। আয়েশা (রাঃ) ছিলেন তরুণী এবং হালকা-পাতলা, আর সাওদা (রাঃ) ছিলেন বয়স্ক এবং ভারী শরীরের।",
      "রাতে যখন কাফেলা থামল, রাসূল (সাঃ) আয়েশা (রাঃ) কে বললেন, চলো আমরা দৌড় প্রতিযোগিতা করি। আয়েশা (রাঃ) রাজি হলেন এবং তাঁরা দৌড়ালেন। আয়েশা (রাঃ) জিতে গেলেন কারণ তিনি ছিলেন হালকা এবং দ্রুত।",
      "এই ঘটনার কয়েক বছর পর, আরেকটি সফরে সাওদা (রাঃ) ও সাথে ছিলেন। এবার আয়েশা (রাঃ) একটু মোটা হয়ে গিয়েছিলেন কারণ তিনি ভালো খাবার খেতেন।",
      "রাসূল (সাঃ) আবার বললেন, চলো দৌড় প্রতিযোগিতা করি! এবার আয়েশা (রাঃ) এবং সাওদা (রাঃ) দুজনেই দৌড়ালেন। কিন্তু এবার কেউই দ্রুত দৌড়াতে পারলেন না!",
      "দুজনেই হাঁপাতে হাঁপাতে ধীরে ধীরে দৌড়াচ্ছিলেন। সাওদা (রাঃ) তাঁর ভারী শরীর নিয়ে যতটা পারছিলেন দৌড়াচ্ছিলেন, আর আয়েশা (রাঃ) ও আগের মতো দ্রুত দৌড়াতে পারছিলেন না।",
      "অবশেষে সাওদা (রাঃ) জিতে গেলেন! তিনি হাঁপাতে হাঁপাতে রাসূল (সাঃ) এর কাছে এসে বললেন, ইয়া রাসূলাল্লাহ! এবার আমি জিতেছি! আগের দৌড়ের বদলা নিয়ে নিলাম!",
      "রাসূলুল্লাহ (সাঃ) হেসে বললেন, হ্যাঁ, এটা সেই দৌড়ের বদলা! এবার তুমি জিতেছ! সবাই হেসে উঠল এবং সাওদা (রাঃ) খুব খুশি হলেন।",
      "আয়েশা (রাঃ) পরে এই ঘটনা বর্ণনা করতে গিয়ে বলতেন, রাসূল (সাঃ) আমাদের সাথে এমনভাবে মজা করতেন যেন আমরা তাঁর বন্ধু। তিনি কখনো আমাদের অপমান করতেন না বরং আমাদের খুশি রাখতেন।",
      "এই ঘটনা থেকে বোঝা যায় যে রাসূল (সাঃ) তাঁর স্ত্রীদের সাথে কতটা সুন্দর ও আন্তরিক ছিলেন। তিনি তাঁদের সাথে খেলাধুলা করতেন এবং তাঁদের মন ভালো রাখতেন। এমনকি বয়স্ক এবং ভারী শরীরের সাওদা (রাঃ) কেও তিনি সম্মান করতেন এবং তাঁর সাথে মজা করতেন।",
      "সাওদা (রাঃ) ছিলেন অত্যন্ত দানশীল এবং রাসূল (সাঃ) এর প্রতি নিবেদিতপ্রাণ। তিনি একবার তাঁর পালার দিন আয়েশা (রাঃ) কে দিয়ে দিয়েছিলেন কারণ তিনি জানতেন রাসূল (সাঃ) আয়েশা (রাঃ) কে বেশি ভালোবাসেন। এই ত্যাগের জন্য রাসূল (সাঃ) তাঁকে আরও বেশি সম্মান করতেন।"
    ],
    "moral": "ইসলামে স্বামী-স্ত্রীর মধ্যে হাসি-ঠাট্টা এবং খেলাধুলা করা বৈধ এবং উৎসাহিত। রাসূল (সাঃ) নিজেও তাঁর স্ত্রীদের সাথে এমন করতেন। এটি দাম্পত্য জীবনে ভালোবাসা ও আন্তরিকতা বৃদ্ধি করে।",
    "source": "সুনানে আবু দাউদ; মুসনাদে আহমাদ।"
  }
]