[
  {
    "id": "tawba_golpo_kab_ibn_malik",
    "categoryId": "tawba_golpo",
    "title": "কা'ব ইবনে মালিক (রাঃ)-এর তাওবা: ৫০ দিনের বয়কট",
    "summary": "কা'ব ইবনে মালিক (রাঃ) তাবুক যুদ্ধে অংশ নেননি এবং মিথ্যা অজুহাত দেননি। তাঁর সততার কারণে আল্লাহ তাঁকে পরীক্ষা করলেন—৫০ দিন সম্পূর্ণ বয়কট। অবশেষে আল্লাহ তাঁর তাওবা কবুল করলেন এবং কুরআনে তাঁর ঘটনা বর্ণনা করলেন।",
    "paragraphs": [
      "হযরত কা'ব ইবনে মালিক (রাঃ) ছিলেন একজন সম্মানিত সাহাবী। তাবুক যুদ্ধের সময় তিনি কোনো বৈধ অজুহাত ছাড়াই যুদ্ধে যাননি। যখন রাসূলুল্লাহ (সাঃ) ফিরে এলেন, অনেকে মিথ্যা অজুহাত দিয়ে নিজেদের বাঁচিয়ে নিল।",
      "কিন্তু কা'ব (রাঃ) সত্য বললেন: 'ইয়া রাসূলাল্লাহ! আমার কোনো অজুহাত নেই। আমি সুস্থ ছিলাম এবং সামর্থ্যও ছিল, কিন্তু আমি অলসতা করেছি।'",
      "রাসূলুল্লাহ (সাঃ) বললেন: 'এই ব্যক্তি সত্য বলেছে। তুমি অপেক্ষা করো যতক্ষণ না আল্লাহ তোমার ব্যাপারে সিদ্ধান্ত দেন।'",
      "রাসূলুল্লাহ (সাঃ) মুসলমানদের নির্দেশ দিলেন যেন তারা কা'ব (রাঃ) এবং আরও দুইজন সাহাবীর সাথে কথা না বলে। এটি ছিল এক কঠিন পরীক্ষা।",
      "কা'ব (রাঃ) বলেন: 'পুরো মদীনা আমার জন্য সংকীর্ণ হয়ে গেল। আমার নিজের বন্ধুরা, এমনকি আমার চাচাতো ভাইও আমার সালামের জবাব দিত না। আমি রাসূলুল্লাহ (সাঃ)-এর মজলিসে বসতাম, কিন্তু তিনি আমার দিকে তাকাতেন না।'",
      "৪০ দিন পর রাসূলুল্লাহ (সাঃ) নির্দেশ দিলেন যেন তারা তিনজন তাদের স্ত্রীদের থেকেও আলাদা থাকে। এটি ছিল আরও কঠিন পরীক্ষা।",
      "কা'ব (রাঃ) বলেন: 'আমি আমার ছাদে উঠে কাঁদতাম এবং আল্লাহর কাছে তাওবা করতাম। একদিন রোমান সম্রাটের একটি চিঠি এল যেখানে আমাকে তাদের দেশে আশ্রয়ের প্রস্তাব দেওয়া হয়েছিল। আমি সেই চিঠি আগুনে পুড়িয়ে দিলাম।'",
      "৫০ দিন পূর্ণ হওয়ার পর ফজরের নামাজের সময় আল্লাহ তায়ালা তাঁদের তাওবা কবুল করার আয়াত নাজিল করলেন: ",
      "وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوا أَن لَّا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا",
      "অর্থাৎ, এবং সেই তিনজনের ব্যাপারেও (তাওবা কবুল করা হলো) যাদেরকে পিছনে রাখা হয়েছিল, যখন পৃথিবী প্রশস্ত হওয়া সত্ত্বেও তাদের জন্য সংকীর্ণ হয়ে গেল এবং তাদের জীবন তাদের জন্য দুর্বিষহ হয়ে উঠল এবং তারা বুঝতে পারল যে আল্লাহ ছাড়া কোথাও আশ্রয় নেই। তারপর তিনি তাদের তাওবা কবুল করলেন যাতে তারা তাওবা করতে পারে। [সূরা আত-তাওবাহ: ১১৮]",
      "কা'ব (রাঃ) বলেন: 'এক ব্যক্তি দৌড়ে এসে সুসংবাদ দিল। আমি খুশিতে আমার দুটি কাপড়ই তাকে দিয়ে দিলাম এবং রাসূলুল্লাহ (সাঃ)-এর কাছে গেলাম। তাঁর চেহারা চাঁদের মতো উজ্জ্বল হয়ে আছে। তিনি বললেন: তোমার জীবনের সবচেয়ে ভালো দিনের সুসংবাদ গ্রহণ করো!' [সহীহ বুখারী: ৪৪১৮]"
    ],
    "moral": "সততা এবং ধৈর্য তাওবার মূল ভিত্তি। মিথ্যা বলে পাপ ঢাকার চেয়ে সত্য বলে আল্লাহর কাছে তাওবা করা উত্তম। আল্লাহ ধৈর্যশীলদের ভালোবাসেন এবং তাদের তাওবা কবুল করেন।",
    "source": "পবিত্র কুরআন (সূরা আত-তাওবাহ: ১১৮) এবং সহীহ বুখারী (৪৪১৮)।"
  }
]