[
  {
    "id": "tawba_golpo_kab_ibn_malik",
    "categoryId": "tawba_golpo",
    "title": "**কা'ব ইবনে মালিক (রাঃ)-এর তাওবা:** ৫০ দিনের বয়কট",
    "summary": "",
    "paragraphs": [
      "হযরত কা'ব ইবনে মালিক (রাঃ) ছিলেন একজন সম্মানিত সাহাবী। তাবুক যুদ্ধের সময় তিনি কোনো বৈধ অজুহাত ছাড়াই যুদ্ধে যাননি। যখন রাসূলুল্লাহ (সাঃ) ফিরে এলেন, অনেকে মিথ্যা অজুহাত দিয়ে নিজেদের বাঁচিয়ে নিল।",
      "কিন্তু কা'ব (রাঃ) সত্য বললেন, 'ইয়া রাসূলাল্লাহ! আমার কোনো অজুহাত নেই। আমি সুস্থ ছিলাম এবং সামর্থ্যও ছিল, কিন্তু আমি অলসতা করেছি।'",
      "রাসূলুল্লাহ (সাঃ) বললেন, 'এই ব্যক্তি সত্য বলেছে। তুমি অপেক্ষা করো যতক্ষণ না আল্লাহ তোমার ব্যাপারে সিদ্ধান্ত দেন।'",
      "রাসূলুল্লাহ (সাঃ) মুসলমানদের নির্দেশ দিলেন যেন তারা কা'ব (রাঃ) এবং আরও দুইজন সাহাবীর সাথে কথা না বলে। এটি ছিল এক কঠিন পরীক্ষা।",
      "কা'ব (রাঃ) বলেন, 'পুরো মদীনা আমার জন্য সংকীর্ণ হয়ে গেল। আমার নিজের বন্ধুরা, এমনকি আমার চাচাতো ভাইও আমার সালামের জবাব দিত না। আমি রাসূলুল্লাহ (সাঃ)-এর মজলিসে বসতাম, কিন্তু তিনি আমার দিকে তাকাতেন না।'",
      "৪০ দিন পর রাসূলুল্লাহ (সাঃ) নির্দেশ দিলেন যেন তারা তিনজন তাদের স্ত্রীদের থেকেও আলাদা থাকে। এটি ছিল আরও কঠিন পরীক্ষা।",
      "কা'ব (রাঃ) বলেন, 'আমি আমার ছাদে উঠে কাঁদতাম এবং আল্লাহর কাছে তাওবা করতাম। একদিন রোমান সম্রাটের একটি চিঠি এল যেখানে আমাকে তাদের দেশে আশ্রয়ের প্রস্তাব দেওয়া হয়েছিল। আমি সেই চিঠি আগুনে পুড়িয়ে দিলাম।'",
      "৫০ দিন পূর্ণ হওয়ার পর ফজরের নামাজের সময় আল্লাহ তায়ালা তাঁদের তাওবা কবুল করার আয়াত নাজিল করলেন: ",
      "وَعَلَى الثَّلَاثَةِ الَّذِينَ خُلِّفُوا حَتَّىٰ إِذَا ضَاقَتْ عَلَيْهِمُ الْأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّوا أَن لَّا مَلْجَأَ مِنَ اللَّهِ إِلَّا إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا",
      "অর্থাৎ, এবং সেই তিনজনের ব্যাপারেও (তাওবা কবুল করা হলো) যাদেরকে পিছনে রাখা হয়েছিল, যখন পৃথিবী প্রশস্ত হওয়া সত্ত্বেও তাদের জন্য সংকীর্ণ হয়ে গেল এবং তাদের জীবন তাদের জন্য দুর্বিষহ হয়ে উঠল এবং তারা বুঝতে পারল যে আল্লাহ ছাড়া কোথাও আশ্রয় নেই। তারপর তিনি তাদের তাওবা কবুল করলেন যাতে তারা তাওবা করতে পারে। [সূরা আত-তাওবাহ: ১১৮]",
      "কা'ব (রাঃ) বলেন, 'এক ব্যক্তি দৌড়ে এসে সুসংবাদ দিল। আমি খুশিতে আমার দুটি কাপড়ই তাকে দিয়ে দিলাম এবং রাসূলুল্লাহ (সাঃ)-এর কাছে গেলাম। তাঁর চেহারা চাঁদের মতো উজ্জ্বল হয়ে আছে। তিনি বললেন, তোমার জীবনের সবচেয়ে ভালো দিনের সুসংবাদ গ্রহণ করো!' [সহীহ বুখারী: ৪৪১৮]"
    ],
    "moral": "সততা এবং ধৈর্য তাওবার মূল ভিত্তি। মিথ্যা বলে পাপ ঢাকার চেয়ে সত্য বলে আল্লাহর কাছে তাওবা করা উত্তম। আল্লাহ ধৈর্যশীলদের ভালোবাসেন এবং তাদের তাওবা কবুল করেন।",
    "source": "**পবিত্র কুরআন (সূরা আত-তাওবাহ:** ১১৮) এবং সহীহ বুখারী (৪৪১৮)।"
  },
  {
    "id": "tawba_golpo_100_murderer",
    "categoryId": "tawba_golpo",
    "title": "**১০০ মানুষ হত্যাকারীর তাওবা:** আল্লাহর অসীম রহমত",
    "summary": "বনী ইসরাঈলের এক ব্যক্তি ৯৯ জন মানুষকে হত্যা করার পরও তাওবা করতে চেয়েছিল। সে একজন আলেমকে হত্যা করে ১০০ পূর্ণ করে, কিন্তু শেষ পর্যন্ত আল্লাহর রহমতে তার তাওবা কবুল হয়।",
    "paragraphs": [
      "রাসূলুল্লাহ (সাঃ) বনী ইসরাঈলের এক ব্যক্তির ঘটনা বর্ণনা করেছেন যে ৯৯ জন মানুষকে হত্যা করেছিল। এরপর তার মনে অনুশোচনা জাগল এবং সে তাওবা করার পথ খুঁজতে লাগল। সে পৃথিবীর সবচেয়ে বড় আলেম সম্পর্কে জানতে চাইল। তাকে এক পাদ্রীর কথা বলা হলো।",
      "সে পাদ্রীর কাছে গিয়ে বলল, আমি ৯৯ জন মানুষকে হত্যা করেছি। আমার কি তাওবা করার কোনো সুযোগ আছে? পাদ্রী বলল, না, তোমার কোনো সুযোগ নেই। তখন সে রাগান্বিত হয়ে পাদ্রীকেও হত্যা করল এবং ১০০ জন পূর্ণ করল।",
      "এরপর সে আবার তাওবার পথ খুঁজতে লাগল এবং এক বিজ্ঞ আলেমের সন্ধান পেল। সে তাকে বলল, আমি ১০০ জন মানুষকে হত্যা করেছি। আমার কি তাওবা করার সুযোগ আছে? আলেম বললেন, হ্যাঁ, অবশ্যই। তোমার এবং তাওবার মধ্যে কে বাধা দিতে পারে? তুমি অমুক গ্রামে যাও, সেখানে কিছু নেককার লোক আল্লাহর ইবাদত করে। তুমি তাদের সাথে ইবাদত করো এবং নিজের গ্রামে ফিরে যেও না, কারণ ওটা খারাপ জায়গা।",
      "সে তাওবা করে ওই নেককার গ্রামের দিকে রওনা হলো। কিন্তু পথিমধ্যে তার মৃত্যু উপস্থিত হলো। মৃত্যুর সময় সে তার বুকটা ওই নেককার গ্রামের দিকে ঠেলে দিল।",
      "তখন রহমতের ফেরেশতা এবং আজাবের ফেরেশতাদের মধ্যে তর্ক শুরু হলো। রহমতের ফেরেশতারা বলল, সে তাওবা করে আল্লাহর দিকে ফিরে এসেছিল। আর আজাবের ফেরেশতারা বলল, সে তো কখনো কোনো ভালো কাজ করেনি।",
      "তখন আল্লাহ তায়ালা মানুষের রূপ ধরে এক ফেরেশতাকে পাঠালেন বিচারক হিসেবে। তিনি বললেন, তোমরা দুই গ্রামের দূরত্ব মেপে দেখো। সে যে গ্রামের বেশি নিকটবর্তী হবে, সে সেই গ্রামের অন্তর্ভুক্ত হবে।",
      "আল্লাহ তায়ালা তখন নেককার গ্রামকে আদেশ দিলেন কাছে আসার জন্য এবং খারাপ গ্রামকে আদেশ দিলেন দূরে সরে যাওয়ার জন্য। ফেরেশতারা মেপে দেখল যে সে নেককার গ্রামের দিকে মাত্র এক বিঘত পরিমাণ বেশি এগিয়ে আছে। ফলে তাকে ক্ষমা করে দেওয়া হলো।",
      "রাসূলুল্লাহ (সাঃ) বলেন, আল্লাহ তায়ালা তাকে ক্ষমা করে জান্নাতবাসী করলেন।",
      "আল্লাহ তায়ালা কুরআনে বলেন,",
      "إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ",
      "অর্থাৎ, নিশ্চয়ই আল্লাহ তাওবাকারীদের ভালোবাসেন এবং যারা পবিত্র থাকে তাদেরও ভালোবাসেন। [সূরা আল-বাকারাহ: ২২২]"
    ],
    "moral": "আল্লাহর রহমত থেকে কখনো নিরাশ হওয়া উচিত নয়। যত বড় পাপই হোক না কেন, যদি কেউ খাঁটি মনে তাওবা করে, আল্লাহ তাকে ক্ষমা করে দেন। পরিবেশ মানুষের ওপর প্রভাব ফেলে, তাই সৎসঙ্গ গ্রহণ করা জরুরি।",
    "source": "সহীহ বুখারী (৩৪৭০) ও সহীহ মুসলিম (২৭৬৬)।"
  },
  {
    "id": "tawba_golpo_ghamidi_woman",
    "categoryId": "tawba_golpo",
    "title": "**গামিদী গোত্রের মহিলার তাওবা:** খাঁটি অনুশোচনা",
    "summary": "গামিদী গোত্রের এক মহিলা ব্যভিচারের পাপে লিপ্ত হয়েছিল। সে নিজেই রাসূলুল্লাহ (সাঃ)-এর কাছে এসে শাস্তির দাবি জানায় যাতে সে পবিত্র হতে পারে। তার তাওবা এতই খাঁটি ছিল যে রাসূলুল্লাহ (সাঃ) তার জানাজার নামাজ পড়ান।",
    "paragraphs": [
      "গামিদী গোত্রের এক মহিলা রাসূলুল্লাহ (সাঃ)-এর কাছে এসে বলল, ইয়া রাসূলাল্লাহ! আমি ব্যভিচার করেছি, আমাকে পবিত্র করুন। রাসূলুল্লাহ (সাঃ) তাকে ফিরিয়ে দিলেন।",
      "পরদিন সে আবার এসে বলল, ইয়া রাসূলাল্লাহ! আপনি কেন আমাকে ফিরিয়ে দিচ্ছেন? আমি তো গর্ভবতী। রাসূলুল্লাহ (সাঃ) বললেন, আচ্ছা, তুমি এখন যাও। সন্তান প্রসবের পর এসো।",
      "সন্তান প্রসবের পর সে শিশুটিকে এক টুকরো কাপড়ে জড়িয়ে নিয়ে এল এবং বলল, এই যে সন্তান প্রসব করেছি। রাসূলুল্লাহ (সাঃ) বললেন, যাও, একে দুধ পান করাও এবং দুধ ছাড়ানোর পর এসো।",
      "দুধ ছাড়ানোর পর সে শিশুটির হাতে এক টুকরো রুটি দিয়ে নিয়ে এল (বোঝাতে যে সে এখন খেতে পারে) এবং বলল, ইয়া রাসূলাল্লাহ! আমি একে দুধ ছাড়িয়েছি এবং সে এখন খেতে পারে।",
      "তখন রাসূলুল্লাহ (সাঃ) শিশুটিকে এক সাহাবীর জিম্মায় দিলেন এবং মহিলার ব্যাপারে নির্দেশ দিলেন। তাকে বুক পর্যন্ত গর্তে পুঁতে পাথর মেরে শাস্তি কার্যকর করা হলো।",
      "খালিদ ইবনে ওয়ালিদ (রাঃ) পাথর মারার সময় রক্তের ছিটা তাঁর গায়ে লাগলে তিনি মহিলাকে গালি দিলেন। রাসূলুল্লাহ (সাঃ) তা শুনে বললেন, হে খালিদ! শান্ত হও। সেই সত্তার কসম যার হাতে আমার প্রাণ, সে এমন তাওবা করেছে যে, যদি কোনো ট্যাক্স আদায়কারীও এমন তাওবা করত তবে তাকেও ক্ষমা করে দেওয়া হতো।",
      "এরপর রাসূলুল্লাহ (সাঃ) তার জানাজার নামাজ পড়ালেন এবং তাকে দাফন করা হলো।",
      "হযরত ওমর (রাঃ) অবাক হয়ে বললেন, ইয়া রাসূলাল্লাহ! আপনি তার জানাজা পড়ালেন অথচ সে ব্যভিচার করেছে? রাসূলুল্লাহ (সাঃ) বললেন, সে এমন তাওবা করেছে যা যদি মদীনার ৭০ জন লোকের মধ্যে ভাগ করে দেওয়া হতো, তবে তাদের সবার জন্য তা যথেষ্ট হতো। তুমি কি এর চেয়ে উত্তম কিছু পেয়েছ যে সে আল্লাহর সন্তুষ্টির জন্য নিজের প্রাণ দিয়ে দিয়েছে?",
      "আল্লাহ তায়ালা বলেন,",
      "يَا أَيُّهَا الَّذِينَ آمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَّصُوحًا",
      "অর্থাৎ, হে ঈমানদারগণ! তোমরা আল্লাহর কাছে খাঁটি তাওবা করো। [সূরা আত-তাহরীম: ৮]"
    ],
    "moral": "তাওবা হতে হবে খাঁটি এবং আন্তরিক। নিজের ভুলের জন্য অনুতপ্ত হয়ে আল্লাহর কাছে ফিরে আসলে আল্লাহ অবশ্যই ক্ষমা করেন। পাপের শাস্তি দুনিয়ায় পেয়ে গেলে আখেরাতে আর শাস্তি পেতে হয় না।",
    "source": "সহীহ মুসলিম (১৬৯৫)।"
  }
]