[
  {
    "id": "khadija_bint_khuwaylid",
    "categoryId": "ummahatul_mumineen",
    "title": "খাদিজা বিনতে খুওয়াইলিদ (রাঃ)",
    "paragraphs": [
      "হযরত খাদিজা (রাঃ) বিনতে খুওয়াইলিদ (আরবি: خَدِيجَة بِنْت خُوَيْلِد; জন্ম: আনু. ৫৫৫ – মৃত্যু: ৬২০) ছিলেন ইসলামের নবী মুহাম্মাদ (সাঃ)-এর প্রথম স্ত্রী এবং প্রথম ইসলাম গ্রহণকারী ব্যক্তি। তিনি সাধারণত খাদিজা (রাঃ) বা খাদিজা (রাঃ)তুল কুবরা নামে পরিচিত।",
      "**বংশ ও উপাধি:** খাদিজা (রাঃ) হস্তীবর্ষের ১৫ বছর পূর্বে, আনুমানিক ৫৫৫ খ্রিস্টাব্দে মক্কার সম্ভ্রান্ত কুরাইশ বংশে জন্মগ্রহণ করেন। তাঁর পিতা খুওয়াইলিদ ইবনে আসাদ ছিলেন কুরাইশের নেতা ও বিখ্যাত বণিক। জাহেলিয়াতের যুগেই মানুষ তাঁকে তাহিরা (পবিত্রা) ও আমিরাতু কুরাইশ (কুরাইশের রাজকুমারী) উপাধিতে ডাকত। তিনি ছিলেন বুদ্ধিমতী, সৎ এবং চরিত্রবান।",
      "**ব্যবসায়ী জীবন:** খাদিজা (রাঃ) ছিলেন মক্কার সবচেয়ে সফল ব্যবসায়ী মহিলা। তাঁর ব্যবসায়িক কাফেলা সিরিয়া, ইয়েমেন, বাহরাইন পর্যন্ত যেত। ইবনে সাদ বলেছেন: কুরাইশদের সকল বাণিজ্য কাফেলা একত্রিত করলে যা হতো, খাদিজা (রাঃ)র একার কাফেলা তার সমান ছিল! মক্কার অনেক সম্ভ্রান্ত পুরুষ তাঁকে বিয়ের প্রস্তাব দিয়েছিল, তিনি সবাইকে প্রত্যাখ্যান করেছিলেন।",
      "**আল-আমিনের সাথে পরিচয়:** একদিন খাদিজা (রাঃ) মুহাম্মাদ (সাঃ) ইবনে আবদুল্লাহ সম্পর্কে শুনলেন, যিনি আল-আমিন (বিশ্বস্ত) নামে পরিচিত। তিনি মুহাম্মাদ (সাঃ)কে তাঁর ব্যবসায়ের দায়িত্ব দিয়ে সিরিয়ায় পাঠালেন। সাথে দিলেন তাঁর বিশ্বস্ত দাস মাইসারাকে। ব্যবসায়ে অভূতপূর্ব লাভ হলো, দ্বিগুণেরও বেশি!",
      "সিরিয়া থেকে ফিরে এসে মাইসারা খাদিজা (রাঃ)কে বলল: হে আমার মনিব! আমি এমন সৎ, বিশ্বস্ত ও বরকতময় মানুষ কখনো দেখিনি! পথে এক পাদ্রী আমাকে বলেছেন, এই গাছের নিচে নবী ছাড়া কেউ বসে না। আর আমি নিজ চোখে দেখেছি, আকাশে দুটি ফেরেশতা তাঁকে ছায়া দিচ্ছিল!",
      "**বিবাহ:** খাদিজা (রাঃ) মুগ্ধ হলেন। তিনি তাঁর বান্ধবী নাফিসা বিনতে মানিয়্যাকে ডেকে বললেন: তুমি মুহাম্মাদ (সাঃ)ের কাছে গিয়ে আমার পক্ষ থেকে বিয়ের প্রস্তাব দাও। নাফিসা গেলেন এবং মুহাম্মাদ (সাঃ) সম্মতি দিলেন। ৫৯৫ খ্রিস্টাব্দে বিয়ে হলো। খাদিজা (রাঃ)র বয়স তখন চল্লিশ, মুহাম্মাদ (সাঃ)ের পঁচিশ। চাচা আবু তালিব খুতবা পড়লেন এবং মোহরানা ধার্য হলো ৫০০ স্বর্ণমুদ্রা। এই বিয়ে ২৫ বছর স্থায়ী হয়েছিল এবং খাদিজা (রাঃ)র জীবদ্দশায় রাসূল (সাঃ) অন্য কোনো বিয়ে করেননি।",
      "**সন্তান:** রাসূল (সাঃ) এর ঘরে খাদিজা (রাঃ)র ছয় সন্তান জন্মগ্রহণ করে। প্রথম সন্তান কাসিম, যার নামে রাসূলের কুনিয়াত আবুল কাসিম। কাসিম শৈশবেই মারা যান। এরপর চার কন্যা, যয়নাব, রুকাইয়া, উম্মে কুলসুম ও ফাতিমা (রাঃ)। সবশেষে আবদুল্লাহ, যাকে তাইয়্যেব ও তাহির উপাধি দেওয়া হয়েছিল। আবদুল্লাহও শৈশবে মারা যান। দুই পুত্রের মৃত্যুতে খাদিজা (রাঃ) ধৈর্য ধরেছিলেন এবং রাসূল (সাঃ) কে সান্ত্বনা দিয়েছিলেন।",
      "**প্রথম ঈমান, হেরা গুহার ঘটনা:** ৬১০ সাল, রমজান মাস। রাসূল (সাঃ) হেরা গুহায় ধ্যানমগ্ন ছিলেন। হঠাৎ ফেরেশতা জিবরাঈল (আঃ) এসে তাঁকে জড়িয়ে ধরে বললেন: পড়ুন!। রাসূল (সাঃ) বললেন: আমি পড়তে জানি না। তিনবার এভাবে হলো। তারপর জিবরাঈল (আঃ) কুরআনের প্রথম আয়াত শোনালেন:",
      "اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ",
      "অর্থাৎ, পড়ুন আপনার রবের নামে, যিনি সৃষ্টি করেছেন। [সূরা আলাক: ১]",
      "রাসূল (সাঃ) ভয়ে কাঁপতে কাঁপতে ঘরে ফিরলেন এবং খাদিজা (রাঃ)কে বললেন: যাম্মিলুনি! যাম্মিলুনি! (আমাকে আবৃত করো! আমাকে আবৃত করো!)। খাদিজা (রাঃ) তাঁকে কম্বল দিয়ে ঢেকে দিলেন। ভয় কমে গেলে রাসূল (সাঃ) পুরো ঘটনা বললেন এবং বললেন: আমি আমার জীবনের আশঙ্কা করছি।",
      "খাদিজা (রাঃ) এক মুহূর্তও দ্বিধা করলেন না। তিনি দৃঢ়তার সাথে বললেন -",
      "كَلَّا وَاللَّهِ لَا يُخْزِيكَ اللَّهُ أَبَدًا",
      "কখনো না! আল্লাহর কসম, আল্লাহ আপনাকে কখনো লাঞ্ছিত করবেন না!",
      "তারপর তিনি রাসূলের গুণাবলী গুনে বললেন -",
      "إِنَّكَ لَتَصِلُ الرَّحِمَ، وَتَصْدُقُ الْحَدِيثَ، وَتَحْمِلُ الْكَلَّ، وَتَكْسِبُ الْمَعْدُومَ، وَتَقْرِي الضَّيْفَ، وَتُعِينُ عَلَى نَوَائِبِ الْحَقِّ",
      "আপনি আত্মীয়তার বন্ধন রক্ষা করেন, সত্য কথা বলেন, দরিদ্রদের বোঝা বহন করেন, নিঃস্বদের সাহায্য করেন, মেহমানদারি করেন এবং বিপদগ্রস্তদের সাহায্য করেন। [সহীহ বুখারী]",
      "তারপর খাদিজা (রাঃ) রাসূলকে নিয়ে গেলেন তাঁর চাচাতো ভাই ওয়ারাকা ইবনে নওফলের কাছে, যিনি ছিলেন খ্রিস্টান পণ্ডিত। ওয়ারাকা সব শুনে বললেন: এ তো সেই নামুস (জিবরাঈল) যিনি মূসা (আঃ) এর কাছে এসেছিলেন! হায়! আমি যদি সেদিন জীবিত থাকতাম যেদিন তোমার কওম তোমাকে বের করে দেবে! এভাবে খাদিজা (রাঃ) হলেন প্রথম মুসলিম, নারী-পুরুষ নির্বিশেষে সর্বপ্রথম যিনি ইসলাম গ্রহণ করেন।",
      "**ইসলাম প্রচারে অবদান:** খাদিজা (রাঃ) তাঁর সমস্ত সম্পদ, সময় ও জীবন ইসলামের জন্য উৎসর্গ করেছিলেন। তিনি তাঁর বিশাল ব্যবসায়িক সম্পদ রাসূল (সাঃ) এর হাতে তুলে দিলেন। রাসূল (সাঃ) বলতেন: খাদিজা (রাঃ)র সম্পদ আমার সবচেয়ে বেশি উপকারে এসেছে। সেই সম্পদ দিয়ে রাসূল (সাঃ) দরিদ্র মুসলিমদের সাহায্য করতেন, ক্রীতদাস মুক্ত করতেন। যখন কুরাইশরা মুসলিমদের নির্যাতন করত, খাদিজা (রাঃ) তাঁর প্রভাব খাটিয়ে তাদের রক্ষা করতেন।",
      "**শিয়াবে আবু তালিব, তিন বছরের অবরোধ:** নবুয়তের সপ্তম বছর (৬১৬ সাল)। কুরাইশরা মুসলিমদের সম্পূর্ণ বয়কট করল। বনু হাশিম ও বনু মুত্তালিব গোত্রের সবাইকে শিয়াবে আবু তালিব নামক উপত্যকায় বন্দী করা হলো। খাদিজা (রাঃ)ও সেখানে ছিলেন, তখন তাঁর বয়স ৬০ এর কাছাকাছি। তিন বছর ধরে চলল এই অবরোধ। খাবারের চরম অভাব, পানির সংকট, রোগ-ব্যাধি, সব কিছু সহ্য করতে হলো। কখনো গাছের পাতা খেয়ে দিন কাটাতে হয়েছে। কখনো চামড়া সিদ্ধ করে খেতে হয়েছে। শিশুদের কান্নার শব্দ মক্কা পর্যন্ত পৌঁছাত। কিন্তু খাদিজা (রাঃ) কখনো অভিযোগ করেননি। তিনি ধৈর্য ধরেছিলেন এবং রাসূল (সাঃ) কে সান্ত্বনা দিতেন।",
      "**মৃত্যু:** তিন বছরের অবরোধের কষ্ট খাদিজা (রাঃ)র শরীরে প্রভাব ফেলেছিল। তিনি অসুস্থ হয়ে পড়লেন। নবুয়তের দশম বছর, রমজান মাস (৬২০ সাল)। ৬৫ বছর বয়সে খাদিজা (রাঃ) মক্কায় ইন্তেকাল করেন। তখনও জানাযার বিধান নাজিল হয়নি। রাসূল (সাঃ) নিজেই তাঁর লাশ গোসল দিলেন এবং কবরে নামালেন। তাঁকে জান্নাতুল মুয়াল্লায় দাফন করা হলো।",
      "**আমুল হুযন, দুঃখের বছর:** রাসূল (সাঃ) এত শোকাহত হলেন যে এই বছরকে আমুল হুযন (দুঃখের বছর) বলা হয়। কারণ এই বছরেই চাচা আবু তালিবও মারা যান। রাসূল (সাঃ) বলেছিলেন: আমি কখনো খাদিজা (রাঃ)র চেয়ে উত্তম স্ত্রী পাইনি। যখন সবাই আমাকে মিথ্যাবাদী বলেছিল, তখন সে আমাকে সত্য বলে মেনে নিয়েছে। যখন সবাই আমাকে অবিশ্বাস করেছিল, তখন সে আমাকে বিশ্বাস করেছে। যখন কেউ আমার সাহায্যে এগিয়ে আসেনি, তখন সে তার সম্পদ দিয়ে আমাকে সাহায্য করেছে। আল্লাহ তাঁর মাধ্যমে আমাকে সন্তান দান করেছেন।",
      "**চিরস্থায়ী ভালোবাসা:** খাদিজা (রাঃ)র মৃত্যুর পরও রাসূল (সাঃ) তাঁকে কখনো ভুলতে পারেননি। বাড়িতে ভালো খাবার রান্না হলে তিনি খাদিজা (রাঃ)র বান্ধবীদের কাছে পাঠাতেন। আয়েশা (রাঃ) বলেন: আমি খাদিজা (রাঃ)কে দেখিনি, তবুও তাঁর প্রতি আমার ঈর্ষা হতো। কারণ রাসূল (সাঃ) সবসময় তাঁর কথা স্মরণ করতেন। একবার আয়েশা (রাঃ) বললেন: আল্লাহ আপনাকে তাঁর চেয়ে উত্তম স্ত্রী দিয়েছেন। রাসূল (সাঃ) রাগান্বিত হয়ে বললেন:",
      "مَا أَبْدَلَنِي اللَّهُ خَيْرًا مِنْهَا",
      "কখনো না! আল্লাহর কসম, আল্লাহ আমাকে তাঁর চেয়ে উত্তম কাউকে দেননি। [সহীহ বুখারী]",
      "**মর্যাদা:** রাসূল (সাঃ) বলেছেন:",
      "خَيْرُ نِسَائِهَا مَرْيَمُ بِنْتُ عِمْرَانَ، وَخَيْرُ نِسَائِهَا خَدِيجَةُ",
      "পৃথিবীর সর্বশ্রেষ্ঠ চার নারী হলেন: মরিয়ম বিনতে ইমরান, আসিয়া বিনতে মুযাহিম (ফেরাউনের স্ত্রী), খাদিজা (রাঃ) বিনতে খুওয়াইলিদ এবং ফাতিমা বিনতে মুহাম্মাদ (সাঃ)। [সহীহ বুখারী]",
      "একবার জিবরাঈল (আঃ) এসে বললেন: হে আল্লাহর রাসূল! খাদিজা (রাঃ) আসছেন। তাঁর হাতে খাবারের পাত্র আছে। তাঁকে আল্লাহর সালাম জানাবেন এবং জান্নাতে মণি-মুক্তার তৈরি একটি প্রাসাদের সুসংবাদ দিবেন, যেখানে কোনো শোরগোল নেই, কোনো কষ্ট নেই। [সহীহ বুখারী]। খাদিজা (রাঃ) ছিলেন উম্মুল মুমিনীন, প্রথম মুসলিম, ইসলামের প্রথম দাঈ এবং জান্নাতের নারীদের সর্দার।"
    ]
  },
  {
    "id": "aisha_bint_abu_bakr",
    "categoryId": "ummahatul_mumineen",
    "title": "আয়েশা বিনতে আবু বকর (রাঃ)",
    "paragraphs": [
      "হযরত আয়েশা বিনতে আবু বকর (আরবি: عَائِشَة بِنْت أَبِي بَكْر; জন্ম: ৬১৪ – মৃত্যু: ৬৭৮) ছিলেন ইসলামের নবী মুহাম্মাদ (সাঃ)-এর সবচেয়ে প্রিয় স্ত্রী এবং প্রথম খলিফা আবু বকর সিদ্দিক (রাঃ)-এর কন্যা। তিনি ছিলেন অত্যন্ত জ্ঞানী, বুদ্ধিমতী এবং ইসলামী শিক্ষার এক উজ্জ্বল নক্ষত্র।",
      "**বংশ ও জন্ম:** আয়েশা (রাঃ) নবুয়তের চতুর্থ বা পঞ্চম বছরে (৬১৪ খ্রিস্টাব্দ) মক্কায় জন্মগ্রহণ করেন। তাঁর পিতা আবু বকর সিদ্দিক (রাঃ) ছিলেন রাসূল (সাঃ)-এর সবচেয়ে ঘনিষ্ঠ সাহাবী এবং প্রথম খলিফা। মা উম্মে রুমান (রাঃ) ছিলেন একজন মহীয়সী নারী। আয়েশা (রাঃ) ইসলামী পরিবেশে বেড়ে উঠেছিলেন এবং শৈশব থেকেই ইসলামের শিক্ষায় প্রশিক্ষিত হয়েছিলেন।",
      "**বিবাহ:** রাসূল (সাঃ)-এর প্রিয় স্ত্রী খাদিজা (রাঃ)-এর মৃত্যুর পর, খাওলা বিনতে হাকিম (রাঃ) রাসূল (সাঃ)-কে বললেন: হে আল্লাহর রাসূল! আপনি কি বিয়ে করবেন না? রাসূল (সাঃ) জিজ্ঞেস করলেন: কাকে? খাওলা বললেন: যদি আপনি চান, কুমারী, আয়েশা বিনতে আবু বকর। অথবা বিধবা, সাওদা বিনতে যামআ। রাসূল (সাঃ) বললেন: তাহলে তুমি আমার পক্ষ থেকে তাদের উভয়ের কাছে প্রস্তাব নিয়ে যাও।",
      "খাওলা আবু বকর (রাঃ)-এর কাছে গেলেন। আবু বকর (রাঃ) বললেন: তুমি অপেক্ষা করো, আমি উম্মে রুমানকে জিজ্ঞেস করি। উম্মে রুমান খুশিতে বললেন: এর চেয়ে বড় সম্মান আর কী হতে পারে! এভাবে নবুয়তের দশম বছরে (৬২০ খ্রিস্টাব্দ) আয়েশা (রাঃ)-এর সাথে রাসূল (সাঃ)-এর বিয়ে হয়। তখন আয়েশার বয়স ছিল ছয় বছর। হিজরতের পর মদীনায় শাওয়াল মাসে নয় বছর বয়সে বাসর হয়।",
      "**রাসূলের প্রিয় স্ত্রী:** আয়েশা (রাঃ) ছিলেন রাসূল (সাঃ)-এর সবচেয়ে প্রিয় স্ত্রী। আমর ইবনুল আস (রাঃ) একবার রাসূল (সাঃ)-কে জিজ্ঞেস করলেন:",
      "أَيُّ النَّاسِ أَحَبُّ إِلَيْكَ؟ قَالَ: عَائِشَةُ. قُلْتُ: فَمِنَ الرِّجَالِ؟ قَالَ: أَبُوهَا",
      "হে আল্লাহর রাসূল! আপনার কাছে সবচেয়ে প্রিয় কে? রাসূল (সাঃ) বললেন: আয়েশা। আমর বললেন: পুরুষদের মধ্যে? রাসূল (সাঃ) বললেন: তার পিতা (আবু বকর)। [সহীহ বুখারী]",
      "আয়েশা (রাঃ) বলেন: রাসূল (সাঃ) আমাকে হুমাইরা (লাল রঙের অধিকারী) বলে ডাকতেন। তিনি আরও বলেন: আল্লাহর কসম! আমি জানি যে, রাসূল (সাঃ) আমাকে ভালোবাসতেন। যখন তিনি আমার কাছে থাকতেন, তখন জিবরাঈল (আঃ) আসতেন। আর যখন অন্য স্ত্রীদের কাছে থাকতেন, তখন আসতেন না।",
      "**ইফকের ঘটনা, মিথ্যা অপবাদ:** বনু মুসতালিক যুদ্ধ থেকে ফেরার পথে এক বিরাট পরীক্ষা এলো। আয়েশা (রাঃ) তাঁর হার খুঁজতে গিয়ে কাফেলা থেকে পিছিয়ে পড়েন। সাহাবী সাফওয়ান ইবনুল মুআত্তাল (রাঃ) তাঁকে খুঁজে পেয়ে উটে তুলে দেন এবং মদীনায় পৌঁছে দেন। এই ঘটনা নিয়ে মুনাফিকরা মিথ্যা অপবাদ রটাতে শুরু করল।",
      "আয়েশা (রাঃ) বলেন: আমি এত কাঁদলাম যে, আমার চোখের পানি শুকিয়ে গেল। রাসূল (সাঃ) আমার কাছে এসে বললেন: হে আয়েশা! আমার কাছে তোমার সম্পর্কে এমন কথা পৌঁছেছে। যদি তুমি নির্দোষ হও, তাহলে আল্লাহ তোমার নির্দোষিতা প্রকাশ করবেন। আর যদি তুমি কোনো ভুল করে থাকো, তাহলে আল্লাহর কাছে ক্ষমা চাও।",
      "আয়েশা (রাঃ) বললেন: আল্লাহর কসম! আমি যদি বলি আমি নির্দোষ, তবে আপনারা বিশ্বাস করবেন না। আর যদি স্বীকার করি, তবে আল্লাহ জানেন আমি নির্দোষ। আমি শুধু ইয়াকুব (আঃ)-এর কথা বলতে পারি -",
      "فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ",
      "ধৈর্যই উত্তম এবং আল্লাহই সাহায্যকারী।",
      "এরপর আল্লাহ তায়ালা সূরা নূরের আয়াত নাজিল করলেন -",
      "إِنَّ الَّذِينَ جَاءُوا بِالْإِفْكِ عُصْبَةٌ مِّنكُمْ ۚ لَا تَحْسَبُوهُ شَرًّا لَّكُم ۖ بَلْ هُوَ خَيْرٌ لَّكُمْ",
      "অর্থ: যারা এই মিথ্যা অপবাদ রটনা করেছে তারা তোমাদেরই একটি দল। তোমরা একে তোমাদের জন্য মন্দ মনে করো না, বরং এটা তোমাদের জন্য কল্যাণকর। [সূরা নূর: ১১]",
      "এভাবে আল্লাহ তায়ালা কুরআনে আয়েশা (রাঃ)-এর নির্দোষিতা ঘোষণা করলেন। রাসূল (সাঃ) খুশিতে হেসে বললেন: হে আয়েশা! সুসংবাদ! আল্লাহ তোমার নির্দোষিতা প্রকাশ করেছেন। আয়েশার মা বললেন: উঠে রাসূলকে ধন্যবাদ দাও। আয়েশা (রাঃ) বললেন: আল্লাহর কসম! আমি শুধু আল্লাহর প্রশংসা করব, কারণ তিনিই আমার নির্দোষিতা প্রকাশ করেছেন। [সহীহ বুখারী]",
      "**জ্ঞান ও হাদিস বর্ণনা:** আয়েশা (রাঃ) ছিলেন অত্যন্ত জ্ঞানী এবং তীক্ষ্ণ বুদ্ধিসম্পন্ন। তিনি ২,২১০টি হাদিস বর্ণনা করেছেন, যার মধ্যে ১৭৪টি সহীহ বুখারী ও মুসলিম উভয়ে বর্ণিত। সাহাবীরা কঠিন মাসআলা বুঝতে না পারলে তাঁর কাছে আসতেন। উরওয়া ইবনে যুবাইর বলেন: আমি কুরআন, ফারায়েজ (উত্তরাধিকার), হালাল-হারাম, কবিতা, চিকিৎসা এবং আরবের ইতিহাসে আয়েশার চেয়ে বেশি জ্ঞানী কাউকে দেখিনি।",
      "মুআবিয়া (রাঃ) বলেন: আল্লাহর কসম! আমি আয়েশার চেয়ে বেশি ফাসিহ (বিশুদ্ধ আরবি ভাষায় কথা বলা) এবং বালিগ (সুন্দর বক্তা) কাউকে শুনিনি। আবু মূসা আশআরী (রাঃ) বলেন: যখনই আমরা সাহাবীরা কোনো হাদিসে সন্দেহে পড়তাম, আয়েশার কাছে জিজ্ঞেস করলেই তার সমাধান পেতাম।",
      "**রাসূলের শেষ মুহূর্ত:** রাসূল (সাঃ)-এর অসুস্থতার সময় তিনি তাঁর স্ত্রীদের কাছে জিজ্ঞেস করলেন: আমি আগামীকাল কোথায় থাকব? তাঁরা বুঝতে পারলেন যে, তিনি আয়েশার ঘরে থাকতে চান। তাঁরা সবাই সম্মতি দিলেন। আয়েশা (রাঃ) বলেন: রাসূল (সাঃ) আমার ঘরে, আমার পালার দিনে, আমার বুকে মাথা রেখে ইন্তেকাল করেছেন। আল্লাহ আমার লালা তাঁর লালার সাথে মিশিয়ে দিয়েছেন।",
      "তিনি বলেন: আবদুর রহমান ইবনে আবু বকর (আমার ভাই) একটি মিসওয়াক নিয়ে এলো। রাসূল (সাঃ) সেদিকে তাকালেন। আমি বুঝলাম তিনি মিসওয়াক চান। আমি মিসওয়াকটি নিয়ে নরম করে তাঁকে দিলাম। তিনি মিসওয়াক করলেন। এরপর তাঁর হাত নিচে নেমে গেল এবং তিনি বললেন: আর-রাফিকুল আলা (সর্বোচ্চ বন্ধু, আল্লাহ)। এভাবে তিনি ইন্তেকাল করলেন। [সহীহ বুখারী]",
      "**জামালের যুদ্ধ:** রাসূল (সাঃ)-এর ইন্তেকালের পর, উসমান (রাঃ)-এর হত্যার বিচার নিয়ে মতবিরোধ দেখা দিলে আয়েশা (রাঃ) বিচারের দাবিতে বসরা গমন করেন। ৬৫৬ খ্রিস্টাব্দে তালহা ও যুবাইর (রাঃ)-এর সাথে তিনি আলী (রাঃ)-এর বিরুদ্ধে অবস্থান নেন। এই যুদ্ধে তিনি একটি উটের হাওদায় ছিলেন, তাই এটি জামালের যুদ্ধ (উটের যুদ্ধ) নামে পরিচিত।",
      "যুদ্ধে তালহা ও যুবাইর (রাঃ) শহীদ হন এবং আলী (রাঃ) বিজয়ী হন। আলী (রাঃ) আয়েশা (রাঃ)-কে সম্মানের সাথে মদীনায় ফেরত পাঠান। পরবর্তীতে আয়েশা (রাঃ) এই যুদ্ধে অংশগ্রহণের জন্য অনুতপ্ত হয়েছিলেন এবং বলতেন: হায়! আমি যদি সেদিন ঘরে বসে থাকতাম! তাঁর মৃত্যুতে পুরো মুসলিম উম্মাহ গভীর শোকে মুহ্যমান হয়েছিল। তিনি ছিলেন উম্মাহাতুল মুমিনীন এবং সকল মুসলমানের মা। তাঁর জীবন ছিল ঈমান, তাকওয়া এবং আল্লাহর রাসূলের প্রতি ভালোবাসায় পূর্ণ। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন।",
      "**শিক্ষাদান ও ইবাদত:** আয়েশা (রাঃ) তাঁর জীবনের বাকি সময় মদীনায় শিক্ষাদান ও ইবাদতে কাটিয়েছেন। তাঁর ঘরে একটি পর্দার আড়ালে বসে তিনি পুরুষ ও নারী উভয়কে শিক্ষা দিতেন। তাঁর বিখ্যাত ছাত্রদের মধ্যে ছিলেন উরওয়া ইবনে যুবাইর, কাসিম ইবনে মুহাম্মাদ (সাঃ), আমরা বিনতে আবদুর রহমান এবং আরও অনেকে।",
      "তিনি অত্যন্ত দানশীল ছিলেন। একবার তাঁকে এক লক্ষ দিরহাম দেওয়া হলো। তিনি সব রোজা রেখে বিতরণ করে দিলেন। সন্ধ্যায় তাঁর দাসী বলল: আপনি কি আমাদের জন্য এক দিরহাম রাখতে পারতেন না? আয়েশা (রাঃ) বললেন: তুমি যদি আমাকে মনে করিয়ে দিতে, তাহলে আমি রাখতাম। তিনি বিশ্বাস করতেন যে সম্পদ আল্লাহর দেওয়া আমানত এবং তা গরিব-দুঃখীদের মধ্যে বিতরণ করা উচিত। তিনি কখনো নিজের জন্য সম্পদ জমা করতেন না বরং আল্লাহর পথে খরচ করতেন। তাঁর দানশীলতা ছিল কিংবদন্তি এবং সবাই তাঁর উদারতার প্রশংসা করত।",
      "**ইন্তেকাল:** ৬৭৮ খ্রিস্টাব্দের ১৭ রমজান (মতান্তরে শাওয়াল), মঙ্গলবার রাতে ৬৪ বছর বয়সে আয়েশা (রাঃ) মদীনায় ইন্তেকাল করেন। তাঁর ইচ্ছা অনুযায়ী তাঁকে রাতেই জান্নাতুল বাকীতে দাফন করা হয়। আবু হুরায়রা (রাঃ) তাঁর জানাজার নামাজ পড়ান। হাজার হাজার মানুষ তাঁর জানাজায় অংশ নেয়। তাঁর মৃত্যুতে পুরো মদীনা শোকে মুহ্যমান হয়ে পড়ে। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ]
  },
  {
    "id": "hafsa_bint_umar",
    "categoryId": "ummahatul_mumineen",
    "title": "হাফসা বিনতে উমর (রাঃ)",
    "summary": "উমর (রাঃ)-এর কন্যা এবং রাসূল (সাঃ)-এর স্ত্রী। তিনি কুরআন হিফজকারী ছিলেন এবং তাঁর কাছে কুরআনের মূল কপি সংরক্ষিত ছিল।",
    "paragraphs": [
      "**প্রারম্ভিক জীবন:** হাফসা (রাঃ) ছিলেন উমর ইবনুল খাত্তাব (রাঃ)-এর কন্যা। তিনি ছিলেন অত্যন্ত জ্ঞানী, ইবাদতগুজার এবং কুরআনের হাফিজা।",
      "প্রথমে তিনি খুনাইস ইবনে হুজাফা (রাঃ)-এর সাথে বিবাহবন্ধনে আবদ্ধ হন। তিনি ছিলেন একজন সাহাবী যিনি বদর ও উহুদ যুদ্ধে অংশগ্রহণ করেন। উহুদ যুদ্ধে তিনি আহত হন এবং পরে শাহাদাত বরণ করেন।",
      "হাফসা (রাঃ) বিধবা হয়ে গেলেন। উমর (রাঃ) তাঁর কন্যার জন্য চিন্তিত হলেন এবং আবু বকর (রাঃ) ও উসমান (রাঃ)-এর কাছে বিয়ের প্রস্তাব দিলেন। কিন্তু তাঁরা কোনো উত্তর দিলেন না।",
      "উমর (রাঃ) দুঃখিত হয়ে রাসূল (সাঃ)-এর কাছে গেলেন এবং বললেন: হে আল্লাহর রাসূল! আমি আবু বকর ও উসমানের কাছে হাফসার বিয়ের প্রস্তাব দিয়েছিলাম কিন্তু তারা কোনো উত্তর দেননি।",
      "**রাসূলের সাথে বিবাহ:** রাসূল (সাঃ) মুচকি হেসে বললেন: হাফসা এমন একজনকে বিয়ে করবে যে উসমান থেকে ভালো এবং উসমান এমন একজনকে বিয়ে করবে যে হাফসা থেকে ভালো।",
      "এরপর রাসূল (সাঃ) নিজেই হাফসা (রাঃ)-কে বিয়ে করলেন এবং উসমান (রাঃ) রাসূল (সাঃ)-এর কন্যা উম্মে কুলসুম (রাঃ)-কে বিয়ে করলেন।",
      "**ইবাদত:** হাফসা (রাঃ) ছিলেন অত্যন্ত ইবাদতগুজার। তিনি দিনে রোজা রাখতেন এবং রাতে নামাজ পড়তেন। আয়েশা (রাঃ) বলেছেন যে হাফসা (রাঃ) তাঁর সমকক্ষ ছিলেন ইবাদত ও জ্ঞানে।",
      "তিনি কুরআন হিফজ করেছিলেন এবং হাদিস বর্ণনা করতেন। তাঁর থেকে ৬০টি হাদিস বর্ণিত হয়েছে।",
      "**কুরআন সংরক্ষণ:** আবু বকর (রাঃ) যখন কুরআন সংকলন করলেন, সেই মূল কপি হাফসা (রাঃ)-এর কাছে সংরক্ষিত ছিল। উসমান (রাঃ) যখন খলিফা হলেন এবং কুরআনের একাধিক কপি তৈরি করার সিদ্ধান্ত নিলেন, তখন তিনি হাফসা (রাঃ)-এর কাছ থেকে সেই মূল কপি নিয়েছিলেন।",
      "**ইন্তেকাল:** হাফসা (রাঃ) ৪৫ হিজরিতে ৬৩ বছর বয়সে মদিনায় ইন্তেকাল করেন। আব্দুল্লাহ ইবনে উমর (রাঃ) তাঁর জানাজার নামাজ পড়ান এবং তাঁকে জান্নাতুল বাকিতে দাফন করা হয়।"
    ],
    "source": "সহীহ বুখারী; সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "zainab_bint_khuzayma",
    "categoryId": "ummahatul_mumineen",
    "title": "যায়নাব বিনতে খুজাইমা (রাঃ)",
    "summary": "তাঁকে 'উম্মুল মাসাকিন' (গরিবদের মা) বলা হতো কারণ তিনি গরিব-মিসকিনদের অত্যন্ত সেবা করতেন।",
    "paragraphs": [
      "**প্রারম্ভিক জীবন ও ইসলাম গ্রহণ:** যায়নাব বিনতে খুজাইমা (রাঃ) ছিলেন রাসূল (সাঃ)-এর স্ত্রীদের একজন। তাঁকে উম্মুল মাসাকিন (গরিবদের মা) উপাধিতে ভূষিত করা হয়েছিল।",
      "ইসলামের প্রথম দিকেই তিনি মুসলমান হয়েছিলেন এবং মক্কায় অত্যাচার সহ্য করেছিলেন। তিনি ছিলেন অত্যন্ত দয়ালু এবং গরিব-মিসকিনদের প্রতি সহানুভূতিশীল।",
      "**প্রথম বিবাহ:** তাঁর প্রথম স্বামী ছিলেন তুফাইল ইবনে হারিস (রাঃ)। তাঁর সাথে বিচ্ছেদের পর তিনি উবাইদা ইবনে হারিস (রাঃ)-কে বিয়ে করেন।",
      "**উবাইদার শাহাদাত:** উবাইদা (রাঃ) ছিলেন একজন সাহসী যোদ্ধা এবং রাসূল (সাঃ)-এর চাচাতো ভাই। বদরের যুদ্ধে তিনি মুবারাজা (দ্বন্দ্ব যুদ্ধ) করেন এবং গুরুতর আহত হন।",
      "বদরের যুদ্ধে উবাইদা (রাঃ) তিনজন মুসলমানের একজন ছিলেন যারা তিনজন কুরাইশ যোদ্ধার বিরুদ্ধে লড়াই করেন। তিনি উতবা ইবনে রাবিয়ার বিরুদ্ধে লড়াই করেন এবং তাঁর পা কেটে যায়। তিনি ইসলামের শিক্ষা গভীরভাবে অধ্যয়ন করেছিলেন এবং তাঁর জীবনে প্রয়োগ করেছিলেন। তাঁর ঈমান ছিল দৃঢ় এবং অটল। কোনো পরীক্ষা বা বিপদ তাঁকে আল্লাহর পথ থেকে সরাতে পারেনি।",
      "যুদ্ধের পর মদিনায় ফেরার পথে সাফরা নামক স্থানে তিনি শাহাদাত বরণ করেন। রাসূল (সাঃ) তাঁর জানাজার নামাজ পড়ান এবং তাঁকে সেখানে দাফন করা হয়। এই যুদ্ধে তিনি অসাধারণ বীরত্ব ও সাহস প্রদর্শন করেছিলেন এবং ইসলামের জন্য জীবন বাজি রেখেছিলেন। তিনি ইসলামের শিক্ষা গভীরভাবে অধ্যয়ন করেছিলেন এবং তাঁর জীবনে প্রয়োগ করেছিলেন। তাঁর ঈমান ছিল দৃঢ় এবং অটল। কোনো পরীক্ষা বা বিপদ তাঁকে আল্লাহর পথ থেকে সরাতে পারেনি।",
      "**বিধবা জীবন:** যায়নাব (রাঃ) বিধবা হয়ে গেলেন। তিনি ছিলেন অত্যন্ত দানশীল এবং গরিবদের সেবা করতেন। তাঁর কাছে যা থাকত তা-ই গরিবদের মধ্যে বিতরণ করে দিতেন।",
      "জাহিলিয়াতের যুগেও তিনি গরিবদের খাওয়াতেন এবং সাহায্য করতেন। ইসলাম গ্রহণের পর এই অভ্যাস আরও বেড়ে যায়। মানুষ তাঁকে উম্মুল মাসাকিন বলে ডাকত।",
      "**রাসূলের সাথে বিবাহ:** রাসূল (সাঃ) তাঁর দানশীলতা ও চরিত্রের কথা শুনে ৪ হিজরিতে তাঁকে বিয়ে করেন। এটি ছিল একদিকে তাঁর সম্মান, অন্যদিকে শহীদ সাহাবীর বিধবা স্ত্রীর প্রতি সহানুভূতি।",
      "রাসূল (সাঃ) তাঁকে ৪০০ দিরহাম মোহর দেন এবং তাঁর জন্য একটি ওলিমা (বিয়ের ভোজ) করেন।",
      "**মৃত্যু:** যায়নাব (রাঃ) রাসূল (সাঃ)-এর ঘরে মাত্র ২-৩ মাস ছিলেন। এরপর তিনি অসুস্থ হয়ে পড়েন এবং রবিউল আখির মাসে ৪ হিজরিতে ইন্তেকাল করেন।",
      "রাসূল (সাঃ) নিজে তাঁর জানাজার নামাজ পড়ান এবং তাঁকে জান্নাতুল বাকিতে দাফন করা হয়। তিনি ছিলেন রাসূল (সাঃ)-এর স্ত্রীদের মধ্যে প্রথম যিনি তাঁর জীবদ্দশায় ইন্তেকাল করেন।",
      "যদিও তাঁর জীবন সংক্ষিপ্ত ছিল, তাঁর দানশীলতা ও গরিবদের প্রতি ভালোবাসা তাঁকে উম্মুল মাসাকিন উপাধি এনে দিয়েছে যা চিরকাল স্মরণীয় হয়ে আছে। তিনি আল্লাহর পথে অকাতরে দান করতেন এবং কখনো নিজের জন্য সম্পদ জমা করতেন না। তিনি বিশ্বাস করতেন যে সম্পদ আল্লাহর দেওয়া আমানত এবং তা গরিব-দুঃখীদের মধ্যে বিতরণ করা উচিত। তিনি কখনো নিজের জন্য সম্পদ জমা করতেন না বরং আল্লাহর পথে খরচ করতেন। তাঁর দানশীলতা ছিল কিংবদন্তি এবং সবাই তাঁর উদারতার প্রশংসা করত।",
      "أَسْرَعُكُنَّ لَحَاقًا بِي أَطْوَلُكُنَّ يَدًا",
      "অর্থ: তোমাদের মধ্যে যার হাত সবচেয়ে লম্বা (অর্থাৎ যে সবচেয়ে বেশি দান করে) সে সবার আগে আমার সাথে মিলিত হবে। [সহীহ বুখারী]",
      "আয়েশা (রাঃ) বলেছেন যে যায়নাব (রাঃ) অত্যন্ত দয়ালু এবং নম্র স্বভাবের ছিলেন। তিনি সবসময় গরিবদের কথা চিন্তা করতেন এবং তাদের সাহায্য করতেন।"
    ],
    "source": "সিয়ারু আ'লামিন নুবালা; ইবনে সা'দ"
  },
  {
    "id": "juwayriya_bint_harith",
    "categoryId": "ummahatul_mumineen",
    "title": "জুওয়াইরিয়া বিনতে হারিস (রাঃ)",
    "summary": "তিনি ছিলেন বনু মুসতালিক গোত্রের নেতার কন্যা। রাসূল (সাঃ) তাঁকে বিয়ে করায় পুরো গোত্র মুসলমান হয়েছিল।",
    "paragraphs": [
      "**প্রারম্ভিক জীবন:** জুওয়াইরিয়া (রাঃ) ছিলেন বনু মুসতালিক গোত্রের নেতা হারিস ইবনে আবি দিরারের কন্যা। তিনি ছিলেন অত্যন্ত সুন্দরী এবং সম্ভ্রান্ত পরিবারের।",
      "৫ হিজরিতে বনু মুসতালিক যুদ্ধে মুসলমানরা বিজয়ী হন। যুদ্ধবন্দীদের মধ্যে জুওয়াইরিয়া (রাঃ)-ও ছিলেন। তিনি সাবিত ইবনে কায়েস (রাঃ)-এর ভাগে পড়েন।",
      "**বিবাহ ও মুক্তি:** জুওয়াইরিয়া (রাঃ) রাসূল (সাঃ)-এর কাছে এসে বললেন: হে আল্লাহর রাসূল! আমি হারিস ইবনে আবি দিরারের কন্যা এবং আমার গোত্রের নেতা। আমার উপর যা ঘটেছে তা আপনি জানেন। আমি সাবিতের ভাগে পড়েছি এবং তিনি আমার মুক্তিপণ চেয়েছেন। আমি আপনার কাছে সাহায্য চাইতে এসেছি।",
      "রাসূল (সাঃ) বললেন: আমি কি তোমাকে এর চেয়ে ভালো কিছু দিতে পারি? জুওয়াইরিয়া (রাঃ) জিজ্ঞেস করলেন: সেটা কী, হে আল্লাহর রাসূল? রাসূল (সাঃ) বললেন: আমি তোমার মুক্তিপণ পরিশোধ করব এবং তোমাকে বিয়ে করব।",
      "জুওয়াইরিয়া (রাঃ) খুশি হয়ে রাজি হলেন। রাসূল (সাঃ) তাঁর মুক্তিপণ দিয়ে তাঁকে মুক্ত করলেন এবং বিয়ে করলেন। এই বিয়ের খবর শুনে সাহাবীরা বললেন যে এখন বনু মুসতালিক রাসূল (সাঃ)-এর আত্মীয় হয়ে গেছে, তাই তাদের বন্দী করে রাখা উচিত নয়। সাহাবীরা তাদের কাছে থাকা সব বনু মুসতালিক বন্দীদের মুক্ত করে দিলেন।",
      "আয়েশা (রাঃ) বলেছেন যে জুওয়াইরিয়া (রাঃ)-এর চেয়ে বেশি বরকতময় কোনো নারী তাঁর গোত্রের জন্য ছিল না। তাঁর কারণে ১০০টি পরিবার মুক্তি পেয়েছিল।",
      "**ইবাদত:** জুওয়াইরিয়া (রাঃ) অত্যন্ত ইবাদতগুজার ছিলেন। একবার রাসূল (সাঃ) ফজরের পর তাঁকে তাসবিহ পড়তে দেখলেন এবং দুপুরে ফিরে এসেও তাঁকে সেই অবস্থায় পেলেন। রাসূল (সাঃ) বললেন: তুমি কি সকাল থেকে এখনও এই অবস্থায় আছ? জুওয়াইরিয়া (রাঃ) বললেন: হ্যাঁ, হে আল্লাহর রাসূল। রাসূল (সাঃ) বললেন: আমি তোমার পর তিনটি কথা চারবার বলেছি যা তুমি সকাল থেকে যা পড়েছ তার চেয়ে ভারী - সুবহানাল্লাহি ওয়া বিহামদিহি আদাদা খালকিহি ওয়া রিদা নাফসিহি ওয়া যিনাতা আরশিহি ওয়া মিদাদা কালিমাতিহি।",
      "**ইন্তেকাল:** জুওয়াইরিয়া (রাঃ) ৫০ হিজরিতে ৬৫ বছর বয়সে ইন্তেকাল করেন। মারওয়ান ইবনে হাকাম তাঁর জানাজার নামাজ পড়ান এবং তাঁকে জান্নাতুল বাকিতে দাফন করা হয়।"
    ],
    "source": "সহীহ মুসলিম; সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "umm_salama",
    "categoryId": "ummahatul_mumineen",
    "title": "উম্মে সালামা (রাঃ)",
    "paragraphs": [
      "হযরত উম্মে সালামা (আরবি: أُمّ سَلَمَة; পূর্ণ নাম: হিন্দ বিনতে আবি উমাইয়া; মৃত্যু: ৬৮১) ছিলেন উম্মুল মুমিনীন এবং রাসূলুল্লাহ (সাঃ)-এর অন্যতম জ্ঞানী ও বুদ্ধিমতী স্ত্রী। তিনি ছিলেন অত্যন্ত ধৈর্যশীল এবং দূরদর্শী মহিলা। তাঁর মৃত্যুতে পুরো মুসলিম উম্মাহ গভীর শোকে মুহ্যমান হয়েছিল। তিনি ছিলেন উম্মাহাতুল মুমিনীন এবং সকল মুসলমানের মা। তাঁর জীবন ছিল ঈমান, তাকওয়া এবং আল্লাহর রাসূলের প্রতি ভালোবাসায় পূর্ণ। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন।",
      "**বংশ ও প্রাথমিক জীবন:** উম্মে সালামা (রাঃ) মক্কার সম্ভ্রান্ত কুরাইশ বংশে জন্মগ্রহণ করেন। তাঁর পিতা আবু উমাইয়া ইবনে মুগীরা ছিলেন মক্কার অন্যতম ধনী ও প্রভাবশালী ব্যক্তি। তাঁর প্রকৃত নাম ছিল হিন্দ, কিন্তু তাঁর পুত্র সালামার নামে তিনি উম্মে সালামা নামে পরিচিত হন।",
      "**প্রথম স্বামী আবু সালামা:** ইসলামের প্রথম দিকে উম্মে সালামা (রাঃ) আবু সালামা (রাঃ)-কে বিয়ে করেন। তাঁরা উভয়েই প্রথম দিকে ইসলাম গ্রহণ করেছিলেন এবং কুরাইশদের নির্যাতনের শিকার হয়েছিলেন। তাঁরা হাবশায় (আবিসিনিয়া) হিজরত করেন এবং সেখানে তাঁদের পুত্র সালামার জন্ম হয়।",
      "**মদীনায় হিজরত, বিচ্ছেদের কষ্ট:** মক্কা থেকে মদীনায় হিজরতের সময় উম্মে সালামা (রাঃ)-এর পরিবার এক মর্মান্তিক ঘটনার সম্মুখীন হয়। তিনি বলেন: যখন আবু সালামা মদীনায় হিজরতের সিদ্ধান্ত নিলেন, তখন তিনি আমাকে এবং আমার ছেলে সালামাকে উটে তুলে নিলেন। কিন্তু আমার গোত্রের লোকেরা এসে বলল: তুমি যেতে পারো, কিন্তু আমাদের মেয়েকে নিয়ে যেতে পারবে না!",
      "তাঁরা জোর করে উম্মে সালামা (রাঃ)-কে উট থেকে নামিয়ে দিল। এরপর আবু সালামার গোত্র এসে বলল: আমাদের ছেলেকেও তোমরা রাখতে পারবে না! তাঁরা শিশু সালামাকে টেনে নিয়ে গেল। এভাবে স্বামী মদীনায়, স্ত্রী মক্কায় এবং সন্তান অন্য জায়গায়, তিনজন তিন জায়গায় বিচ্ছিন্ন হয়ে গেল। উম্মে সালামা (রাঃ) বলেন: আমি প্রতিদিন মক্কার বাইরে গিয়ে কাঁদতাম এবং আল্লাহর কাছে দোয়া করতাম। এক বছর পর আল্লাহর রহমতে তাঁদের পুনর্মিলন হয় এবং তাঁরা মদীনায় হিজরত করেন।",
      "আবু সালামার শাহাদাত: উহুদের যুদ্ধে আবু সালামা (রাঃ) আহত হন। কিছুদিন পর তাঁর ক্ষত সেরে যায়। কিন্তু পরবর্তীতে বনু আসাদ অভিযানে তাঁর পুরনো ক্ষত আবার খুলে যায় এবং তিনি শহীদ হন। মৃত্যুর আগে তিনি উম্মে সালামা (রাঃ)-কে বললেন: আমি রাসূল (সাঃ)-কে বলতে শুনেছি: যখন কোনো মুসিবত আসে, তখন বলো: إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا (আমরা আল্লাহর জন্য এবং তাঁর কাছেই ফিরে যাব। হে আল্লাহ! আমাকে এই মুসিবতে সওয়াব দাও এবং এর চেয়ে উত্তম বিনিময় দাও)।",
      "উম্মে সালামা (রাঃ) বলেন: আবু সালামা মারা গেলে আমি এই দোয়া পড়লাম। কিন্তু মনে মনে ভাবলাম: আবু সালামার চেয়ে উত্তম কে হতে পারে? কিন্তু আল্লাহ তাঁকে রাসূলুল্লাহ (সাঃ)-এর সাথে বিয়ে দিয়ে এর উত্তর দিলেন। [সহীহ মুসলিম]",
      "**রাসূলের সাথে বিবাহ:** আবু সালামার মৃত্যুর পর আবু বকর ও উমর (রাঃ) উম্মে সালামা (রাঃ)-কে বিয়ের প্রস্তাব দেন, কিন্তু তিনি প্রত্যাখ্যান করেন। এরপর রাসূলুল্লাহ (সাঃ) নিজে প্রস্তাব পাঠান। উম্মে সালামা (রাঃ) বললেন: হে আল্লাহর রাসূল! আমার তিনটি সমস্যা আছে: আমি অত্যন্ত ঈর্ষাপরায়ণ, আমার অনেক সন্তান আছে এবং আমি বয়স্কা। রাসূল (সাঃ) বললেন: ঈর্ষার ব্যাপারে আমি আল্লাহর কাছে দোয়া করব। সন্তানদের দায়িত্ব আল্লাহ ও তাঁর রাসূলের। আর বয়সের ব্যাপারে, আমিও তো বয়স্ক। এভাবে ৪ হিজরিতে তাঁদের বিয়ে হয়।",
      "**জ্ঞান ও বুদ্ধিমত্তা:** উম্মে সালামা (রাঃ) ছিলেন অত্যন্ত জ্ঞানী এবং বুদ্ধিমতী। তিনি ৩৭৮টি হাদিস বর্ণনা করেছেন। মহিলারা তাঁর কাছে ইসলামী বিধান জিজ্ঞাসা করতে আসত। হুদায়বিয়ার সন্ধির সময় তাঁর পরামর্শ ইসলামের ইতিহাসে অত্যন্ত গুরুত্বপূর্ণ ছিল।",
      "**হুদায়বিয়ার সন্ধি, বুদ্ধিমত্তার পরামর্শ:** হুদায়বিয়ার সন্ধির পর রাসূল (সাঃ) সাহাবীদের বললেন: তোমরা কুরবানি করো এবং মাথা মুণ্ডন করো। কিন্তু সাহাবীরা সন্ধির শর্তে মর্মাহত হয়ে কেউ উঠলেন না। রাসূল (সাঃ) তিনবার বললেন, কিন্তু কেউ সাড়া দিলেন না। রাসূল (সাঃ) দুঃখিত হয়ে উম্মে সালামা (রাঃ)-এর তাঁবুতে গেলেন এবং ঘটনা বললেন।",
      "উম্মে সালামা (রাঃ) বললেন: হে আল্লাহর রাসূল! আপনি তাদের সাথে কথা না বলে নিজেই বাইরে গিয়ে কুরবানি করুন এবং মাথা মুণ্ডন করুন। তাহলে তারা আপনাকে দেখে নিজেরাই করবে। রাসূল (সাঃ) এই পরামর্শ মেনে নিলেন এবং বাইরে গিয়ে কুরবানি করলেন ও মাথা মুণ্ডন করলেন। সাহাবীরা তাঁকে দেখে সাথে সাথে কুরবানি ও মাথা মুণ্ডন করতে শুরু করলেন। এভাবে উম্মে সালামা (রাঃ)-এর বুদ্ধিমত্তা একটি বড় সমস্যার সমাধান করল। [সহীহ বুখারী]",
      "**ধৈর্য ও সবর:** উম্মে সালামা (রাঃ) ছিলেন অত্যন্ত ধৈর্যশীল। স্বামী-সন্তান বিচ্ছেদ, স্বামীর মৃত্যু, সব কিছুতে তিনি ধৈর্য ধরেছিলেন এবং আল্লাহর উপর ভরসা রেখেছিলেন। তাঁর জীবন ধৈর্য ও সবরের এক উজ্জ্বল দৃষ্টান্ত।",
      "**ইন্তেকাল:** ৬৮১ খ্রিস্টাব্দে (৬১ হিজরি) মদীনায় প্রায় ৮৪ বছর বয়সে তিনি ইন্তেকাল করেন। তিনি ছিলেন রাসূল (সাঃ)-এর স্ত্রীদের মধ্যে সর্বশেষ ইন্তেকালকারী। তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "source": "সহীহ বুখারী; সহীহ মুসলিম; সীরাতে ইবনে হিশাম; তাবাকাতে ইবনে সাদ।"
  },
  {
    "id": "safiyya_bint_huyayy",
    "categoryId": "ummahatul_mumineen",
    "title": "সাফিয়্যা বিনতে হুয়াই (রাঃ)",
    "paragraphs": [
      "হযরত সাফিয়্যা বিনতে হুয়াই (আরবি: صَفِيَّة بِنْت حُيَيّ; জন্ম: ৬১০ – মৃত্যু: ৬৭০) ছিলেন উম্মুল মুমিনীন এবং রাসূলুল্লাহ (সাঃ)-এর স্ত্রী। তিনি ছিলেন ইহুদি বংশোদ্ভূত একজন মহান মুসলিম মহিলা যিনি তাঁর জ্ঞান, ধৈর্য এবং চরিত্রের জন্য বিখ্যাত ছিলেন।",
      "**বংশ ও প্রাথমিক জীবন:** সাফিয়্যা (রাঃ) বনু নাদির গোত্রের সম্ভ্রান্ত ইহুদি পরিবারে জন্মগ্রহণ করেন। তাঁর পিতা হুয়াই ইবনে আখতাব ছিলেন বনু নাদিরের নেতা এবং মা বাররা বিনতে সামুয়াল ছিলেন বনু কুরাইযার বংশধর। তিনি ছিলেন অত্যন্ত সুন্দরী এবং বুদ্ধিমতী। প্রথমে তাঁর বিয়ে হয় সাল্লাম ইবনে মিশকামের সাথে এবং পরে কিনানা ইবনে আবিল হুকাইকের সাথে।",
      "স্বপ্ন: সাফিয়্যা (রাঃ) বলেন: আমি আমার পিতার সবচেয়ে প্রিয় সন্তান ছিলাম। কিন্তু রাসূলুল্লাহ (সাঃ) মদীনায় আসার পর আমার পিতা ও চাচা তাঁর কাছে গেলেন এবং ফিরে এসে আমার দিকে তাকালেন না। আমি তাদের কথা শুনলাম। চাচা বললেন: তিনিই কি সেই ব্যক্তি? পিতা বললেন: হ্যাঁ, আল্লাহর কসম! চাচা বললেন: তুমি তাঁকে চিনতে পেরেছ? পিতা বললেন: হ্যাঁ। চাচা বললেন: তাহলে তোমার মনোভাব কী? পিতা বললেন: আল্লাহর কসম! যতদিন বেঁচে থাকব তাঁর শত্রুতা করব।",
      "সাফিয়্যা (রাঃ) আরও বলেন: একদিন আমি স্বপ্ন দেখলাম যে, চাঁদ আকাশ থেকে নেমে এসে আমার কোলে পড়ল। আমি আমার স্বামী কিনানাকে স্বপ্নটি বললাম। সে রেগে গিয়ে আমার মুখে এমন জোরে চড় মারল যে আমার চোখে কালশিটে পড়ে গেল। সে বলল: তুমি কি ইয়াসরিবের (মদীনার) রাজাকে বিয়ে করতে চাও? আমি তখন বুঝতে পারিনি যে এই স্বপ্নের অর্থ কী।",
      "খায়বারের যুদ্ধ: ৭ হিজরিতে (৬২৮ খ্রিস্টাব্দ) খায়বারের যুদ্ধে মুসলিমরা বিজয়ী হন। সাফিয়্যা (রাঃ)-এর স্বামী কিনানা যুদ্ধে নিহত হয় এবং তিনি যুদ্ধবন্দী হন। দিহইয়া কালবি (রাঃ) রাসূল (সাঃ)-এর কাছে এসে একজন দাসী চাইলেন। রাসূল (সাঃ) বললেন: যাও, একজন দাসী নিয়ে নাও। দিহইয়া সাফিয়্যা (রাঃ)-কে নিয়ে আসলেন।",
      "একজন সাহাবী রাসূল (সাঃ)-কে বললেন: হে আল্লাহর রাসূল! বনু নাদির ও বনু কুরাইযার নেতার কন্যা দিহইয়ার জন্য উপযুক্ত নয়। তিনি শুধু আপনার জন্যই উপযুক্ত। রাসূল (সাঃ) বললেন: তাকে ডেকে আনো। দিহইয়া তাঁকে নিয়ে এলেন। রাসূল (সাঃ) সাফিয়্যা (রাঃ)-কে দেখে বললেন: তুমি নিজের জন্য অন্য একজন দাসী নিয়ে নাও।",
      "ইসলাম গ্রহণ ও বিবাহ: রাসূল (সাঃ) সাফিয়্যা (রাঃ)-কে বললেন: আমি তোমাকে দুটি পথের একটি বেছে নেওয়ার সুযোগ দিচ্ছি: হয় তুমি ইসলাম গ্রহণ করো এবং আমি তোমাকে বিয়ে করব, অথবা তুমি তোমার ধর্মে থাকো এবং আমি তোমাকে মুক্ত করে তোমার পরিবারের কাছে পাঠিয়ে দেব। সাফিয়্যা (রাঃ) বললেন: হে আল্লাহর রাসূল! আমি আপনাকে দেখার আগেই ইসলাম ও আপনার প্রতি আকৃষ্ট হয়েছিলাম। আমার ইহুদি ধর্মে কোনো আগ্রহ নেই এবং আমার কোনো পিতা বা ভাই নেই। আপনি আমাকে কুফর ও ইসলামের মধ্যে বেছে নেওয়ার সুযোগ দিয়েছেন। আল্লাহ ও তাঁর রাসূল আমার কাছে অন্য সব কিছুর চেয়ে প্রিয়।",
      "এভাবে সাফিয়্যা (রাঃ) ইসলাম গ্রহণ করেন এবং রাসূল (সাঃ) তাঁকে মুক্ত করে বিয়ে করেন। তাঁর মুক্তিই ছিল তাঁর মোহরানা। বিয়ের ওলিমায় রাসূল (সাঃ) খেজুর ও ছাতু (যবের আটা) দিয়ে খাবার পরিবেশন করেন। [সহীহ বুখারী]",
      "অন্যদের কটূক্তি ও রাসূলের সান্ত্বনা: সাফিয়্যা (রাঃ) ইহুদি বংশোদ্ভূত হওয়ায় কখনো কখনো অন্য স্ত্রীরা তাঁকে কটূক্তি করতেন। একবার তিনি কাঁদতে কাঁদতে রাসূল (সাঃ)-এর কাছে এলেন। রাসূল (সাঃ) জিজ্ঞেস করলেন: কী হয়েছে? সাফিয়্যা (রাঃ) বললেন: হাফসা আমাকে বলেছে যে আমি ইহুদির মেয়ে।",
      "রাসূল (সাঃ) বললেন: তুমি তো নবীর কন্যা (হারুন আঃ-এর বংশধর), তোমার চাচা নবী (মূসা আঃ) এবং তোমার স্বামী নবী (আমি)। তাহলে সে তোমার চেয়ে কীভাবে শ্রেষ্ঠ হতে পারে? তারপর তিনি হাফসা (রাঃ)-কে বললেন: হে হাফসা! আল্লাহকে ভয় করো। [তিরমিযী] রাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন এবং তাঁর প্রতি সম্মান প্রদর্শন করতেন। তিনি রাসূল (সাঃ)-এর সেবায় নিজেকে নিয়োজিত রাখতেন এবং তাঁর সুখ-দুঃখের সাথী ছিলেন। তাঁদের সম্পর্ক ছিল গভীর ভালোবাসা এবং পারস্পরিক শ্রদ্ধায় পূর্ণ।",
      "ধৈর্য ও সহনশীলতা: সাফিয়্যা (রাঃ) ছিলেন অত্যন্ত ধৈর্যশীল এবং সহনশীল। তিনি কখনো কারো কটূক্তির জবাব দিতেন না বরং ধৈর্য ধরতেন। তিনি রাসূল (সাঃ)-কে অত্যন্ত ভালোবাসতেন এবং তাঁর সেবায় নিজেকে নিয়োজিত রাখতেন।",
      "রাসূলের অসুস্থতায় সেবা: রাসূল (সাঃ)-এর শেষ অসুস্থতার সময় সাফিয়্যা (রাঃ) বললেন: হে আল্লাহর রাসূল! আমি চাই আপনার কষ্ট আমার উপর এসে পড়ুক। অন্য স্ত্রীরা একে অপরের দিকে তাকিয়ে চোখ টিপলেন (যেন বলছেন তিনি মিথ্যা বলছেন)। রাসূল (সাঃ) তা দেখে বললেন: তোমরা কুলি করো। তাঁরা বললেন: কেন? রাসূল (সাঃ) বললেন: তোমরা সাফিয়্যার প্রতি যে ইশারা করলে তার জন্য। আল্লাহর কসম! সে সত্য বলেছে। [মুসনাদে আহমাদ]",
      "দানশীলতা: সাফিয়্যা (রাঃ) অত্যন্ত দানশীল ছিলেন। তিনি তাঁর সম্পদ দরিদ্রদের মধ্যে বিতরণ করতেন এবং আত্মীয়দের সাহায্য করতেন। তিনি তাঁর ভাইয়ের সন্তানদের লালন-পালন করেছিলেন এবং তাদের জন্য ব্যয় করেছিলেন।",
      "**ইন্তেকাল:** ৬৭০ খ্রিস্টাব্দে (৫০ হিজরি) মদীনায় খলিফা মুআবিয়া (রাঃ)-এর শাসনামলে প্রায় ৬০ বছর বয়সে তিনি ইন্তেকাল করেন। তাঁকে জান্নাতুল বাকীতে দাফন করা হয়। তিনি তাঁর সম্পত্তির এক-তৃতীয়াংশ তাঁর ভাইয়ের সন্তানদের জন্য এবং বাকি অংশ দাতব্য কাজের জন্য ওসিয়ত করে যান। আল্লাহ তাঁকে জান্নাতুল ফিরদাউস দান করুন। আমিন।"
    ],
    "source": "সহীহ বুখারী; তিরমিযী; মুসনাদে আহমাদ; ইবনে সা'দ"
  },
  {
    "id": "sawdah_bint_zamah",
    "categoryId": "ummahatul_mumineen",
    "title": "সাওদা বিনতে যামআ (রাঃ)",
    "summary": "খাদিজা (রাঃ)-এর পর রাসূল (সাঃ)-এর দ্বিতীয় স্ত্রী। তিনি ছিলেন অত্যন্ত দানশীল এবং হাসিখুশি স্বভাবের।",
    "paragraphs": [
      "প্রারম্ভিক জীবন ও বংশ: সাওদা বিনতে যামআ (রাঃ) ছিলেন কুরাইশ বংশের বনু আমির ইবনে লুয়াই গোত্রের সম্ভ্রান্ত পরিবারের কন্যা। তাঁর পিতা যামআ ইবনে কায়েস ছিলেন মক্কার একজন সম্মানিত ব্যক্তি। সাওদা (রাঃ) ছিলেন বয়স্ক, অভিজ্ঞ এবং পরিপক্ব চরিত্রের অধিকারী। তিনি ছিলেন নম্র, ধৈর্যশীল এবং বিনয়ী স্বভাবের একজন মহিলা যিনি জীবনের উত্থান-পতন দেখেছিলেন।",
      "প্রথম বিবাহ ও ইসলাম গ্রহণ: সাওদা (রাঃ)-এর প্রথম বিবাহ হয়েছিল সাকরান ইবনে আমর (রাঃ)-এর সাথে। তাঁরা দুজনেই ইসলামের প্রথম দিকে মুসলমান হয়েছিলেন এবং রাসূল (সাঃ)-এর প্রতি অগাধ বিশ্বাস রাখতেন। যখন মক্কায় মুসলিমদের উপর অত্যাচার বাড়তে থাকল এবং জীবন কঠিন হয়ে উঠল, তখন রাসূল (সাঃ) তাঁর সাহাবীদের আবিসিনিয়ায় হিজরত করার অনুমতি দিলেন। সাওদা (রাঃ) এবং তাঁর স্বামী সাকরান (রাঃ) দ্বিতীয় হিজরতে অংশগ্রহণ করেন এবং আবিসিনিয়ায় কয়েক বছর কাটান।",
      "স্বামীর মৃত্যু ও বিধবা জীবন: আবিসিনিয়া থেকে মক্কায় ফিরে আসার পর সাকরান (রাঃ) অসুস্থ হয়ে পড়েন এবং কিছুদিন পর ইন্তেকাল করেন। সাওদা (রাঃ) বিধবা হয়ে গেলেন। তাঁর কোনো সন্তান ছিল না এবং তিনি একাকী ও অসহায় হয়ে পড়লেন। সেই সময় তাঁর বয়স ছিল প্রায় ৫৫ বছর। মক্কার কাফিররা বিধবা মুসলিম মহিলাদের নির্যাতন করত এবং সাওদা (রাঃ)-এর জীবন অত্যন্ত কঠিন হয়ে উঠল।",
      "**রাসূলের সাথে বিবাহ:** খাদিজা (রাঃ)-এর মৃত্যুর পর রাসূল (সাঃ) গভীর শোকে ছিলেন। সেই বছরকে আমুল হুযন (দুঃখের বছর) বলা হয়। খাওলা বিনতে হাকিম (রাঃ) রাসূল (সাঃ)-কে বললেন: হে আল্লাহর রাসূল! আপনি কি বিয়ে করবেন না? রাসূল (সাঃ) জিজ্ঞেস করলেন: কাকে? খাওলা বললেন: যদি আপনি চান, কুমারী আয়েশা বিনতে আবু বকর, অথবা বিধবা সাওদা বিনতে যামআ। রাসূল (সাঃ) বললেন: তাহলে তুমি আমার পক্ষ থেকে তাদের উভয়ের কাছে প্রস্তাব নিয়ে যাও।",
      "খাওলা সাওদা (রাঃ)-এর কাছে গেলেন এবং বললেন: আল্লাহ তোমার জন্য কল্যাণ এনেছেন। মুহাম্মাদ (সাঃ) তোমাকে বিয়ের প্রস্তাব পাঠিয়েছেন। সাওদা (রাঃ) অত্যন্ত খুশি হলেন এবং বললেন: আমি রাজি আছি। এভাবে রমজান মাসে নবুয়তের দশম বছরে (৬২০ খ্রিস্টাব্দ) সাওদা (রাঃ)-এর সাথে রাসূল (সাঃ)-এর বিয়ে হয়। সাওদা (রাঃ) হলেন খাদিজা (রাঃ)-এর পর রাসূল (সাঃ)-এর দ্বিতীয় স্ত্রী।",
      "চরিত্র ও স্বভাব: সাওদা (রাঃ) ছিলেন হাস্যোজ্জ্বল এবং রসিক স্বভাবের। তিনি রাসূল (সাঃ)-কে হাসাতেন এবং পরিবারে আনন্দের পরিবেশ সৃষ্টি করতেন। আয়েশা (রাঃ) বলেন: সাওদা ছিলেন আমাদের মধ্যে সবচেয়ে হাসিখুশি এবং দয়ালু। তিনি সবসময় অন্যদের খুশি রাখার চেষ্টা করতেন এবং কখনো কারো সাথে ঝগড়া করতেন না।",
      "আয়েশার জন্য মহান ত্যাগ: বয়স বাড়ার সাথে সাথে সাওদা (রাঃ) বুঝতে পারলেন যে তিনি রাসূল (সাঃ)-এর যথাযথ সেবা করতে পারছেন না। একবার রাসূল (সাঃ) তাঁকে তালাক দিতে চাইলেন। সাওদা (রাঃ) কেঁদে ফেললেন এবং বললেন: হে আল্লাহর রাসূল! আমাকে তালাক দিবেন না। আমি আপনার স্ত্রী হিসেবে থাকতে চাই এবং কিয়ামতের দিন আপনার স্ত্রী হিসেবে উঠতে চাই। আমার আর কোনো চাহিদা নেই। আমি আমার পালার দিন আয়েশাকে দিয়ে দিচ্ছি।",
      "রাসূল (সাঃ) তাঁর এই আত্মত্যাগ এবং ভালোবাসা দেখে খুশি হলেন এবং তাঁকে রেখে দিলেন। এরপর থেকে সাওদা (রাঃ)-এর পালার দিন আয়েশা (রাঃ) পেতেন। এই ঘটনায় সূরা নিসার আয়াত নাজিল হয় -",
      "وَإِنِ امْرَأَةٌ خَافَتْ مِن بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَا أَن يُصْلِحَا بَيْنَهُمَا صُلْحًا",
      "অর্থ: যদি কোনো স্ত্রী তার স্বামীর অবহেলা বা উপেক্ষার আশঙ্কা করে, তাহলে তাদের মধ্যে মীমাংসা করে নেওয়াতে কোনো দোষ নেই। [সূরা নিসা: ১২৮]",
      "দানশীলতা: সাওদা (রাঃ) অত্যন্ত দানশীল ছিলেন। তাঁর কাছে যা থাকত তা-ই দান করে দিতেন। তিনি চামড়া পাকা করতেন এবং তা বিক্রি করে দরিদ্রদের মধ্যে বিতরণ করতেন।",
      "**মৃত্যু:** সাওদা (রাঃ) উমর (রাঃ)-এর খিলাফতের শেষ দিকে (৫৪ হিজরি) মদিনায় ইন্তেকাল করেন। তাঁর বয়স হয়েছিল প্রায় ৮০ বছর। তাঁকে জান্নাতুল বাকিতে দাফন করা হয়।"
    ],
    "source": "সহীহ বুখারী; সিয়ারু আ'লামিন নুবালা"
  },
  {
    "id": "zainab_bint_jahsh",
    "categoryId": "ummahatul_mumineen",
    "title": "যায়নাব বিনতে জাহশ (রাঃ)",
    "paragraphs": [
      "**প্রারম্ভিক জীবন:** যায়নাব বিনতে জাহশ (রাঃ) ছিলেন রাসূল (সাঃ)-এর ফুফাতো বোন। তাঁর মা উমাইমা ছিলেন রাসূল (সাঃ)-এর ফুফু। তিনি ছিলেন সম্ভ্রান্ত কুরাইশ বংশের এবং অত্যন্ত সুন্দরী।",
      "তিনি ইসলামের প্রথম দিকে মুসলমান হয়েছিলেন এবং মক্কা থেকে মদিনায় হিজরত করেছিলেন। তিনি ছিলেন অত্যন্ত দানশীল এবং ইবাদতগুজার। তিনি ইসলামের শিক্ষা গভীরভাবে অধ্যয়ন করেছিলেন এবং তাঁর জীবনে প্রয়োগ করেছিলেন। তাঁর ঈমান ছিল দৃঢ় এবং অটল। কোনো পরীক্ষা বা বিপদ তাঁকে আল্লাহর পথ থেকে সরাতে পারেনি।",
      "যায়েদের সাথে বিবাহ: রাসূল (সাঃ) তাঁকে তাঁর পালক পুত্র যায়েদ ইবনে হারিসা (রাঃ)-এর সাথে বিয়ে দিলেন। এটি ছিল ইসলামের একটি গুরুত্বপূর্ণ শিক্ষা যে বংশ বা সম্পদ নয়, তাকওয়াই আসল মাপকাঠি।",
      "فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَاكَهَا",
      "অর্থ: যখন যায়েদ তার সাথে সম্পর্ক ছিন্ন করল, তখন আমি তাকে তোমার সাথে বিয়ে দিলাম। [সূরা আহযাব: ৩৭]",
      "কিন্তু তাঁদের দাম্পত্য জীবন সুখের হলো না। যায়নাব (রাঃ) ছিলেন সম্ভ্রান্ত বংশের এবং যায়েদ (রাঃ) ছিলেন মুক্ত দাস। এই পার্থক্য তাঁদের মধ্যে সমস্যা সৃষ্টি করল। এই ঘটনা ইসলামের ইতিহাসে একটি গুরুত্বপূর্ণ শিক্ষা এবং আমাদের জন্য অনুসরণীয় দৃষ্টান্ত। তাঁর জীবন থেকে আমরা শিখতে পারি কীভাবে আল্লাহর পথে চলতে হয় এবং কীভাবে দ্বীনের জন্য ত্যাগ স্বীকার করতে হয়।",
      "যায়েদ (রাঃ) কয়েকবার রাসূল (সাঃ)-এর কাছে এসে বললেন যে তিনি যায়নাবকে তালাক দিতে চান। কিন্তু রাসূল (সাঃ) বললেন: তোমার স্ত্রীকে রেখে দাও এবং আল্লাহকে ভয় করো। রাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন এবং তাঁর প্রতি সম্মান প্রদর্শন করতেন। তিনি রাসূল (সাঃ)-এর সেবায় নিজেকে নিয়োজিত রাখতেন এবং তাঁর সুখ-দুঃখের সাথী ছিলেন। তাঁদের সম্পর্ক ছিল গভীর ভালোবাসা এবং পারস্পরিক শ্রদ্ধায় পূর্ণ।",
      "**রাসূলের সাথে বিবাহ:** অবশেষে যায়েদ (রাঃ) যায়নাবকে তালাক দিলেন। এরপর আল্লাহ তায়ালা সূরা আহযাবে আয়াত নাজিল করলেন যে রাসূল (সাঃ) যায়নাবকে বিয়ে করবেন।",
      "এই বিয়ের উদ্দেশ্য ছিল পালক পুত্রের তালাকপ্রাপ্তা স্ত্রীকে বিয়ে করা জায়েজ প্রমাণ করা। জাহিলিয়াতের যুগে এটি নিষিদ্ধ ছিল।",
      "فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَاكَهَا",
      "অর্থ: যখন যায়েদ তার সাথে সম্পর্ক ছিন্ন করল, তখন আমি তাকে তোমার সাথে বিয়ে দিলাম। [সূরা আহযাব: ৩৭]",
      "আল্লাহ তায়ালা বলেন: فَلَمَّا قَضَىٰ زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَاكَهَا অর্থ: যখন যায়েদ তার সাথে সম্পর্ক ছিন্ন করল, তখন আমি তাকে তোমার সাথে বিয়ে দিলাম। [সূরা আহযাব: ৩৭]",
      "এই বিয়ে আকাশ থেকে আল্লাহ নিজে সম্পন্ন করেছিলেন। যায়নাব (রাঃ) এই বিষয়ে গর্ব করতেন এবং অন্য স্ত্রীদের বলতেন: তোমাদের বিয়ে তোমাদের পরিবার করেছে, কিন্তু আমার বিয়ে আল্লাহ করেছেন সাত আসমানের উপর থেকে।",
      "দানশীলতা: যায়নাব (রাঃ) ছিলেন অত্যন্ত দানশীল। তিনি চামড়া পাকা করতেন এবং তা বিক্রি করে দান করতেন। রাসূল (সাঃ) বলেছিলেন: তোমাদের মধ্যে যে সবচেয়ে দানশীল সে আমার পরে সবার আগে আমার সাথে মিলিত হবে।",
      "আয়েশা (রাঃ) বলেন: যায়নাব ছিলেন আমাদের মধ্যে সবচেয়ে দানশীল। তিনি তাঁর হাতে কাজ করতেন এবং আল্লাহর পথে দান করতেন। তিনি বিশ্বাস করতেন যে সম্পদ আল্লাহর দেওয়া আমানত এবং তা গরিব-দুঃখীদের মধ্যে বিতরণ করা উচিত। তিনি কখনো নিজের জন্য সম্পদ জমা করতেন না বরং আল্লাহর পথে খরচ করতেন। তাঁর দানশীলতা ছিল কিংবদন্তি এবং সবাই তাঁর উদারতার প্রশংসা করত।",
      "**মৃত্যু:** যায়নাব (রাঃ) ২০ হিজরিতে উমর (রাঃ)-এর খিলাফতকালে ইন্তেকাল করেন। তিনি ছিলেন রাসূল (সাঃ)-এর স্ত্রীদের মধ্যে প্রথম যিনি তাঁর পরে ইন্তেকাল করেন। তাঁর বয়স হয়েছিল প্রায় ৫৩ বছর।",
      "উমর (রাঃ) নিজে তাঁর জানাজার নামাজ পড়ান এবং তাঁকে জান্নাতুল বাকিতে দাফন করা হয়। তাঁর জানাজায় অসংখ্য মানুষ অংশগ্রহণ করেছিল।"
    ]
  },
  {
    "id": "umm_habiba",
    "categoryId": "ummahatul_mumineen",
    "title": "উম্মে হাবিবা (রাঃ)",
    "paragraphs": [
      "**প্রারম্ভিক জীবন:** উম্মে হাবিবা (রাঃ)-এর আসল নাম ছিল রামলা বিনতে আবু সুফিয়ান। তিনি ছিলেন আবু সুফিয়ানের কন্যা এবং মুয়াবিয়া (রাঃ)-এর বোন।",
      "তিনি ছিলেন সম্ভ্রান্ত উমাইয়া বংশের এবং মক্কার অন্যতম ধনী পরিবারের সন্তান। কিন্তু তিনি ইসলামের প্রথম দিকে মুসলমান হয়েছিলেন। তিনি ইসলামের শিক্ষা গভীরভাবে অধ্যয়ন করেছিলেন এবং তাঁর জীবনে প্রয়োগ করেছিলেন। তাঁর ঈমান ছিল দৃঢ় এবং অটল। কোনো পরীক্ষা বা বিপদ তাঁকে আল্লাহর পথ থেকে সরাতে পারেনি।",
      "আবিসিনিয়ায় হিজরত: তাঁর প্রথম স্বামী ছিলেন উবাইদুল্লাহ ইবনে জাহশ। তাঁরা দুজনে মক্কার অত্যাচার থেকে বাঁচতে আবিসিনিয়ায় হিজরত করেছিলেন।",
      "আবিসিনিয়ায় থাকাকালীন উবাইদুল্লাহ ইসলাম ত্যাগ করে খ্রিস্টান হয়ে যান। এটি ছিল উম্মে হাবিবার জন্য এক কঠিন পরীক্ষা। কিন্তু তিনি তাঁর ঈমানে অটল থাকলেন। তিনি ইসলামের শিক্ষা গভীরভাবে অধ্যয়ন করেছিলেন এবং তাঁর জীবনে প্রয়োগ করেছিলেন। তাঁর ঈমান ছিল দৃঢ় এবং অটল। কোনো পরীক্ষা বা বিপদ তাঁকে আল্লাহর পথ থেকে সরাতে পারেনি।",
      "উবাইদুল্লাহ মদ্যপান করে মারা গেলে উম্মে হাবিবা (রাঃ) বিধবা হয়ে গেলেন। তিনি একাকী আবিসিনিয়ায় থেকে গেলেন তাঁর ছোট মেয়ে হাবিবাকে নিয়ে। এই ঘটনা ইসলামের ইতিহাসে একটি গুরুত্বপূর্ণ শিক্ষা এবং আমাদের জন্য অনুসরণীয় দৃষ্টান্ত। তাঁর জীবন থেকে আমরা শিখতে পারি কীভাবে আল্লাহর পথে চলতে হয় এবং কীভাবে দ্বীনের জন্য ত্যাগ স্বীকার করতে হয়।",
      "**রাসূলের সাথে বিবাহ:** রাসূল (সাঃ) উম্মে হাবিবার অবস্থা জানতে পেরে তাঁকে বিয়ের প্রস্তাব পাঠালেন। তিনি আবিসিনিয়ার বাদশাহ নাজাশিকে বললেন উম্মে হাবিবাকে তাঁর পক্ষ থেকে বিয়ে করতে।",
      "নাজাশি অত্যন্ত খুশি হলেন এবং ৪০০ দিনার মোহরানা দিয়ে উম্মে হাবিবার সাথে রাসূল (সাঃ)-এর বিয়ে সম্পন্ন করলেন। এই বিয়ে হয়েছিল ৭ হিজরিতে।",
      "উম্মে হাবিবা (রাঃ) বলেন: আমি স্বপ্নে দেখলাম যে একজন ফেরেশতা আমাকে বলছেন তুমি মুমিনদের মা। আমি বুঝলাম যে আল্লাহ আমার জন্য কল্যাণ চান। এই ঘটনা ইসলামের ইতিহাসে একটি গুরুত্বপূর্ণ শিক্ষা এবং আমাদের জন্য অনুসরণীয় দৃষ্টান্ত। তাঁর জীবন থেকে আমরা শিখতে পারি কীভাবে আল্লাহর পথে চলতে হয় এবং কীভাবে দ্বীনের জন্য ত্যাগ স্বীকার করতে হয়।",
      "মদিনায় আগমন: ৭ হিজরিতে খায়বার বিজয়ের পর উম্মে হাবিবা (রাঃ) মদিনায় আসেন। রাসূল (সাঃ) তাঁকে অত্যন্ত সম্মান করতেন এবং তাঁর মতামতের মূল্য দিতেন।",
      "পিতার সাথে সাক্ষাৎ: মক্কা বিজয়ের সময় তাঁর পিতা আবু সুফিয়ান মদিনায় এসেছিলেন সন্ধির জন্য। তিনি উম্মে হাবিবার ঘরে প্রবেশ করতে চাইলে উম্মে হাবিবা রাসূল (সাঃ)-এর বিছানা গুটিয়ে ফেললেন।",
      "لَا تَجِدُ قَوْمًا يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الْآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ وَرَسُولَهُ",
      "অর্থ: তুমি এমন কোনো সম্প্রদায় পাবে না যারা আল্লাহ ও শেষ দিবসে বিশ্বাস করে অথচ তাদের সাথে বন্ধুত্ব করে যারা আল্লাহ ও তাঁর রাসূলের বিরোধিতা করে। [সূরা মুজাদালা: ২২]",
      "আবু সুফিয়ান বললেন: হে আমার কন্যা! আমি জানি না বিছানা আমার জন্য ভালো নাকি আমি বিছানার জন্য ভালো নই? উম্মে হাবিবা বললেন: এটি আল্লাহর রাসূলের বিছানা এবং আপনি একজন মুশরিক। আমি চাই না আপনি এই পবিত্র বিছানায় বসুন। রাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন এবং তাঁর প্রতি সম্মান প্রদর্শন করতেন। তিনি রাসূল (সাঃ)-এর সেবায় নিজেকে নিয়োজিত রাখতেন এবং তাঁর সুখ-দুঃখের সাথী ছিলেন। তাঁদের সম্পর্ক ছিল গভীর ভালোবাসা এবং পারস্পরিক শ্রদ্ধায় পূর্ণ।",
      "এই ঘটনা প্রমাণ করে যে উম্মে হাবিবা (রাঃ) আল্লাহ ও তাঁর রাসূলের ভালোবাসাকে সবকিছুর উপরে রাখতেন, এমনকি পিতার ভালোবাসার উপরেও। রাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন এবং তাঁর প্রতি সম্মান প্রদর্শন করতেন। তিনি রাসূল (সাঃ)-এর সেবায় নিজেকে নিয়োজিত রাখতেন এবং তাঁর সুখ-দুঃখের সাথী ছিলেন। তাঁদের সম্পর্ক ছিল গভীর ভালোবাসা এবং পারস্পরিক শ্রদ্ধায় পূর্ণ।",
      "**মৃত্যু:** উম্মে হাবিবা (রাঃ) ৪৪ হিজরিতে মুয়াবিয়া (রাঃ)-এর খিলাফতকালে ইন্তেকাল করেন। তাঁকে জান্নাতুল বাকিতে দাফন করা হয়। তিনি ছিলেন ধৈর্যশীল, ঈমানদার এবং আল্লাহর পথে অবিচল।"
    ]
  },
  {
    "id": "maymuna_bint_harith",
    "categoryId": "ummahatul_mumineen",
    "title": "মাইমুনা বিনতে হারিস (রাঃ)",
    "paragraphs": [
      "**প্রারম্ভিক জীবন:** মাইমুনা বিনতে হারিস (রাঃ) ছিলেন হিলাল গোত্রের। তাঁর আসল নাম ছিল বাররা কিন্তু রাসূল (সাঃ) তাঁর নাম রাখেন মাইমুনা যার অর্থ বরকতময়।",
      "তিনি ছিলেন আব্বাস (রাঃ)-এর স্ত্রী উম্মুল ফাদলের বোন। এভাবে তিনি রাসূল (সাঃ)-এর চাচা আব্বাসের সালা (স্ত্রীর বোন) ছিলেন। রাসূল (সাঃ) তাঁকে অত্যন্ত ভালোবাসতেন এবং তাঁর প্রতি সম্মান প্রদর্শন করতেন। তিনি রাসূল (সাঃ)-এর সেবায় নিজেকে নিয়োজিত রাখতেন এবং তাঁর সুখ-দুঃখের সাথী ছিলেন। তাঁদের সম্পর্ক ছিল গভীর ভালোবাসা এবং পারস্পরিক শ্রদ্ধায় পূর্ণ।",
      "**ইসলাম গ্রহণ:** মাইমুনা (রাঃ) ইসলামের প্রথম দিকে মুসলমান হয়েছিলেন। তিনি মক্কা থেকে মদিনায় হিজরত করেছিলেন এবং ইসলামের জন্য অনেক কষ্ট সহ্য করেছিলেন।",
      "তাঁর প্রথম স্বামী ছিলেন আবু রুহম ইবনে আব্দুল উযযা যিনি মারা যান। এরপর তিনি বিধবা হিসেবে থাকেন। এই ঘটনা ইসলামের ইতিহাসে একটি গুরুত্বপূর্ণ শিক্ষা এবং আমাদের জন্য অনুসরণীয় দৃষ্টান্ত। তাঁর জীবন থেকে আমরা শিখতে পারি কীভাবে আল্লাহর পথে চলতে হয় এবং কীভাবে দ্বীনের জন্য ত্যাগ স্বীকার করতে হয়।",
      "**রাসূলের সাথে বিবাহ:** ৭ হিজরিতে হুদায়বিয়ার সন্ধির পর রাসূল (সাঃ) উমরা করতে মক্কায় যান। সেই সময় মাইমুনা (রাঃ) নিজেই রাসূল (সাঃ)-এর কাছে বিয়ের প্রস্তাব পাঠান।",
      "রাসূল (সাঃ) তাঁর প্রস্তাব গ্রহণ করেন এবং আব্বাস (রাঃ) তাঁর পক্ষ থেকে বিয়ে সম্পন্ন করেন। এই বিয়ে হয়েছিল সারিফ নামক স্থানে, মক্কা থেকে কয়েক মাইল দূরে।",
      "মাইমুনা (রাঃ) ছিলেন রাসূল (সাঃ)-এর সর্বশেষ স্ত্রী। তাঁর পরে রাসূল (সাঃ) আর কোনো বিয়ে করেননি।",
      "وَمَا كَانَ لَكُمْ أَن تُؤْذُوا رَسُولَ اللَّهِ وَلَا أَن تَنكِحُوا أَزْوَاجَهُ مِن بَعْدِهِ أَبَدًا",
      "অর্থ: তোমাদের জন্য আল্লাহর রাসূলকে কষ্ট দেওয়া এবং তাঁর মৃত্যুর পর তাঁর স্ত্রীদের বিয়ে করা কখনো বৈধ নয়। [সূরা আহযাব: ৫৩]",
      "ইবাদত ও তাকওয়া: মাইমুনা (রাঃ) ছিলেন অত্যন্ত ইবাদতগুজার এবং তাকওয়াবান। তিনি রাত জেগে নামাজ পড়তেন এবং দিনে রোজা রাখতেন।",
      "আয়েশা (রাঃ) বলেন: মাইমুনা ছিলেন আমাদের মধ্যে সবচেয়ে বেশি আত্মীয়তার সম্পর্ক রক্ষাকারী এবং সবচেয়ে বেশি তাকওয়াবান। এই ঘটনা ইসলামের ইতিহাসে একটি গুরুত্বপূর্ণ শিক্ষা এবং আমাদের জন্য অনুসরণীয় দৃষ্টান্ত। তাঁর জীবন থেকে আমরা শিখতে পারি কীভাবে আল্লাহর পথে চলতে হয় এবং কীভাবে দ্বীনের জন্য ত্যাগ স্বীকার করতে হয়।",
      "ইবনে আব্বাস (রাঃ) বলেন: আমার খালা মাইমুনা ছিলেন অত্যন্ত নেককার এবং আল্লাহভীরু মহিলা। তিনি সবসময় আল্লাহর যিকিরে মশগুল থাকতেন। এই ঘটনা ইসলামের ইতিহাসে একটি গুরুত্বপূর্ণ শিক্ষা এবং আমাদের জন্য অনুসরণীয় দৃষ্টান্ত। তাঁর জীবন থেকে আমরা শিখতে পারি কীভাবে আল্লাহর পথে চলতে হয় এবং কীভাবে দ্বীনের জন্য ত্যাগ স্বীকার করতে হয়।",
      "রাসূলের প্রতি ভালোবাসা: মাইমুনা (রাঃ) রাসূল (সাঃ)-কে অত্যন্ত ভালোবাসতেন এবং তাঁর সেবা করতেন। তিনি রাসূল (সাঃ)-এর ছোট ছোট পছন্দ-অপছন্দ মনে রাখতেন এবং সেই অনুযায়ী কাজ করতেন।",
      "**মৃত্যু:** মাইমুনা (রাঃ) ৫১ হিজরিতে সারিফ নামক স্থানে ইন্তেকাল করেন। এটি সেই স্থান যেখানে তাঁর বিয়ে হয়েছিল।",
      "ইবনে আব্বাস (রাঃ) এবং অন্যান্য সাহাবীরা তাঁর জানাজার নামাজ পড়ান এবং তাঁকে সেখানেই দাফন করা হয়। তাঁর বয়স হয়েছিল প্রায় ৮০ বছর।",
      "মাইমুনা (রাঃ) ছিলেন উম্মুল মুমিনীন এবং রাসূল (সাঃ)-এর প্রিয় স্ত্রী। তাঁর জীবন ছিল ইবাদত, তাকওয়া এবং আল্লাহর রাসূলের প্রতি ভালোবাসায় পূর্ণ।"
    ]
  }
]