[{"id":"dua_zikir_ayatul_kursi_power","categoryId":"dua_zikir","title":"আয়াতুল কুরসির শক্তি: শয়তান থেকে রক্ষা","paragraphs":["হযরত আবু হুরায়রা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ (সাঃ) তাঁকে যাকাতের মাল পাহারা দেওয়ার দায়িত্ব দিয়েছিলেন। কিছুদিন পর তিনি লক্ষ্য করলেন যে, প্রতি রাতে কেউ এসে সেই মাল থেকে খাবার নিয়ে যাচ্ছে।","একদিন আবু হুরায়রা (রাঃ) সেই চোরকে ধরে ফেললেন এবং বললেন, 'আমি তোমাকে রাসূলুল্লাহ (সাঃ)-এর কাছে নিয়ে যাব।'","চোরটি কাকুতি-মিনতি করে বলল, 'আমাকে ছেড়ে দাও, আমি অভাবী। আমার পরিবার আছে। আমি আর আসব না।'","আবু হুরায়রা (রাঃ) তাঁর প্রতি দয়া করে তাকে ছেড়ে দিলেন। পরদিন সকালে রাসূলুল্লাহ (সাঃ) জিজ্ঞাসা করলেন: 'হে আবু হুরায়রা! গতরাতে তোমার বন্দী কী করেছে?'","আবু হুরায়রা (রাঃ) অবাক হয়ে বললেন, 'ইয়া রাসূলাল্লাহ! সে অভাবের কথা বলে কাঁদল, তাই আমি তাকে ছেড়ে দিয়েছি।'","রাসূলুল্লাহ (সাঃ) বললেন, 'সে তোমার সাথে মিথ্যা বলেছে এবং সে আবার আসবে।'","পরের রাতে আবার সেই চোর এল। আবু হুরায়রা (রাঃ) আবার তাকে ধরলেন। এভাবে তিনবার একই ঘটনা ঘটল। তৃতীয়বার যখন আবু হুরায়রা (রাঃ) তাকে ধরলেন এবং বললেন, 'এবার আমি অবশ্যই তোমাকে রাসূলুল্লাহ (সাঃ)-এর কাছে নিয়ে যাব।'","তখন চোরটি বলল, 'আমাকে ছেড়ে দাও, আমি তোমাকে এমন কিছু শব্দ শিখিয়ে দেব যা দ্বারা আল্লাহ তোমার উপকার করবেন।'","**আবু হুরায়রা (রাঃ) জিজ্ঞাসা করলেন:** 'সেটা কী?'","সে বলল, 'যখন তুমি রাতে ঘুমাতে যাবে, তখন আয়াতুল কুরসি পড়বে। তাহলে আল্লাহর পক্ষ থেকে তোমার জন্য একজন রক্ষক নিযুক্ত হবে এবং সকাল পর্যন্ত কোনো শয়তান তোমার কাছে আসতে পারবে না।'","**পরদিন সকালে রাসূলুল্লাহ (সাঃ) আবার জিজ্ঞাসা করলেন:** 'তোমার বন্দী কী করেছে?'","আবু হুরায়রা (রাঃ) পুরো ঘটনা বললেন। রাসূলুল্লাহ (সাঃ) বললেন,","'সে তোমার সাথে সত্য বলেছে, যদিও সে মহা মিথ্যাবাদী। হে আবু হুরায়রা! তুমি কি জানো গত তিন রাত ধরে তুমি কার সাথে কথা বলছিলে?'","আবু হুরায়রা (রাঃ) বললেন, 'না।'","রাসূলুল্লাহ (সাঃ) বললেন, 'সে ছিল শয়তান।' [সহীহ বুখারী: ২৩১১]","এই হাদিস থেকে প্রমাণিত হয় যে, আয়াতুল কুরসি পাঠ করলে সারারাত শয়তান থেকে রক্ষা পাওয়া যায়। এটি কুরআনের সবচেয়ে মহান আয়াত।"],"moral":"আয়াতুল কুরসি হলো কুরআনের সবচেয়ে শক্তিশালী আয়াত। প্রতিদিন রাতে ঘুমানোর আগে এটি পাঠ করলে আল্লাহর রক্ষায় থাকা যায় এবং শয়তান থেকে নিরাপদ থাকা যায়।","source":"সহীহ বুখারী (২৩১১)।"},{"id":"dua_zikir_subhanallah_tree","categoryId":"dua_zikir","title":"**সুবহানাল্লাহ:** জান্নাতে গাছ রোপণ","summary":"রাসূলুল্লাহ (সাঃ) বলেছেন, যে ব্যক্তি 'সুবহানাল্লাহ' বলবে, তার জন্য জান্নাতে একটি গাছ রোপণ করা হবে। এই সহজ যিকিরের মাধ্যমে আমরা জান্নাতে নিজেদের বাগান তৈরি করতে পারি।","paragraphs":["রাসূলুল্লাহ (সাঃ) বলেছেন,","**'যে ব্যক্তি বলবে:** সুবহানাল্লাহ (আল্লাহ পবিত্র), আলহামদুলিল্লাহ (সকল প্রশংসা আল্লাহর), লা ইলাহা ইল্লাল্লাহ (আল্লাহ ছাড়া কোনো উপাস্য নেই), আল্লাহু আকবার (আল্লাহ মহান)—তার জন্য জান্নাতে একটি গাছ রোপণ করা হবে।' [তিরমিযী: ৩৪৬৪]","একবার এক সাহাবী রাসূলুল্লাহ (সাঃ)-কে জিজ্ঞাসা করলেন: 'ইয়া রাসূলাল্লাহ! জান্নাতে আমাদের বাগান কত বড় হবে?'","রাসূলুল্লাহ (সাঃ) মুসকুরিয়ে বললেন, 'তুমি যত বেশি এই কালিমাগুলো পাঠ করবে, তোমার বাগান তত বড় হবে।'","এই হাদিস শুনে সাহাবীরা খুব খুশি হলেন এবং বেশি বেশি তাসবিহ পাঠ করতে শুরু করলেন।","হযরত আবু হুরায়রা (রাঃ) বর্ণনা করেন, রাসূলুল্লাহ (সাঃ) আরও বলেছেন, ","'দুটি বাক্য আছে যা জিহ্বায় উচ্চারণ করা সহজ, মিজানে (দাঁড়িপাল্লায়) ভারী এবং আল্লাহর কাছে অত্যন্ত প্রিয়: সুবহানাল্লাহি ওয়া বিহামদিহি, সুবহানাল্লাহিল আযীম।' [সহীহ বুখারী: ৬৪০৬]","এই যিকিরগুলো এত সহজ যে যে কেউ যেকোনো সময় পড়তে পারে—হাঁটতে হাঁটতে, কাজ করতে করতে, বা বিশ্রামের সময়।","সাহাবীরা সর্বদা এই যিকিরগুলো পাঠ করতেন। তাঁরা জানতেন যে, প্রতিটি তাসবিহ তাঁদের জান্নাতের বাগানকে আরও সুন্দর করে তুলছে।"],"moral":"সহজ যিকিরের মাধ্যমে আমরা জান্নাতে নিজেদের জন্য বাগান তৈরি করতে পারি। 'সুবহানাল্লাহ', 'আলহামদুলিল্লাহ', 'লা ইলাহা ইল্লাল্লাহ', 'আল্লাহু আকবার'—এই কালিমাগুলো বেশি বেশি পাঠ করা উচিত।","source":"তিরমিযী (৩৪৬৪) এবং সহীহ বুখারী (৬৪০৬)।"},{"id":"dua_zikir_istighfar_power","categoryId":"dua_zikir","title":"**ইস্তিগফারের শক্তি:** বৃষ্টি ও রিযিক","summary":"হযরত নূহ (আঃ) তাঁর জাতিকে বলেছিলেন, তোমরা আল্লাহর কাছে ক্ষমা চাও, তাহলে তিনি তোমাদের জন্য আকাশ থেকে বৃষ্টি পাঠাবেন এবং সম্পদ ও সন্তান দান করবেন। ইস্তিগফার শুধু পাপ মোচন করে না, বরং দুনিয়া ও আখিরাতের কল্যাণও বয়ে আনে।","paragraphs":["আল্লাহ তায়ালা পবিত্র কুরআনে হযরত নূহ (আঃ)-এর ঘটনা বর্ণনা করে বলেন,","فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا ۝ يُرْسِلِ السَّمَاءَ عَلَيْكُم مِّدْرَارًا ۝ وَيُمْدِدْكُم بِأَمْوَالٍ وَبَنِينَ وَيَجْعَل لَّكُمْ جَنَّاتٍ وَيَجْعَل لَّكُمْ أَنْهَارًا","অর্থাৎ, আমি (নূহ) বললাম, তোমরা তোমাদের রবের কাছে ক্ষমা প্রার্থনা করো, নিশ্চয় তিনি মহা ক্ষমাশীল। তিনি তোমাদের জন্য আকাশ থেকে প্রচুর বৃষ্টি পাঠাবেন, তোমাদের সম্পদ ও সন্তান দিয়ে সাহায্য করবেন এবং তোমাদের জন্য বাগান ও নদী সৃষ্টি করবেন। [সূরা নূহ: ১০-১২]","রাসূলুল্লাহ (সাঃ) বলেছেন, ","'যে ব্যক্তি নিয়মিত ইস্তিগফার করবে, আল্লাহ তার সকল সংকট থেকে মুক্তির পথ বের করে দেবেন, সকল দুশ্চিন্তা দূর করে দেবেন এবং এমন উৎস থেকে রিযিক দেবেন যা সে কল্পনাও করেনি।' [আবু দাউদ: ১৫১৮]","একবার এক সাহাবী রাসূলুল্লাহ (সাঃ)-এর কাছে এসে বললেন, 'ইয়া রাসূলাল্লাহ! আমি অনেক পাপ করেছি। আমার কি ক্ষমা পাওয়ার কোনো উপায় আছে?'","রাসূলুল্লাহ (সাঃ) বললেন, 'তুমি কি ইস্তিগফার করো?'","সাহাবী বললেন, 'হ্যাঁ, প্রতিদিন অনেকবার।'","রাসূলুল্লাহ (সাঃ) বললেন, 'তাহলে আল্লাহ তোমার সকল পাপ ক্ষমা করে দেবেন, যদিও তা সমুদ্রের ফেনার মতো অসংখ্য হয়।'","সাইয়্যিদুল ইস্তিগফার (ইস্তিগফারের সর্দার) হলো, ","اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَٰهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ","রাসূলুল্লাহ (সাঃ) বলেছেন, 'যে ব্যক্তি দিনের বেলা দৃঢ় বিশ্বাসের সাথে এই দোয়া পড়বে এবং সেদিন সন্ধ্যার আগে মারা যাবে, সে জান্নাতবাসী হবে। আর যে রাতে এটি পড়বে এবং সকালের আগে মারা যাবে, সেও জান্নাতবাসী হবে।' [সহীহ বুখারী: ৬৩০৬]"],"moral":"ইস্তিগফার শুধু পাপ মোচনের মাধ্যম নয়, বরং এটি দুনিয়া ও আখিরাতের সকল কল্যাণের চাবিকাঠি। নিয়মিত ইস্তিগফার করলে আল্লাহ রিযিক, বরকত এবং সকল সমস্যার সমাধান দান করেন।","source":"**পবিত্র কুরআন (সূরা নূহ:** ১০-১২), সহীহ বুখারী (৬৩০৬) এবং আবু দাউদ (১৫১৮)।"}]